[
  {
    "id": "ctu1zt4",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": ">The official police report never mentioned the two gunshots that killed Hammond on July 26 in a Hardees parking lot.\n\nIf this part is true, then this part needs to be a significant source of outrage all its own.\n\nHow do you shoot a guy to death and not even mention it in your police report?",
    "controversiality": 0,
    "ups": 6651,
    "downs": 0,
    "score": 6651,
    "created": 1438924435.0,
    "date_created": "2015-08-06",
    "time_created": "17:13:55",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctubnp8",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": ">I mean, I can send any fool with a badge and a gun up on them corners and jack a crew and grab vials. But policing? I mean, you call something a war, and pretty soon everybody gonna be running around acting like warriors! They gonna be running around on a damn crusade storming corners, slapping on cuffs, racking up body counts. And when you're at war, you need a fuckin' enemy. And pretty soon, damn near everybody on every corner is your fucking enemy! And soon the neighborhood that you supposed to be policing... that's just occupied territory...\n\n> Okay, the point I'm making Carver is this: soldiering and policing ain't the same thing. And before we went and took the wrong turn and started up with these war games, the cop worked a beat. And he *learned* that post. And if there were things that happened up on that post whether they be a rape a robbery or a shooting, he had people helping him out there, feeding him information... But every time I come to you, my DEU sergeant, for information, to find out what's going on out there in them streets... All that came back was some bullshit. You had your stats, you had your arrests, you had your seizures. But don't none of that amount to shit when you talkin' 'bout protecting the neighborhood now, do it?\n\n>You know the worst thing about this so called \"drug war,\" to my mind... It just... it ruined this job.\n\n-- Major Bunny Colvin to Sergeant Ellis Carver",
    "controversiality": 0,
    "ups": 698,
    "downs": 0,
    "score": 698,
    "created": 1438940652.0,
    "date_created": "2015-08-06",
    "time_created": "21:44:12",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4cn1",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "Seneca resident here, it's been pretty crazy here.  While there has been plenty of outrage and many people are mad, the majority of the community here is hyper conservative and many are retired upper middle class that aren't going to question the police, or will blame it on the drugs.  That being said, there is a fair deal of us that are furious, and being a small town almost everyone knows his family so I'm hoping that once the facts of the case are better known publicly, there will be more outcry for some sort of change.",
    "controversiality": 0,
    "ups": 2626,
    "downs": 0,
    "score": 2626,
    "created": 1438928055.0,
    "date_created": "2015-08-06",
    "time_created": "18:14:15",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu3k0a",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "Part of the outrage should be that there was an undercover operation for 10 grams(!?) of weed. \n\nI know some paranoid people that thinks \"the evil powers that be\" use the racial tensions behind these police killings to keep the little guys fighting each other and distracted. ",
    "controversiality": 0,
    "ups": 2919,
    "downs": 0,
    "score": 2919,
    "created": 1438926816.0,
    "date_created": "2015-08-06",
    "time_created": "17:53:36",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4nux",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "why in the fuck is the word unarmed in quotes?  Was he actually not unarmed? Drives me 'insane'.",
    "controversiality": 0,
    "ups": 1135,
    "downs": 0,
    "score": 1135,
    "created": 1438928549.0,
    "date_created": "2015-08-06",
    "time_created": "18:22:29",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu17nd",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "\"To continue reading this article, enter your email address.\"  There's my fuckin outrage. ",
    "controversiality": 0,
    "ups": 912,
    "downs": 0,
    "score": 912,
    "created": 1438923289.0,
    "date_created": "2015-08-06",
    "time_created": "16:54:49",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4j57",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "\"Through the Back of the Chest\". \n\n\n*Through the back of the chest.*............. \n\nThat's almost like being shot in the front of the back. wtf.\n\nedit: (iffy)[Source](http://www.latimes.com/nation/nationnow/la-na-nn-zachary-hammond-police-shooting-20150804-htmlstory.html)",
    "controversiality": 0,
    "ups": 431,
    "downs": 0,
    "score": 431,
    "created": 1438928339.0,
    "date_created": "2015-08-06",
    "time_created": "18:18:59",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu67lp",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm outraged.  I'm an AA and I think that anyone of color or whatever would read what happened here and think \"damn this is fucked up\".  It's the media that is failing to report on this or give it the publicity it deserves.  And the locals should rise up as well.  My thinking of America is that when shit starts with minorities, it will eventually bleed into white communities, because, in reality, we are the same group.  Race/color/ethnicity are all things used to divide us and blind us to where the real difference is; those with enough money that they never, ever have to worry about any of this shit.",
    "controversiality": 0,
    "ups": 110,
    "downs": 0,
    "score": 110,
    "created": 1438931112.0,
    "date_created": "2015-08-06",
    "time_created": "19:05:12",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6fbx",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "This shit is getting out of hand. My dad was a cop for 22 years and never shot anyone. That's exactly how it should be.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1438931482.0,
    "date_created": "2015-08-06",
    "time_created": "19:11:22",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu3n82",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "Killed for less than a half ounce of weed. This is South Carolina, and a dead white teenager shot by the police *in the back*, if there isn't some real substantive reaction to this then the police state has won. ",
    "controversiality": 0,
    "ups": 195,
    "downs": 0,
    "score": 195,
    "created": 1438926956.0,
    "date_created": "2015-08-06",
    "time_created": "17:55:56",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu0sr5",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "Have they protested? Have they organized a group to form a sit-in or a press conference, or a demonstration in front of government buildings? Have they contacted any civil rights organizations about this case? Have they circulated a petition or made any noise with the local media?  \n\nI'm all for supporting them, but attention wasn't focused on \"the black side of the argument\" in police shootings until some, if not all of what I mentioned had already taken place within the local communities. The media attention came because of the backlash, not simply because of the original incident. If there's no backlash, it won't get the attention of an incident that creates a massive response. So it doesn't appear that this situation is at all apples-to-apples if all they did was expect the same response because of an incident report. Go out and make some noise about it, I'll be right there with you (virtually), but make an effort at least. I'm plenty outraged, this is bullshit. If the local community banded together and had a rally, a protest, or something, I have no doubt they'd start getting more attention. But if it's only the parents or family it won't seem as important on a national scale (in the media's eyes, not mine).",
    "controversiality": 0,
    "ups": 1278,
    "downs": 0,
    "score": 1278,
    "created": 1438922692.0,
    "date_created": "2015-08-06",
    "time_created": "16:44:52",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu72hb",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "It's really sort of disappointing that the issue of police violence has become convoluted into a race issue BETWEEN THE VICTIMS. The larger issue here is that police are *killing* young, unarmed citizens, and yet I see far too many people fixated on race. This whole \"if the victim was black, the story would have gotten more attention\" mentality is reprehensible. Regardless of the race of the victim, you still have a person dead at the hands of the police. That is what matters. I don't care whether reform comes from the outcry of black people or white people, it's not a fucking contest. I just care that we, as a country, figure out how to stop the killing of unarmed citizens at the hands of the police.",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1438932514.0,
    "date_created": "2015-08-06",
    "time_created": "19:28:34",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "cttzqv2",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "There is no outrage because the local community isn't doing enough to get it out there. True the media loves to stir the pot for all that it's worth. But still, regardless of race, this should spark outrage. The media doesn't go out and tell black people to protest, riot, loot, march or anything that happens as a result. We do that and the media swoops in to cover it. White people should do the same(except the riots and looting, that's just ignorant). But you don't. And that's the reason why there is no outrage. That's the reason why there is no story. Because you'd rather post anger on Facebook and Reddit than show your outrage. You have the right to protest as well. All lives matter.",
    "controversiality": 0,
    "ups": 5688,
    "downs": 0,
    "score": 5688,
    "created": 1438921198.0,
    "date_created": "2015-08-06",
    "time_created": "16:19:58",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu9s12",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "Killing a 19 year old should always be worse and have more consequences than having any amount of weed. I dont understand the country we live in.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1438937272.0,
    "date_created": "2015-08-06",
    "time_created": "20:47:52",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu9pns",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "\"Where is the outrage?\" \n\nI don't think the family wants the honest answer to that question. \n\n\"People with power understand exactly one thing: violence.”\n\n“All over the place, from the popular culture to the propaganda system, there is constant pressure to make people feel that they are helpless, that the only role they can have is to ratify decisions and to consume.”\n\nNoam Chomsky",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1438937159.0,
    "date_created": "2015-08-06",
    "time_created": "20:45:59",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu1i1p",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "This was on the frontpage of /r/news yesterday.  Over 1500 upvotes and over 280 comments.\n\nhttps://www.reddit.com/r/news/comments/3fvx8w/attorney_for_family_of_zachary_hammond_19yearold/\n\n",
    "controversiality": 0,
    "ups": 278,
    "downs": 0,
    "score": 278,
    "created": 1438923715.0,
    "date_created": "2015-08-06",
    "time_created": "17:01:55",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu30id",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "These are parallel themes and both deserve attention. They don't have to compete with each other, cancel each other out, or be combined to matter. You have: \n\n* Cops killing unarmed citizens\n* Cops killing black men in high numbers (either because of racism or because it's easier to get away with due to race)\n* Cops killing poorer people in high numbers (either because of stigma about who looks more like a criminal or because it's easier to get away with killing poorer people)\n\nAll three of those are important things to talk about and shouldn't be pitted against each other as unfairness or diminishing the importance of the others.\n\nEdit: Slight edit as I haven't taken enough time to research the data to make a point about proportion. Don't want that to take away from the point that these are just all valid discussions for a society to go over without turning them into a two-sides fallacy.",
    "controversiality": 0,
    "ups": 483,
    "downs": 0,
    "score": 483,
    "created": 1438925980.0,
    "date_created": "2015-08-06",
    "time_created": "17:39:40",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "cttzlpz",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": ">Where is the outrage?\n\nPretty sure I see people outraged everywhere at cops. 90% of Reddit news threads are about cops these days.",
    "controversiality": 0,
    "ups": 250,
    "downs": 0,
    "score": 250,
    "created": 1438921000.0,
    "date_created": "2015-08-06",
    "time_created": "16:16:40",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5fhi",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1438929820.0,
    "date_created": "2015-08-06",
    "time_created": "18:43:40",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6kxy",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "The outrage doesn't exist because most people would rather believe that there isn't a problem. Most people yapping on about AllLivesMatter don't actually care about all lives. They just want to make a counterargument against BlackLivesMatter. So when something like this happens, instead of coming out to condone the police they stay quiet because to them it is more important to deny the fact that there is a problem with policing in America rather than to say anything in support of this family.\n\nTL;DR: Racists more concerned with downplaying BlackLivesMatter don't support this kid because it would take legitimacy out of their idea that there is no problem with LEOs abusing power in the US.",
    "controversiality": 0,
    "ups": 104,
    "downs": 0,
    "score": 104,
    "created": 1438931744.0,
    "date_created": "2015-08-06",
    "time_created": "19:15:44",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4vgm",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "The police kill so many people here--it takes something unusual for one of these killings to get widespread coverage in the mainstream media. Some things that help are: \n\n1. Video of the killing. \n2. The victim or the cop has an interesting background.\n3. Local protests or riots.  \n\nThe killing of Zachary Hammond unfortunately doesn't have any of that. As for #3, he was from a small town with a majority white population--very few of these people have likely had negative interactions with police, which makes them much more willing to swallow the PD's bullshit. If this kid had gotten shot in Ferguson or Baltimore or LA or Philly, you can bet your ass his neighbors would be marching in the streets, and the media wouldn't be far behind.",
    "controversiality": 0,
    "ups": 79,
    "downs": 0,
    "score": 79,
    "created": 1438928882.0,
    "date_created": "2015-08-06",
    "time_created": "18:28:02",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4vu0",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "Turning this into an us vs them situation is retarded. All police abuse needs to be treated with utmost severity regardless of race of victim.",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1438928898.0,
    "date_created": "2015-08-06",
    "time_created": "18:28:18",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuqr0h",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "The outrage would have been right here, in the thread you made if you didn't make this kids murder about how black people should stop whining. \n",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1438982480.0,
    "date_created": "2015-08-07",
    "time_created": "09:21:20",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4hn5",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "I like how the family's lawyer is bitching about black activists not bringing attention to this, and then later in the article black activists on Twitter are quoted talking about the shooting and wondering where the #alllivesmatter people are. ",
    "controversiality": 0,
    "ups": 66,
    "downs": 0,
    "score": 66,
    "created": 1438928274.0,
    "date_created": "2015-08-06",
    "time_created": "18:17:54",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu527q",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "The family shouldn't be asking \"where is the outrage?\". They should be leading the charge in the outrage and let people join them.",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1438929196.0,
    "date_created": "2015-08-06",
    "time_created": "18:33:16",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu26r3",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "Pity I can't even read the article without \"subscribing\". Makes me wonder just how many of these comments were made without actually reading the article.",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1438924722.0,
    "date_created": "2015-08-06",
    "time_created": "17:18:42",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu0xeu",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "More than 600 people have been killed by the police in the US this year along. If you can name all but the white ones, then there's a point to this \"where's the outrage?\" line. In reality, only a tiny number have risen to media prominence. That there's an article in a national newspaper about this case at all means that there's already much more coverage of this case than most of them.",
    "controversiality": 0,
    "ups": 82,
    "downs": 0,
    "score": 82,
    "created": 1438922882.0,
    "date_created": "2015-08-06",
    "time_created": "16:48:02",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5jkh",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "This will get about as much traction as the John Geer story.\n\nhttp://www.washingtonpost.com/news/local/wp/2015/05/01/john-geers-family-still-reeling-waiting-for-decision-20-months-after-shooting/\n\nWe'll see if Torres gets charged.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1438930009.0,
    "date_created": "2015-08-06",
    "time_created": "18:46:49",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6bsi",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "\"That's the way the ruling class  operates in any society. They try to divide the rest of the people. They keep the lower and the middle classes fighting with each other, so that they, the rich, can run off with all the fucking money. Fairly simple thing, happens to work. You know, anything different, that's what they're gonna talk about. Race, religion, ethic and national background, jobs, income, education, social status, sexuality. Anything they can do to keep us fighting with each other, so that they can keep going to the bank.\"  \n-George Carlin",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1438931312.0,
    "date_created": "2015-08-06",
    "time_created": "19:08:32",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctubm6f",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "I hate it when people ask \"wheres the outrage?\" This is the first most of us have heard anything about this tragedy. All I hear about is Bruce Jenner, Cecil the lion, Donald Trump from the news.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1438940578.0,
    "date_created": "2015-08-06",
    "time_created": "21:42:58",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuj7s9",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "I wasn't outraged because I hadn't heard about it. I have now heard about it, and if everything I have read is true, I am outraged. See how that works? The protests in black communities raises awareness and creates even more outrage. That didn't happen here. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1438956362.0,
    "date_created": "2015-08-07",
    "time_created": "02:06:02",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctup1r5",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "Where is the outrage? I AM fucking outraged, this is bullshit. Shout that shit out, plaster it everywhere you can. The only way to combat the selective media is outlets like this, that have proven to possess their own unusual, but no less noticed, spotlight. This shit has got to stop, black, white, hispanic, or any other people. Cops just aren't learning that nonsense like this will not be swept under the rug anymore.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1438978158.0,
    "date_created": "2015-08-07",
    "time_created": "08:09:18",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuqlu6",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438982166.0,
    "date_created": "2015-08-07",
    "time_created": "09:16:06",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuqvjo",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "I cannot begin to fathom why this motherfucker isn't in stocks in the public square for all to piss on. How the fuck do you shoot someone to death and not put it in the report? This is a fucking cold blooded murderer operating under color of law and protected by the government. This has to be stopped. These assholes MUST be held accountable for pulling  AND firing their weapons. There is no room for shoot first make shit up later.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1438982747.0,
    "date_created": "2015-08-07",
    "time_created": "09:25:47",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu7gu3",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "So let me get this straight, You shot a teenager in the back and killed him over 10 grams of Marijuana that was part of a sting operatation? A \"drug\" that is 100% legal in four of the United States and Washington DC. How can you possibly Justify that? I'm with the parents this deserves absolute outrage.  ",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1438933168.0,
    "date_created": "2015-08-06",
    "time_created": "19:39:28",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctubg10",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "So make an outrage. No police are going to go uncover as protestors and incite violence to undermine your message. No media is going to call you rioters, looters, etc. No social media is going to use fake or mislabelled photos to show how animalistic you all are. None will take this child and drag him through the mud and say he deserved it using inane reasons.",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1438940280.0,
    "date_created": "2015-08-06",
    "time_created": "21:38:00",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctui8qn",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "Where's the #AllLivesMatter folks?\n",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1438953762.0,
    "date_created": "2015-08-07",
    "time_created": "01:22:42",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4zp1",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "Any one want to explain how the kid was \"accelerating towards the officer\" but somehow got shot in the back? ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1438929080.0,
    "date_created": "2015-08-06",
    "time_created": "18:31:20",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5r0n",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "It's not a competition. Everybody should be outraged about every wrongful death. We can all help each other here.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1438930351.0,
    "date_created": "2015-08-06",
    "time_created": "18:52:31",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6pzu",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "Where is the outrage? where was the washington post article telling us about this before just now?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438931963.0,
    "date_created": "2015-08-06",
    "time_created": "19:19:23",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu7p65",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm black, and i'm outraged! no one should die unarmed and non-threatening! I love white people as much as black people! The controversy is with the disappropriate amount of police shooting and killing unarmed blacks is another issue,",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1438933557.0,
    "date_created": "2015-08-06",
    "time_created": "19:45:57",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuc8um",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "There's no outrage because there's no outrage. People aren't out rioting about it, doesn't mean that they don't care. Perhaps they want more civilized methods to deal with this now?",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438941706.0,
    "date_created": "2015-08-06",
    "time_created": "22:01:46",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctue5tp",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "So they say the teen was driving right at him, yet somehow he was shot in the back not the chest, and they didn't report using the gun. Nothing shady here lol.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438945111.0,
    "date_created": "2015-08-06",
    "time_created": "22:58:31",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctup2gn",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "This is just my opinion feel free to flame or not. When a minority gets in this situation, it's minorities that get outraged.The media covers it because they get outraged which fuels more coverage. Yet this happens to a white individual and according to the parents the white community does not. Which without outcry and outrage does not make for good sensationalized news so they wont cover it on a nation wide scale.\n\nThe outcry / outrage and sensationalism is theonly reason I think the media bothers to cover minority shootings nationwide.Increasing the number of readers/viewers reading and tuning in.  The news media is all about ratings and readership. Even if their job is to report the news they have to make money they not reporting the news for free.  It's a shame a majority of the news coverage is like this, but it has been this way since before anyone reading this was born.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438978215.0,
    "date_created": "2015-08-07",
    "time_created": "08:10:15",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctup7b9",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "OP...what are you doing besides posting this to help the family get justice?",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438978606.0,
    "date_created": "2015-08-07",
    "time_created": "08:16:46",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctupc7s",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "It's not about black or white as much as it is about a failing war on drugs where thousands of civilians are being killed.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438978985.0,
    "date_created": "2015-08-07",
    "time_created": "08:23:05",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuttlc",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "> An ‘unarmed’ white teen was shot dead by police. His family asks: Where is the outrage?\n\nThe article says the family is asking about media coverage. It's pretty simple. The media is not covering the protests because there are no protests. There are no protests because they live in a conservative white area, and their community consists of people who have spent the last decades supporting and defending the police in these cases. They are not going to change their tune now and start protesting all of a sudden. Nothing has changed. Their community is being consistent. If they suddenly started protesting this one it would be very strange and different from their normal response, which is to defend the police, or remain silent.\n\nOne might instead ask, where was this family during the previous shootings? Were they out protesting the death of blacks and trying to educate their own conservative white community to not be always defending police actions? No they were not.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1438988006.0,
    "date_created": "2015-08-07",
    "time_created": "10:53:26",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuuwsz",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "This is the time for whites to go in the streets and protest for police reform. JOIN US WE ARE STRONGER AS ONE AMERICA NOT BLACK AND WHITE AMERICA. IF YOU CANT ACCEPT THAT YOURE THE PROBLEM",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438989684.0,
    "date_created": "2015-08-07",
    "time_created": "11:21:24",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctvhr9k",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "There's always outrage over an unarmed citizen being shot. If you can't hear it then maybe you haven't been listening.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1439026485.0,
    "date_created": "2015-08-07",
    "time_created": "21:34:45",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuc9uu",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1438941754.0,
    "date_created": "2015-08-06",
    "time_created": "22:02:34",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctudxyj",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "(throw-away since I am the spouse of a law enforcement officer)\n\nI firmly believe the problem is not race but rather the law enforcement officials themselves.  I'm not saying that LEO (law enforcement officials) are all bad people.  Most of those that start in law enforcement actually believe they can change things.  About 2-3 years in they realize they cannot.  When a person first hires on with any department they go through a difficult hire-on process (as I feel it should be) that consists of drug tests, numerous interviews, physical tests, polygraphs and pysch evaluations.  However, this is the ONLY time LEOs are required to go through these evaluations.  Ever wondered why there are obese LEOs? Because they were never required to take the physical test again.  Why does this matter? Once an LEO is hired that is it, there are no follow up exams or questions.  \n\nOur LEOs endure a lot of hate and sadness. I would say that many suffer from undiagnosed PTSD and depression. Knowing that when you are in uniform people avoid you takes a mental toll on a person.  An officer will find their first dead body that has been decomposing for a week and the only support they recieve is from a supervisor.  That \"support\" consists of the following question: \"hey Smith, you okay after seeing your first gross dead body?\" Smith replies a simple \"yeah\" and all is okay with the department.  \n\nLEO need to be \"retested\" and their mental AND physical capabilites need to be re-evaluated every so often .  An LEO that was mentally qualified 2 years ago may no longer be mentally stable to do the same job duties.  I would hope there would be a plan in place to help these LEOs but seeing how we treat our veterans I highly doubt that would happen.  By no means do I feel we should discard the LEOs that are no longer mentally fit to serve the public but there needs to be more support and resources to help the mentallity of our LEOs.  I just wish across our society we would think more of people that sought out mental health improvement rather than the stygma that those that do are weak.  LEOs should feel it is acceptable to get help with mental health issues. Hell, I'd say departments should make it manditory that EVERY officer see a counselor/pyschiatrist/pyshcologist once a month just to eliminate the \"you're a pussy\" teasing since everyone has to go. \n\n Our LEO have just become too desensitized to humans and need some \"maintenance\" in the mental health department.   They should also be required to maintain the same physical attributes as they had when they were first hired but thats another discussion for another day. ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1438944723.0,
    "date_created": "2015-08-06",
    "time_created": "22:52:03",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu194s",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "There's like 1 1/2 paragraphs about what happened and the rest is just about race.\n\nAlso, 10 grams? undercover cops for less than a half ounce? dafuq",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1438923351.0,
    "date_created": "2015-08-06",
    "time_created": "16:55:51",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5al3",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "That's it, I'm going to burn down Neiman Marcus.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1438929591.0,
    "date_created": "2015-08-06",
    "time_created": "18:39:51",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu698j",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "He's not a lion. Simple as that. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1438931190.0,
    "date_created": "2015-08-06",
    "time_created": "19:06:30",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu80yo",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "White people aren't as communal. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1438934125.0,
    "date_created": "2015-08-06",
    "time_created": "19:55:25",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu1gdi",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "Where are the ALM activists when you need them? ",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1438923648.0,
    "date_created": "2015-08-06",
    "time_created": "17:00:48",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8eur",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "Me being a 22yr old black male this eats me up inside because cops dont just target black males they have no color barrier I believe its not a race problem its a law enforcement problem in America that needs to be addressed or it will only keep happening more. My prayers go out to this family. ",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1438934809.0,
    "date_created": "2015-08-06",
    "time_created": "20:06:49",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuf2oy",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "You're right. Let's go loot Lee Valley Tools or Bass Pro Mills",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1438946891.0,
    "date_created": "2015-08-06",
    "time_created": "23:28:11",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctugty0",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "Time to loot bass pro shops",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1438950445.0,
    "date_created": "2015-08-07",
    "time_created": "00:27:25",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctup0m6",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "\"White lives matter\" is brought to you by the white community which generally believes most if not all police shootings are justified, therefore no outrage. Pretty simple, really. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1438978067.0,
    "date_created": "2015-08-07",
    "time_created": "08:07:47",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctus69b",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "The fact you can shoot somebody and then your account of the events be trusted just because you're a police officer is outrageous.  ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1438985273.0,
    "date_created": "2015-08-07",
    "time_created": "10:07:53",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuxrev",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "1. The \"media\" didn't create the outrage over Michael Brown et al. People *organized*. Black Lives Matter is a political campaign. There are activists. They didn't expect attention, they *demanded* it and made it happen.\n2. Black Lives Matter centered around people that weren't involved in serious crimes. The second any actual criminal matter happens, like actually selling drugs, the media and everyday people care less, period.\n3. There is an overall problem with police brutality, but let's not pretend that people of color don't have it worse. Pair overall police brutality with systemic racism and discrimination, and you've got a massive problem.\n4. Black Lives Matter has actually been support of raising awareness for Hammond.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1438993902.0,
    "date_created": "2015-08-07",
    "time_created": "12:31:42",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuyr5b",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "White people. You guys are the ones that can get this shit to stop. Everyones watching. I am sympathetic to the victim. I know how it feels. Its like damn that could have been me or someone I know. That being said all life matters. Black live matter wasnt meant to negate that. Lower class and upper class matters. I hope we as a people get it right this time... \n\nOh and to the reddit racists... not the majority just the most vocal minority. NOW YOU SEE HOW WE FEEL.\n\nYou dont see the few black people that are on this site trying to side with the damn cop. Or poke holes. SOMEBODY DIED. A HUMAN LIFE. THEIR SKIN COLOR IS SOMETHING STUPID TO BASE AN OPINION OFF OF.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1438995333.0,
    "date_created": "2015-08-07",
    "time_created": "12:55:33",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4p0i",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "Of course people should be outraged by this.  People should be outraged by *all* police abuses.  Shit like this should definitely be shouted from the hills.\n\nFuck yeah, get this story out and make it clear -- police abuse isn't just a racial thing. It's not something that only happens to black people or Hispanic people.  Anybody can be a target.  Anyone at all.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1438928599.0,
    "date_created": "2015-08-06",
    "time_created": "18:23:19",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu40v0",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "There's no outrage because, as the article says, it was ruled a homicide and the two officers were indicted. Unlike Darren Wilson or officers involved in the death of dozens of other people of color in the last year.\n\nThere's no need to be outraged when the criminal justice system does what it's supposed to.",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1438927545.0,
    "date_created": "2015-08-06",
    "time_created": "18:05:45",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4a8t",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "Burn something down. That will get CNN. \n",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438927955.0,
    "date_created": "2015-08-06",
    "time_created": "18:12:35",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6bbf",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "I sure would like a little more information than the article gave. Besides stating the obvious that there is no media outrage because the victim was white, I would like to know how busting someone with less than an ounce of marijuana calls for an undercover sting targeting the marijuana Tony Montana? Also, I know even if your driving your car past an officer trying to get away if the officer perceives the car as a threat they are authorized to use deadly force, but really. Did a teen warrant being shot over a small amount of weed and some crazy driving? Maybe we will know more in the coming days. Hope OP will keep us posted. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438931289.0,
    "date_created": "2015-08-06",
    "time_created": "19:08:09",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu7lcv",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "Who has heard of the event and isn't outraged? I think that anytime someone hears of an incident like this it should stir outrage within their souls. But you can't have outrage for something you don't hear about. The community needs to spread the word about this. The injustice that the public of America is subjected to on a day to day basis is incomprehensible. Nothing is going to change as long as the public continues to point fingers at each other instead of at the people that have the power. Time and time again we hear of these shootings and while the families and communities are grieving, the actual perpetrators are on paid leave while our justice system figures out how to soften the blow to the public. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438933376.0,
    "date_created": "2015-08-06",
    "time_created": "19:42:56",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu84tw",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "The selfishness of police has been allowed to rear it's head and go unchallenged. \n\nIn the 1930s and 1950s, they didn't hold the idea that \"Fuck serve and protect\" was honorable. We didn't have officers being taken to court and sued for refusing to intervene and help people. \n\nNowdays, it's common to see LEOs say on cops, and in press conferences that \"Officers have to go home at the end of the day.\" \n\nHow much of a fuckup do you have to be to go into the \"Serve and protect\" field, when you're that narcissistic. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438934315.0,
    "date_created": "2015-08-06",
    "time_created": "19:58:35",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8ax0",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "\"Where is the outrage?\"\n\nWell, this is the first I have heard of this incident. I am outraged. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438934616.0,
    "date_created": "2015-08-06",
    "time_created": "20:03:36",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8hdh",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438934937.0,
    "date_created": "2015-08-06",
    "time_created": "20:08:57",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8urh",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "Maybe the teen was running away. It pisses cops off yif you run away from them.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438935601.0,
    "date_created": "2015-08-06",
    "time_created": "20:20:01",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8uyi",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "There wont be any outrage unfortanately except with the family. Its a sad fact of life that unless its on video and seen by enough people to shift popular opinion, nothing will be done.         \n\nIn a similar case, Las Vegas Metro opened fire on a man that was reported to have a gun in a Costco. It didnt matter that he didnt take it out, that he was simply shopping with his girlfriend, and that officers waited outside for him to complete his purchase, and that it remained in its legally concealed holster when confronted not by Costco employees but police who claimed he threatened them. It didnt matter that the police or coronors couldnt be cross examined by the family as to their procedures or testimony , that it took 20 minutes to clear the officers, and that one of them later was fired for giving a firearm to a felon. It was revealed that every gun he owned was registered to him and he had no place to hold the 45 cal Kimber they \"found\", also this was not the gun the store employee reported seeing. Eric Scott was a former Army Captain and pharmaceutical rep with no priors and no history of violence. The police just do what they want and let the end justify the means. Costco's security footage oddly enough just didnt happen to work that day. \n http://lasvegassun.com/news/2010/sep/28/jury-shooting-justified/\n\nhttp://www.copblock.org/1004/erik-scotts-death-what-happens-in-the-lvmpd-stays-in-the-lvmpd/\n\nhttp://lasvegassun.com/news/2011/jan/31/officer-tied-costco-shooting-faces-felony-weapons-/\n",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438935611.0,
    "date_created": "2015-08-06",
    "time_created": "20:20:11",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu9al0",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm pretty sure any normal human being is outraged once they hear about shit like this. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438936396.0,
    "date_created": "2015-08-06",
    "time_created": "20:33:16",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu9nu4",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "Oh another \"police officer involved murder\". ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438937068.0,
    "date_created": "2015-08-06",
    "time_created": "20:44:28",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu9vsj",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "Cops are cowards by majority, not all of them.  Shooting anyone in the back is cowardice, nothing more or less.  I'm all for protecting yourself and others but bullets in the back is inexcusable.  Be the shield that protects the innocent but do it with honor not in pure shame, it's taints the honor of  all those that serve with dignity.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438937457.0,
    "date_created": "2015-08-06",
    "time_created": "20:50:57",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu9zn2",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "I hate cops more and more each day.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438937651.0,
    "date_created": "2015-08-06",
    "time_created": "20:54:11",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctua2sv",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "No outrage, he isn't black, so we can't get behind a race scandal. Why can't people address the real issue.. The police !!! ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438937805.0,
    "date_created": "2015-08-06",
    "time_created": "20:56:45",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuacxq",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "This is the third piece of big media on this that I've seen today. It seems like we're raging.  \n\nEdit: by all means continue to rage. Get out the pitchforks!",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438938298.0,
    "date_created": "2015-08-06",
    "time_created": "21:04:58",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctub5x9",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "Something doesn't add up here--the officer shot in self defense because the victim was accelerating towards him, but the autopsy showed the victim was shot from the back? Could someone clarify?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438939773.0,
    "date_created": "2015-08-06",
    "time_created": "21:29:33",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctubbnu",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "that is so messed up. Police officers should be obligated to carry a gopro attached to them that records everything they do.... at the end of the day it is a public service and this would benefit the public",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438940062.0,
    "date_created": "2015-08-06",
    "time_created": "21:34:22",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctucblv",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "Lets forget about race which i know is a factor, but more importantly think about the corruption, abuse, and amount of power the police has.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438941837.0,
    "date_created": "2015-08-06",
    "time_created": "22:03:57",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctue1ca",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "why is \"unarmed\" in quotes? ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438944889.0,
    "date_created": "2015-08-06",
    "time_created": "22:54:49",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctue9f5",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "Cops killing white kids doesn't sell tickets.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438945292.0,
    "date_created": "2015-08-06",
    "time_created": "23:01:32",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctufsdi",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "This reminds me of those complaints about why there's so much about breast cancer and not prostate cancer.  The answer is because people did a *fucking shit ton* of work to make it a big media thing.\n\nSo, ya know, do that.  If you want something to be a big thing then make it a big thing.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438948275.0,
    "date_created": "2015-08-06",
    "time_created": "23:51:15",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctug3kx",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "Won't spark race riots that's why. Also, it needs to be recognized that police brutality is effecting everyone in this country.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438948903.0,
    "date_created": "2015-08-07",
    "time_created": "00:01:43",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctug5tb",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "There's no outrage because these days no one hates white people more than other white people. The outrage before was the black community saying \"What the fuck?!?\" and then the progressive white people decided it was a good time to make people think they care about things so it gained traction from trust fund babies on social media caring about people they secretly think are less than they are. There's no outrage because he isn't black. if you want a backlash then start doing things about it.  \n\nMe? I'm good. Cops are going to shoot people for no reason. Give a sociopath a weapon and these things happen. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438949029.0,
    "date_created": "2015-08-07",
    "time_created": "00:03:49",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuhgld",
    "parent_id": "t3_3g1nxm",
    "subreddit_name_prefixed": "r/news",
    "body": "YAY! 10 grams of marijuana off the street!  Another victory for the WAR ON DRUGS/PEOPLE",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438951857.0,
    "date_created": "2015-08-07",
    "time_created": "00:50:57",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu3ok5",
    "parent_id": "t1_ctu1zt4",
    "subreddit_name_prefixed": "r/news",
    "body": "Slipped my mind.",
    "controversiality": 0,
    "ups": 4607,
    "downs": 0,
    "score": 4607,
    "created": 1438927014.0,
    "date_created": "2015-08-06",
    "time_created": "17:56:54",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4950",
    "parent_id": "t1_ctu1zt4",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 1029,
    "downs": 0,
    "score": 1029,
    "created": 1438927907.0,
    "date_created": "2015-08-06",
    "time_created": "18:11:47",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu3yia",
    "parent_id": "t1_ctu1zt4",
    "subreddit_name_prefixed": "r/news",
    "body": "With all the police shootings happening, it was left to be implied.",
    "controversiality": 0,
    "ups": 142,
    "downs": 0,
    "score": 142,
    "created": 1438927443.0,
    "date_created": "2015-08-06",
    "time_created": "18:04:03",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu3xeu",
    "parent_id": "t1_ctu1zt4",
    "subreddit_name_prefixed": "r/news",
    "body": "[8] Condition of body upon discovery.\n\n*See attached.*",
    "controversiality": 0,
    "ups": 61,
    "downs": 0,
    "score": 61,
    "created": 1438927393.0,
    "date_created": "2015-08-06",
    "time_created": "18:03:13",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu59b0",
    "parent_id": "t1_ctu1zt4",
    "subreddit_name_prefixed": "r/news",
    "body": "this happened about a week ago and the investigation into the death is still ongoing (the one into the drug issue is wrapped up). There is also video footage.\n\nHow about people wait until that report comes out. Maybe the officer will get charged, maybe the kid stepped on the gas and tried to run him over.",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1438929531.0,
    "date_created": "2015-08-06",
    "time_created": "18:38:51",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctujbx2",
    "parent_id": "t1_ctubnp8",
    "subreddit_name_prefixed": "r/news",
    "body": "God Damn that's the truth. ",
    "controversiality": 0,
    "ups": 90,
    "downs": 0,
    "score": 90,
    "created": 1438956700.0,
    "date_created": "2015-08-07",
    "time_created": "02:11:40",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctul983",
    "parent_id": "t1_ctubnp8",
    "subreddit_name_prefixed": "r/news",
    "body": "Spot on. The increasing militarisation of police has contributed to that. How are they NOT supposed to think it's war when they're wearing military surplus or carrying ex-military weapons???\n\n",
    "controversiality": 0,
    "ups": 61,
    "downs": 0,
    "score": 61,
    "created": 1438963090.0,
    "date_created": "2015-08-07",
    "time_created": "03:58:10",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuo8jp",
    "parent_id": "t1_ctubnp8",
    "subreddit_name_prefixed": "r/news",
    "body": "Natural police.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1438975540.0,
    "date_created": "2015-08-07",
    "time_created": "07:25:40",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctur00z",
    "parent_id": "t1_ctubnp8",
    "subreddit_name_prefixed": "r/news",
    "body": "I love the wire. The funny thing is that his solution worked great and he got fired for it",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438983012.0,
    "date_created": "2015-08-07",
    "time_created": "09:30:12",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6o75",
    "parent_id": "t1_ctu4cn1",
    "subreddit_name_prefixed": "r/news",
    "body": "I work in West Union and this is the first time I've heard of it!!  WTF how does this happen in Oconee!!",
    "controversiality": 0,
    "ups": 413,
    "downs": 0,
    "score": 413,
    "created": 1438931887.0,
    "date_created": "2015-08-06",
    "time_created": "19:18:07",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu74a4",
    "parent_id": "t1_ctu4cn1",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm in Lexington, SC, and this is the first I've heard of it. \n\nWhat I don't understand about all these shootings is how people who are supposed to serve and protect have such little regard for human life. And yes, I KNOW that this is a small percentage of cops, but when we're talking about lives lost, it's still too many.",
    "controversiality": 0,
    "ups": 226,
    "downs": 0,
    "score": 226,
    "created": 1438932594.0,
    "date_created": "2015-08-06",
    "time_created": "19:29:54",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5m6p",
    "parent_id": "t1_ctu4cn1",
    "subreddit_name_prefixed": "r/news",
    "body": "Has there been any protest, or is it just people talking about it?",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1438930131.0,
    "date_created": "2015-08-06",
    "time_created": "18:48:51",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu89g0",
    "parent_id": "t1_ctu4cn1",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 200,
    "downs": 0,
    "score": 200,
    "created": 1438934543.0,
    "date_created": "2015-08-06",
    "time_created": "20:02:23",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu71w2",
    "parent_id": "t1_ctu4cn1",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm from greenville and i've been hearing a lot about this on wyff4 and fox (local), also among coworkers and stuff. It's definitely been talked about a good bit around me. I am confused that this hasn't made national attention and I'm happy to see it's starting to. There's no reason this boy should have been shot in his **back**.  ",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1438932487.0,
    "date_created": "2015-08-06",
    "time_created": "19:28:07",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6us1",
    "parent_id": "t1_ctu4cn1",
    "subreddit_name_prefixed": "r/news",
    "body": "The irony is if anyone in the media picks this up it will be the conservative media pointing out the hypocrisy",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1438932172.0,
    "date_created": "2015-08-06",
    "time_created": "19:22:52",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu7s8q",
    "parent_id": "t1_ctu4cn1",
    "subreddit_name_prefixed": "r/news",
    "body": "Greenville here, nobody's talkin about it. Heard about it on reddit today",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438933700.0,
    "date_created": "2015-08-06",
    "time_created": "19:48:20",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4txb",
    "parent_id": "t1_ctu3k0a",
    "subreddit_name_prefixed": "r/news",
    "body": "As it becomes legal in more and more places within the US, this becomes even more surreal. One place, you can just walk in a shop and buy it. Another in the same country, cops will flat our murder you for it. ",
    "controversiality": 0,
    "ups": 1933,
    "downs": 0,
    "score": 1933,
    "created": 1438928814.0,
    "date_created": "2015-08-06",
    "time_created": "18:26:54",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5lv7",
    "parent_id": "t1_ctu3k0a",
    "subreddit_name_prefixed": "r/news",
    "body": "10 years ago when I was around 20, there was this guy who was a friend of a friend that called me constantly asking me if I could find any drugs. I didn't give him my number, and he was pretty aggressive about it. I always just told him no because I never sold drugs.\n\nHe called a few times a day if I didn't pick up. I wasn't very confrontational so I didn't straight up tell him to fuck off but told him no everytime. I remember one time he asked if I could find 100 pills of ecstasy. \n\nOne time I was on the phone with my friend who I got pot from and got a beep from another call, and lo and behold it was him asking if I could get anything at all. I told him my friend was going to be here in 45 minutes and to be here at the same time and he could get an eighth a pot for 50 bucks. \n\nSo this guy shows up 45 minutes late with his friend(the undercover). I give him the bag because my friend had already came and left, expecting me to get the money for him cause he had to leave. \n\nLong story short, a few weeks later the same thing happens, except I tell him to go meet him himself since he kept me waiting so long before. He insist he picks me up and we go get it together. It's from the same guy as the first time and we go to meet him. He insist I take the money and go get it from the guy. They drop me off back at my house after.\n\nA few months later I get a knock on my door and it's a policeman at my door. He says that they have recovered property of mine that I need to sign for. So I'm all happy wondering what it is and as I'm walking to his car in my driveway someone radios him and says \"thats him!\", and I get tackled.\n\nIm like wtf and asked what im being arrested for, and he says that I know I'm a drug dealer. I get thrown into a small jail at the police station and one by one, my friends start getting put into the cell with me. \n\nFour of them were in a car together when they got pulled over by a team of 4 with mask and shotguns yelling orders.\n\nWe eventually figure out we got setup by this guy we know. To this day it still blows my mind because they didn't even bust our dealer (who was small time teenager anyways wow), and we all get arrested for drug trafficking for middle manning 25-50$ pot deals.\n\nI tried to tell my public attorney to get the phone records to argue some kind of extortion ( i dont know), but they didnt care enough to make it happen apparently. \n\nI ended up doing 3-4 months of jailtime and 2 years of probation, having to pay thousands in fines and cost. Glad I didn't get shot for it though.\n\n\nTLDR: Arrested for middle manning 75$ worth of pot over 3 stings",
    "controversiality": 0,
    "ups": 894,
    "downs": 0,
    "score": 894,
    "created": 1438930116.0,
    "date_created": "2015-08-06",
    "time_created": "18:48:36",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu50fp",
    "parent_id": "t1_ctu3k0a",
    "subreddit_name_prefixed": "r/news",
    "body": "(For those who are unaware, that's a third of an ounce, or a little over $100 worth of weed given prices in South Carolina.  Roughly 10-20 (**Edit**:-30) joints worth.)",
    "controversiality": 0,
    "ups": 45,
    "downs": 0,
    "score": 45,
    "created": 1438929113.0,
    "date_created": "2015-08-06",
    "time_created": "18:31:53",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu60qn",
    "parent_id": "t1_ctu3k0a",
    "subreddit_name_prefixed": "r/news",
    "body": "10 grams was called Tuesday for me in high school. That's fucking unbelievable this kid was killed over 10 grams of weed by a cop. Disgusting. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1438930787.0,
    "date_created": "2015-08-06",
    "time_created": "18:59:47",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4rig",
    "parent_id": "t1_ctu3k0a",
    "subreddit_name_prefixed": "r/news",
    "body": "racism is the most effective tool that capitalists use. it prevents the working classes from uniting together ",
    "controversiality": 0,
    "ups": 127,
    "downs": 0,
    "score": 127,
    "created": 1438928709.0,
    "date_created": "2015-08-06",
    "time_created": "18:25:09",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4zwu",
    "parent_id": "t1_ctu3k0a",
    "subreddit_name_prefixed": "r/news",
    "body": "Exactly what I thought. Not only did they kill someons but wasted God knows how many dollars and hours arranging a sting for a plant that is completely legal in 4 states. Fucking insane",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438929090.0,
    "date_created": "2015-08-06",
    "time_created": "18:31:30",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8dy7",
    "parent_id": "t1_ctu4nux",
    "subreddit_name_prefixed": "r/news",
    "body": "The police officer claims the kid was trying to run him over. The author is trying to be impartial, which is a good thing. ",
    "controversiality": 0,
    "ups": 500,
    "downs": 0,
    "score": 500,
    "created": 1438934764.0,
    "date_created": "2015-08-06",
    "time_created": "20:06:04",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu93k7",
    "parent_id": "t1_ctu4nux",
    "subreddit_name_prefixed": "r/news",
    "body": "Quotes are often given in news articles when the word or phrase in quotations hasn't been substantiated. They report it, but the quotation marks show it's not yet proven. BBC does this.  Right now on BBC a headline says: Boy, 11 'shot dead a toddler.'  Since the boy hasn't been convicted, the offense is in quotes. ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1438936041.0,
    "date_created": "2015-08-06",
    "time_created": "20:27:21",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6jwi",
    "parent_id": "t1_ctu4nux",
    "subreddit_name_prefixed": "r/news",
    "body": "I came to post this as well... was he a 'teen'? was he 'white'? was he actually 'shot dead'???",
    "controversiality": 0,
    "ups": 177,
    "downs": 0,
    "score": 177,
    "created": 1438931698.0,
    "date_created": "2015-08-06",
    "time_created": "19:14:58",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu7xfl",
    "parent_id": "t1_ctu4nux",
    "subreddit_name_prefixed": "r/news",
    "body": "It's in quotes because the vehicle is being considered a weapon. The general consensus here (seneca) is that the kid was going towards the officer and got shot as he went past him. ",
    "controversiality": 0,
    "ups": 118,
    "downs": 0,
    "score": 118,
    "created": 1438933956.0,
    "date_created": "2015-08-06",
    "time_created": "19:52:36",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8mnx",
    "parent_id": "t1_ctu4nux",
    "subreddit_name_prefixed": "r/news",
    "body": "Well, technically he had two arms, but",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438935201.0,
    "date_created": "2015-08-06",
    "time_created": "20:13:21",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu9dqx",
    "parent_id": "t1_ctu4nux",
    "subreddit_name_prefixed": "r/news",
    "body": "It's because the police claim the car could have served as a weapon had the officer not shot him... In the back.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438936556.0,
    "date_created": "2015-08-06",
    "time_created": "20:35:56",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu3d4p",
    "parent_id": "t1_ctu17nd",
    "subreddit_name_prefixed": "r/news",
    "body": "Fuck@you.site.com",
    "controversiality": 0,
    "ups": 250,
    "downs": 0,
    "score": 250,
    "created": 1438926520.0,
    "date_created": "2015-08-06",
    "time_created": "17:48:40",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu7zus",
    "parent_id": "t1_ctu17nd",
    "subreddit_name_prefixed": "r/news",
    "body": "Damn why do I always gotta be outraged at everything anyway?\n\nCan't I just relax for once?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438934075.0,
    "date_created": "2015-08-06",
    "time_created": "19:54:35",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu65qd",
    "parent_id": "t1_ctu4j57",
    "subreddit_name_prefixed": "r/news",
    "body": "So... his *heart* fired the gun?",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1438931023.0,
    "date_created": "2015-08-06",
    "time_created": "19:03:43",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuaznl",
    "parent_id": "t1_ctu4j57",
    "subreddit_name_prefixed": "r/news",
    "body": "He was shot through the front of his ass.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1438939449.0,
    "date_created": "2015-08-06",
    "time_created": "21:24:09",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctugbb5",
    "parent_id": "t1_ctu4j57",
    "subreddit_name_prefixed": "r/news",
    "body": "Through^the^backof the chest",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438949347.0,
    "date_created": "2015-08-07",
    "time_created": "00:09:07",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuikii",
    "parent_id": "t1_ctu67lp",
    "subreddit_name_prefixed": "r/news",
    "body": "As a white guy, I feel precisely the same as you do; we are all of one people, the human race. Whenever I try to point out that race is just another tool to keep the general public at each other's throats while the elite make off like thieves in the night, I am almost immediately accused of being some sort of closeted bigot by people of all colors and creeds. It's confounding, really.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1438954597.0,
    "date_created": "2015-08-07",
    "time_created": "01:36:37",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuf525",
    "parent_id": "t1_ctu6fbx",
    "subreddit_name_prefixed": "r/news",
    "body": "According to the UCR/FBI in 2012, there were 14,827 murders. That same year there were around 400 police shootings, only about 4% of the deaths in the US are cop related killings. Of that number maybe only another 5% of those are actually unjustifiable shootings. In 310 of those 400 police shootings, the felon was shot during the commission of a crime. You're more likely to get killed by your family member than you are a police officer. The amount of hate police get sometimes baffles me. \n\nI'm sure your dad is a great man and you shouldn't feel ashamed to mention that he was an officer. Yeah there are a few unjustified shootings by police and they should be prosecuted to the full extent, is it a problem? Yeah. Is it a big problem? No not at all. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1438947016.0,
    "date_created": "2015-08-06",
    "time_created": "23:30:16",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu2k43",
    "parent_id": "t1_ctu0sr5",
    "subreddit_name_prefixed": "r/news",
    "body": "Also, Black families have been protesting murder-by-cop for decades. They only just got attention for it now. ",
    "controversiality": 0,
    "ups": 745,
    "downs": 0,
    "score": 745,
    "created": 1438925288.0,
    "date_created": "2015-08-06",
    "time_created": "17:28:08",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4855",
    "parent_id": "t1_ctu0sr5",
    "subreddit_name_prefixed": "r/news",
    "body": "What is there to protest? \n\nAccording to that article the coroner ruled the shooting a homicide and the officer involved is suspended and under investigation. \n\nThe black shootings generate outrage because of the lack of accountability and police treating shooting unarmed people like business as usual, something that has not happened in this case. ",
    "controversiality": 0,
    "ups": 186,
    "downs": 0,
    "score": 186,
    "created": 1438927863.0,
    "date_created": "2015-08-06",
    "time_created": "18:11:03",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu3y7u",
    "parent_id": "t1_ctu0sr5",
    "subreddit_name_prefixed": "r/news",
    "body": ">Have they protested? Have they organized a group to form a sit-in or a press conference, or a demonstration in front of government buildings? Have they contacted any civil rights organizations about this case? Have they circulated a petition or made any noise with the local media? \n\nYou know, a shitload of white people get killed by cops in this country, but I only ever hear about one of these cases when someone is using it to complain about #BlackLivesMatter. I can't help but feel the reason nobody talks about these cases is that people really just don't care. This sort of thing should make people FURIOUS, but instead of protesting, or making a case, people just use it to shut down the only other people who care about this stuff and then ignore it when the argument is over.",
    "controversiality": 0,
    "ups": 114,
    "downs": 0,
    "score": 114,
    "created": 1438927430.0,
    "date_created": "2015-08-06",
    "time_created": "18:03:50",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu26hr",
    "parent_id": "t1_ctu0sr5",
    "subreddit_name_prefixed": "r/news",
    "body": "I guess the question extends to both local reaction and media reaction.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1438924712.0,
    "date_created": "2015-08-06",
    "time_created": "17:18:32",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8589",
    "parent_id": "t1_ctu0sr5",
    "subreddit_name_prefixed": "r/news",
    "body": "Exactly right. You don't get Media awareness for free. That kind of attention was fought hard for in the other cases. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438934334.0,
    "date_created": "2015-08-06",
    "time_created": "19:58:54",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuhog5",
    "parent_id": "t1_ctu0sr5",
    "subreddit_name_prefixed": "r/news",
    "body": "I think you've missed the point entirely. white people haven't been repressed for decades. The black community has a network setup with a lot of influential and powerful people. They have infrastructure set up for this kind of situation and they know from a lot of experience how to get things out there. It doesn't always work but white people don't really have experience or connection to get it through the pipes as smoothly . It's the ultimate first world problem. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438952374.0,
    "date_created": "2015-08-07",
    "time_created": "00:59:34",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu10g5",
    "parent_id": "t1_cttzqv2",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm a black person and I definitely agree this should stir outrage.  I'm spreading it around social media right now in order to try to get it out there.",
    "controversiality": 0,
    "ups": 4086,
    "downs": 0,
    "score": 4086,
    "created": 1438923002.0,
    "date_created": "2015-08-06",
    "time_created": "16:50:02",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu1e2w",
    "parent_id": "t1_cttzqv2",
    "subreddit_name_prefixed": "r/news",
    "body": "Americans of every race should help protest against police brutality because it effects all of us. I think African Americans were united around this issue initially because they're the only race in this country that's had to unite to overturn laws discriminating against them.",
    "controversiality": 0,
    "ups": 729,
    "downs": 0,
    "score": 729,
    "created": 1438923554.0,
    "date_created": "2015-08-06",
    "time_created": "16:59:14",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu0ik0",
    "parent_id": "t1_cttzqv2",
    "subreddit_name_prefixed": "r/news",
    "body": "Right... uh, this is the first I've heard of it and it seems pretty outrage worthy.",
    "controversiality": 0,
    "ups": 126,
    "downs": 0,
    "score": 126,
    "created": 1438922292.0,
    "date_created": "2015-08-06",
    "time_created": "16:38:12",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu12e4",
    "parent_id": "t1_cttzqv2",
    "subreddit_name_prefixed": "r/news",
    "body": "Two issues are constantly being conflated:\n\n* Racist police officers. This problem is an extension of systemic racism in many facets of our society and government\n* Police abuse, overreach, impunity etc which are problems that *can* be treated independently from the racial issues, even though there can be a compounding ~~a~~effect between them. The safeguards for citizens won't be racial in nature.\n\n\n**EDIT** : I am *not* , in this post, deeming what makes officers \"racist\". I am actually saying the the issue of \"racism in the police force\" is an much more abstract issue *for the very reason* that it is very difficult (in many cases) to be sure an act was motivated by racism. Some responses are defending officers' right to arrest black criminals, and I'm not arguing against that.\n\nWhat I am saying it this: **there are very clear solutions to the issue of reining in aggressive, abusive police: zero-tolerance policies, body cameras, etc. whereas the general idea of 'racism in the system' is a much more difficult issue to solve with a couple of policies**",
    "controversiality": 0,
    "ups": 290,
    "downs": 0,
    "score": 290,
    "created": 1438923078.0,
    "date_created": "2015-08-06",
    "time_created": "16:51:18",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu40ku",
    "parent_id": "t1_cttzqv2",
    "subreddit_name_prefixed": "r/news",
    "body": "> White people should do the same. But you don't.\n\nI think it's telling that outside of a couple anarchist radicals, nobody except, weirdly, black people ever mentions police violence against white people. I've seen BLM activists bringing up what happened to this kid on twitter. I don't see that many white people doing it. \n\nThe sad thing that my neighbors don't seem to understand is that if this shit can happen to black people it could just as easily happen to white people. And it does. Obviously there's a massive racial disparity at work here that needs to be talked about. But the inability of white people to recognize problems in our community is astounding to me. \n\nI grew up hearing complaints but never seeing any action. ",
    "controversiality": 0,
    "ups": 226,
    "downs": 0,
    "score": 226,
    "created": 1438927533.0,
    "date_created": "2015-08-06",
    "time_created": "18:05:33",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4d4x",
    "parent_id": "t1_cttzqv2",
    "subreddit_name_prefixed": "r/news",
    "body": "Well said\n\nIt's worth noting that while this story has been gaining traction on reddit, BlackLivesMatter has been the most outspoken about Hammond's death & the lack of media coverage on it",
    "controversiality": 0,
    "ups": 106,
    "downs": 0,
    "score": 106,
    "created": 1438928076.0,
    "date_created": "2015-08-06",
    "time_created": "18:14:36",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4u7u",
    "parent_id": "t1_cttzqv2",
    "subreddit_name_prefixed": "r/news",
    "body": "Black Lives Matter folks have been talking about this for days. Check out Derey McKesson's twitter timeline. ",
    "controversiality": 0,
    "ups": 92,
    "downs": 0,
    "score": 92,
    "created": 1438928827.0,
    "date_created": "2015-08-06",
    "time_created": "18:27:07",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu43s8",
    "parent_id": "t1_cttzqv2",
    "subreddit_name_prefixed": "r/news",
    "body": ">There is no outrage because the local community isn't doing enough to get it out there.\n\nAlso because according to that article, Hammonds death was classified by the coroner as a homicide and the officer involved is suspended while the case is investigated.\n\nThe black killings spark outrage because they were treated like business as usual and not investigated by the departments involved. ",
    "controversiality": 0,
    "ups": 89,
    "downs": 0,
    "score": 89,
    "created": 1438927670.0,
    "date_created": "2015-08-06",
    "time_created": "18:07:50",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4hbi",
    "parent_id": "t1_cttzqv2",
    "subreddit_name_prefixed": "r/news",
    "body": "I've seen a lot of outrage in social media about this shooting, in fact that's probably why it's making national headlines now. The people I've seen share it are those active in the blacklivesmatter ",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1438928259.0,
    "date_created": "2015-08-06",
    "time_created": "18:17:39",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4qxp",
    "parent_id": "t1_cttzqv2",
    "subreddit_name_prefixed": "r/news",
    "body": "> White people should do the same.  \n\nDING! DING! DING! DING!  \n\nIn my neck of the woods, when a Vietnamese immigrant got shot for no reason by the cops, the Vietnamese American community got up in arms and shit happened. That's because Vietnamese Americans are a distinct group with shared cultural roots.  \n\nWhite Americans? By the admission of many, *many* white American redditors, American whites don't have a distinct identity and shared roots that allow for this kind of mobilization. Y'all need to recognize that, get off your asses, and do whatever it takes to be heard (within legal bounds of course)!  \n\nTo some extent, the same is true of Asians. Our parents hailed from numerous Asian countries. My old folks don't feel a sense of solidarity with America as a whole and they sure don't identify with people who immigrated from other countries. The result is there's no distinct Asian American identity to rally around.\n\n",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438928684.0,
    "date_created": "2015-08-06",
    "time_created": "18:24:44",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu1s3b",
    "parent_id": "t1_ctu1i1p",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah but faux outrage about not enough outrage gets a lot more clicks.",
    "controversiality": 0,
    "ups": 205,
    "downs": 0,
    "score": 205,
    "created": 1438924125.0,
    "date_created": "2015-08-06",
    "time_created": "17:08:45",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu2mac",
    "parent_id": "t1_ctu1i1p",
    "subreddit_name_prefixed": "r/news",
    "body": "280 comments is low as fuck, and does not even come close to constituting outrage. \n\nThese parents are spot on in pointing out a lack of outrage. What they feel to address is that the reason there is outrage when a black person is killed by police is because it has happened so often in the past, the situation boiled over.",
    "controversiality": 0,
    "ups": 51,
    "downs": 0,
    "score": 51,
    "created": 1438925379.0,
    "date_created": "2015-08-06",
    "time_created": "17:29:39",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu52sk",
    "parent_id": "t1_ctu1i1p",
    "subreddit_name_prefixed": "r/news",
    "body": "Are you suggesting a *mildly* successful post on Reddit somehow qualifies as public outrage?\n\nPictures of cats get more than 1,500 upvotes and 280 comments.\n\n",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1438929224.0,
    "date_created": "2015-08-06",
    "time_created": "18:33:44",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu9vwh",
    "parent_id": "t1_ctu1i1p",
    "subreddit_name_prefixed": "r/news",
    "body": "Lots of clicks doesn't really change much, but it's a good substitute for activism.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438937462.0,
    "date_created": "2015-08-06",
    "time_created": "20:51:02",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4anz",
    "parent_id": "t1_ctu30id",
    "subreddit_name_prefixed": "r/news",
    "body": "Would it also be held true poorer people commit a greater number of violent crime? They would also be more likely to commit a less amount of white collared crimes.",
    "controversiality": 0,
    "ups": 53,
    "downs": 0,
    "score": 53,
    "created": 1438927972.0,
    "date_created": "2015-08-06",
    "time_created": "18:12:52",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu0riz",
    "parent_id": "t1_cttzlpz",
    "subreddit_name_prefixed": "r/news",
    "body": "Good, keep the drum beating. The police in their current incarnation need to be stopped. Ending the war on drugs doctrine and scaling back police to solely responding to violent crime will be one of the greatest civil rights struggles of the 21st century and it isnt anywhere close to over. We need this idea to be fresh and ever-present in everyone's minds. ",
    "controversiality": 0,
    "ups": 175,
    "downs": 0,
    "score": 175,
    "created": 1438922646.0,
    "date_created": "2015-08-06",
    "time_created": "16:44:06",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctubgb3",
    "parent_id": "t1_ctu5fhi",
    "subreddit_name_prefixed": "r/news",
    "body": "I know you're joking but it's easy for Jimmy Kimmel or someone to go out and \"take a stand\" against something easy like a dentist killing a lion. It takes much more grit to go out against the status-quo and call it what it is in the face of so much resistance. Really shows the vapid nature of pop culture in America as well as artists who, traditionally have had the role of bringing sensitive yet important issues into the public discussion.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438940295.0,
    "date_created": "2015-08-06",
    "time_created": "21:38:15",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuk9v8",
    "parent_id": "t1_ctu4hn5",
    "subreddit_name_prefixed": "r/news",
    "body": "I think it's actually really bad that the family's lawyer is doing that. The lawyer shouldn't throw shade at a group of people other than the police and the media.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438959643.0,
    "date_created": "2015-08-07",
    "time_created": "03:00:43",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6e61",
    "parent_id": "t1_ctu4hn5",
    "subreddit_name_prefixed": "r/news",
    "body": "Honestly I think it's because the #alllivesmatter train is just real thinly disguised racism",
    "controversiality": 0,
    "ups": 58,
    "downs": 0,
    "score": 58,
    "created": 1438931423.0,
    "date_created": "2015-08-06",
    "time_created": "19:10:23",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6fl6",
    "parent_id": "t1_ctu4hn5",
    "subreddit_name_prefixed": "r/news",
    "body": "its very simple, you see:\n\nblack guy gets shot by cops = black people's responsibility\n\nwhite guy gets shot by cops = black people's responsibility\n\n",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1438931494.0,
    "date_created": "2015-08-06",
    "time_created": "19:11:34",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4cen",
    "parent_id": "t1_ctu26r3",
    "subreddit_name_prefixed": "r/news",
    "body": "> Makes me wonder just how many of these comments were made without actually reading the article\n\nWhere do you think you are? ",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1438928045.0,
    "date_created": "2015-08-06",
    "time_created": "18:14:05",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5wfv",
    "parent_id": "t1_ctu26r3",
    "subreddit_name_prefixed": "r/news",
    "body": "Local source: http://www.wyff4.com/news/New-autopsy-findings-released-in-death-of-teen-shot-by-officer/34550522 ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1438930590.0,
    "date_created": "2015-08-06",
    "time_created": "18:56:30",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu74y2",
    "parent_id": "t1_ctu26r3",
    "subreddit_name_prefixed": "r/news",
    "body": "I read it without subscribing, because I have browser tools installed that block that kind of shit.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1438932623.0,
    "date_created": "2015-08-06",
    "time_created": "19:30:23",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4hzc",
    "parent_id": "t1_ctu0xeu",
    "subreddit_name_prefixed": "r/news",
    "body": "> More than 600 people have been killed by the police in the US this year along. If you can name all but the white ones, then there's a point to this \"where's the outrage?\" line. In reality, only a tiny number have risen to media prominence. \n\nYep, this is it. The fact that there wasn't any video has hurt their efforts, as has the absence of any local protests. \n\nRace *is*, I suspect, the best explanation for the second part--why the locals in Seneca haven't protested or rioted. It's a mostly rural, majority-white community; they haven't had as many reasons to distrust the police as the residents of Ferguson or Baltimore or LA have had.\n",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1438928289.0,
    "date_created": "2015-08-06",
    "time_created": "18:18:09",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8pqj",
    "parent_id": "t1_ctu0xeu",
    "subreddit_name_prefixed": "r/news",
    "body": "But why was this post in a national publication?\n\nWhat was the primary point of this article?\n",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438935353.0,
    "date_created": "2015-08-06",
    "time_created": "20:15:53",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctubwut",
    "parent_id": "t1_ctubm6f",
    "subreddit_name_prefixed": "r/news",
    "body": "That's quite the bag over our heads, huh?",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438941106.0,
    "date_created": "2015-08-06",
    "time_created": "21:51:46",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu9hfm",
    "parent_id": "t1_ctu7gu3",
    "subreddit_name_prefixed": "r/news",
    "body": "Just to clarify, he was shot for \"trying to run over the police\" not for the possession of drugs. The drugs may have been the cause of the interaction in the first place, but the shooting was due to something else. Based on the police report.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1438936744.0,
    "date_created": "2015-08-06",
    "time_created": "20:39:04",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctug24c",
    "parent_id": "t1_ctudxyj",
    "subreddit_name_prefixed": "r/news",
    "body": "Let suggest that LEO general attitudes when mixed with racism further compound the issue. One does not negate the other. So everyone has it bad when law enforcement is unaccountable but some people have it worse. Sympathy and empathy don't need to be a zero sum game.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438948819.0,
    "date_created": "2015-08-07",
    "time_created": "00:00:19",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctug1ge",
    "parent_id": "t1_ctudxyj",
    "subreddit_name_prefixed": "r/news",
    "body": "I like the honest and the mental health angle you take wrt this topic. The fact that you felt the need to use a throwaway because bringing attention to a real problem in LEOs speaks to a larger issue, but your willingness to do it anyway is much appreciated. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438948781.0,
    "date_created": "2015-08-06",
    "time_created": "23:59:41",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6jty",
    "parent_id": "t1_ctu194s",
    "subreddit_name_prefixed": "r/news",
    "body": "Kid got killed for a fucking misdemeanor.  For a misdemeanor.  It's basically the same as a cop opening fire on jaywalkers.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1438931694.0,
    "date_created": "2015-08-06",
    "time_created": "19:14:54",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu45pm",
    "parent_id": "t1_ctu1gdi",
    "subreddit_name_prefixed": "r/news",
    "body": "They never existed. ALM is only a counter point to BLM. The ALM platform cannot stand on its own.",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1438927756.0,
    "date_created": "2015-08-06",
    "time_created": "18:09:16",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8w6z",
    "parent_id": "t1_ctu8eur",
    "subreddit_name_prefixed": "r/news",
    "body": "Honestly it's a class barrier. There's a reason the police in poorer neighborhoods are usually living in the higher income areas. That way they already feel superior to the people they're helping to subjugate. \nNo matter how anybody argues it, there is a higher chance of being harassed by the police if you are a person of color, but *poor* white people are only marginally better off. I am a white dude living in a poor neighborhood...I don't call the police anymore because they don't respond, period. In the past (when I drove a beater ass pickup truck) it seemed like I was getting pulled over every other week for petty bullshit. I am lucky enough to now own a nicer looking car and oddly enough, I get pulled over less often. Huh, I wonder why that might be? ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438935672.0,
    "date_created": "2015-08-06",
    "time_created": "20:21:12",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8f0v",
    "parent_id": "t1_ctu40v0",
    "subreddit_name_prefixed": "r/news",
    "body": "indicted? I don't think they've been charged with anything yet. It's still at the internal investigation phase from what I see.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1438934819.0,
    "date_created": "2015-08-06",
    "time_created": "20:06:59",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6o38",
    "parent_id": "t1_ctu40v0",
    "subreddit_name_prefixed": "r/news",
    "body": "Homicide != murder. It was ruled a homicide, or a person causing the death of another person. They will only stand trial if it was neglectful or intentional. As of now it is still being investigated and they have not been indicted or charged with anything. ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1438931882.0,
    "date_created": "2015-08-06",
    "time_created": "19:18:02",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu72jj",
    "parent_id": "t1_ctu40v0",
    "subreddit_name_prefixed": "r/news",
    "body": "Where did you get that from, here's what the article says: \"The officer, who has been placed on administrative leave while the investigation is pending\" No indictment. ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1438932517.0,
    "date_created": "2015-08-06",
    "time_created": "19:28:37",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu70qz",
    "parent_id": "t1_ctu40v0",
    "subreddit_name_prefixed": "r/news",
    "body": "What? I can not find any articles stating the officers were indicted. Homicide is not the same as murder or even manslaughter. The cause of death was homicide, any legal shooting by police that results in death is ruled a homicide. ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1438932438.0,
    "date_created": "2015-08-06",
    "time_created": "19:27:18",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctua0cq",
    "parent_id": "t1_ctu40v0",
    "subreddit_name_prefixed": "r/news",
    "body": "> There's no need to be outraged when the criminal justice system does what it's supposed to.\n\nNo, there's a pretty fucking good reason to be outraged when a Law Enforcement Officer murders someone.  It's great that he's getting what he deserves for it, but it should never have happened in the first place.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438937686.0,
    "date_created": "2015-08-06",
    "time_created": "20:54:46",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu3tii",
    "parent_id": "t1_ctu3ok5",
    "subreddit_name_prefixed": "r/news",
    "body": "Can't dumb down these reports with unnecessary details",
    "controversiality": 0,
    "ups": 2264,
    "downs": 0,
    "score": 2264,
    "created": 1438927225.0,
    "date_created": "2015-08-06",
    "time_created": "18:00:25",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu42ji",
    "parent_id": "t1_ctu3ok5",
    "subreddit_name_prefixed": "r/news",
    "body": "\"Why didn't you mention that you shot that kid?\"\n\n\"Slipped my mind, sir.\"\n\n\"Well why did you shoot him?\"\n\n\"Uhhhh, bullets slipped too.\"",
    "controversiality": 0,
    "ups": 906,
    "downs": 0,
    "score": 906,
    "created": 1438927615.0,
    "date_created": "2015-08-06",
    "time_created": "18:06:55",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4qeg",
    "parent_id": "t1_ctu3ok5",
    "subreddit_name_prefixed": "r/news",
    "body": "Report couldn't exceed 140 characters",
    "controversiality": 0,
    "ups": 387,
    "downs": 0,
    "score": 387,
    "created": 1438928661.0,
    "date_created": "2015-08-06",
    "time_created": "18:24:21",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4tsq",
    "parent_id": "t1_ctu3ok5",
    "subreddit_name_prefixed": "r/news",
    "body": "*am I supposed to remember everyone I kill?*",
    "controversiality": 0,
    "ups": 622,
    "downs": 0,
    "score": 622,
    "created": 1438928809.0,
    "date_created": "2015-08-06",
    "time_created": "18:26:49",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu43wv",
    "parent_id": "t1_ctu3ok5",
    "subreddit_name_prefixed": "r/news",
    "body": "Don't let it happen again. 30 days paid leave. ",
    "controversiality": 0,
    "ups": 323,
    "downs": 0,
    "score": 323,
    "created": 1438927677.0,
    "date_created": "2015-08-06",
    "time_created": "18:07:57",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4wud",
    "parent_id": "t1_ctu3ok5",
    "subreddit_name_prefixed": "r/news",
    "body": "I'll tell you what...I'll mention it in the police report, give you a free copy of The Godfather and 2 bottles of scotch. ",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1438928946.0,
    "date_created": "2015-08-06",
    "time_created": "18:29:06",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5s67",
    "parent_id": "t1_ctu3ok5",
    "subreddit_name_prefixed": "r/news",
    "body": "https://youtu.be/0lHxugvam5M?t=59s",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1438930403.0,
    "date_created": "2015-08-06",
    "time_created": "18:53:23",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4gw1",
    "parent_id": "t1_ctu3ok5",
    "subreddit_name_prefixed": "r/news",
    "body": "Because the shooting report is handled by the State Law Enforcement Division and has not yet been released.  The only report available to the media at this time is the marijuana possession charge which is a separate report. \n\nEdit:   Let me be clear, this idea that the police officer did not report the shooting is insane.  He reported it immediately to his superiors and SLED.  From that point on SLED takes over the entire investigation to include the report.  The officer and the entire department is prohibited from talking to anybody about the incident and all questions are referred to SLED.  The chief has stuck his neck out there providing as much detail as he has.  \n\nSLED has said nothing, as is their policy until their investigation is complete.  So the only real source of information is the family's attorney, whose only interest in the case is an eventual payday from civil litigation. \n\nHomicide investigations can take years before an arrest warrant is issued.  It hasn't even been two weeks.  Give the system time to run its course.  Watch carefully but understand that the initial sources of information are incredibly biased because they have the most to gain.  Don't forget that the officer in Ferguson was exonerated by both the grand jury and the follow-up independent DOJ investigation and report.  \n\n\n",
    "controversiality": 0,
    "ups": 786,
    "downs": 0,
    "score": 786,
    "created": 1438928240.0,
    "date_created": "2015-08-06",
    "time_created": "18:17:20",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4kz1",
    "parent_id": "t1_ctu3ok5",
    "subreddit_name_prefixed": "r/news",
    "body": "My finger slipped, my mind slipped, and these documents slipped into this trash can which I lit on fire whoops. ",
    "controversiality": 0,
    "ups": 74,
    "downs": 0,
    "score": 74,
    "created": 1438928421.0,
    "date_created": "2015-08-06",
    "time_created": "18:20:21",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5m8s",
    "parent_id": "t1_ctu3ok5",
    "subreddit_name_prefixed": "r/news",
    "body": "I feel just awful... Tell you what...\n\nSeriously though, it's sad thinking of the potential lost, so much life left to live at age 19.  Sigh.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1438930134.0,
    "date_created": "2015-08-06",
    "time_created": "18:48:54",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu3vp7",
    "parent_id": "t1_ctu3ok5",
    "subreddit_name_prefixed": "r/news",
    "body": "Best KITH skit! ",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1438927319.0,
    "date_created": "2015-08-06",
    "time_created": "18:01:59",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4mcv",
    "parent_id": "t1_ctu4950",
    "subreddit_name_prefixed": "r/news",
    "body": "\"placed bullets inside holes to prevent leakage\"",
    "controversiality": 0,
    "ups": 721,
    "downs": 0,
    "score": 721,
    "created": 1438928483.0,
    "date_created": "2015-08-06",
    "time_created": "18:21:23",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5wb0",
    "parent_id": "t1_ctu4950",
    "subreddit_name_prefixed": "r/news",
    "body": "\"On a different note: I want to file a complain. Someone stole two bullets from my magazine.\"",
    "controversiality": 0,
    "ups": 138,
    "downs": 0,
    "score": 138,
    "created": 1438930585.0,
    "date_created": "2015-08-06",
    "time_created": "18:56:25",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6zr1",
    "parent_id": "t1_ctu3xeu",
    "subreddit_name_prefixed": "r/news",
    "body": "The department is run by EA, the full police report is DLC",
    "controversiality": 0,
    "ups": 98,
    "downs": 0,
    "score": 98,
    "created": 1438932394.0,
    "date_created": "2015-08-06",
    "time_created": "19:26:34",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu437d",
    "parent_id": "t1_ctu3xeu",
    "subreddit_name_prefixed": "r/news",
    "body": "That's really high. ",
    "controversiality": 0,
    "ups": 47,
    "downs": 0,
    "score": 47,
    "created": 1438927645.0,
    "date_created": "2015-08-06",
    "time_created": "18:07:25",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5i7c",
    "parent_id": "t1_ctu59b0",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm not suggesting we lynch him. I'm completely comfortable waiting on an investigation, and having him punished under the same laws as anyone else.\n\nBut I sure as heck think that investigation needs to consider, on top of the shooting itself, the potential perjury committed by omitting super significant information from the arrest report.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1438929946.0,
    "date_created": "2015-08-06",
    "time_created": "18:45:46",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuu0bd",
    "parent_id": "t1_ctul983",
    "subreddit_name_prefixed": "r/news",
    "body": "Not to mention waging an actual war on the American public, the war on drugs",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1438988295.0,
    "date_created": "2015-08-07",
    "time_created": "10:58:15",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctut55e",
    "parent_id": "t1_ctur00z",
    "subreddit_name_prefixed": "r/news",
    "body": "I love the unveiling.  He shows them his numbers and them tells them exactly how he did it. I need to re-watch that show.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438986923.0,
    "date_created": "2015-08-07",
    "time_created": "10:35:23",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu9j0d",
    "parent_id": "t1_ctu6o75",
    "subreddit_name_prefixed": "r/news",
    "body": "> the majority of the community here is hyper conservative and many are retired upper middle class\n\nAnd here's the answer as to why they aren't hollering in the streets about it; this isn't the kind of  low-income community that has been victimized by the police for years upon years like Ferguson et al. There's no perpetually frustrated, simmering undercurrent of rage against chronic injustice that this kind of incident will set off in those communities.  \nI have no doubt that white middle class assholes are already crowing ''You see? YOU SEEEEE? White people don't riot when their kids are shot like those silly, irrational black people'' etc",
    "controversiality": 0,
    "ups": 669,
    "downs": 0,
    "score": 669,
    "created": 1438936822.0,
    "date_created": "2015-08-06",
    "time_created": "20:40:22",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8o36",
    "parent_id": "t1_ctu74a4",
    "subreddit_name_prefixed": "r/news",
    "body": "That it's a small percentage isn't much comfort when that percentage is being covered by the ENTIRE police union.\n\nI wonder if the percentage would still be small if you included everyone that does their best to make sure this small percentage sees minimal consequences of their actions.\nEdit: A word",
    "controversiality": 0,
    "ups": 104,
    "downs": 0,
    "score": 104,
    "created": 1438935270.0,
    "date_created": "2015-08-06",
    "time_created": "20:14:30",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu9d30",
    "parent_id": "t1_ctu74a4",
    "subreddit_name_prefixed": "r/news",
    "body": "> protect and serve\n\n[10 years ago the US Supreme Court decided police don't have to protect people.](http://www.nytimes.com/2005/06/28/politics/justices-rule-police-do-not-have-a-constitutional-duty-to-protect-someone.html)",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1438936524.0,
    "date_created": "2015-08-06",
    "time_created": "20:35:24",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8m3l",
    "parent_id": "t1_ctu5m6p",
    "subreddit_name_prefixed": "r/news",
    "body": "People were talking about Ferguson and Baltimore before the protests and riots were ever planned. \n\nIncluding the national news. \n\nI live in SC and I haven't even seen it on the LOCAL news. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438935174.0,
    "date_created": "2015-08-06",
    "time_created": "20:12:54",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuh90w",
    "parent_id": "t1_ctu5m6p",
    "subreddit_name_prefixed": "r/news",
    "body": "White people protest by posting a picture with shitty writing that says \"This boy was shot to death by the police, 99% of people won't share this!\" after it was compressed 50 times.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1438951376.0,
    "date_created": "2015-08-07",
    "time_created": "00:42:56",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuawpd",
    "parent_id": "t1_ctu89g0",
    "subreddit_name_prefixed": "r/news",
    "body": "As a Conservative, you *should* be horrified by this blatant abuse of State power.  Just because the Republican party has been hijacked by Bible thumpers, racists, and authoritarian neocons doesn't make you any less of a conservative. Weren't conservatives supposed to be the ones that supported a small government that respected personal liberty? What's more conservative than \"don't tread on me?\"",
    "controversiality": 0,
    "ups": 289,
    "downs": 0,
    "score": 289,
    "created": 1438939295.0,
    "date_created": "2015-08-06",
    "time_created": "21:21:35",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuass8",
    "parent_id": "t1_ctu89g0",
    "subreddit_name_prefixed": "r/news",
    "body": "Your heart certainly seems to be in the right place...\n\nWhat's going on here is hard for me to pinpoint. Something needs to change.\n\nAs you said, *A bag of weed? That's worth murdering our children?*\n\nI couldn't have said it better, myself.\n\nJust remember (and I know you know this,) there are so many other interests involved. From the smallest interest to the largest, there *are* interests involved. Those interests compete with one another, and, in the end, terrible things  happen, that seem (or often are) inhumane.\n\nIt's just really, really easy to look at these things from the perspective of, *Oh, police killed someone again, wow...*\n\nAnd even if that's okay or even correct (even if it's true that police do seem to kill innocent people too much), I just feel like we have to be careful about taking sides, or which side we take if we do take one. I'm always inclined to jump to the victim's side, but the truth is that a lot of people love playing victim, and do it very well. I'm not referring to this case in particular, but if the police were seriously out there murdering people in the streets by the hundreds in every city, there *would* be much more outcry. While you may be \"more likely to die at the hands of a peace officer than a terrorist in the USA\" (quoted because I have no source, but have heard this many times,) it's not like hundreds or thousands of citizens die every day at the hands of police. (Hell, I could be wrong about that and I'm open to sources/information if I am -- I'd believe hundreds, maybe, but not thousands.)\n\nHopefully I've made sense. I've had a couple of beers :P I'm all about \"policing the police,\" but let's be careful about where we put our blame, and how we choose to put it there.\n\n**EDIT** Again, I'm a bit tipsy, so I don't even know why I replied to you in particular. Just so you know, /u/Quartus4, I just wanted to share my thoughts and I agree with 96% or more of what you said :P",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1438939091.0,
    "date_created": "2015-08-06",
    "time_created": "21:18:11",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctue36t",
    "parent_id": "t1_ctu89g0",
    "subreddit_name_prefixed": "r/news",
    "body": "I think what you are is not what Conservative means anymore. You just sound sane. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438944982.0,
    "date_created": "2015-08-06",
    "time_created": "22:56:22",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8yi5",
    "parent_id": "t1_ctu71w2",
    "subreddit_name_prefixed": "r/news",
    "body": "If that turns out to be the case, I agree. Keep in mind though that this is a private autopsy performed at the request of a malpractice lawyer. The official one hasn't determined angle of entry yet.\n\nBetter to wait for more information before we get our knickers in a knot.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438935788.0,
    "date_created": "2015-08-06",
    "time_created": "20:23:08",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu605m",
    "parent_id": "t1_ctu4txb",
    "subreddit_name_prefixed": "r/news",
    "body": "SERIOUSLY. shot and killed for a non-violent drug offense even when it was illegal is still ridiculous.",
    "controversiality": 0,
    "ups": 942,
    "downs": 0,
    "score": 942,
    "created": 1438930761.0,
    "date_created": "2015-08-06",
    "time_created": "18:59:21",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6b9h",
    "parent_id": "t1_ctu4txb",
    "subreddit_name_prefixed": "r/news",
    "body": "I just had more than 10 grams delivered to my house. Then theres this kid, getting shot for what I'm doing legally.",
    "controversiality": 0,
    "ups": 237,
    "downs": 0,
    "score": 237,
    "created": 1438931286.0,
    "date_created": "2015-08-06",
    "time_created": "19:08:06",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6d9q",
    "parent_id": "t1_ctu4txb",
    "subreddit_name_prefixed": "r/news",
    "body": "I literally went to the store earlier and bought more than twice what this guy got killed over/his date arrested for :(",
    "controversiality": 0,
    "ups": 86,
    "downs": 0,
    "score": 86,
    "created": 1438931380.0,
    "date_created": "2015-08-06",
    "time_created": "19:09:40",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6df3",
    "parent_id": "t1_ctu5lv7",
    "subreddit_name_prefixed": "r/news",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 178,
    "downs": 0,
    "score": 178,
    "created": 1438931388.0,
    "date_created": "2015-08-06",
    "time_created": "19:09:48",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu63tj",
    "parent_id": "t1_ctu5lv7",
    "subreddit_name_prefixed": "r/news",
    "body": "Fuck our system is fucked.",
    "controversiality": 0,
    "ups": 392,
    "downs": 0,
    "score": 392,
    "created": 1438930932.0,
    "date_created": "2015-08-06",
    "time_created": "19:02:12",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu73su",
    "parent_id": "t1_ctu5lv7",
    "subreddit_name_prefixed": "r/news",
    "body": "Man.. and to think I got busted by cops in Canada for middle manning 120 dollars worth of cocaine and got no jail, no probation, just a choice between a 775 dollar fine or 2 weeks in jail. I chose the fine and was set to pay it within 6 months. The judge even said if I wanted I could ask the courts later on for an extension of up to an aditional 6 months to pay if I needed it.",
    "controversiality": 0,
    "ups": 91,
    "downs": 0,
    "score": 91,
    "created": 1438932573.0,
    "date_created": "2015-08-06",
    "time_created": "19:29:33",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6yr1",
    "parent_id": "t1_ctu5lv7",
    "subreddit_name_prefixed": "r/news",
    "body": "That is probably the most ridiculous thing I've ever heard...and to think these assholes go home at night proud of themselves for getting \"dangerous\" people off the streets.",
    "controversiality": 0,
    "ups": 66,
    "downs": 0,
    "score": 66,
    "created": 1438932350.0,
    "date_created": "2015-08-06",
    "time_created": "19:25:50",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu7lyx",
    "parent_id": "t1_ctu5lv7",
    "subreddit_name_prefixed": "r/news",
    "body": "I don't mean to be a dick, but youre kind of an idiot for not seeing how sketchy that guy was being ",
    "controversiality": 0,
    "ups": 54,
    "downs": 0,
    "score": 54,
    "created": 1438933403.0,
    "date_created": "2015-08-06",
    "time_created": "19:43:23",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu7v9t",
    "parent_id": "t1_ctu5lv7",
    "subreddit_name_prefixed": "r/news",
    "body": "Fyi entrapment wouldn't really apply in this case I believe. The guy calling you three times a day is mildly harassing but he isn't posing a threat to you, he just nagged you until you sold him weed. I do think thats bullshit but its not entrapment.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1438933848.0,
    "date_created": "2015-08-06",
    "time_created": "19:50:48",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu7gym",
    "parent_id": "t1_ctu5lv7",
    "subreddit_name_prefixed": "r/news",
    "body": "So your 'friend' was a cop? Or working for the police for some reason as an informant? Did you ever catch up with him afterwards? ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438933173.0,
    "date_created": "2015-08-06",
    "time_created": "19:39:33",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu9obb",
    "parent_id": "t1_ctu5lv7",
    "subreddit_name_prefixed": "r/news",
    "body": "Similar situation happened to me. Thankfully, the judge pulled her head out of her ass and let me off with a possession charge. I don't know about you, but it made me lose even more trust in law enforcement. The fact that they claim to 'serve and protect' but then pull this shit on a 19 year old college student who thought he was helping a friend out. I really wonder how those scumbags (police) sleep at night.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438937092.0,
    "date_created": "2015-08-06",
    "time_created": "20:44:52",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu9tbq",
    "parent_id": "t1_ctu5lv7",
    "subreddit_name_prefixed": "r/news",
    "body": "That's why street smarts are a valuable skill. You don't accommodate sketchiness.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438937335.0,
    "date_created": "2015-08-06",
    "time_created": "20:48:55",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu66gk",
    "parent_id": "t1_ctu50fp",
    "subreddit_name_prefixed": "r/news",
    "body": "in Canada thats like 60$ worth of weed.. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1438931060.0,
    "date_created": "2015-08-06",
    "time_created": "19:04:20",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4yvh",
    "parent_id": "t1_ctu4rig",
    "subreddit_name_prefixed": "r/news",
    "body": "Everyone is too mad at the lack of response form BlackLivesMatter to be mad that teenager was murdered by a policeman **who failed to report he even used his gun**",
    "controversiality": 0,
    "ups": 124,
    "downs": 0,
    "score": 124,
    "created": 1438929041.0,
    "date_created": "2015-08-06",
    "time_created": "18:30:41",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5ltt",
    "parent_id": "t1_ctu4rig",
    "subreddit_name_prefixed": "r/news",
    "body": "That's pretty much why modern racism exists.  It all dates back to before the American revolution.  The best way to keep poor whites and poor blacks (in other words, slaves) from revolting against you collectively is to pit them against each other.  ",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1438930114.0,
    "date_created": "2015-08-06",
    "time_created": "18:48:34",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu65mb",
    "parent_id": "t1_ctu4rig",
    "subreddit_name_prefixed": "r/news",
    "body": "Racism is but one tactic in the book of [Cultural Hegemony](https://en.wikipedia.org/wiki/Cultural_hegemony).",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1438931018.0,
    "date_created": "2015-08-06",
    "time_created": "19:03:38",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5g93",
    "parent_id": "t1_ctu4rig",
    "subreddit_name_prefixed": "r/news",
    "body": "Division as a whole, war on women war on men, war on anything worth uttering. Prevailers of division are the cause ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1438929855.0,
    "date_created": "2015-08-06",
    "time_created": "18:44:15",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu9hxv",
    "parent_id": "t1_ctu8dy7",
    "subreddit_name_prefixed": "r/news",
    "body": "He was trying to run me over so I put 2 bullets in his back. Yeah his back was facing the windshield ",
    "controversiality": 0,
    "ups": 248,
    "downs": 0,
    "score": 248,
    "created": 1438936769.0,
    "date_created": "2015-08-06",
    "time_created": "20:39:29",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu9pnt",
    "parent_id": "t1_ctu93k7",
    "subreddit_name_prefixed": "r/news",
    "body": "That makes sense.  Thanks.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438937159.0,
    "date_created": "2015-08-06",
    "time_created": "20:45:59",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8bbh",
    "parent_id": "t1_ctu6jwi",
    "subreddit_name_prefixed": "r/news",
    "body": "He was \"white\" but not really white.",
    "controversiality": 0,
    "ups": 53,
    "downs": 0,
    "score": 53,
    "created": 1438934637.0,
    "date_created": "2015-08-06",
    "time_created": "20:03:57",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8weg",
    "parent_id": "t1_ctu7xfl",
    "subreddit_name_prefixed": "r/news",
    "body": "Creating an unpredictable and uncontrollable missile. I dont understand the logic of shooting drivers. It hardly solves the problem in front or from behind.",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1438935683.0,
    "date_created": "2015-08-06",
    "time_created": "20:21:23",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu442h",
    "parent_id": "t1_ctu3d4p",
    "subreddit_name_prefixed": "r/news",
    "body": "Fuck@you sounds like a kinky Pokemon. \n\nIt also sounds like someone who just realized he can't contain his sneeze any longer.",
    "controversiality": 0,
    "ups": 184,
    "downs": 0,
    "score": 184,
    "created": 1438927684.0,
    "date_created": "2015-08-06",
    "time_created": "18:08:04",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctudbmr",
    "parent_id": "t1_ctu65qd",
    "subreddit_name_prefixed": "r/news",
    "body": "If his chest had been a cannon, he'd have shot his heart upon him.\n\nEdit: Mixed up my Melville with my Picard. Went with Picard.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1438943638.0,
    "date_created": "2015-08-06",
    "time_created": "22:33:58",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuba2j",
    "parent_id": "t1_ctuaznl",
    "subreddit_name_prefixed": "r/news",
    "body": "Front of the ass is the holy grail of where you dont wanna be shot",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438939982.0,
    "date_created": "2015-08-06",
    "time_created": "21:33:02",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4zau",
    "parent_id": "t1_ctu2k43",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah the media extensively covering police brutality against minorities is an entirely new thing. My dad was brutally beaten by NYPD in the 70s even though he didn't even commit a crime and you can be sure there were no reporters with cameras knocking on his door after that. \n\nEven a couple years ago things were differient. I remember not too long ago here in Westchester not far from where I live a black veteran's life alert bracelet went off, the cops showed up and when he said that he was fine and wouldn't let them in the cops kicked down the door and shot and killed him and of course a grand jury cleared them of all wrongdoing. Outside of the local news I don't remember much media coverage about that case yet I'm sure if that happened today a lot more people would have heard about it.",
    "controversiality": 0,
    "ups": 325,
    "downs": 0,
    "score": 325,
    "created": 1438929061.0,
    "date_created": "2015-08-06",
    "time_created": "18:31:01",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8a6n",
    "parent_id": "t1_ctu2k43",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1438934581.0,
    "date_created": "2015-08-06",
    "time_created": "20:03:01",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu2v5o",
    "parent_id": "t1_ctu2k43",
    "subreddit_name_prefixed": "r/news",
    "body": "Very true. I wasn't trying to minimize that in any way with my post(s). I was simply trying to take away some of the \"automatic race based\" slants that people fall back on while ignoring the efforts of the local communities in making these incidents a rallying cry for others.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1438925752.0,
    "date_created": "2015-08-06",
    "time_created": "17:35:52",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4fgy",
    "parent_id": "t1_ctu4855",
    "subreddit_name_prefixed": "r/news",
    "body": "You are dead-on, and I didn't address that at all. I will point to me being a citizen of Cincinnati to illustrate your point. The recent headline of the police shooting went global, and my city has had significant racial unrest in my lifetime. However, there was no rioting, no looting, etc. There was plenty of outrage at first, but when the prosecutor addressed it directly and succinctly (as should always be the case in these situations) there wasn't an explosion afterward. If justice is served, or it appears that it will be, there won't be the same reaction if \"justice\" appears to be a farce. ",
    "controversiality": 0,
    "ups": 59,
    "downs": 0,
    "score": 59,
    "created": 1438928179.0,
    "date_created": "2015-08-06",
    "time_created": "18:16:19",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4n4v",
    "parent_id": "t1_ctu3y7u",
    "subreddit_name_prefixed": "r/news",
    "body": "[This HuffPo article](http://www.huffingtonpost.com/entry/zachary-hammond-police-killing_55c0e240e4b0c9fdc75dfda3?ncid=fcbklnkushpmg00000063) points out the exact same thing. You know who was making a stink about the killing of Zachary Hammond on Twitter? The \\#blacklivesmatter crew. ",
    "controversiality": 0,
    "ups": 109,
    "downs": 0,
    "score": 109,
    "created": 1438928518.0,
    "date_created": "2015-08-06",
    "time_created": "18:21:58",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4ql4",
    "parent_id": "t1_ctu3y7u",
    "subreddit_name_prefixed": "r/news",
    "body": "I think it is because white people are only now starting to become outraged over the police state. Black Lives Matter is not one group. It is thousands of people everywhere. They come together around this exact issue. At some point I expect white America to become just as outraged over this brutality. ",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1438928668.0,
    "date_created": "2015-08-06",
    "time_created": "18:24:28",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu2ss9",
    "parent_id": "t1_ctu26hr",
    "subreddit_name_prefixed": "r/news",
    "body": "You won't get the latter without the former. For example, let's say two people in two communities are shot by police under virtually identical circumstances. I'm going to leave race out of it. In the first, there's a short story in the local media, the family grieves, receives visitors, talks amongst their circle of close acquaintances, but really does nothing else. The community shows support and then moves on with their lives.\n\nIn the second, however, things are different. Immediately following the incident, someone sets up a \"Justice for victim 2\" FB page, and starts a Twitter campaign. That night, there is a candlelight vigil in a community area. The next day, 25 people show up outside the police station with signs and chant through megaphones. A change.org petition is circulated and gains traction. The FB page goes viral and more people who would be unaware start showing support. Tweets are suddenly retweeted by celebrities and people who have an audience. Within a week the crowds outside the police department swell from 25 to 50 to 200 to more. \n\nIn one situation, the media isn't going to dig deeper, but in the other, the media can't ignore the response. For all the hate that SJWs get on here, some of these situations would not have gained as much traction if people who weren't involved decided they wanted to lend a hand to the effort. But if there is no effort in the first place, who is going to take it upon themselves to publicize injustice if those intimately involved don't start the movement. \n\nSure, there's plenty of race-baiting in the media, it sells. But that doesn't mean that they're not going to cover an issue that gains massive support. But if you want to get that massive support, you have to get out there and make noise. If you want attention to your cause, you have to make an effort to DRAW attention to your cause. Blaming this situation solely on the fact that \"he was white\" ignores the fact that the deaths in the black community became a rallying-cry for others to get involved and lend an effort to the cause. I haven't seen one indication that any of this happened in this case, that any effort was made by the community to FORCE this issue. And that's sad, because there are a lot of people, myself definitely included, who would lend their support",
    "controversiality": 0,
    "ups": 64,
    "downs": 0,
    "score": 64,
    "created": 1438925653.0,
    "date_created": "2015-08-06",
    "time_created": "17:34:13",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4tq8",
    "parent_id": "t1_ctu10g5",
    "subreddit_name_prefixed": "r/news",
    "body": "Sadly it's too clearcut to really storm social media. \n\nIt's perverse but the cases which get the most media attention aren't the ones we'd really like got social/media attention. \n\nWhen it's too clearcut the people trying to get it attention will say \"It's terrible\" The republicans/pro-police side will say \"hmmm... ya it sort of is, you're right\", that side scores a small win and it dies there. \n\nNo, sadly the cases which get real attention, the ones which magnify, the ones which grow and grow until they drown out everything and get blanket media attention with hundreds of thousands outraged are the ones where one side says \"It's terrible\" and the other side says \"NO IT'S NOT!!\" and then the other screams back \"HOW COULD YOU BELEIVE THAT!\" etc\n\nhttp://slatestarcodex.com/2014/12/17/the-toxoplasma-of-rage/\n\nIt's why a sleeping 7 year old black girl shot in the head by police who had the wrong address for a raid got barely any media attention, it's why this story of an unarmed kid getting shot twice in the back won't get much attention but someone young man who'd just robbed a convenience store and then wrestled a cop got months of blanket national attention. The latter gave both sides just enough grip to get pissed off about it so they went back and forth making each other angrier and angrier. ",
    "controversiality": 0,
    "ups": 1302,
    "downs": 0,
    "score": 1302,
    "created": 1438928806.0,
    "date_created": "2015-08-06",
    "time_created": "18:26:46",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu7b3t",
    "parent_id": "t1_ctu10g5",
    "subreddit_name_prefixed": "r/news",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 199,
    "downs": 0,
    "score": 199,
    "created": 1438932904.0,
    "date_created": "2015-08-06",
    "time_created": "19:35:04",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu3r7p",
    "parent_id": "t1_ctu10g5",
    "subreddit_name_prefixed": "r/news",
    "body": "White or Black, all bullet wounds bleed red. ",
    "controversiality": 0,
    "ups": 2147,
    "downs": 0,
    "score": 2147,
    "created": 1438927125.0,
    "date_created": "2015-08-06",
    "time_created": "17:58:45",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4jyl",
    "parent_id": "t1_ctu10g5",
    "subreddit_name_prefixed": "r/news",
    "body": "The outrage about dead black kids usually starts with friends and family being upset at a senseless death and the media refusing to cover it, and then almost always followed by the injustice of a cop getting away with it.\n\nThese parents should be screaming that their son was murdered and the rest should all fall into place. ",
    "controversiality": 0,
    "ups": 75,
    "downs": 0,
    "score": 75,
    "created": 1438928375.0,
    "date_created": "2015-08-06",
    "time_created": "18:19:35",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu42b0",
    "parent_id": "t1_ctu10g5",
    "subreddit_name_prefixed": "r/news",
    "body": "Hispanic checking in to do the same!! Equality must be treated as such. (im mixed but it counts si..?)",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1438927606.0,
    "date_created": "2015-08-06",
    "time_created": "18:06:46",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6ezr",
    "parent_id": "t1_ctu10g5",
    "subreddit_name_prefixed": "r/news",
    "body": "The messed up thing is that sharing this story if your white makes it seem like you're saying \"See, it happens to whites too!\" And that you are trying to devalue the importance of it happening to blacks. Mainly because there are a lot of racist white guys that will share this story exactly for that reason. I know it's fucked up, but people are stupid.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1438931465.0,
    "date_created": "2015-08-06",
    "time_created": "19:11:05",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu1cdj",
    "parent_id": "t1_ctu10g5",
    "subreddit_name_prefixed": "r/news",
    "body": "YOU THE REAL HERO! we all equal! we should all stand when one of our children gets taken from us by a cop with trigger finger!",
    "controversiality": 0,
    "ups": 131,
    "downs": 0,
    "score": 131,
    "created": 1438923483.0,
    "date_created": "2015-08-06",
    "time_created": "16:58:03",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu1t58",
    "parent_id": "t1_ctu1e2w",
    "subreddit_name_prefixed": "r/news",
    "body": "Pretty much.  And media attention wasn't just handed to us over every shooting.  In each case, we were out there marching, because that's what it takes.  Of course, it's got a downside: as soon as you raise hell, even if you are doing it peacefully, there are a lot of people who will dismiss you as criminal scum, but that's just a part of the deal.",
    "controversiality": 0,
    "ups": 301,
    "downs": 0,
    "score": 301,
    "created": 1438924167.0,
    "date_created": "2015-08-06",
    "time_created": "17:09:27",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6ent",
    "parent_id": "t1_ctu1e2w",
    "subreddit_name_prefixed": "r/news",
    "body": "I've seen more about this from the black lives matter folks I follow on Twitter than the people on Facebook who were but hurt by black lives matter.\n\nParent poster here is 100% right, if this family is mad, it's up to them and the period where they live to pocket outside the police station.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1438931448.0,
    "date_created": "2015-08-06",
    "time_created": "19:10:48",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu3pyw",
    "parent_id": "t1_ctu1e2w",
    "subreddit_name_prefixed": "r/news",
    "body": "They are not the only ethnicity to have to do that. ",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1438927073.0,
    "date_created": "2015-08-06",
    "time_created": "17:57:53",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8y0r",
    "parent_id": "t1_ctu1e2w",
    "subreddit_name_prefixed": "r/news",
    "body": "They also have to face it a lot more often and it effects a larger portion of their group, which sucks but helps a lot in actually getting people up and out. White people can largely think \"that's tragic, but it would probably never happen to anyone I know or care about\" while black people have to live with the reality of \"holy shit, that could happen to me\", not just in terms of outright murder but a lot of the small aggressions and minor acts of power that can make a person's life shit but won't ever get any media attention.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438935764.0,
    "date_created": "2015-08-06",
    "time_created": "20:22:44",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu0mjh",
    "parent_id": "t1_ctu0ik0",
    "subreddit_name_prefixed": "r/news",
    "body": "I was pissed reading it. The kid was shot in the back over a little marijuana. I'm black, and I would take to the streets to march for this young man. Race doesn't affect right and wrong.",
    "controversiality": 0,
    "ups": 189,
    "downs": 0,
    "score": 189,
    "created": 1438922449.0,
    "date_created": "2015-08-06",
    "time_created": "16:40:49",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu2tfb",
    "parent_id": "t1_ctu0ik0",
    "subreddit_name_prefixed": "r/news",
    "body": "Start reading r/bad_cop_no_donut You're missing about 5 of these a day\n\nAnd this has been posted all over reddit including news and plenty online. The community has tried getting it out there. Cable news only likes stories that they can play groups off each other on though",
    "controversiality": 0,
    "ups": 59,
    "downs": 0,
    "score": 59,
    "created": 1438925679.0,
    "date_created": "2015-08-06",
    "time_created": "17:34:39",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu2737",
    "parent_id": "t1_ctu0ik0",
    "subreddit_name_prefixed": "r/news",
    "body": "First I've heard of it too, you're not alone.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438924736.0,
    "date_created": "2015-08-06",
    "time_created": "17:18:56",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4gq5",
    "parent_id": "t1_ctu12e4",
    "subreddit_name_prefixed": "r/news",
    "body": "Nailed it. To get to a root and solution for these problems, they should very definitely not be conflated.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1438928233.0,
    "date_created": "2015-08-06",
    "time_created": "18:17:13",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu58nr",
    "parent_id": "t1_ctu40ku",
    "subreddit_name_prefixed": "r/news",
    "body": "Yup. I have only seen it mentioned by people of color on my social media as well. Not to generalize, but a lot of white people that I know don't want to be associated with the type of white people that would have interactions with police. I hate to say it, but from their attitude it almost feels like they think the people deserve it for being \"uneducated\" or \"lower class\".",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1438929501.0,
    "date_created": "2015-08-06",
    "time_created": "18:38:21",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4sms",
    "parent_id": "t1_ctu40ku",
    "subreddit_name_prefixed": "r/news",
    "body": "> The sad thing that my neighbors don't seem to understand is that if this shit can happen to black people it could just as easily happen to white people. And it does.\n\nThis is what I keep trying to tell idiots who bend themselves into pretzel shapes trying to justify every police shooting against a black kid. If you tolerate police shooting unarmed black kids, they'll start shooting unarmed white kids with impunity as well. You're not immune because you think your race has the moral high ground. You're not immune because you suck up to cops.",
    "controversiality": 0,
    "ups": 101,
    "downs": 0,
    "score": 101,
    "created": 1438928758.0,
    "date_created": "2015-08-06",
    "time_created": "18:25:58",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5jpo",
    "parent_id": "t1_ctu40ku",
    "subreddit_name_prefixed": "r/news",
    "body": "Dude!  That's because we're all taught from a young age that if \"you get an attitude\" with the police or run from them you're the bad guy and deserve what you get!  \n\nI was taught that the cops were always the good guys and to tell an officer if you need help and etc, etc.  I had no fucking idea that other people's (read 'groups') experience of the police and their expectations of police behavior were so vastly, _vastly_ different from mine.\n\nIt took me _years_ of reading and paying attention before that brainwashing wore off.  Many white folk's hasn't yet, and for many it never will.\n\nIts the same reason my grandma who completely understand and is okay with my gay cousin and my transgender cousin, and thinks the corporations have too much power, will still vote a straight god damn republican ticket because they \"support the military and god.\"  \n\nBrainwashing and Cultural \"norms\" are nearly set in stone at an early age.  Very difficult to overcome.  They'll look at this hammond case and despite the evidence, since he's white, in the back of their head they will think \"well he must have done _something_\" but they always stop that thought before it concludes with \" ... to be shot in the back like a dog over weed.\"",
    "controversiality": 0,
    "ups": 60,
    "downs": 0,
    "score": 60,
    "created": 1438930016.0,
    "date_created": "2015-08-06",
    "time_created": "18:46:56",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6416",
    "parent_id": "t1_ctu40ku",
    "subreddit_name_prefixed": "r/news",
    "body": "if white people en masse admit that police brutality is a real issue, then they'd admit en masse that all the victim blaming they do whenever a black person gets shot is messed up.  if they support the police in the shooting of a black person, but not a white person, under the same circumstances, the jig is up.  so they're forced to sit on their hands when it comes up.",
    "controversiality": 0,
    "ups": 56,
    "downs": 0,
    "score": 56,
    "created": 1438930942.0,
    "date_created": "2015-08-06",
    "time_created": "19:02:22",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5l9v",
    "parent_id": "t1_ctu4d4x",
    "subreddit_name_prefixed": "r/news",
    "body": "[yep](http://www.huffingtonpost.com/entry/zachary-hammond-police-killing_55c0e240e4b0c9fdc75dfda3)",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1438930088.0,
    "date_created": "2015-08-06",
    "time_created": "18:48:08",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu9953",
    "parent_id": "t1_ctu4d4x",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah, but this isn't what the Reddit circlejerk wants to hear. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1438936322.0,
    "date_created": "2015-08-06",
    "time_created": "20:32:02",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4vp3",
    "parent_id": "t1_ctu43s8",
    "subreddit_name_prefixed": "r/news",
    "body": "> the officer involved is suspended while the case is investigated.\n\nDon't forget when the internal investigation is completed and he's cleared of any wrongdoing and back on the job from his paid vacation that's business as usual too.",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1438928892.0,
    "date_created": "2015-08-06",
    "time_created": "18:28:12",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu9d8h",
    "parent_id": "t1_ctu4hbi",
    "subreddit_name_prefixed": "r/news",
    "body": "Meanwhile, many white people who have been outright dismissive about the BLM movement are suddenly up in arms about why there isn't more outrage about this shooting. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1438936532.0,
    "date_created": "2015-08-06",
    "time_created": "20:35:32",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4juc",
    "parent_id": "t1_ctu1s3b",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1438928370.0,
    "date_created": "2015-08-06",
    "time_created": "18:19:30",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu58tz",
    "parent_id": "t1_ctu0riz",
    "subreddit_name_prefixed": "r/news",
    "body": ">scaling back police to solely responding to violent crime\n\nSo I can't call the police if someone is trespassing and refusing to leave? Police shouldn't direct resources to catching drunk drivers? Police shouldn't investigate theft allegations?\n\nWhat are you really suggesting?",
    "controversiality": 0,
    "ups": 73,
    "downs": 0,
    "score": 73,
    "created": 1438929508.0,
    "date_created": "2015-08-06",
    "time_created": "18:38:28",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5km6",
    "parent_id": "t1_ctu0riz",
    "subreddit_name_prefixed": "r/news",
    "body": ">solely responding to violent crime\n\nDude, that's pretty shortsighted and naive. While I agree there needs to be massive reform in police forces nationwide, it mostly just boils down to getting rid of the bad apples and amping up the punishment for inappropriate conduct. (i.e. unlawful arrests, brutality, etc) War on drugs needs to go as well.    ",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1438930056.0,
    "date_created": "2015-08-06",
    "time_created": "18:47:36",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4zmt",
    "parent_id": "t1_ctu0riz",
    "subreddit_name_prefixed": "r/news",
    "body": ">scaling back police to solely responding to violent crime\n\nWait what?",
    "controversiality": 0,
    "ups": 83,
    "downs": 0,
    "score": 83,
    "created": 1438929077.0,
    "date_created": "2015-08-06",
    "time_created": "18:31:17",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6mzy",
    "parent_id": "t1_ctu0riz",
    "subreddit_name_prefixed": "r/news",
    "body": "Uh, bro. Most crime isn't violent. And non-violent crime can cause harm as well. \n\n-Human Trafficking\n-Theft\n-Fraud\n\nAre just a couple I can think of off of the top of my head and they can be achieved via non-violent means.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1438931835.0,
    "date_created": "2015-08-06",
    "time_created": "19:17:15",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5ycc",
    "parent_id": "t1_ctu4cen",
    "subreddit_name_prefixed": "r/news",
    "body": "I thought it was common knowledge that reddit is just a medium for functional illiterates to communicate. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438930677.0,
    "date_created": "2015-08-06",
    "time_created": "18:57:57",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu564p",
    "parent_id": "t1_ctu4hzc",
    "subreddit_name_prefixed": "r/news",
    "body": "There is dashcam video yet to be released... ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1438929381.0,
    "date_created": "2015-08-06",
    "time_created": "18:36:21",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu91vd",
    "parent_id": "t1_ctu8w6z",
    "subreddit_name_prefixed": "r/news",
    "body": "That is also a great perspective and I agree also I came from a lower neighborhood and the police response times are so much slower than in higher class neighborhoods and its sad. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438935956.0,
    "date_created": "2015-08-06",
    "time_created": "20:25:56",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu97ww",
    "parent_id": "t1_ctu3tii",
    "subreddit_name_prefixed": "r/news",
    "body": "It wasn't the shooting that killed him.  It was low blood pressure.",
    "controversiality": 0,
    "ups": 1268,
    "downs": 0,
    "score": 1268,
    "created": 1438936259.0,
    "date_created": "2015-08-06",
    "time_created": "20:30:59",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu56mk",
    "parent_id": "t1_ctu3tii",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 160,
    "downs": 0,
    "score": 160,
    "created": 1438929404.0,
    "date_created": "2015-08-06",
    "time_created": "18:36:44",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu51sw",
    "parent_id": "t1_ctu42ji",
    "subreddit_name_prefixed": "r/news",
    "body": "Y'see I had some super greasy food, the trigger just slipped sir",
    "controversiality": 0,
    "ups": 229,
    "downs": 0,
    "score": 229,
    "created": 1438929175.0,
    "date_created": "2015-08-06",
    "time_created": "18:32:55",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4hlh",
    "parent_id": "t1_ctu42ji",
    "subreddit_name_prefixed": "r/news",
    "body": "And then his mind slipped...out of the hole I put in the back of his head :/",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1438928272.0,
    "date_created": "2015-08-06",
    "time_created": "18:17:52",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu63ri",
    "parent_id": "t1_ctu4qeg",
    "subreddit_name_prefixed": "r/news",
    "body": "\"Approached suspect who seemed to be nervous and under the influence, suspect reached into his pocket for identification, I pulled out my gun.\"",
    "controversiality": 0,
    "ups": 141,
    "downs": 0,
    "score": 141,
    "created": 1438930929.0,
    "date_created": "2015-08-06",
    "time_created": "19:02:09",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu79w9",
    "parent_id": "t1_ctu4qeg",
    "subreddit_name_prefixed": "r/news",
    "body": "Trigger fingers turn to twitter fingers...",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438932850.0,
    "date_created": "2015-08-06",
    "time_created": "19:34:10",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5m3w",
    "parent_id": "t1_ctu4tsq",
    "subreddit_name_prefixed": "r/news",
    "body": "\"That's why you're supposed to write them down in your murder log Brian! Your lunch break is suspended for today.\"",
    "controversiality": 0,
    "ups": 376,
    "downs": 0,
    "score": 376,
    "created": 1438930127.0,
    "date_created": "2015-08-06",
    "time_created": "18:48:47",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4l0y",
    "parent_id": "t1_ctu43wv",
    "subreddit_name_prefixed": "r/news",
    "body": "And I'm sorry, but we have to promote you ",
    "controversiality": 0,
    "ups": 238,
    "downs": 0,
    "score": 238,
    "created": 1438928424.0,
    "date_created": "2015-08-06",
    "time_created": "18:20:24",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu593k",
    "parent_id": "t1_ctu4wud",
    "subreddit_name_prefixed": "r/news",
    "body": "You promise?",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1438929521.0,
    "date_created": "2015-08-06",
    "time_created": "18:38:41",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu7vk9",
    "parent_id": "t1_ctu4gw1",
    "subreddit_name_prefixed": "r/news",
    "body": "> Homicide investigations can take years\n\nYes they can, but it's a bit disingenuous to compare those types of investigations to this.",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1438933862.0,
    "date_created": "2015-08-06",
    "time_created": "19:51:02",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4rcs",
    "parent_id": "t1_ctu4gw1",
    "subreddit_name_prefixed": "r/news",
    "body": "It happened as part of the sting op (what a fing waste of taxpayer money and soon to get worse) and this should be part of the sting op report. Period. It can go in both reports.",
    "controversiality": 0,
    "ups": 126,
    "downs": 0,
    "score": 126,
    "created": 1438928703.0,
    "date_created": "2015-08-06",
    "time_created": "18:25:03",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctud5te",
    "parent_id": "t1_ctu4gw1",
    "subreddit_name_prefixed": "r/news",
    "body": "> Don't forget that the officer in Ferguson was exonerated by both the grand jury \n\nDon't they say that a decent prosecutor could get a grand jury to indict a ham sandwich?  From what I understand, grand juries are a very one-sided affair that mostly end up doing whatever the prosecutor wants, whether that's exonerating the police or indicting the ham sandwich. ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1438943346.0,
    "date_created": "2015-08-06",
    "time_created": "22:29:06",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctubeh5",
    "parent_id": "t1_ctu4gw1",
    "subreddit_name_prefixed": "r/news",
    "body": "alll the media is bias most of the time, thats how they make money. you think if they really told the truth the news wont be as intersting to read. They make it all addicting and make you all emotional so you  keep your eyes for more news to come. Its funny how the majority of reddit community believes the news so much, but few like you think this way. And its nice to see a redditor that is aware of how the news works. People on reddit just see and reliable source and automatically believe everything. \n",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438940205.0,
    "date_created": "2015-08-06",
    "time_created": "21:36:45",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuakyr",
    "parent_id": "t1_ctu4gw1",
    "subreddit_name_prefixed": "r/news",
    "body": ">So the only real source of information is the family's attorney, whose only interest in the case is an eventual payday from civil litigation.\n\nPerhaps *part* of their motivation is to see justice done for their murdered son.  I think you're very biased to say their \"only motivation is a payday.\"",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1438938693.0,
    "date_created": "2015-08-06",
    "time_created": "21:11:33",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu9hjb",
    "parent_id": "t1_ctu4gw1",
    "subreddit_name_prefixed": "r/news",
    "body": ">So the only real source of information is the family's attorney, whose only interest in the case is an eventual payday from civil litigation.\n\nIf you're going to defend an individual with *very little* information about them, don't turn around and attack the very character and driving force of another individual that you know **nothing** about - it weakens the impact of your position and words. I understand what your point was, but it only comes off as petty.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1438936750.0,
    "date_created": "2015-08-06",
    "time_created": "20:39:10",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu71my",
    "parent_id": "t1_ctu4kz1",
    "subreddit_name_prefixed": "r/news",
    "body": "Honest mistake Johnson. Let's get some lunch. ",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1438932476.0,
    "date_created": "2015-08-06",
    "time_created": "19:27:56",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu89xj",
    "parent_id": "t1_ctu5m8s",
    "subreddit_name_prefixed": "r/news",
    "body": "And on a first date man...ugh",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1438934567.0,
    "date_created": "2015-08-06",
    "time_created": "20:02:47",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6okk",
    "parent_id": "t1_ctu4mcv",
    "subreddit_name_prefixed": "r/news",
    "body": "Makes the ~~car~~ human go faster!",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1438931903.0,
    "date_created": "2015-08-06",
    "time_created": "19:18:23",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8gal",
    "parent_id": "t1_ctu4mcv",
    "subreddit_name_prefixed": "r/news",
    "body": "I laughed... and then I immediately felt bad. :(",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1438934882.0,
    "date_created": "2015-08-06",
    "time_created": "20:08:02",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu9guc",
    "parent_id": "t1_ctu6zr1",
    "subreddit_name_prefixed": "r/news",
    "body": "*read the full report for only $9.99*",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1438936715.0,
    "date_created": "2015-08-06",
    "time_created": "20:38:35",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6b59",
    "parent_id": "t1_ctu5i7c",
    "subreddit_name_prefixed": "r/news",
    "body": "again, I believe the report they are talking about covers the drug bust only (the girl got charged). Every one knows a kid died. It's not coverup or perjury.\n\nI imagine because the shooting investigation is currently active, and is done by some state agency not these cops, some rules kicked in where they couldn't get into that part in the published pot bust report. Since literally the other investigation is under various gag order, the cops name is not yet released, details and video not yet released, etc. while the other report is public",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1438931280.0,
    "date_created": "2015-08-06",
    "time_created": "19:08:00",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctufv4n",
    "parent_id": "t1_ctu9j0d",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 114,
    "downs": 0,
    "score": 114,
    "created": 1438948431.0,
    "date_created": "2015-08-06",
    "time_created": "23:53:51",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctubkus",
    "parent_id": "t1_ctu9j0d",
    "subreddit_name_prefixed": "r/news",
    "body": "People didn't riot in South Carolina when an unarmed black man was shot running away either.",
    "controversiality": 0,
    "ups": 187,
    "downs": 0,
    "score": 187,
    "created": 1438940514.0,
    "date_created": "2015-08-06",
    "time_created": "21:41:54",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctud7rz",
    "parent_id": "t1_ctu9j0d",
    "subreddit_name_prefixed": "r/news",
    "body": "Edit:  oh, I'm mostly pink, but I claim Caucasian. \n\nYou think that these folks might write him off being eliminated as, \"well I bet he lived a good life,\" because he is white? \n\nI lived a pretty up and down life for my self, and everyone treated me very well. I had a bunch of friends who rocked. However, once I went to university--after a lot of lucky breaks--I was admitted into a community where I was expected to \"check my privilege\" at the door. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1438943444.0,
    "date_created": "2015-08-06",
    "time_created": "22:30:44",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctud2gz",
    "parent_id": "t1_ctu9j0d",
    "subreddit_name_prefixed": "r/news",
    "body": "Relevant: Run the Jewels' take on Fergison Riots\n\nhttp://www.bbc.com/news/world-us-canada-33774841\n\nedit: btw its only about 2 min long. Love El-p and Killer Mike. Killer Mike and El-P together! Even better! ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438943177.0,
    "date_created": "2015-08-06",
    "time_created": "22:26:17",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuiczq",
    "parent_id": "t1_ctu8o36",
    "subreddit_name_prefixed": "r/news",
    "body": "I keep on repeating this, but still... I am German and in 2012 ALL the German police fired 90 bullets on duty, where as the NYPD put that much into one guy during one incident. (I don't have more recent numbers, didn't look them up because I don't think they are any \"better\")\n\nI am not saying that we are better. But rather that if your guys don't get their shit in order and stop treating the people as a war zone, that mentality might swash over here.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1438954058.0,
    "date_created": "2015-08-07",
    "time_created": "01:27:38",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctultdb",
    "parent_id": "t1_ctu9d30",
    "subreddit_name_prefixed": "r/news",
    "body": "That's fucking horrifying.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438965302.0,
    "date_created": "2015-08-07",
    "time_created": "04:35:02",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctukzh4",
    "parent_id": "t1_ctu8m3l",
    "subreddit_name_prefixed": "r/news",
    "body": "Black people get shot by police in my area (south Florida) nearly every other week, but black people here don't protest or riot. They can't afford to take the time off work. Maybe it has less to do with the fact that the victim is white, and more to do with the fact that it's an economically depressed area where people hang onto their shitty jobs tooth and nail.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1438962103.0,
    "date_created": "2015-08-07",
    "time_created": "03:41:43",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctud0g6",
    "parent_id": "t1_ctuawpd",
    "subreddit_name_prefixed": "r/news",
    "body": "Modern American conservatism has it's ideals all mixed up, true. That's why I (a conservative) use my own head just like any regular person should. Small government? Yeah! Guns? Sure! Trickle down? I have strong doubts. \n\nWhat reddit doesn't understand about conservative ideals is that was originally economic based (I believe- someone probably knows more than me). Conservative means that these old folk aren't active to change, but know that change will happen anyway.",
    "controversiality": 0,
    "ups": 65,
    "downs": 0,
    "score": 65,
    "created": 1438943075.0,
    "date_created": "2015-08-06",
    "time_created": "22:24:35",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctucbwe",
    "parent_id": "t1_ctuawpd",
    "subreddit_name_prefixed": "r/news",
    "body": "Exactly. I'm conservative and fuck anyone that impedes on me or my peoples' rights, and that most definitely includes cops.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1438941850.0,
    "date_created": "2015-08-06",
    "time_created": "22:04:10",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuegq9",
    "parent_id": "t1_ctuass8",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1438945681.0,
    "date_created": "2015-08-06",
    "time_created": "23:08:01",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu771i",
    "parent_id": "t1_ctu605m",
    "subreddit_name_prefixed": "r/news",
    "body": "In the parking lot eating ice cream, not even some seedy drug den.",
    "controversiality": 0,
    "ups": 249,
    "downs": 0,
    "score": 249,
    "created": 1438932719.0,
    "date_created": "2015-08-06",
    "time_created": "19:31:59",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6v13",
    "parent_id": "t1_ctu605m",
    "subreddit_name_prefixed": "r/news",
    "body": "He wasn't even the one selling it. He may not even have known there were drugs in the car.",
    "controversiality": 0,
    "ups": 287,
    "downs": 0,
    "score": 287,
    "created": 1438932183.0,
    "date_created": "2015-08-06",
    "time_created": "19:23:03",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctub5rk",
    "parent_id": "t1_ctu605m",
    "subreddit_name_prefixed": "r/news",
    "body": "This is even more stupid if you think about it this way. Fireworks are not legal in every state, however you can cross state lines and buy some, shoot them off in the illegal state and nothing ever happens. Now weed is just like fireworks, legal in some not in others, however you do not see cops doing firework busts on people. The police in this situation need to stop doing this and go after real criminals not some kid who bought weed.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438939765.0,
    "date_created": "2015-08-06",
    "time_created": "21:29:25",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctufojj",
    "parent_id": "t1_ctu605m",
    "subreddit_name_prefixed": "r/news",
    "body": "killed for 10 grams that was found on his friend.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438948067.0,
    "date_created": "2015-08-06",
    "time_created": "23:47:47",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8c8j",
    "parent_id": "t1_ctu6b9h",
    "subreddit_name_prefixed": "r/news",
    "body": "That's ~$100 of weed this kid died for.  $100.  Apparently that's what a life is worth to American police.",
    "controversiality": 0,
    "ups": 159,
    "downs": 0,
    "score": 159,
    "created": 1438934681.0,
    "date_created": "2015-08-06",
    "time_created": "20:04:41",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctua8bv",
    "parent_id": "t1_ctu6b9h",
    "subreddit_name_prefixed": "r/news",
    "body": "Well no, they weren't after him they were there to bust his girlfriend that was with him.  They killed him then arrested his girlfriend.  Which really just makes this even crazier.\n\nThe officer that killed him claims he attempted to ram the officer with his car.  But the family's lawyer order a 2nd autopsy that claims he was shot from behind, seeming to contradict the officer's testimony.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1438938074.0,
    "date_created": "2015-08-06",
    "time_created": "21:01:14",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8knk",
    "parent_id": "t1_ctu6d9q",
    "subreddit_name_prefixed": "r/news",
    "body": "You live in a weed legal state? It seriously fucked up for weed to be legal in one state and then people getting killed for it in others. I wish they'd just legalize countrywide already.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438935105.0,
    "date_created": "2015-08-06",
    "time_created": "20:11:45",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8jlh",
    "parent_id": "t1_ctu6df3",
    "subreddit_name_prefixed": "r/news",
    "body": "> I tried to tell my public attorney\n\nThere's the reason right there.",
    "controversiality": 0,
    "ups": 140,
    "downs": 0,
    "score": 140,
    "created": 1438935052.0,
    "date_created": "2015-08-06",
    "time_created": "20:10:52",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu98bq",
    "parent_id": "t1_ctu6df3",
    "subreddit_name_prefixed": "r/news",
    "body": "different states have really different laws",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438936280.0,
    "date_created": "2015-08-06",
    "time_created": "20:31:20",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6ci8",
    "parent_id": "t1_ctu63tj",
    "subreddit_name_prefixed": "r/news",
    "body": "Your police are evaluated by how many arrests they make, so they arrest people for petty shit.",
    "controversiality": 0,
    "ups": 253,
    "downs": 0,
    "score": 253,
    "created": 1438931345.0,
    "date_created": "2015-08-06",
    "time_created": "19:09:05",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctua3v7",
    "parent_id": "t1_ctu73su",
    "subreddit_name_prefixed": "r/news",
    "body": "Damn.  I paid more than that for not showing up for my court date after a traffic ticket.",
    "controversiality": 0,
    "ups": 47,
    "downs": 0,
    "score": 47,
    "created": 1438937856.0,
    "date_created": "2015-08-06",
    "time_created": "20:57:36",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8jzu",
    "parent_id": "t1_ctu6yr1",
    "subreddit_name_prefixed": "r/news",
    "body": "They know these people aren't dangerous. They're proud of themselves for getting a gold star by hitting their arrest benchmark for the week. Sometimes I feel like police stations operate on the same principals as a kindergarten classroom.",
    "controversiality": 0,
    "ups": 66,
    "downs": 0,
    "score": 66,
    "created": 1438935071.0,
    "date_created": "2015-08-06",
    "time_created": "20:11:11",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu87ej",
    "parent_id": "t1_ctu7gym",
    "subreddit_name_prefixed": "r/news",
    "body": "Probably did it to get his charges dropped. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438934441.0,
    "date_created": "2015-08-06",
    "time_created": "20:00:41",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6db3",
    "parent_id": "t1_ctu66gk",
    "subreddit_name_prefixed": "r/news",
    "body": "And with the state of our dollar, that's like 45 USD. ",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1438931382.0,
    "date_created": "2015-08-06",
    "time_created": "19:09:42",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuaekk",
    "parent_id": "t1_ctu66gk",
    "subreddit_name_prefixed": "r/news",
    "body": "Are you from Canada? $60 gets you a quarter here unless you're buying in bulk.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438938374.0,
    "date_created": "2015-08-06",
    "time_created": "21:06:14",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu559l",
    "parent_id": "t1_ctu4yvh",
    "subreddit_name_prefixed": "r/news",
    "body": "I thought it was the AllLivesMatter crowd and* the BlackLivesMatter crowd was mocking the silence?\n\nWonderful, totally unbiased and reliable journalism here from huffpo /s : http://www.huffingtonpost.com/entry/zachary-hammond-police-killing_55c0e240e4b0c9fdc75dfda3\n\n*spelling",
    "controversiality": 0,
    "ups": 51,
    "downs": 0,
    "score": 51,
    "created": 1438929339.0,
    "date_created": "2015-08-06",
    "time_created": "18:35:39",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctul77w",
    "parent_id": "t1_ctu4yvh",
    "subreddit_name_prefixed": "r/news",
    "body": "I've literally only seen the BlackLivesMatter crowd talking about this until now.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1438962878.0,
    "date_created": "2015-08-07",
    "time_created": "03:54:38",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6e2p",
    "parent_id": "t1_ctu5g93",
    "subreddit_name_prefixed": "r/news",
    "body": "It's called identity politics. It's pretty much always manipulative bullshit that sounds nice. Sometimes it shows a hateful face, and sometimes it shows a friendly face, but its the same. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1438931419.0,
    "date_created": "2015-08-06",
    "time_created": "19:10:19",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5zdp",
    "parent_id": "t1_ctu5g93",
    "subreddit_name_prefixed": "r/news",
    "body": "Divide and Conquer. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438930723.0,
    "date_created": "2015-08-06",
    "time_created": "18:58:43",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuanzb",
    "parent_id": "t1_ctu9hxv",
    "subreddit_name_prefixed": "r/news",
    "body": "Could have been reversing",
    "controversiality": 0,
    "ups": 142,
    "downs": 0,
    "score": 142,
    "created": 1438938844.0,
    "date_created": "2015-08-06",
    "time_created": "21:14:04",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu9bwm",
    "parent_id": "t1_ctu8bbh",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah probably tan",
    "controversiality": 0,
    "ups": 37,
    "downs": 0,
    "score": 37,
    "created": 1438936463.0,
    "date_created": "2015-08-06",
    "time_created": "20:34:23",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu9cen",
    "parent_id": "t1_ctu8bbh",
    "subreddit_name_prefixed": "r/news",
    "body": "Lots of that going around lately.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438936489.0,
    "date_created": "2015-08-06",
    "time_created": "20:34:49",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu87iu",
    "parent_id": "t1_ctu442h",
    "subreddit_name_prefixed": "r/news",
    "body": "I mean, the most famous pokemon out there IS called pick@you, fuck@you could be a badass evolution or something",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1438934448.0,
    "date_created": "2015-08-06",
    "time_created": "20:00:48",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu68fd",
    "parent_id": "t1_ctu4zau",
    "subreddit_name_prefixed": "r/news",
    "body": "technology changed everything\n\nrodney king never gets exposure if a guy didn't just happen to have a camera on him\n\nall this raw footage of these shootings is what is sparking the outrage. its more visceral for people now.",
    "controversiality": 0,
    "ups": 112,
    "downs": 0,
    "score": 112,
    "created": 1438931152.0,
    "date_created": "2015-08-06",
    "time_created": "19:05:52",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5zov",
    "parent_id": "t1_ctu4zau",
    "subreddit_name_prefixed": "r/news",
    "body": ">veteran's life alert bracelet went off, the cops showed up and when he said that he was fine and wouldn't let them in the cops kicked down the door and shot and killed him and of course a grand jury cleared them of all wrongdoing.\n\nWhat the ever-loving, Jesus fucking, holy mother of Christ?! How have I never heard of this?\n\nThat's one of the most ass-backwards things I've ever heard of. What the fuck.",
    "controversiality": 0,
    "ups": 124,
    "downs": 0,
    "score": 124,
    "created": 1438930739.0,
    "date_created": "2015-08-06",
    "time_created": "18:58:59",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuflnr",
    "parent_id": "t1_ctu4zau",
    "subreddit_name_prefixed": "r/news",
    "body": "“Oh, you're fine? Better give that life bracelet a reason to have gone off!”",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1438947908.0,
    "date_created": "2015-08-06",
    "time_created": "23:45:08",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu9dvf",
    "parent_id": "t1_ctu4zau",
    "subreddit_name_prefixed": "r/news",
    "body": "[Wiki article about the second story](https://en.wikipedia.org/wiki/Killing_of_Kenneth_Chamberlain,_Sr.)",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438936562.0,
    "date_created": "2015-08-06",
    "time_created": "20:36:02",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu9m83",
    "parent_id": "t1_ctu2ss9",
    "subreddit_name_prefixed": "r/news",
    "body": "I've called and been called a sjw.  Kind of getting meaningless are this point.  ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1438936985.0,
    "date_created": "2015-08-06",
    "time_created": "20:43:05",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5kay",
    "parent_id": "t1_ctu4tq8",
    "subreddit_name_prefixed": "r/news",
    "body": "https://en.wikipedia.org/wiki/Death_of_Aiyana_Jones\n\n>Officer Joseph Weekley was charged in connection with Jones' death. In October 2011, Weekley was charged with involuntary manslaughter and reckless endangerment with a gun. Weekley's first trial ended in a mistrial in June 2013.[6]\n\n>Weekley's retrial began in September 2014. On October 3, the judge dismissed the involuntary manslaughter charge against Weekley, leaving him on trial for only one charge: recklessly discharging a firearm.[7][8][9]\n\n>On October 10, the second trial ended in another mistrial.[10][11]\n\n>On January 28, 2015, a prosecutor cleared Weekley of the last remaining charge against him, ensuring there would not be a third trial.[12]\n\nWTF",
    "controversiality": 0,
    "ups": 332,
    "downs": 0,
    "score": 332,
    "created": 1438930042.0,
    "date_created": "2015-08-06",
    "time_created": "18:47:22",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu56j4",
    "parent_id": "t1_ctu4tq8",
    "subreddit_name_prefixed": "r/news",
    "body": "That's a pretty good explanation that I hadn't considered. Still bothers me how little attention Tamir Rice got compared to Michael Brown.",
    "controversiality": 0,
    "ups": 214,
    "downs": 0,
    "score": 214,
    "created": 1438929400.0,
    "date_created": "2015-08-06",
    "time_created": "18:36:40",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5f3r",
    "parent_id": "t1_ctu4tq8",
    "subreddit_name_prefixed": "r/news",
    "body": "Interesting. I never thought about it this way before, but what you say does make sense. ",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1438929802.0,
    "date_created": "2015-08-06",
    "time_created": "18:43:22",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu7f72",
    "parent_id": "t1_ctu4tq8",
    "subreddit_name_prefixed": "r/news",
    "body": "If reddit had a \"Posts people should read throughout life\" this would be near the top. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438933090.0,
    "date_created": "2015-08-06",
    "time_created": "19:38:10",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5uq2",
    "parent_id": "t1_ctu4tq8",
    "subreddit_name_prefixed": "r/news",
    "body": "Someone r/bestof this, I'm at work.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1438930515.0,
    "date_created": "2015-08-06",
    "time_created": "18:55:15",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu9s3n",
    "parent_id": "t1_ctu7b3t",
    "subreddit_name_prefixed": "r/news",
    "body": "This needs to be up higher. We cant rely on Anonymous to do all the heavy lifting here people.\n\nEdit a word",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1438937275.0,
    "date_created": "2015-08-06",
    "time_created": "20:47:55",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu42nd",
    "parent_id": "t1_ctu3r7p",
    "subreddit_name_prefixed": "r/news",
    "body": "Some guy from the civil war bled blue.",
    "controversiality": 0,
    "ups": 774,
    "downs": 0,
    "score": 774,
    "created": 1438927620.0,
    "date_created": "2015-08-06",
    "time_created": "18:07:00",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4rx0",
    "parent_id": "t1_ctu3r7p",
    "subreddit_name_prefixed": "r/news",
    "body": "band-aids don't fix bullet holes",
    "controversiality": 0,
    "ups": 63,
    "downs": 0,
    "score": 63,
    "created": 1438928726.0,
    "date_created": "2015-08-06",
    "time_created": "18:25:26",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4h9n",
    "parent_id": "t1_ctu3r7p",
    "subreddit_name_prefixed": "r/news",
    "body": "deep shit bro",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1438928257.0,
    "date_created": "2015-08-06",
    "time_created": "18:17:37",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5wur",
    "parent_id": "t1_ctu3r7p",
    "subreddit_name_prefixed": "r/news",
    "body": "Black or white, they all pink inside. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438930609.0,
    "date_created": "2015-08-06",
    "time_created": "18:56:49",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu58tb",
    "parent_id": "t1_ctu42b0",
    "subreddit_name_prefixed": "r/news",
    "body": "Totally counts.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438929508.0,
    "date_created": "2015-08-06",
    "time_created": "18:38:28",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuae2s",
    "parent_id": "t1_ctu42b0",
    "subreddit_name_prefixed": "r/news",
    "body": "I think the common convention is that if you have \"a drop\", you get to decide which race you identify with. So you be you, however you feel \"you\" is defined.\n\nPasty white girl checking in, with some family that are in law enforcement, some family that's mixed race and identify as black, some family that's Hispanic, and family with severe mental health issues... we all need to be rational and powerful when it comes to this kind of inexcusable thing.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438938353.0,
    "date_created": "2015-08-06",
    "time_created": "21:05:53",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu1hyo",
    "parent_id": "t1_ctu1cdj",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm a member of Moral Monday, GA, and I'm about to be getting on the phone to see if we can't bring some attention to this shooting at our next protest.  This is a very good example of the kind of brutality and oversight that affects us all. And yes, black people are more often victims of police brutality, per capita, than white people, but that doesn't mean every instance isn't an outrage.  The solutions of more accountability for police and harsher punishments for their wrongdoing are colorblind ones that will help everyone.",
    "controversiality": 0,
    "ups": 328,
    "downs": 0,
    "score": 328,
    "created": 1438923711.0,
    "date_created": "2015-08-06",
    "time_created": "17:01:51",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu38lj",
    "parent_id": "t1_ctu1cdj",
    "subreddit_name_prefixed": "r/news",
    "body": "Trigger fingers turn to Twitter fingers.",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1438926325.0,
    "date_created": "2015-08-06",
    "time_created": "17:45:25",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu3bh7",
    "parent_id": "t1_ctu1cdj",
    "subreddit_name_prefixed": "r/news",
    "body": "Equality love! ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438926449.0,
    "date_created": "2015-08-06",
    "time_created": "17:47:29",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu2nz2",
    "parent_id": "t1_ctu1t58",
    "subreddit_name_prefixed": "r/news",
    "body": "Leaders in the African American communities helped to get police brutality stories heard and when they started reaching national spotlight, the mainstream media initially turned them into race issues. Michael Brown's story headlined as \"White cop shoots unarmed black teen in broad daylight\" and all the media and everyone talked about at first was racism. Racism definitely could've played a factor in many of these but the real problem was police brutality and excessive force. It's taken a while for mainstream media to make these stories about police brutality. We need a national organization like the NAACP that focuses on cop brutality issues for people of all races.",
    "controversiality": 0,
    "ups": 92,
    "downs": 0,
    "score": 92,
    "created": 1438925450.0,
    "date_created": "2015-08-06",
    "time_created": "17:30:50",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu40t6",
    "parent_id": "t1_ctu3pyw",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1438927543.0,
    "date_created": "2015-08-06",
    "time_created": "18:05:43",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu1et5",
    "parent_id": "t1_ctu0mjh",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah... I saw today the company that's supposed to do psychological testing of perspective police officers in Baltimore is under investigation for pretty much just not doing their jobs.\n\nIt's just frightening... you don't shoot someone unless your life or the lives of others are in immediate danger. This \"I couldn't outrun him so I shot him\" shit has to stop.\n\nThe trigger happy power trippers need to be weeded out before they are put on the streets in uniform. It ruins the reputation of all police officers.",
    "controversiality": 0,
    "ups": 89,
    "downs": 0,
    "score": 89,
    "created": 1438923587.0,
    "date_created": "2015-08-06",
    "time_created": "16:59:47",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu3ls7",
    "parent_id": "t1_ctu0mjh",
    "subreddit_name_prefixed": "r/news",
    "body": "\" The kid was shot in the back over a little marijuana.\"\n\nThis senseless \"war on drugs\" has got to stop! It never will due to \"policing for profit\"as law enforcement departments make large sums of money through seizure policies and the fines levied by courts. Incarceration,due to drugs,disproportionately affects young black males at rates that are a national embarrassment. \n\nThis incident should have people taking to the streets to stand up to police brutality. \n\nAll lives matter!\n",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1438926894.0,
    "date_created": "2015-08-06",
    "time_created": "17:54:54",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8xi1",
    "parent_id": "t1_ctu58nr",
    "subreddit_name_prefixed": "r/news",
    "body": "Probably the same people who are complacent with having their privacy invaded because \"I have nothing to hide!\"",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1438935737.0,
    "date_created": "2015-08-06",
    "time_created": "20:22:17",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5ly4",
    "parent_id": "t1_ctu4sms",
    "subreddit_name_prefixed": "r/news",
    "body": "> You're not immune\n\nWe're all criminal scum, just as soon as some cop decides we are.",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1438930120.0,
    "date_created": "2015-08-06",
    "time_created": "18:48:40",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu9rh1",
    "parent_id": "t1_ctu4sms",
    "subreddit_name_prefixed": "r/news",
    "body": ">If you tolerate police shooting unarmed black kids, they'll start shooting unarmed white kids with impunity as well. \n\nThis is the only time that the \"first they came for __\" meme is relevant",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438937245.0,
    "date_created": "2015-08-06",
    "time_created": "20:47:25",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu7do5",
    "parent_id": "t1_ctu5jpo",
    "subreddit_name_prefixed": "r/news",
    "body": "I think you're right. I was taught the police couldn't be trusted and you had to look out for yourself.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1438933021.0,
    "date_created": "2015-08-06",
    "time_created": "19:37:01",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuhuwg",
    "parent_id": "t1_ctu5jpo",
    "subreddit_name_prefixed": "r/news",
    "body": "You should look at the recent \"askreddit\" thread about what you should say to get out of a ticket. While most of the tips are legitimate, they basically tell you to not upset the wild animal in its natural habitat. And that's the pro-police crowd, if not the cops themselves.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438952808.0,
    "date_created": "2015-08-07",
    "time_created": "01:06:48",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5yw0",
    "parent_id": "t1_ctu4juc",
    "subreddit_name_prefixed": "r/news",
    "body": "1 like = 1 outrage.    \n1 share = 10 riots",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1438930700.0,
    "date_created": "2015-08-06",
    "time_created": "18:58:20",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctubbjj",
    "parent_id": "t1_ctu4juc",
    "subreddit_name_prefixed": "r/news",
    "body": "Pretty sure you have to cri evry tiem. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438940055.0,
    "date_created": "2015-08-06",
    "time_created": "21:34:15",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu95kc",
    "parent_id": "t1_ctu6mzy",
    "subreddit_name_prefixed": "r/news",
    "body": "I am roughly 400% sure that human trafficking is considered violent.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438936138.0,
    "date_created": "2015-08-06",
    "time_created": "20:28:58",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctua1am",
    "parent_id": "t1_ctu97ww",
    "subreddit_name_prefixed": "r/news",
    "body": "It wasn't the officers fault that the guy had a heart condition. ",
    "controversiality": 0,
    "ups": 454,
    "downs": 0,
    "score": 454,
    "created": 1438937733.0,
    "date_created": "2015-08-06",
    "time_created": "20:55:33",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuakjx",
    "parent_id": "t1_ctu97ww",
    "subreddit_name_prefixed": "r/news",
    "body": "Wasn't the cops fault the kid walked into those bullets.",
    "controversiality": 0,
    "ups": 97,
    "downs": 0,
    "score": 97,
    "created": 1438938673.0,
    "date_created": "2015-08-06",
    "time_created": "21:11:13",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuawzw",
    "parent_id": "t1_ctu97ww",
    "subreddit_name_prefixed": "r/news",
    "body": "He had an abnormally high iron count. Mainly from the bullets.",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1438939310.0,
    "date_created": "2015-08-06",
    "time_created": "21:21:50",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu679e",
    "parent_id": "t1_ctu56mk",
    "subreddit_name_prefixed": "r/news",
    "body": "He herped and he derped and he missed the perp",
    "controversiality": 0,
    "ups": 86,
    "downs": 0,
    "score": 86,
    "created": 1438931097.0,
    "date_created": "2015-08-06",
    "time_created": "19:04:57",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu97v6",
    "parent_id": "t1_ctu56mk",
    "subreddit_name_prefixed": "r/news",
    "body": "When he should have zagged",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438936257.0,
    "date_created": "2015-08-06",
    "time_created": "20:30:57",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5fv2",
    "parent_id": "t1_ctu51sw",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 62,
    "downs": 0,
    "score": 62,
    "created": 1438929837.0,
    "date_created": "2015-08-06",
    "time_created": "18:43:57",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8h4z",
    "parent_id": "t1_ctu51sw",
    "subreddit_name_prefixed": "r/news",
    "body": "So many donuts my hands were jittery.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1438934924.0,
    "date_created": "2015-08-06",
    "time_created": "20:08:44",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu9i3q",
    "parent_id": "t1_ctu63ri",
    "subreddit_name_prefixed": "r/news",
    "body": "Then we did the polka #DanceLikeWhitePeople RT@Scientolojesus : Approached suspect who seemed to be nervous and under the influence, suspect reached into his pocket for identification, I pulled out my gun.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1438936777.0,
    "date_created": "2015-08-06",
    "time_created": "20:39:37",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu84ih",
    "parent_id": "t1_ctu63ri",
    "subreddit_name_prefixed": "r/news",
    "body": "> I pulled out my gun\n\n[Now you're in the closet too.](https://www.youtube.com/watch?v=3LiuZLQbdTc)",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1438934299.0,
    "date_created": "2015-08-06",
    "time_created": "19:58:19",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctucw87",
    "parent_id": "t1_ctu63ri",
    "subreddit_name_prefixed": "r/news",
    "body": "[\"....and so I pulled out my gun!\"](https://www.youtube.com/watch?v=Bxm0A5LHF08)",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438942862.0,
    "date_created": "2015-08-06",
    "time_created": "22:21:02",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctudfq4",
    "parent_id": "t1_ctu63ri",
    "subreddit_name_prefixed": "r/news",
    "body": "I put on my robe and wizards hat",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438943847.0,
    "date_created": "2015-08-06",
    "time_created": "22:37:27",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5vvt",
    "parent_id": "t1_ctu5m3w",
    "subreddit_name_prefixed": "r/news",
    "body": "\"You're harsh but fair, sarge\" ",
    "controversiality": 0,
    "ups": 342,
    "downs": 0,
    "score": 342,
    "created": 1438930567.0,
    "date_created": "2015-08-06",
    "time_created": "18:56:07",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu66nk",
    "parent_id": "t1_ctu5m3w",
    "subreddit_name_prefixed": "r/news",
    "body": "*Drives off to get some donuts*",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1438931068.0,
    "date_created": "2015-08-06",
    "time_created": "19:04:28",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4yfh",
    "parent_id": "t1_ctu4l0y",
    "subreddit_name_prefixed": "r/news",
    "body": "Ordering pizzas now.......\n",
    "controversiality": 0,
    "ups": 58,
    "downs": 0,
    "score": 58,
    "created": 1438929020.0,
    "date_created": "2015-08-06",
    "time_created": "18:30:20",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6j9a",
    "parent_id": "t1_ctu4l0y",
    "subreddit_name_prefixed": "r/news",
    "body": "No, promotions are only handed out for shooting minorities, this guy'll have to settle for a lateral move with an increase in pay. That'll teach him to shoot a white kid!",
    "controversiality": 0,
    "ups": 104,
    "downs": 0,
    "score": 104,
    "created": 1438931670.0,
    "date_created": "2015-08-06",
    "time_created": "19:14:30",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8ls9",
    "parent_id": "t1_ctu4l0y",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm taking you off the beat! You'll be doing paper work in your own office from now on!",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438935159.0,
    "date_created": "2015-08-06",
    "time_created": "20:12:39",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu67qc",
    "parent_id": "t1_ctu593k",
    "subreddit_name_prefixed": "r/news",
    "body": "Will do.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1438931119.0,
    "date_created": "2015-08-06",
    "time_created": "19:05:19",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctudpj4",
    "parent_id": "t1_ctuakyr",
    "subreddit_name_prefixed": "r/news",
    "body": "Attorney. Not the parents. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1438944324.0,
    "date_created": "2015-08-06",
    "time_created": "22:45:24",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctulifs",
    "parent_id": "t1_ctu71my",
    "subreddit_name_prefixed": "r/news",
    "body": "But let's sprinkle some crack on it first.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438964090.0,
    "date_created": "2015-08-07",
    "time_created": "04:14:50",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctueczv",
    "parent_id": "t1_ctu89xj",
    "subreddit_name_prefixed": "r/news",
    "body": "Over a fucking bag of weed. Our justice system needs more to do if they're busting white kids in ice cream parking lots for bud. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1438945477.0,
    "date_created": "2015-08-06",
    "time_created": "23:04:37",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuc8kk",
    "parent_id": "t1_ctu9guc",
    "subreddit_name_prefixed": "r/news",
    "body": "Extraneous injury report $4.99 per exit wound.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438941692.0,
    "date_created": "2015-08-06",
    "time_created": "22:01:32",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctunr7x",
    "parent_id": "t1_ctufv4n",
    "subreddit_name_prefixed": "r/news",
    "body": "Holy shit. That sounds depressing.   \n  \n> Wanna protest? I'll see you with bail for some bullshit charge at county lock up.  \n  \n\nHas the corruption really become that bad?",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1438973757.0,
    "date_created": "2015-08-07",
    "time_created": "06:55:57",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctue7ip",
    "parent_id": "t1_ctubkus",
    "subreddit_name_prefixed": "r/news",
    "body": "That cop was charged with murder right?",
    "controversiality": 0,
    "ups": 70,
    "downs": 0,
    "score": 70,
    "created": 1438945198.0,
    "date_created": "2015-08-06",
    "time_created": "22:59:58",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctud45x",
    "parent_id": "t1_ctubkus",
    "subreddit_name_prefixed": "r/news",
    "body": "I mean there was also a video of him running away and a cop shooting him, there is a pretty good chance people are gonna get outraged over that easily. ",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1438943262.0,
    "date_created": "2015-08-06",
    "time_created": "22:27:42",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctul4rt",
    "parent_id": "t1_ctud0g6",
    "subreddit_name_prefixed": "r/news",
    "body": "Liberalism is what your ideology is called, more specific classical liberalism. It stands for economic freedom and smaller government. Conservatism is often described in textbooks as representing slow change, but as we all know conservatives often actively opposes change or want it to go back to the way it was before. To be a liberalist, not to be confused with a liberal; the opposite of conservative, you don't have to be a conservative. I think they all commonly just fall under the same category in the US today due to your two party system. I'm a liberal socialist, and understanding the core of both socialism and liberalism makes me see the beauty of both of the ideologies principles, and where they both can, and have, gone wrong. But even if I understand the idea behind conservatism I'll never see it as something positive.",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1438962631.0,
    "date_created": "2015-08-07",
    "time_created": "03:50:31",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu938w",
    "parent_id": "t1_ctu771i",
    "subreddit_name_prefixed": "r/news",
    "body": "While on a date",
    "controversiality": 0,
    "ups": 195,
    "downs": 0,
    "score": 195,
    "created": 1438936025.0,
    "date_created": "2015-08-06",
    "time_created": "20:27:05",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctubpm6",
    "parent_id": "t1_ctu771i",
    "subreddit_name_prefixed": "r/news",
    "body": "Was it chocolate ice cream? The police may have been confused and feared for their lives.",
    "controversiality": 0,
    "ups": 125,
    "downs": 0,
    "score": 125,
    "created": 1438940743.0,
    "date_created": "2015-08-06",
    "time_created": "21:45:43",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuaqsp",
    "parent_id": "t1_ctu771i",
    "subreddit_name_prefixed": "r/news",
    "body": "This makes me sad. What is so wrong with a little weed and munchies that people need to die over it. ",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1438938990.0,
    "date_created": "2015-08-06",
    "time_created": "21:16:30",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuc2vn",
    "parent_id": "t1_ctu771i",
    "subreddit_name_prefixed": "r/news",
    "body": "Like I said in another part of this thread, I'm from this area.   It's actually a pretty nice town, on a beautiful lake.   Weed is definitely an offense you're going to jail for up there.  But to be killed by a cop over a quarter of weed?  Just terrible.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1438941408.0,
    "date_created": "2015-08-06",
    "time_created": "21:56:48",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu91p2",
    "parent_id": "t1_ctu8c8j",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1438935947.0,
    "date_created": "2015-08-06",
    "time_created": "20:25:47",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8krn",
    "parent_id": "t1_ctu8c8j",
    "subreddit_name_prefixed": "r/news",
    "body": "10g for 100? Man, I'm gettin fucked with my prices down here in fl.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1438935110.0,
    "date_created": "2015-08-06",
    "time_created": "20:11:50",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu90m3",
    "parent_id": "t1_ctu8jlh",
    "subreddit_name_prefixed": "r/news",
    "body": "My dad had a public attorney that **didn't let him go in front of the judge** on one of his court dates. Sat in a courthouse cell for 10 hours and was shipped right back to prison after his public defender told him that'd he be getting another 5 weeks of jail time.",
    "controversiality": 0,
    "ups": 76,
    "downs": 0,
    "score": 76,
    "created": 1438935893.0,
    "date_created": "2015-08-06",
    "time_created": "20:24:53",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctugij9",
    "parent_id": "t1_ctu8jlh",
    "subreddit_name_prefixed": "r/news",
    "body": "From experience, I personally believe a lot of public attorneys have relationships with the judge...",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438949765.0,
    "date_created": "2015-08-07",
    "time_created": "00:16:05",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6sfn",
    "parent_id": "t1_ctu6ci8",
    "subreddit_name_prefixed": "r/news",
    "body": "It's true. Im lucky to live in a small town with friendly police that get you shouldn't bully the stoners. Worst they do is ask if you smoked it recently and if you did tell you not to drive for a while. That's it. Maybe the couple dickheads we have will confiscate it and your piece but that's nicer than some places where you're straight up jailed or apparently now, killed because of an officer's opinion on what you're doing.",
    "controversiality": 0,
    "ups": 79,
    "downs": 0,
    "score": 79,
    "created": 1438932070.0,
    "date_created": "2015-08-06",
    "time_created": "19:21:10",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8vdr",
    "parent_id": "t1_ctu6ci8",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 63,
    "downs": 0,
    "score": 63,
    "created": 1438935632.0,
    "date_created": "2015-08-06",
    "time_created": "20:20:32",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctubf3h",
    "parent_id": "t1_ctu6ci8",
    "subreddit_name_prefixed": "r/news",
    "body": "Watch the Wire. ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1438940234.0,
    "date_created": "2015-08-06",
    "time_created": "21:37:14",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuf5nj",
    "parent_id": "t1_ctu6ci8",
    "subreddit_name_prefixed": "r/news",
    "body": "And small time pot busts are safe.\n\nGoing after major dealers is difficult and dangerous.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438947048.0,
    "date_created": "2015-08-06",
    "time_created": "23:30:48",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctubsnf",
    "parent_id": "t1_ctua3v7",
    "subreddit_name_prefixed": "r/news",
    "body": "Not showing up for court is waaay more serious than peddling a little coke.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1438940896.0,
    "date_created": "2015-08-06",
    "time_created": "21:48:16",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctudh2j",
    "parent_id": "t1_ctu8jzu",
    "subreddit_name_prefixed": "r/news",
    "body": "I think this is kinda true in many work sectors with managers and such. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438943916.0,
    "date_created": "2015-08-06",
    "time_created": "22:38:36",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu96jv",
    "parent_id": "t1_ctu87iu",
    "subreddit_name_prefixed": "r/news",
    "body": "Mega evolution. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438936191.0,
    "date_created": "2015-08-06",
    "time_created": "20:29:51",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6xyo",
    "parent_id": "t1_ctu68fd",
    "subreddit_name_prefixed": "r/news",
    "body": "I agree entirely. When I was in LA in the 90s, it was a lot like the LAPD song by Offspring. \n\nThey weren't kidding, the LAPD were the nastiest thugs in the area. Hands down.",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1438932315.0,
    "date_created": "2015-08-06",
    "time_created": "19:25:15",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu70pg",
    "parent_id": "t1_ctu5zov",
    "subreddit_name_prefixed": "r/news",
    "body": "https://en.m.wikipedia.org/wiki/Killing_of_Kenneth_Chamberlain,_Sr.",
    "controversiality": 0,
    "ups": 81,
    "downs": 0,
    "score": 81,
    "created": 1438932436.0,
    "date_created": "2015-08-06",
    "time_created": "19:27:16",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu9wfi",
    "parent_id": "t1_ctu9m83",
    "subreddit_name_prefixed": "r/news",
    "body": "I have the same experience. To me a \"Social Justice Warrior\" is simply someone who gets involved in a situation that doesn't affect them acutely to promote a cause they believe in. When they join a shared view, they are welcomed, when they are attached to an opposing view, it's a pejorative. Like you said, a meaningless term.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1438937490.0,
    "date_created": "2015-08-06",
    "time_created": "20:51:30",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6xem",
    "parent_id": "t1_ctu5kay",
    "subreddit_name_prefixed": "r/news",
    "body": "> Officer Joseph Weekley \n\nHe's back on the job today, btw.",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1438932290.0,
    "date_created": "2015-08-06",
    "time_created": "19:24:50",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu64t2",
    "parent_id": "t1_ctu5kay",
    "subreddit_name_prefixed": "r/news",
    "body": "[\"Aiyana Jones\"]\n\n49,300 hits on google.\n\n[\"Michael Brown\" shooting]\n\n5,960,000\n\nJust too clear cut. It's not social media outrage material.",
    "controversiality": 0,
    "ups": 209,
    "downs": 0,
    "score": 209,
    "created": 1438930979.0,
    "date_created": "2015-08-06",
    "time_created": "19:02:59",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu7a5w",
    "parent_id": "t1_ctu5kay",
    "subreddit_name_prefixed": "r/news",
    "body": "That's what happens when nobody gives a flying fuck.\n\nIf you're not taking to the streets over an issue, you have no voice as an average citizen. It's really that simple, and it's never going to change unless it starts being used regularly. ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1438932863.0,
    "date_created": "2015-08-06",
    "time_created": "19:34:23",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6wjx",
    "parent_id": "t1_ctu5kay",
    "subreddit_name_prefixed": "r/news",
    "body": "How does this happen? How does a jury see this and go \"Yeah, I'm sure he had a good reason for shooting that little girl.\"?",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1438932250.0,
    "date_created": "2015-08-06",
    "time_created": "19:24:10",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6jgk",
    "parent_id": "t1_ctu56j4",
    "subreddit_name_prefixed": "r/news",
    "body": "http://www.huffingtonpost.com/2014/09/17/aiyana-stanley-jones-joseph-weekley-trial_n_5824684.html \n\nThis one should have gotten some attention too",
    "controversiality": 0,
    "ups": 54,
    "downs": 0,
    "score": 54,
    "created": 1438931678.0,
    "date_created": "2015-08-06",
    "time_created": "19:14:38",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5mko",
    "parent_id": "t1_ctu5f3r",
    "subreddit_name_prefixed": "r/news",
    "body": "Read the article he linked, that's where he got the idea from (I guess), it's really good. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1438930149.0,
    "date_created": "2015-08-06",
    "time_created": "18:49:09",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4o88",
    "parent_id": "t1_ctu42nd",
    "subreddit_name_prefixed": "r/news",
    "body": "no they just glowed blue. blood was still red.",
    "controversiality": 0,
    "ups": 661,
    "downs": 0,
    "score": 661,
    "created": 1438928566.0,
    "date_created": "2015-08-06",
    "time_created": "18:22:46",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu20b5",
    "parent_id": "t1_ctu1hyo",
    "subreddit_name_prefixed": "r/news",
    "body": "People like you will help to heal this country. I thank you for all you do and all you have done. you probably don't get nearly enough respect and appreciation for all this but I for on will never forget. Thank you!",
    "controversiality": 0,
    "ups": 81,
    "downs": 0,
    "score": 81,
    "created": 1438924456.0,
    "date_created": "2015-08-06",
    "time_created": "17:14:16",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu1ptl",
    "parent_id": "t1_ctu1hyo",
    "subreddit_name_prefixed": "r/news",
    "body": "More white people should be like you.",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1438924035.0,
    "date_created": "2015-08-06",
    "time_created": "17:07:15",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu7sj2",
    "parent_id": "t1_ctu1hyo",
    "subreddit_name_prefixed": "r/news",
    "body": "this is what I've been trying to tell people. as a black person, people write me off when I complain about police brutality. but blacks aren't the only victims and race isn't the only factor. \n\nthe real issue is police overstepping laws and the courts and departments protecting them. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438933714.0,
    "date_created": "2015-08-06",
    "time_created": "19:48:34",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu41qm",
    "parent_id": "t1_ctu2nz2",
    "subreddit_name_prefixed": "r/news",
    "body": "Police use of excessive force is always an outrage regardless of who the victim is. But if you imagine black people don't experience the brunt of excessive police force, then... well, you have a pretty darned good imagination. The media didn't just arbitrarily spin police brutality as a racial issue. The racial angle is there, and it's real. It's just that it isn't the *only* angle.  ",
    "controversiality": 0,
    "ups": 137,
    "downs": 0,
    "score": 137,
    "created": 1438927582.0,
    "date_created": "2015-08-06",
    "time_created": "18:06:22",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu9eqw",
    "parent_id": "t1_ctu2nz2",
    "subreddit_name_prefixed": "r/news",
    "body": "> We need a national organization like the NAACP that focuses on cop brutality issues for people of all races.\n\nWe do. It's called the ACLU.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438936607.0,
    "date_created": "2015-08-06",
    "time_created": "20:36:47",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4oup",
    "parent_id": "t1_ctu40t6",
    "subreddit_name_prefixed": "r/news",
    "body": "European immigrants have had trouble, too.  Unfortunately, we as a species just love to divide everybody into groups.",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1438928593.0,
    "date_created": "2015-08-06",
    "time_created": "18:23:13",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5cn4",
    "parent_id": "t1_ctu40t6",
    "subreddit_name_prefixed": "r/news",
    "body": "Aren't the English-descended white people the first Americans to do that? \n\n",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1438929687.0,
    "date_created": "2015-08-06",
    "time_created": "18:41:27",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuaz0b",
    "parent_id": "t1_ctu5ly4",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438939417.0,
    "date_created": "2015-08-06",
    "time_created": "21:23:37",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctue0x0",
    "parent_id": "t1_ctua1am",
    "subreddit_name_prefixed": "r/news",
    "body": "This particular individual attempted to flee the scene in a threatening manner and subsequently attempted to merge my bullets with his body. At this moment i assisted the bullets into his body wherupon he decided to release his blood at me in a threatening and assaultive manner causing me to fear for my safety and he ultimately brought his heart to a stopped position in an attempt to frighten me so i shot him again.",
    "controversiality": 0,
    "ups": 528,
    "downs": 0,
    "score": 528,
    "created": 1438944868.0,
    "date_created": "2015-08-06",
    "time_created": "22:54:28",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctubrg5",
    "parent_id": "t1_ctua1am",
    "subreddit_name_prefixed": "r/news",
    "body": "His body had high lead count. ",
    "controversiality": 0,
    "ups": 615,
    "downs": 0,
    "score": 615,
    "created": 1438940836.0,
    "date_created": "2015-08-06",
    "time_created": "21:47:16",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctucmr0",
    "parent_id": "t1_ctua1am",
    "subreddit_name_prefixed": "r/news",
    "body": "Guy had holes in his heart. We tried to plug them with lead, but the our heroic efforts were in vain.",
    "controversiality": 0,
    "ups": 133,
    "downs": 0,
    "score": 133,
    "created": 1438942387.0,
    "date_created": "2015-08-06",
    "time_created": "22:13:07",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctucgig",
    "parent_id": "t1_ctua1am",
    "subreddit_name_prefixed": "r/news",
    "body": "It wasn't the media's fault he was white ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1438942076.0,
    "date_created": "2015-08-06",
    "time_created": "22:07:56",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctufoe1",
    "parent_id": "t1_ctua1am",
    "subreddit_name_prefixed": "r/news",
    "body": "Pre-existing condition. By the time he was in police custody, he already had bullets in him, so they thought that was just normal for the kid. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438948059.0,
    "date_created": "2015-08-06",
    "time_created": "23:47:39",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctucbp3",
    "parent_id": "t1_ctuakjx",
    "subreddit_name_prefixed": "r/news",
    "body": "Exactly. Look both ways before crossing the shooting range/Hardee's parking lot ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1438941841.0,
    "date_created": "2015-08-06",
    "time_created": "22:04:01",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuhro4",
    "parent_id": "t1_ctuakjx",
    "subreddit_name_prefixed": "r/news",
    "body": ">both bullets entered Hammond’s body from the back\n\n*Moon*walked into those bullets.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438952584.0,
    "date_created": "2015-08-07",
    "time_created": "01:03:04",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctubos4",
    "parent_id": "t1_ctu679e",
    "subreddit_name_prefixed": "r/news",
    "body": "Makes me think of the first Shrek movie where the pig says \"he huffed and he puffed and he... Signed an eviction notice...\" \r\rThat's how I read it :P",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1438940703.0,
    "date_created": "2015-08-06",
    "time_created": "21:45:03",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5rxb",
    "parent_id": "t1_ctu5fv2",
    "subreddit_name_prefixed": "r/news",
    "body": "The Thickburger Gambit.",
    "controversiality": 0,
    "ups": 48,
    "downs": 0,
    "score": 48,
    "created": 1438930392.0,
    "date_created": "2015-08-06",
    "time_created": "18:53:12",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu9yu6",
    "parent_id": "t1_ctu9i3q",
    "subreddit_name_prefixed": "r/news",
    "body": "Thanks! I'm gonna get like dozens more followers!",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438937611.0,
    "date_created": "2015-08-06",
    "time_created": "20:53:31",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6u3s",
    "parent_id": "t1_ctu5vvt",
    "subreddit_name_prefixed": "r/news",
    "body": "\"I'm going to my union rep!\"",
    "controversiality": 0,
    "ups": 116,
    "downs": 0,
    "score": 116,
    "created": 1438932143.0,
    "date_created": "2015-08-06",
    "time_created": "19:22:23",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuc0u2",
    "parent_id": "t1_ctu6j9a",
    "subreddit_name_prefixed": "r/news",
    "body": "\"Dammit Kevin, can't you just stick to the easy targets like I showed you?",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1438941304.0,
    "date_created": "2015-08-06",
    "time_created": "21:55:04",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu7jgh",
    "parent_id": "t1_ctu67qc",
    "subreddit_name_prefixed": "r/news",
    "body": "Hey, uh, do you have that police report about the shooting? I mean, soon the DA is gonna be up my ass and rightly so cuz, you know, when you shoot an unarmed civilian and fail to report it, you enter a sacred trust!",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1438933287.0,
    "date_created": "2015-08-06",
    "time_created": "19:41:27",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuolks",
    "parent_id": "t1_ctunr7x",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 45,
    "downs": 0,
    "score": 45,
    "created": 1438976775.0,
    "date_created": "2015-08-07",
    "time_created": "07:46:15",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctukk0c",
    "parent_id": "t1_ctue7ip",
    "subreddit_name_prefixed": "r/news",
    "body": "Yes, the day after.",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1438960572.0,
    "date_created": "2015-08-07",
    "time_created": "03:16:12",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctugkvs",
    "parent_id": "t1_ctud45x",
    "subreddit_name_prefixed": "r/news",
    "body": "They charged the cop with murder",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1438949907.0,
    "date_created": "2015-08-07",
    "time_created": "00:18:27",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctua23f",
    "parent_id": "t1_ctu938w",
    "subreddit_name_prefixed": "r/news",
    "body": "A fucking first date with the girl, the one who ACTUALLY had drugs. \n\nFucking A. ",
    "controversiality": 0,
    "ups": 278,
    "downs": 0,
    "score": 278,
    "created": 1438937772.0,
    "date_created": "2015-08-06",
    "time_created": "20:56:12",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctul5kx",
    "parent_id": "t1_ctuc2vn",
    "subreddit_name_prefixed": "r/news",
    "body": "Going to jail for weed is bad enough already, but how could anyone think shooting someone over it would be the right thing to do??",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1438962707.0,
    "date_created": "2015-08-07",
    "time_created": "03:51:47",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuhnm1",
    "parent_id": "t1_ctu91p2",
    "subreddit_name_prefixed": "r/news",
    "body": ">200$ or more here in Seneca.\n\nThat's some murder in and of itself. ",
    "controversiality": 0,
    "ups": 51,
    "downs": 0,
    "score": 51,
    "created": 1438952320.0,
    "date_created": "2015-08-07",
    "time_created": "00:58:40",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctugk0w",
    "parent_id": "t1_ctu91p2",
    "subreddit_name_prefixed": "r/news",
    "body": "Damn homie you getting ripped off",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438949854.0,
    "date_created": "2015-08-07",
    "time_created": "00:17:34",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctucdju",
    "parent_id": "t1_ctubf3h",
    "subreddit_name_prefixed": "r/news",
    "body": "Juking the stats.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438941928.0,
    "date_created": "2015-08-06",
    "time_created": "22:05:28",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu70ug",
    "parent_id": "t1_ctu6xyo",
    "subreddit_name_prefixed": "r/news",
    "body": "fun fact about the LAPD; when the klan got disbanded in LA, all the old members just became cops and that's why the LAPD got so notoriously horrible (that happened in a lot of cities but it was a concentrated effort in LA)\n\nThe klan encouraged their members to be in positions of power.  Cops, politicians, government agencies were the jobs you wanted to have.  Any place you could potentially fuck over black people they wanted you there.",
    "controversiality": 0,
    "ups": 61,
    "downs": 0,
    "score": 61,
    "created": 1438932442.0,
    "date_created": "2015-08-06",
    "time_created": "19:27:22",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8niw",
    "parent_id": "t1_ctu6xyo",
    "subreddit_name_prefixed": "r/news",
    "body": "[LAPD by The Offspring] (https://www.youtube.com/watch?v=jL6-oFPeNco)\n\nWow, I'm surprised anyone remembered this song enough to reference it. I was going to use it as a comment myself just the other day. It's amazing to me how many punk songs from the early 90's (Bad Religion especially) are still relevant today. It's as if not a damn thing has changed sometimes.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438935241.0,
    "date_created": "2015-08-06",
    "time_created": "20:14:01",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctughwb",
    "parent_id": "t1_ctu70pg",
    "subreddit_name_prefixed": "r/news",
    "body": "What the fuck",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438949729.0,
    "date_created": "2015-08-07",
    "time_created": "00:15:29",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8wwl",
    "parent_id": "t1_ctu64t2",
    "subreddit_name_prefixed": "r/news",
    "body": "To be fair, there are a fair number of \"Michael Brown\"s, including the [infamous former director of FEMA during Hurricane Katrina](https://en.wikipedia.org/wiki/Michael_D._Brown). So it's not exactly an apples-to-apples comparison. \n\nStill, you make a fair point; I follow this issue pretty closely and have never heard of Aiyana Jones.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1438935709.0,
    "date_created": "2015-08-06",
    "time_created": "20:21:49",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuicqx",
    "parent_id": "t1_ctu64t2",
    "subreddit_name_prefixed": "r/news",
    "body": "[\"Columbine shooting\"]\n1,720,000\n\n[\"Columbine\"]\n9,700,000\n\n[\"Cecil the lion\"]\n133,000,000\n\n[\"Cecil the lion shot\"]\n87,300,000\n\n#HumansLivesDon'tMatter? /s \n\nApparently cats really are the supreme race of the internet.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1438954040.0,
    "date_created": "2015-08-07",
    "time_created": "01:27:20",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctub2rn",
    "parent_id": "t1_ctu6wjx",
    "subreddit_name_prefixed": "r/news",
    "body": "Because prosecutors have a conflict of interest when bringing up charges against cops.  If they convict a cop of a crime, the cops will all turn their back to the prosecutor.  If the prosecutor doesn't present a well put together case against the cop, the jury will have no choice but to let the cop off.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1438939611.0,
    "date_created": "2015-08-06",
    "time_created": "21:26:51",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu9kkk",
    "parent_id": "t1_ctu6jgk",
    "subreddit_name_prefixed": "r/news",
    "body": "FUCK. Why did I read that?\n\n\nMaybe I'm a pussy but I've been crying over that for like 10 minutes.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1438936904.0,
    "date_created": "2015-08-06",
    "time_created": "20:41:44",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctug5ov",
    "parent_id": "t1_ctu6jgk",
    "subreddit_name_prefixed": "r/news",
    "body": "Your correct it should have gotten more attention but it did not because the public did not react in the same way and in the same  scale and magnitude as it did with the Michael Brown case. We as a society should not be relying on mass media to start the public outrage. Society should start and fuel the outrage first so that the mass media had no choice but to cover the story and fan the flames of the outrage. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438949022.0,
    "date_created": "2015-08-07",
    "time_created": "00:03:42",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6636",
    "parent_id": "t1_ctu5mko",
    "subreddit_name_prefixed": "r/news",
    "body": "I'd thought something similar before but the blog in question articulates it vastly better than I ever would have. ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1438931040.0,
    "date_created": "2015-08-06",
    "time_created": "19:04:00",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4ymt",
    "parent_id": "t1_ctu4o88",
    "subreddit_name_prefixed": "r/news",
    "body": "And that was due to bioluminescent bacteria ",
    "controversiality": 0,
    "ups": 350,
    "downs": 0,
    "score": 350,
    "created": 1438929029.0,
    "date_created": "2015-08-06",
    "time_created": "18:30:29",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu1wgt",
    "parent_id": "t1_ctu1ptl",
    "subreddit_name_prefixed": "r/news",
    "body": "aw, thanks DaJango :)",
    "controversiality": 0,
    "ups": 59,
    "downs": 0,
    "score": 59,
    "created": 1438924301.0,
    "date_created": "2015-08-06",
    "time_created": "17:11:41",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4tl4",
    "parent_id": "t1_ctu41qm",
    "subreddit_name_prefixed": "r/news",
    "body": ">The media didn't just arbitrarily spin police brutality as a racial issue.\n\nBoth sides of the media cause the other side to be more racist by exaggerating and fabricating many things. This causes more viewership and higher ratings, meaning they get more income by perpetuating racism, instead of finding ways to help America progress on this topic. We made a lot of progress on gay marriage... we should be able to get past race just as easily. Here's some notable examples, although this isn't even scratching the surface: \n\n\n[MSNBC caught cropping video to make black guy appear white.](https://www.youtube.com/watch?v=fvBQDHqdCck) (this is the most outrageous example)\n\n\n[Time Magazine edited OJ Simpson's face to make him appear darker](http://www.cnet.com/pictures/pictures-that-lie-photos/16/)\n\n[NBC edited the Zimmerman tapes to make him appear racist, issues apology and claims it was a \"screw-up.\"](https://www.washingtonpost.com/blogs/erik-wemple/post/nbc-issues-apology-on-zimmerman-tape-screw-up/2012/04/03/gIQA8m5jtS_blog.html) (the damage was already done, however.)\n\n[Photo showing Zimmerman's bruised and beaten face was withheld for quite some time.](http://www.foxnews.com/us/2012/12/03/newly-released-photo-shows-bloodied-george-zimmerman-from-night-trayvon-martin/)\n\n[Fox news anchor sick of Fox News' race baiting](https://www.youtube.com/watch?v=UIcB_xFsz3w)\n\nEtc, etc. When they are caught, they always come up with a reasonable explanation (The OJ Simpson example was explained as \"we just tried making him seem more sinister\", but some of us know what they're up to.)",
    "controversiality": 0,
    "ups": 47,
    "downs": 0,
    "score": 47,
    "created": 1438928799.0,
    "date_created": "2015-08-06",
    "time_created": "18:26:39",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu63l2",
    "parent_id": "t1_ctu4oup",
    "subreddit_name_prefixed": "r/news",
    "body": "and as time when on, those dirty Irish become upstanding americans, those fucking greasy Italian immigrants on the other hand...oh wait they became \"white\" too. ",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1438930920.0,
    "date_created": "2015-08-06",
    "time_created": "19:02:00",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuhy74",
    "parent_id": "t1_ctue0x0",
    "subreddit_name_prefixed": "r/news",
    "body": "Reads like a real police report.",
    "controversiality": 0,
    "ups": 126,
    "downs": 0,
    "score": 126,
    "created": 1438953032.0,
    "date_created": "2015-08-07",
    "time_created": "01:10:32",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuhi6f",
    "parent_id": "t1_ctue0x0",
    "subreddit_name_prefixed": "r/news",
    "body": "Good work Sam!",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438951959.0,
    "date_created": "2015-08-07",
    "time_created": "00:52:39",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctufg9u",
    "parent_id": "t1_ctubrg5",
    "subreddit_name_prefixed": "r/news",
    "body": "He had ingested fatal amounts of lead through his back.",
    "controversiality": 0,
    "ups": 239,
    "downs": 0,
    "score": 239,
    "created": 1438947619.0,
    "date_created": "2015-08-06",
    "time_created": "23:40:19",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctujzbk",
    "parent_id": "t1_ctucmr0",
    "subreddit_name_prefixed": "r/news",
    "body": "We applied the cortical electrodes, but were unable to get a neural reaction from either patient. ",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1438958683.0,
    "date_created": "2015-08-07",
    "time_created": "02:44:43",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuh65m",
    "parent_id": "t1_ctucmr0",
    "subreddit_name_prefixed": "r/news",
    "body": "In vein? ",
    "controversiality": 0,
    "ups": 71,
    "downs": 0,
    "score": 71,
    "created": 1438951198.0,
    "date_created": "2015-08-07",
    "time_created": "00:39:58",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuhl8u",
    "parent_id": "t1_ctucmr0",
    "subreddit_name_prefixed": "r/news",
    "body": "*Those are speed holes*.\n\n*They make the heart go faster*. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1438952164.0,
    "date_created": "2015-08-07",
    "time_created": "00:56:04",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8eba",
    "parent_id": "t1_ctu6u3s",
    "subreddit_name_prefixed": "r/news",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1438934782.0,
    "date_created": "2015-08-06",
    "time_created": "20:06:22",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuj5ip",
    "parent_id": "t1_ctu6u3s",
    "subreddit_name_prefixed": "r/news",
    "body": "Worked in internal affairs for a bit post-college. This was pretty much spouted daily. \n\nNot that what we did/recommended mattered. It was up to the DA and they wouldn't prosecute shit (if it even got that far. Absolute joke)",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438956178.0,
    "date_created": "2015-08-07",
    "time_created": "02:02:58",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8tep",
    "parent_id": "t1_ctu7jgh",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm just sick about the whole thing. I'll tell us what. I'll bring the report tomorrow, along with a copy of the Godfather and a bottle of Scotch. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1438935533.0,
    "date_created": "2015-08-06",
    "time_created": "20:18:53",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctunv2d",
    "parent_id": "t1_ctukk0c",
    "subreddit_name_prefixed": "r/news",
    "body": "A little less to protest about in this case. It becomes just a tragedy and not an injustice.",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1438974178.0,
    "date_created": "2015-08-07",
    "time_created": "07:02:58",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctupcla",
    "parent_id": "t1_ctua23f",
    "subreddit_name_prefixed": "r/news",
    "body": "Honestly, if I went on a first date and during the date we pulled in for ice cream, then police stormed the vehicle and murdered me while trying to grab less than a fistful of weed from the girl, I think that would be it - there would be no second date. Gotta draw the line somewhere.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1438979015.0,
    "date_created": "2015-08-07",
    "time_created": "08:23:35",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctufatk",
    "parent_id": "t1_ctua23f",
    "subreddit_name_prefixed": "r/news",
    "body": "Jesus Christ on the cross",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1438947322.0,
    "date_created": "2015-08-06",
    "time_created": "23:35:22",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuq4fy",
    "parent_id": "t1_ctuhnm1",
    "subreddit_name_prefixed": "r/news",
    "body": "$20/g is pretty standard in a lot of places where it isn't legalized. For \"good\" stuff. I've seen it at 25$ even. \n\n Although usually at that much volume they'll give you a little discount...",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438981041.0,
    "date_created": "2015-08-07",
    "time_created": "08:57:21",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu73lq",
    "parent_id": "t1_ctu70ug",
    "subreddit_name_prefixed": "r/news",
    "body": "I did not know that - but it makes sense. I was in absolute terror when I lived down there. The violence levels in LA were the worst I ever experienced.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1438932565.0,
    "date_created": "2015-08-06",
    "time_created": "19:29:25",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctui2ns",
    "parent_id": "t1_ctu70ug",
    "subreddit_name_prefixed": "r/news",
    "body": "I'd rather a squad of rooftop Koreans over Klan cops tbh",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1438953343.0,
    "date_created": "2015-08-07",
    "time_created": "01:15:43",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu8pcb",
    "parent_id": "t1_ctu70ug",
    "subreddit_name_prefixed": "r/news",
    "body": "I've heard the Huntington Beach area has a particularly large percentage of these folks, though they went more of the biker route than cop.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438935333.0,
    "date_created": "2015-08-06",
    "time_created": "20:15:33",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu95wl",
    "parent_id": "t1_ctu8wwl",
    "subreddit_name_prefixed": "r/news",
    "body": "It's why I added \"shooting\" to that one. I'm trying to be specific with the larger search and more forgiving with the smaller so that I err in the opposite direction from my claim. ",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1438936156.0,
    "date_created": "2015-08-06",
    "time_created": "20:29:16",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctua5jo",
    "parent_id": "t1_ctu9kkk",
    "subreddit_name_prefixed": "r/news",
    "body": "You're not a pussy, you're a decent human being. Fuck everyone involved in that case who let that scum get off Scott free.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1438937936.0,
    "date_created": "2015-08-06",
    "time_created": "20:58:56",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu56up",
    "parent_id": "t1_ctu4ymt",
    "subreddit_name_prefixed": "r/news",
    "body": "That produced a antibiotic.",
    "controversiality": 0,
    "ups": 244,
    "downs": 0,
    "score": 244,
    "created": 1438929414.0,
    "date_created": "2015-08-06",
    "time_created": "18:36:54",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu2sil",
    "parent_id": "t1_ctu1wgt",
    "subreddit_name_prefixed": "r/news",
    "body": "Man, you can't spell *anyones* name correctly.",
    "controversiality": 0,
    "ups": 110,
    "downs": 0,
    "score": 110,
    "created": 1438925643.0,
    "date_created": "2015-08-06",
    "time_created": "17:34:03",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu1zxf",
    "parent_id": "t1_ctu1wgt",
    "subreddit_name_prefixed": "r/news",
    "body": "The D is silent, but you're welcome. ;)",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1438924440.0,
    "date_created": "2015-08-06",
    "time_created": "17:14:00",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu276k",
    "parent_id": "t1_ctu1wgt",
    "subreddit_name_prefixed": "r/news",
    "body": "The \"D\" is silent, I believe.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1438924740.0,
    "date_created": "2015-08-06",
    "time_created": "17:19:00",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctufifi",
    "parent_id": "t1_ctu63l2",
    "subreddit_name_prefixed": "r/news",
    "body": "An interesting phenomenon is that everything they used to say about the Irish in the 19th century was later said about the blacks. The Irish were supposed to be brutish and subhuman, closer to animals, not as able to control their impulses, licentious, more musical and instinctual. This shows that a degree of psychological projection is going on. These things are in the mind of the racist and he projects them onto some group of \"others\". ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438947736.0,
    "date_created": "2015-08-06",
    "time_created": "23:42:16",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctummc9",
    "parent_id": "t1_ctuhy74",
    "subreddit_name_prefixed": "r/news",
    "body": "I lost it at\n\n>brought his heart to a stopped position",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1438969105.0,
    "date_created": "2015-08-07",
    "time_created": "05:38:25",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctugnad",
    "parent_id": "t1_ctufg9u",
    "subreddit_name_prefixed": "r/news",
    "body": "Natural causes. Because  naturally you  die from gunshot wounds. ",
    "controversiality": 0,
    "ups": 222,
    "downs": 0,
    "score": 222,
    "created": 1438950052.0,
    "date_created": "2015-08-07",
    "time_created": "00:20:52",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctubrrp",
    "parent_id": "t1_ctu8eba",
    "subreddit_name_prefixed": "r/news",
    "body": "I hope you learned your lesson!",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1438940853.0,
    "date_created": "2015-08-06",
    "time_created": "21:47:33",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "cturr5l",
    "parent_id": "t1_ctupcla",
    "subreddit_name_prefixed": "r/news",
    "body": "IMHO, this seems a bit harsh, but I get where you're coming from. I guess everyone has their limits. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1438984500.0,
    "date_created": "2015-08-07",
    "time_created": "09:55:00",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuyvqy",
    "parent_id": "t1_ctupcla",
    "subreddit_name_prefixed": "r/news",
    "body": "I know right?! Being murdered seriously cramps my style. My game just goes out the window, along with a good chunk of my blood supply. Damn cockblocking cops",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438995515.0,
    "date_created": "2015-08-07",
    "time_created": "12:58:35",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctugmjr",
    "parent_id": "t1_ctufatk",
    "subreddit_name_prefixed": "r/news",
    "body": "Spear piercing his side. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1438950008.0,
    "date_created": "2015-08-07",
    "time_created": "00:20:08",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu76pl",
    "parent_id": "t1_ctu73lq",
    "subreddit_name_prefixed": "r/news",
    "body": "LA is the result of decades of intense gentrification and horrible urban planning  \n\nIt's really a miracle that place hasn't completely gone to shit a la Detroit\n\nIf it wasn't for the entertainment industry it would of a long time ago",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1438932702.0,
    "date_created": "2015-08-06",
    "time_created": "19:31:42",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuas97",
    "parent_id": "t1_ctu95wl",
    "subreddit_name_prefixed": "r/news",
    "body": "Hell, [\"michael brown\" shooting ferguson] gets you 948,000. \n\nExcellent point.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1438939066.0,
    "date_created": "2015-08-06",
    "time_created": "21:17:46",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctucvz6",
    "parent_id": "t1_ctu95wl",
    "subreddit_name_prefixed": "r/news",
    "body": "Ugh. Missed that. Good point.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1438942850.0,
    "date_created": "2015-08-06",
    "time_created": "22:20:50",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuagxj",
    "parent_id": "t1_ctua5jo",
    "subreddit_name_prefixed": "r/news",
    "body": "Gosh, I want to know more info but honestly right now I don't have the emotional capacity to endure any research. I'll have to look back into it later...\n\n\nThe poor girl didn't have a chance to god damn live a life !!\n\nAnd her poor family... They must feel so defeated and hopeless. Like what the fuck can they do? Nothing! The MURDERERS won't be held accountable for their actions. Their child/sister/niece/granddaughter/whatever 's life was wasted, ruined, STOLEN. And in the same fucking breath all of their lives were too.\n\nIt is just so horrible. My heart breaks for them, and I'm literally weeping for them. Argh =\\\n\n",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1438938490.0,
    "date_created": "2015-08-06",
    "time_created": "21:08:10",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5bk8",
    "parent_id": "t1_ctu56up",
    "subreddit_name_prefixed": "r/news",
    "body": "That prevented infection.",
    "controversiality": 0,
    "ups": 211,
    "downs": 0,
    "score": 211,
    "created": 1438929636.0,
    "date_created": "2015-08-06",
    "time_created": "18:40:36",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu3qrh",
    "parent_id": "t1_ctu2sil",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah, listen to Empirelist.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1438927107.0,
    "date_created": "2015-08-06",
    "time_created": "17:58:27",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu4lp6",
    "parent_id": "t1_ctu1zxf",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1438928454.0,
    "date_created": "2015-08-06",
    "time_created": "18:20:54",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu3v3s",
    "parent_id": "t1_ctu1zxf",
    "subreddit_name_prefixed": "r/news",
    "body": "*shoots /u/jstrydor in both knees anyway, rides off.*",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1438927293.0,
    "date_created": "2015-08-06",
    "time_created": "18:01:33",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu5pdp",
    "parent_id": "t1_ctu276k",
    "subreddit_name_prefixed": "r/news",
    "body": "But deadly.  I mean, have you ever heard of a dangerous gunslinger named Jango?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438930276.0,
    "date_created": "2015-08-06",
    "time_created": "18:51:16",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctupubw",
    "parent_id": "t1_ctugnad",
    "subreddit_name_prefixed": "r/news",
    "body": "The gunshot has nothing to do with the cause of death. I blame the EMT for not saving his life by applying the correct pressure to the wounds.  \n  \nBut then i blame mother nature for not giving this kid bullet proof skin like the rest of us. Just natural selection.  \n  \nThis is what the US has been doing for years. Shooting everyone in the hopes they develop bullet prove qualities giving their armed forces an advantage over every other armed forces in the world.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1438980325.0,
    "date_created": "2015-08-07",
    "time_created": "08:45:25",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuh295",
    "parent_id": "t1_ctugnad",
    "subreddit_name_prefixed": "r/news",
    "body": "Maybe he was like Sandra Bland and he ingested large amounts of marijuana beforehand. O wait, no, he was murdered/arrested while buying his marijuana. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1438950957.0,
    "date_created": "2015-08-07",
    "time_created": "00:35:57",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctubamu",
    "parent_id": "t1_ctu76pl",
    "subreddit_name_prefixed": "r/news",
    "body": "The entertainment industry is like 10 percent of the LA economy. There is much more to the economy there than that. With that weather and that setting, LA will always attract folks. Can't compare that to the below freezing temps and muggy summers in Detroit. LA is a world city that is here to stay. Detroit was just a regional powerhouse.\n\nEdit: Besides entertainment, you have the largest container port in the US, aerospace (JPL, Cal Tech), tourism, manufacturing, tech/IT, banking and finance, and a few others. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1438940011.0,
    "date_created": "2015-08-06",
    "time_created": "21:33:31",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu64fm",
    "parent_id": "t1_ctu5bk8",
    "subreddit_name_prefixed": "r/news",
    "body": "Wasn't it called \"angels glow\" how do I know this...",
    "controversiality": 0,
    "ups": 184,
    "downs": 0,
    "score": 184,
    "created": 1438930961.0,
    "date_created": "2015-08-06",
    "time_created": "19:02:41",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuemxr",
    "parent_id": "t1_ctu5bk8",
    "subreddit_name_prefixed": "r/news",
    "body": "That swallowed the fly.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438946024.0,
    "date_created": "2015-08-06",
    "time_created": "23:13:44",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu81n0",
    "parent_id": "t1_ctu3qrh",
    "subreddit_name_prefixed": "r/news",
    "body": "1. Roman Empire\n2. Ottoman Empire\n3. British Empire\netc.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438934159.0,
    "date_created": "2015-08-06",
    "time_created": "19:55:59",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctuiwmx",
    "parent_id": "t1_ctuh295",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm honestly fucking sick of marijuana usage being used as practically \"he/she deserved to die\". I know it's illegal, but for fuck's sake.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1438955486.0,
    "date_created": "2015-08-07",
    "time_created": "01:51:26",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctue24o",
    "parent_id": "t1_ctubamu",
    "subreddit_name_prefixed": "r/news",
    "body": "Detroit was called the \"Paris of the West\" in the late 1800s. It took a tumble to be sure, but it was much more than a regional powerhouse.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1438944927.0,
    "date_created": "2015-08-06",
    "time_created": "22:55:27",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu6iiq",
    "parent_id": "t1_ctu64fm",
    "subreddit_name_prefixed": "r/news",
    "body": "maybe cuz it was on TIL like a few days ago",
    "controversiality": 0,
    "ups": 331,
    "downs": 0,
    "score": 331,
    "created": 1438931634.0,
    "date_created": "2015-08-06",
    "time_created": "19:13:54",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu73ku",
    "parent_id": "t1_ctu64fm",
    "subreddit_name_prefixed": "r/news",
    "body": "It's been posted on TIL about 324 times ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1438932564.0,
    "date_created": "2015-08-06",
    "time_created": "19:29:24",
    "submission_id": "news-3g1nxm"
  },
  {
    "id": "ctu77tm",
    "parent_id": "t1_ctu64fm",
    "subreddit_name_prefixed": "r/news",
    "body": "The reddit is in you",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1438932754.0,
    "date_created": "2015-08-06",
    "time_created": "19:32:34",
    "submission_id": "news-3g1nxm"
  }
]