[
  {
    "id": "dcbyjud",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "Clarification here, CVS cut the retail price of the existing generic for Adrenaclick (known as Epinephrine).\n\nThis generic has been around for a while, but isn't an A/B rated generic so it's illegal for a pharmacy to dispense this if a prescription is written for EpiPen. We can dispense this if a prescription is written for Adrenaclick or Epinephrine.\n\n**Make sure your doctor writes a script for Adrenaclick or it is illegal for us to dispense this cheaper generic to you**\n\nEdit: The injection device of each product is what limits the A/B rating. Adrenaclick and EpiPen have different autoinjector systems. Yes the regulations are that strict. [Here's](https://www.youtube.com/watch?v=LRgqwgCh4Fs) a video showing the difference between Adrenaclick, Epipen, and AuviQ (which has been recalled and discontinued).",
    "controversiality": 0,
    "ups": 14323,
    "downs": 0,
    "score": 14323,
    "created": 1484261063.0,
    "date_created": "2017-01-12",
    "time_created": "09:44:23",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc52xo",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "My grandpa's a local rancher so we always have meat and animal organs at our house for eating. I'm alergic to nuts and one time i didn't have an epipen so my grandpa went to the fridge cut off the adrenal glands from the kidney of I think a pig. Anyway he cut it in half and told me to put it under my Lip Like tobacco and my airways opened up about 1 minute later. He drove me to the hospital I got steroid injections to treat the reaction, but the docter was dumbfounded on what my grandpa did. Turns when my grandpa first became a rancher pharmaceutical company's were still using animal organs to make hormones. He use to sell organs to these company's that's how he new what to do. So what I don't get is why this shit is so expensive yet I can get epi and nore epi from a fucking pig kidney. ",
    "controversiality": 0,
    "ups": 1051,
    "downs": 0,
    "score": 1051,
    "created": 1484269020.0,
    "date_created": "2017-01-12",
    "time_created": "11:57:00",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4x02",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "Another Edit: First thank you to whoever gave me gold! \n\nSecond, /u/Jahodac is right with pretty much everything he said here (https://www.reddit.com/r/news/comments/5njj2x/cvs_puts_out_generic_competitor_to_epipen_at_a/dcclw19/). Thank you for bringing all that up. \n\nThere is a manufacturer discount from Mylan as I mention below that can save up to $300 (https://www.activatethecard.com). It doesn't work if you don't have insurance and personally for me, it only took $100 off but perhaps it was going towards my huge ass deductible. Some redditors have said that as the EpiPen generic is not an A/B generic, its injector is different and perhaps more difficult to use, so it may be worthwhile to get your PCP to prescribe both medicines for you in order to decide what you want. As far as the generic goes, if you download the coupon from the link below, it says out of pocket you can save $300, and since its cash price is only $109, the coupon should make it free for literally everyone.\n\nAnd there are programs like the $4/$10 deal that Walmart and others do. I know CVS/Target uses ScriptSave, and for some maintenance meds it brings it down to $4.\n\nTl;dr: Read the links. \n\nEdit: I found this using the GoodRx app. This is one of the most versatile tools at the hands of patients, doctors, and pharmacy workers alike in keeping drug prices in check and it's FREE! I use it everyday I work whenever I see expensive drugs, and it helps like 80% of the time. It is NOT insurance, and the downside of using its discounts is that your payments won't go to your deductible, but if you're like me, and you'll never reach your deductible, you should give it a shot and compare it to how much insurance will pay. While it doesn't tell you how much your insurance will charge you, it does tell you generally the cheapest(Walmart, although I have heard from some coworkers that Walmart doesn't take GoodRx at all) and most expensive pharmacies (lol CVS most of the time) and provides its own discounts that sometimes beat insurance especially if you have a deductible. The Tips tab on GoodRx can help you find if there are manufacturer coupons you can sign up for. Manufacturer coupons only exist for brand name medications and typically only cover 30 or 90 day supplies, and the 90 day supply is almost always cheaper. GoodRx is accurate almost all the time in displaying coupons, but it isn't for the EpiPen, which just discontinued its full coverage program, instead replacing it with one that could \"potentially\" save you $300. Seriously, screw Mylan Pharmaceuticals. I'm deathly allergic to nuts and legumes so I have to have an epipen and I had to pay $535 out of pocket so this issue is personal to me. \n\nCVS Pharmacy Tech here!\n\nTo clarify you have to get a prescription for ADRENACLICK OR EPINEPHRINE in order for us to fill the medication.\n\n\nThere is also a patient assistance program that will allow you to receive Adrenaclick for free by the manufacturer Impax Laboratories. Here is the website (http://www.epinephrineautoinject.com) Present us the coupon at drop off with your prescription pretty please!",
    "controversiality": 0,
    "ups": 1056,
    "downs": 0,
    "score": 1056,
    "created": 1484268838.0,
    "date_created": "2017-01-12",
    "time_created": "11:53:58",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc0oyl",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "As a single dad of a 9yr old boy who has peanut allergies this is a big relief. Every year around September I have to purchase 4 EpiPens (one for school, one for home, one for his mother's home when he visits her, and one for his cousins home because he loves to sleep over their house). It costs me $635 for a pack of 2, so thats a total of $1,270. This is a huge savings and would help out single parents such as myself. Thank you CVS",
    "controversiality": 0,
    "ups": 2831,
    "downs": 0,
    "score": 2831,
    "created": 1484263912.0,
    "date_created": "2017-01-12",
    "time_created": "10:31:52",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcci1m7",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 87,
    "downs": 0,
    "score": 87,
    "created": 1484283298.0,
    "date_created": "2017-01-12",
    "time_created": "15:54:58",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcbypth",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "Now they just need to stop printing me a 30 foot receipt.",
    "controversiality": 0,
    "ups": 1210,
    "downs": 0,
    "score": 1210,
    "created": 1484261294.0,
    "date_created": "2017-01-12",
    "time_created": "09:48:14",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcbx61f",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "Good to see one corporate entity doing a decent thing. ",
    "controversiality": 0,
    "ups": 704,
    "downs": 0,
    "score": 704,
    "created": 1484259026.0,
    "date_created": "2017-01-12",
    "time_created": "09:10:26",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2s4l",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "I have personally worked with many Mylan employees through my last job; they were a large client of ours. \n\nI can honestly say that every single person I dealt with was a fucking prick and made every second I had to spend talking to and/or dealing with them absolutely miserable. \n\nI cannot tell you how pleasing it has been for me to see them receive backlash for price gouging, be listed as the third most hated company in the states, and now this. I genuinely hope that company burns to the fucking ground. ",
    "controversiality": 0,
    "ups": 339,
    "downs": 0,
    "score": 339,
    "created": 1484266432.0,
    "date_created": "2017-01-12",
    "time_created": "11:13:52",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc270h",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "I work for a sterile injectables manufacturing site and we've been pumping these out like crazy the past few months. It's been insane, but I'm glad people are getting their medicine. ",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1484265738.0,
    "date_created": "2017-01-12",
    "time_created": "11:02:18",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc1mqc",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "I paid $648 for EpiPen's this year. I *loved* her getting drilled by the Senate.",
    "controversiality": 0,
    "ups": 77,
    "downs": 0,
    "score": 77,
    "created": 1484265065.0,
    "date_created": "2017-01-12",
    "time_created": "10:51:05",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc1iv3",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "CVS is so good they also flat out stopped selling cigarettes ",
    "controversiality": 0,
    "ups": 441,
    "downs": 0,
    "score": 441,
    "created": 1484264935.0,
    "date_created": "2017-01-12",
    "time_created": "10:48:55",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc29jg",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "Probably doesn't taste as good as the real thing.",
    "controversiality": 0,
    "ups": 117,
    "downs": 0,
    "score": 117,
    "created": 1484265823.0,
    "date_created": "2017-01-12",
    "time_created": "11:03:43",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc74wl",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "My friend's aunt died this past Christmas day from an allergic reaction to a bee sting.  By the time paramedics arrived, she had been without oxygen for too long, stroked out and died shortly thereafter.  If someone at their family Christmas had an Epipen or Adrenaclick, she would still be alive today.  Instead, her 20-something year old children will go the rest of their lives without a mother.\n\nIt is criminal that something so valuable and life-saving should be sold at such an exorbitant rate.  The estimated cost of Epipen production = $30; Cost = $300; $300/$30 = 1,000% markup, which is on par with the markup of movie theater popcorn.  The fact that the CEO of that pharmaceutical company is the daughter of a US Senator (Joe Manchin) makes this matter wreak of corruption even more than the Martin Schkreli mess.\n\nI'm not usually one to support Bernie or his socialist tendencies, but I'm 100% behind him and his fight against overpriced pharmaceuticals.",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1484271302.0,
    "date_created": "2017-01-12",
    "time_created": "12:35:02",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcclza9",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "Reddit saved my mother $764 today. She told me her insurance wouldn't cover the cost of an epi pen which she needs for her surgery in case of emergency,  and I had just found this thread a couple hours earlier. All she ended up having to pay was $2, thank you CVS and thank you reddit!",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1484287675.0,
    "date_created": "2017-01-12",
    "time_created": "17:07:55",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc6ujh",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "Don't let this distract you from the fact that CVS is a terrible company who treats their pharmacy staff like trash. They grade their pharmacists on everything from script count, how fast they answer the phone, how fast they're on the phone with patients and doctors, quickness in answering voicemail, how fast you fill prescriptions, how fast you process insurance, etc. They expect you to do all of that while filing 300+ a day and with patients choosing to wait there in less than 15 minutes. This is why most CVS pharmacists don't take lunch or bathroom breaks. Some pharmacists I know in Oklahoma actually wear diapers because they don't have the time to use the restroom or state law prevents them from using the restroom.",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1484270981.0,
    "date_created": "2017-01-12",
    "time_created": "12:29:41",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc306f",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1484266692.0,
    "date_created": "2017-01-12",
    "time_created": "11:18:12",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccckkz",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "Adrenaclick sounds like a drug from fallout",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1484277225.0,
    "date_created": "2017-01-12",
    "time_created": "14:13:45",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3tdp",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "Except the cost should be more like $50.  Its a medicine 40 years old using technology developed by the US military (auto-injectors for anti-nerve gas injections etc).\n\nNO patents should currently cover this product, generics should be readily available and produced through a lowest-bid process for things like this.",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1484267603.0,
    "date_created": "2017-01-12",
    "time_created": "11:33:23",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcbzlmg",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "In other news, generic disposable, single use epinephrine shots still cost $50 each.",
    "controversiality": 0,
    "ups": 163,
    "downs": 0,
    "score": 163,
    "created": 1484262504.0,
    "date_created": "2017-01-12",
    "time_created": "10:08:24",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3gj2",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "The Economic Laws of Supply and Demand don't work in the medical arena. Buy or Die is a real thing and a-holes make full use of it.",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1484267198.0,
    "date_created": "2017-01-12",
    "time_created": "11:26:38",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc632p",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm not going to let CVS/Any chain pharmacy get good publicity without mentioning that everyone should call and ask for prices when buying prescriptions. Just last week I decided to call about antibiotics I was prescribed, and the prices were \nCVS=50$, \nwalgreens=50$, \ngrocery=65$, \nand my local pharmacy.. 16$.. \n\nthe markups are insane and they're banking on you just relying on insurance. call for prices!",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1484270150.0,
    "date_created": "2017-01-12",
    "time_created": "12:15:50",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc6fo5",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "First they announce that their pharmacists are required to do their job even if they don't approve of birth control, now they're trying to make medicine available to people who need it?\n\nWhat's the opposite of boycott?",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1484270535.0,
    "date_created": "2017-01-12",
    "time_created": "12:22:15",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcbyll0",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "Ex-CVS employee here. The company makes good PR moves but inevitably is still the same shitty company that pays their employees as little as possible.",
    "controversiality": 0,
    "ups": 123,
    "downs": 0,
    "score": 123,
    "created": 1484261132.0,
    "date_created": "2017-01-12",
    "time_created": "09:45:32",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc41eb",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "I still don't get how that lady was allowed to raise the price that much. It is disgusting behavior. There is a special place in hell for her. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1484267855.0,
    "date_created": "2017-01-12",
    "time_created": "11:37:35",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4s2j",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "Hey look, a reason to go into CVS",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484268682.0,
    "date_created": "2017-01-12",
    "time_created": "11:51:22",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccbl0c",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "I had to use my EpiPen last week during a severe allergic reaction to pecans. It's the second time I've ever used one. Luckily, being 24 I'm still covered under my father's insurance and can get one unbelievably cheap. My current employer does not provide insurance for me, and I certainly don't make enough to afford a $600+ EpiPen. This shit seriously saved my life. I'm so happy to see progress that directly affects me. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1484276128.0,
    "date_created": "2017-01-12",
    "time_created": "13:55:28",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccd3li",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "Good guy CVS saving lives, and also selling Arizona iced tea at a terrific price. Thank you.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484277811.0,
    "date_created": "2017-01-12",
    "time_created": "14:23:31",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccnyng",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "CVS is a good company for this and banning tobacco sales. So not every company is super evil and greedy. Good to know.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1484290002.0,
    "date_created": "2017-01-12",
    "time_created": "17:46:42",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccpvtw",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "This country needs more competition.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1484292384.0,
    "date_created": "2017-01-12",
    "time_created": "18:26:24",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc1idk",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "Coming soon: Walmart epi-pen",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1484264918.0,
    "date_created": "2017-01-12",
    "time_created": "10:48:38",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2mju",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "Look at that, capitalism can work.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1484266255.0,
    "date_created": "2017-01-12",
    "time_created": "11:10:55",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc56u3",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm a doctor working in a GP practice in the UK and my computer tells me off if I try to prescribe any branded medication (except certain formulations where the brand matters like lithium or different preparations of dihydropyridine calcium channel blockers).\n\nAmerican dependence on brands is scary. I went to a US teaching hospital as part of my elective when I was in medical school, and no one uses generic names for anything, allowing the companies to fleece away worse than ever. \n\nHere, the pharmacy department will get you to correct anything that isn't generic. Maybe that's part of why we can afford free universal healthcare ¯\\_(ツ)_/¯",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1484269140.0,
    "date_created": "2017-01-12",
    "time_created": "11:59:00",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc5g6l",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "EpiPen and EpiPen Junior indicative NHS prices as per the latest British National Formulary\n\nhttp://imgur.com/bXtuP3E\n\nYour drug companies are fucking you all right up the arseholes. It works out as $32.29 each injector.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1484269431.0,
    "date_created": "2017-01-12",
    "time_created": "12:03:51",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccg8hg",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "CVS is just a very cool company.  I was really impressed with them when they stopped selling tobacco even though it would cost them millions of dollars.  I actually transferred my prescriptions to them because I respected that move so much.    \n\nOn top of that, they do this now.  Very cool company.  :)",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1484281289.0,
    "date_created": "2017-01-12",
    "time_created": "15:21:29",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4mf6",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "Look another example of competition driving the price down.  We need more of that!",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1484268505.0,
    "date_created": "2017-01-12",
    "time_created": "11:48:25",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3v5w",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "Epipens cost £45.00 each here in the UK, equivalent to $55.00 at the moment.\n\nDon't know how they can justify the prices they have in the US. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484267658.0,
    "date_created": "2017-01-12",
    "time_created": "11:34:18",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3xrc",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "Basically its the government saying they know better, fork over the cash to that guy.\n\nI say make all drugs legal and let it sort its self out",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484267740.0,
    "date_created": "2017-01-12",
    "time_created": "11:35:40",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc48qi",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": ">CVS is now selling a rival, generic version of Mylan’s EpiPen at about a sixth of its price, just months after the maker of the life-saving allergy treatment was eviscerated before Congress because of its soaring cost to consumers.\n\nWell, I guess disembowelment is a fitting punishment. I wonder which congressman did it. Probably ~~the Zodiac Killer~~ Ted Cruz.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484268081.0,
    "date_created": "2017-01-12",
    "time_created": "11:41:21",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4o2t",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "FYI- Adrenaclick is not a traditional \"generic\" — it's a branded version of epenephrine just like the EpiPen.\n\nAlso, Adrenaclick tech is a little wonkier than EpiPen and requires different training for emergency personnel, parents, and school staff.\n\n\n\n",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484268557.0,
    "date_created": "2017-01-12",
    "time_created": "11:49:17",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4p5q",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "At a sixth of the price it's now ridiulously pricey as opposed to astronomical",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484268592.0,
    "date_created": "2017-01-12",
    "time_created": "11:49:52",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4pyj",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "Watch Martin try to buy this one too.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484268617.0,
    "date_created": "2017-01-12",
    "time_created": "11:50:17",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc9503",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "I remember Jason Chaffetz interrogating the Mylan CEO Ms. Bresch. \n\nBasically, the exchange went like this:\n\nJ: So you price your Epipens at $608, out of which $274 goes to you.\n\nM: Yes. \n\nJ: To reduce the prices, you now priced it to $300 correct?\n\nM: Yes, but we have a $69 cost-----\n\nJ: Which is the same for both of them\n\nM: Yes.  \n\nJ: So by \"reducing\" the price, you're, making more money. $274 vs. the new $300 which you said directly goes to your pockets.\n\nM: (Some consulated reply) \n\nJ: This is why we don't believe you.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484273471.0,
    "date_created": "2017-01-12",
    "time_created": "13:11:11",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccc7bs",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "Costxo has had it for $79.99 for a long time.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484276817.0,
    "date_created": "2017-01-12",
    "time_created": "14:06:57",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccez1i",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "This benefit would be greatly increased if Americans were allowed to buy drugs from other countries. The pharmaceutical companies in the US would be forced to lower their price or they'd risk getting put out of business by even a company next door in Canada (where drugs do cost less in general.)",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484279871.0,
    "date_created": "2017-01-12",
    "time_created": "14:57:51",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccf73c",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "Good on them, next time I have a choice of pharmacies Ill pick CVS for my cold medicines and whatnot. We gotta keep people like this in business. Every time I go there though its an empty store with a clerk or two... gives me tha RadioShack vibes before that ship sunk.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484280118.0,
    "date_created": "2017-01-12",
    "time_created": "15:01:58",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccfhuv",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "Goddammit, still payed $350 for mine🙄\n",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484280457.0,
    "date_created": "2017-01-12",
    "time_created": "15:07:37",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcchczo",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "but the generic must be the same as the Epipen, it is require by law. Generic cheaper, but same result",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484282548.0,
    "date_created": "2017-01-12",
    "time_created": "15:42:28",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccj636",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "I do love how Mylan has completely decimated it's own market share and stock with this disgusting Epipen debacle. It's like people are voting with their dollars or some old cliche like that. \n\nWhile I don't hold it against individuals for being organelles in a terrible corporation, I do wish that every single one of Mylan's executives ends up sucking leprous cock under a bridge for their living until the day they die of untreated gonorrhea. That would make me *soooooooooo* happy  :)",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484284531.0,
    "date_created": "2017-01-12",
    "time_created": "16:15:31",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccl9gd",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "Weird, it's almost as if markets work and the regulator is the problem. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484286857.0,
    "date_created": "2017-01-12",
    "time_created": "16:54:17",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccnel6",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "Free Market. Enough said. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484289335.0,
    "date_created": "2017-01-12",
    "time_created": "17:35:35",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccpazx",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "Oh look at that. Capitalism. So we don't need gov't price controls? Huh",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484291650.0,
    "date_created": "2017-01-12",
    "time_created": "18:14:10",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccr249",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "Or, you can get epinephrine for a couple dollars, like its always been. Epi pen isn't a medication. Its the delivery device for Epinephrine. Anyone with an allergy that isnt aware of this,  either has a shit dr, or is dumb",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484293895.0,
    "date_created": "2017-01-12",
    "time_created": "18:51:35",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccrwzw",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "Almost like competition is good for the consumer...",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484295030.0,
    "date_created": "2017-01-12",
    "time_created": "19:10:30",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccv7pm",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "6th the price sounds cool.  $100 is still too much.  CVS is just undercutting a despicable gouger with a smaller gouge.\n",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484299478.0,
    "date_created": "2017-01-12",
    "time_created": "20:24:38",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccw2k5",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "which begs the question, can't other companies do the same thing?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484300639.0,
    "date_created": "2017-01-12",
    "time_created": "20:43:59",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccwhtn",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "This is why competition in medicine is so important.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484301207.0,
    "date_created": "2017-01-12",
    "time_created": "20:53:27",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccwt0s",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "still ridiculously overpriced at $109",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484301616.0,
    "date_created": "2017-01-12",
    "time_created": "21:00:16",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccypul",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm simply upvoting this so more people see it!  I hope others do the same.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484304155.0,
    "date_created": "2017-01-12",
    "time_created": "21:42:35",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc0bl1",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "I wonder how much it costs to make the drug, the packaging, the syringe. And how much profit is this made by CVS.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1484263444.0,
    "date_created": "2017-01-12",
    "time_created": "10:24:04",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcbzlm5",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "This is what free market in action means. Not that crap they say to defend lowering wages. Those in charge of big companies seem TiVo have a love/hate relationship with the term.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1484262504.0,
    "date_created": "2017-01-12",
    "time_created": "10:08:24",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc7p2u",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "Publix has been offering a generic Epipen for over a year. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1484271918.0,
    "date_created": "2017-01-12",
    "time_created": "12:45:18",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc8nl9",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "And the \"cheap\" one is still about 3x the price of the same products in Europe...",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1484272941.0,
    "date_created": "2017-01-12",
    "time_created": "13:02:21",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccaspf",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "Can I just point out that the generic one is not MADE by CVS. It's made by the same douche bags that jacked the price up in the first place.\n\nMylan.\n\nIf you're thinking \"Hell yes, I can buy these now and help take a chunk of EpiPen's money!\" you're wrong. The money is still going to the same company. It's just a little less and it's still WAY overpriced. \n\nA doctor in Minnesota is trying to get a $50 version of the epipen on the market. That's 1/2 of this new generic version's price.\n\nAlso...misleading title.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1484275266.0,
    "date_created": "2017-01-12",
    "time_created": "13:41:06",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccjxfo",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "CVS man. First they end the sale of tobacco products to move toward healthier products now this? They get my economic vote. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1484285361.0,
    "date_created": "2017-01-12",
    "time_created": "16:29:21",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3159",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "These \"lower\" prices are what you would pay in the UK anyway for the original branded version\n\nhttps://www.europapharmacy.co.uk/epipen\n\nThe NHS (National medicare service) buys them for around £40 each.\n\nYou in USA are being screwed. Normally it the other way around for us Brits.\n\n",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1484266722.0,
    "date_created": "2017-01-12",
    "time_created": "11:18:42",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2hvr",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "So.... the free market solved this problem? Without Congress? What what??",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1484266102.0,
    "date_created": "2017-01-12",
    "time_created": "11:08:22",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc1nmc",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "So is this the new normal of health care?\n\n1. Become the lowest cost provider of a life-saving drug / applicator.\n\n2. Wait for all your competitors to stop producing it as they can no longer compete.\n\n3. Instantly raise the price overnight by 600%.\n\n4. Maintain at least a 2 year monopoly on people whose lives depend on the drug.\n\n5. Pull the product when competitors finally get their drug / applicator combo pushed through approvals.\n\n6. Rinse and repeat with a different medication.\n",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1484265094.0,
    "date_created": "2017-01-12",
    "time_created": "10:51:34",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc345q",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "The market finds a way",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1484266817.0,
    "date_created": "2017-01-12",
    "time_created": "11:20:17",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcce05f",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "It's amazing what a dash of competition can do. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1484278803.0,
    "date_created": "2017-01-12",
    "time_created": "14:40:03",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccqh15",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "Jesus Christ... Yes, it is great that there is a cheaper alternative to the recently overpriced EpiPen, but the top 3 comments and ridiculously high upvote count make this blatantly obvious commercial advertising. \n\nTell me reddit staff, what's the going rate on 60,000 upvotes? ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1484293131.0,
    "date_created": "2017-01-12",
    "time_created": "18:38:51",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc11r3",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "ITT: People have no idea how drug pricing works\n\n",
    "controversiality": 1,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1484264354.0,
    "date_created": "2017-01-12",
    "time_created": "10:39:14",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc37ms",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "If CVS released it for 1/6th the price, Costco will have it in a year for 1/20th the price",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484266922.0,
    "date_created": "2017-01-12",
    "time_created": "11:22:02",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4xk4",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "It feels nice to know at least someone is trying to stick it to those twats who hiked the price on epi-pens. Also people with severe allergies have access to a more affordable option.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484268856.0,
    "date_created": "2017-01-12",
    "time_created": "11:54:16",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc57gx",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "I just got back from my doctor. I read this post while I was waiting for him to finish computer work, and it reminded me to mention a possible shellfish allergy I recently learned about.\n\nHe tried to give me EpiPen, but I told him about Adrenaclick, which I read about from this thread. He had no idea competitors existed for EpiPen and had assumed it was the only option. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484269158.0,
    "date_created": "2017-01-12",
    "time_created": "11:59:18",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc59od",
    "parent_id": "t3_5njj2x",
    "subreddit_name_prefixed": "r/news",
    "body": "Well CVS finally doing something to justify that 2 billion dollar letup on tobacco..\n\nDo people actually go to CVS over walgreens etc basd on this?\n\nI can tell you that in manhattan the duane reades and walgreens are aggressively adding urgent care centers within..",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484269225.0,
    "date_created": "2017-01-12",
    "time_created": "12:00:25",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcbysnk",
    "parent_id": "t1_dcbyjud",
    "subreddit_name_prefixed": "r/news",
    "body": "## Adrenaclick: ask for it by name\n\n",
    "controversiality": 0,
    "ups": 6898,
    "downs": 0,
    "score": 6898,
    "created": 1484261403.0,
    "date_created": "2017-01-12",
    "time_created": "09:50:03",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcbzf1m",
    "parent_id": "t1_dcbyjud",
    "subreddit_name_prefixed": "r/news",
    "body": "It really would have been nice if the actual news article contained any of the helpful information you just shared.\n\nThank you for the clarification. ",
    "controversiality": 0,
    "ups": 479,
    "downs": 0,
    "score": 479,
    "created": 1484262253.0,
    "date_created": "2017-01-12",
    "time_created": "10:04:13",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc1lmw",
    "parent_id": "t1_dcbyjud",
    "subreddit_name_prefixed": "r/news",
    "body": "Why isn't it rated A/B?",
    "controversiality": 0,
    "ups": 59,
    "downs": 0,
    "score": 59,
    "created": 1484265029.0,
    "date_created": "2017-01-12",
    "time_created": "10:50:29",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc23el",
    "parent_id": "t1_dcbyjud",
    "subreddit_name_prefixed": "r/news",
    "body": "Why was AuviQ recalled?",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1484265617.0,
    "date_created": "2017-01-12",
    "time_created": "11:00:17",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2039",
    "parent_id": "t1_dcbyjud",
    "subreddit_name_prefixed": "r/news",
    "body": "Damn, the AuviQ looked awesome too.",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1484265507.0,
    "date_created": "2017-01-12",
    "time_created": "10:58:27",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc1ln9",
    "parent_id": "t1_dcbyjud",
    "subreddit_name_prefixed": "r/news",
    "body": "In my state, at least, the pharmacist can suggest the alternative and call the doctor for permission to substitute, and that is all that is required.",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1484265029.0,
    "date_created": "2017-01-12",
    "time_created": "10:50:29",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcbzuqe",
    "parent_id": "t1_dcbyjud",
    "subreddit_name_prefixed": "r/news",
    "body": "except your Pharmacist should know this, and just call up your Dr. office and ask them if they can switch the script to Adrenaclick. \n\nThe switch scripts all the time when the Dr. writes a dosage amount that doesn't exist, or if the new meds interact with meds the person is already taking.  ",
    "controversiality": 0,
    "ups": 199,
    "downs": 0,
    "score": 199,
    "created": 1484262842.0,
    "date_created": "2017-01-12",
    "time_created": "10:14:02",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcbzth7",
    "parent_id": "t1_dcbyjud",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah, the story that wasn't told during the witch hunt.  There was an existing alternative that had been around for quite a while.  All the patient needed to do was have their doctor switch the prescription the next time they needed it.",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1484262796.0,
    "date_created": "2017-01-12",
    "time_created": "10:13:16",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcca01g",
    "parent_id": "t1_dcbyjud",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1484274408.0,
    "date_created": "2017-01-12",
    "time_created": "13:26:48",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcbzoot",
    "parent_id": "t1_dcbyjud",
    "subreddit_name_prefixed": "r/news",
    "body": "Walmart has one that is four bucks for two shots",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1484262620.0,
    "date_created": "2017-01-12",
    "time_created": "10:10:20",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccdzcv",
    "parent_id": "t1_dcbyjud",
    "subreddit_name_prefixed": "r/news",
    "body": "Why would a doctor write a prescription for just Epinephrine then? Does this happen regularly?\n\nI get that with some generics the active ingredient is the same but the other stuff that controls delivery/absorbtion rate can be slightly different. But surely the cheapest option with the same amount of active ingredient should be the default and prescribed in 99% of cases? Only prescribing the more expensive option if it's demonstrably better for that particular patient or if they specifically ask for it?\n\nI always thought that a non-generic was only superior for only a very small set of drugs and for people with particularly niche circumstances and those prescriptions should only be happening very very rarely. Not often enough for posts like this to exist. In the case they do need the brand name, the patient should know they are getting the more expensive drug and given a reasonable explanation why by their doctor. These warnings should not be necessary at all. Something must be fucking rotten.\n\nA doctor has a duty of care to their patients and that should include not fucking them over financially, especially when costs are this high. The justification being that it's not good for your mental health or physical health if you keep having to shell hundreds of dollars every time you need an epipen. Some people might even go without because of the high prices and put themselves at serious risk. We're not talking about the generic 30p paracetamol vs the brand name one that costs a few dollars. This hundreds of dollars, for a lot of people this price difference (even with insurance with deductibles/excess) is enough to cause some *serious* hardship.\n\nEven if they default to the expensive and change it if you ask for it, not everyone is educated about this and it's still fucked up. I would even go as far to say that it was just straight up corruption as their must be some kind of kickback involved for a doctor to do that.\n\n",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484278778.0,
    "date_created": "2017-01-12",
    "time_created": "14:39:38",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2ij6",
    "parent_id": "t1_dcbyjud",
    "subreddit_name_prefixed": "r/news",
    "body": "Whew, that was an expensive video. I'm sweating.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484266123.0,
    "date_created": "2017-01-12",
    "time_created": "11:08:43",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2s3d",
    "parent_id": "t1_dcbyjud",
    "subreddit_name_prefixed": "r/news",
    "body": "Since the difference is the injector system, if a prescription was written for Epinephrine would EpiPen or Adrenaclick both be legitimate options?",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484266431.0,
    "date_created": "2017-01-12",
    "time_created": "11:13:51",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc60pj",
    "parent_id": "t1_dcc52xo",
    "subreddit_name_prefixed": "r/news",
    "body": "Dang that's really cool actually, that that worked ",
    "controversiality": 0,
    "ups": 202,
    "downs": 0,
    "score": 202,
    "created": 1484270076.0,
    "date_created": "2017-01-12",
    "time_created": "12:14:36",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc90mh",
    "parent_id": "t1_dcc52xo",
    "subreddit_name_prefixed": "r/news",
    "body": "This is legitimately one of the coolest stories I've ever heard. Thanks for sharing. ",
    "controversiality": 0,
    "ups": 168,
    "downs": 0,
    "score": 168,
    "created": 1484273340.0,
    "date_created": "2017-01-12",
    "time_created": "13:09:00",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc8wsr",
    "parent_id": "t1_dcc52xo",
    "subreddit_name_prefixed": "r/news",
    "body": "That is freaking incredible. ",
    "controversiality": 0,
    "ups": 63,
    "downs": 0,
    "score": 63,
    "created": 1484273224.0,
    "date_created": "2017-01-12",
    "time_created": "13:07:04",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccairq",
    "parent_id": "t1_dcc52xo",
    "subreddit_name_prefixed": "r/news",
    "body": "Because of that phrase people like to bend over backwards to defend: \"intellectual property.\" The notion that an abstract concept can somehow be \"owned\" by a corporation or individual.\n\nSynthesising epinephrine is even cheaper than harvesting it from animal organs. The cost to produce a dose of the actual drug is minuscule. What you're paying for in an EpiPen is just price gouging that's enabled by a patent on the injector mechanism. An injector mechanism that Mylan *purchased* instead of designing themselves, no less. They're demanding obscene amounts of money for a <$10 product that has long since recouped its R&D costs.\n\nPatents and copyright are thoroughly a detriment to society. Their lack of existence didn't demotivate the Millenia of technological advancement and art before their existence, and the nigh-on mythical individual inventor isn't helped by patents when the application fee is thousands of dollars. (Plus legal expenses if you want to actually exercise the patent against a large company. Which will find a portfolio of patents they can claim *you* violate.)\n\nThe core issue is the absurd notion that people take for granted: that someone should be allowed to \"own\" an abstract concept. There's no evidence that it benefits society...only that it makes a select few very rich.",
    "controversiality": 0,
    "ups": 144,
    "downs": 0,
    "score": 144,
    "created": 1484274966.0,
    "date_created": "2017-01-12",
    "time_created": "13:36:06",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccdnef",
    "parent_id": "t1_dcc52xo",
    "subreddit_name_prefixed": "r/news",
    "body": "Helluva MacGuyver-ing!\n\nThe connection between a pig's adrenal gland on a harvested kidney and epinephrine in treating a severe allergic reaction is so very clever, yet incredibly practical.\n\nBased solely on that, your grandpa is the sort of person I'd want if I were in a dystopian future where we've retained our knowledge, but lost our technology.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484278408.0,
    "date_created": "2017-01-12",
    "time_created": "14:33:28",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc9daa",
    "parent_id": "t1_dcc4x02",
    "subreddit_name_prefixed": "r/news",
    "body": "This needs to be much higher up. Thank you! ",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1484273720.0,
    "date_created": "2017-01-12",
    "time_created": "13:15:20",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccabwq",
    "parent_id": "t1_dcc4x02",
    "subreddit_name_prefixed": "r/news",
    "body": "You're the boss - this needs to be voted up higher. Thanks for the coupon link.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1484274761.0,
    "date_created": "2017-01-12",
    "time_created": "13:32:41",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccd3zz",
    "parent_id": "t1_dcc4x02",
    "subreddit_name_prefixed": "r/news",
    "body": "CVS distribution center truck loader here. I load both epipens and adrenaclick pens onto the trucks. They are in green totes by the time I get them and I have know idea the contents of any individual tote but I just wanted to chime in since I work for the company. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1484277823.0,
    "date_created": "2017-01-12",
    "time_created": "14:23:43",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc1jj9",
    "parent_id": "t1_dcc0oyl",
    "subreddit_name_prefixed": "r/news",
    "body": "Just please be sure to ask your doctor for the lower cost option by name. \"EpiPen\" has become synonymous with this system, so you need to make sure you're getting what you want.",
    "controversiality": 0,
    "ups": 1255,
    "downs": 0,
    "score": 1255,
    "created": 1484264958.0,
    "date_created": "2017-01-12",
    "time_created": "10:49:18",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc1te7",
    "parent_id": "t1_dcc0oyl",
    "subreddit_name_prefixed": "r/news",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 255,
    "downs": 0,
    "score": 255,
    "created": 1484265289.0,
    "date_created": "2017-01-12",
    "time_created": "10:54:49",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3ym8",
    "parent_id": "t1_dcc0oyl",
    "subreddit_name_prefixed": "r/news",
    "body": "as another parent with a child with peanut anaphylaxis I feel compelled to advise you that your child should have TWO autoinjectors with them at all times. The second is in case the first fails which has been known to happen either because of faulty product or inappropriate application. I would suggest having your son carry his autoinjectors on his person in any one of numerous containers (belt, strap-on, etc.). This way, he is never without ",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1484267768.0,
    "date_created": "2017-01-12",
    "time_created": "11:36:08",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2w63",
    "parent_id": "t1_dcc0oyl",
    "subreddit_name_prefixed": "r/news",
    "body": "Not having to pay that much is going to feel like you're getting a raise! ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1484266562.0,
    "date_created": "2017-01-12",
    "time_created": "11:16:02",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3hsk",
    "parent_id": "t1_dcc0oyl",
    "subreddit_name_prefixed": "r/news",
    "body": "Did you ever use the [Epipen coupon?](https://www.epipen.com/copay-offer/) Saves a decent amount of money and in my experience working at CVS, a lot of people don't know about it.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1484267239.0,
    "date_created": "2017-01-12",
    "time_created": "11:27:19",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc799e",
    "parent_id": "t1_dcc0oyl",
    "subreddit_name_prefixed": "r/news",
    "body": "We are in a similar situation with our 6 year old. I asked our Dr and pharmacist about Adrenaclick last fall and they said the dosage is incorrect for kids.  We were still stuck with the more expensive option until a Jr version of Adrenaclick comes out. Sad day. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484271437.0,
    "date_created": "2017-01-12",
    "time_created": "12:37:17",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3t5d",
    "parent_id": "t1_dcc0oyl",
    "subreddit_name_prefixed": "r/news",
    "body": "Jeez, never realized they were that expensive my insurance gives them to me like candy usually get 2 like every other month have only had to use a couple of them and holy shit did that suck but so thankful I have them laying around especially if they're that damn pricey. Don't they stay good for a couple years too long as you don't do anything silly like microwave them?",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1484267596.0,
    "date_created": "2017-01-12",
    "time_created": "11:33:16",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc5pz6",
    "parent_id": "t1_dcc0oyl",
    "subreddit_name_prefixed": "r/news",
    "body": "Get the free loading mom to buy half ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1484269741.0,
    "date_created": "2017-01-12",
    "time_created": "12:09:01",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc1wm3",
    "parent_id": "t1_dcc0oyl",
    "subreddit_name_prefixed": "r/news",
    "body": "Quick advice: Keep it climate-controlled *always*. Leaving it out in the hot car for a few hours will ruin it, expiration date or not. I keep mine in the fridge, which is about 5 degrees above the required minimum temp.\n\nEDIT: Okay, quick thing: *Don't put it into a cold fridge*. Check the temperature against the recommended storage temperature. It's an organic compound, and those don't do well in extreme heat or cold. I have a minifridge that's the perfect temperature, I realize not everyone has something like that.",
    "controversiality": 1,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1484265393.0,
    "date_created": "2017-01-12",
    "time_created": "10:56:33",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc56a6",
    "parent_id": "t1_dcc0oyl",
    "subreddit_name_prefixed": "r/news",
    "body": "What the hell is that price?? I just looked it up in Belgium it costs 43,64 euro. So 4 of them would be below 180 euro. There is no reason for some epinephrin to cost 300 dollars every shot.\n",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484269123.0,
    "date_created": "2017-01-12",
    "time_created": "11:58:43",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccncjy",
    "parent_id": "t1_dcci1m7",
    "subreddit_name_prefixed": "r/news",
    "body": "Not the hero we need, but the hero we deserve.\nedit: lol, I got the quote backward didn't I? Still kind of works.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1484289268.0,
    "date_created": "2017-01-12",
    "time_created": "17:34:28",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccibbq",
    "parent_id": "t1_dcci1m7",
    "subreddit_name_prefixed": "r/news",
    "body": "Good for you!",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484283588.0,
    "date_created": "2017-01-12",
    "time_created": "15:59:48",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcd7e7n",
    "parent_id": "t1_dcci1m7",
    "subreddit_name_prefixed": "r/news",
    "body": "> You should've seen the look on the face of the Mylan rep\n\nGood. Mylan deserves worse.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484316756.0,
    "date_created": "2017-01-13",
    "time_created": "01:12:36",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcbzhk5",
    "parent_id": "t1_dcbypth",
    "subreddit_name_prefixed": "r/news",
    "body": "You can get digital receipts now. Saves a ton of paper. ",
    "controversiality": 0,
    "ups": 315,
    "downs": 0,
    "score": 315,
    "created": 1484262349.0,
    "date_created": "2017-01-12",
    "time_created": "10:05:49",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4q2d",
    "parent_id": "t1_dcbypth",
    "subreddit_name_prefixed": "r/news",
    "body": "People get *really* offended at how long the receipt is. Most of the time they don't even mention the environment. They just get really upset that the receipt is so long. Like, it ruins their day. ",
    "controversiality": 0,
    "ups": 45,
    "downs": 0,
    "score": 45,
    "created": 1484268620.0,
    "date_created": "2017-01-12",
    "time_created": "11:50:20",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc5szj",
    "parent_id": "t1_dcbypth",
    "subreddit_name_prefixed": "r/news",
    "body": "They only do that when you use your cvs card. It's all coupons. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484269834.0,
    "date_created": "2017-01-12",
    "time_created": "12:10:34",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc27fb",
    "parent_id": "t1_dcbypth",
    "subreddit_name_prefixed": "r/news",
    "body": "well this cost reduction had to come from somewhere. the receipt budget must have been slashed.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1484265752.0,
    "date_created": "2017-01-12",
    "time_created": "11:02:32",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcbxwg8",
    "parent_id": "t1_dcbx61f",
    "subreddit_name_prefixed": "r/news",
    "body": "CVS is a little weird like that. Like, in my area, all of them stopped selling cigarettes. Not sure if that's a chain-wide thing, but I think it is. That's got to be a very unprofitable move, so... maybe they actually care?\n\nThen again, they also sell homeopathic crap right next to the real stuff, so maybe they don't care all that much.",
    "controversiality": 0,
    "ups": 797,
    "downs": 0,
    "score": 797,
    "created": 1484260130.0,
    "date_created": "2017-01-12",
    "time_created": "09:28:50",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc5pu5",
    "parent_id": "t1_dcbx61f",
    "subreddit_name_prefixed": "r/news",
    "body": "Capitalism as it should be. ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1484269736.0,
    "date_created": "2017-01-12",
    "time_created": "12:08:56",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc33h0",
    "parent_id": "t1_dcbx61f",
    "subreddit_name_prefixed": "r/news",
    "body": "In a free market, competition will yield the lowest possible price while still providing good service.\n\n\n\nThe problem here is when the law protects only that one corporate interest.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1484266796.0,
    "date_created": "2017-01-12",
    "time_created": "11:19:56",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2534",
    "parent_id": "t1_dcbx61f",
    "subreddit_name_prefixed": "r/news",
    "body": "lol they're not doing it for you, this is simple competition in action",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1484265673.0,
    "date_created": "2017-01-12",
    "time_created": "11:01:13",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcbxmry",
    "parent_id": "t1_dcbx61f",
    "subreddit_name_prefixed": "r/news",
    "body": "I think they've stepped their game up. I don't always remember getting as many coupons as I get now.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1484259734.0,
    "date_created": "2017-01-12",
    "time_created": "09:22:14",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2bzk",
    "parent_id": "t1_dcbx61f",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah, I am not a big fan of CVS in my area because their pharmacy is run so poorly.  Glad they got rid of cigarettes and wish they did the same thing to homeopathic BS products they still stock. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484265907.0,
    "date_created": "2017-01-12",
    "time_created": "11:05:07",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc795h",
    "parent_id": "t1_dcbx61f",
    "subreddit_name_prefixed": "r/news",
    "body": "It's not for you.  It's because the market has a vacuum.  And they want you to get all your prescription fills there.\n\nWhen drug stores stop selling cigarettes, that's doing a decent thing.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1484271434.0,
    "date_created": "2017-01-12",
    "time_created": "12:37:14",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2pey",
    "parent_id": "t1_dcbx61f",
    "subreddit_name_prefixed": "r/news",
    "body": "It's called competition, not altruism.  They (*CVS/Adrenaclick)* will likely see an increase in total profits resulting from their increased share of the market.  \n\nSee?  Capitalism and Free Markets might not be so bad!",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1484266347.0,
    "date_created": "2017-01-12",
    "time_created": "11:12:27",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcbywdh",
    "parent_id": "t1_dcbx61f",
    "subreddit_name_prefixed": "r/news",
    "body": "It makes sense. Good rep and still profit? Sounds like a great deal for them.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484261546.0,
    "date_created": "2017-01-12",
    "time_created": "09:52:26",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc7rzo",
    "parent_id": "t1_dcc2s4l",
    "subreddit_name_prefixed": "r/news",
    "body": "Story time?",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1484272006.0,
    "date_created": "2017-01-12",
    "time_created": "12:46:46",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc61o7",
    "parent_id": "t1_dcc2s4l",
    "subreddit_name_prefixed": "r/news",
    "body": "For some reason I really digging your anger, here's an upvote. ",
    "controversiality": 0,
    "ups": 87,
    "downs": 0,
    "score": 87,
    "created": 1484270106.0,
    "date_created": "2017-01-12",
    "time_created": "12:15:06",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc5q85",
    "parent_id": "t1_dcc2s4l",
    "subreddit_name_prefixed": "r/news",
    "body": "Mind giving us an overview of your jerb?",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484269748.0,
    "date_created": "2017-01-12",
    "time_created": "12:09:08",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2qpp",
    "parent_id": "t1_dcc1mqc",
    "subreddit_name_prefixed": "r/news",
    "body": "have you tried using the epipen coupons? they almost always bring the cost down to 0...ask your doctor for them or your local pharmacy. We usually have extra ones lying around.",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1484266389.0,
    "date_created": "2017-01-12",
    "time_created": "11:13:09",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccpdki",
    "parent_id": "t1_dcc1mqc",
    "subreddit_name_prefixed": "r/news",
    "body": "Yea but the sad thing is no one is actually getting in trouble and she and the company made obscene amounts of money",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484291742.0,
    "date_created": "2017-01-12",
    "time_created": "18:15:42",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc8mkv",
    "parent_id": "t1_dcc1iv3",
    "subreddit_name_prefixed": "r/news",
    "body": "Yep, they care so much about your health that they run the pharmacy on a skeleton crew 24/7, putting the handling of dangerous/life saving medications in the hands of people who aren't allowed to eat or go to the bathroom for 12 hours straight, while filling hundreds of prescriptions.",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1484272912.0,
    "date_created": "2017-01-12",
    "time_created": "13:01:52",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc54xq",
    "parent_id": "t1_dcc1iv3",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah, but just talk to their pharmacy staff.... they may be good to the customers, but they are universally considered the most brutal company to work for. 12 hour shifts with no lunch breaks checking upwards of 500 scripts a day. I don't know anyone who works for them that has anything nice to say",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1484269082.0,
    "date_created": "2017-01-12",
    "time_created": "11:58:02",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2wrc",
    "parent_id": "t1_dcc1iv3",
    "subreddit_name_prefixed": "r/news",
    "body": "That is because tobacco products didn't make up much of their revenue and they are looking to make their facilities an urgent care- pharmacy hybrid of sorts. This is what my local alderman said so don't quote me on that. ",
    "controversiality": 0,
    "ups": 144,
    "downs": 0,
    "score": 144,
    "created": 1484266581.0,
    "date_created": "2017-01-12",
    "time_created": "11:16:21",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3b6p",
    "parent_id": "t1_dcc1iv3",
    "subreddit_name_prefixed": "r/news",
    "body": "That was a great PR move that hid the real reason - Cigarettes simply didn't bring in enough money anymore and other options/products had a better profit margin.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1484267032.0,
    "date_created": "2017-01-12",
    "time_created": "11:23:52",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccbh88",
    "parent_id": "t1_dcc29jg",
    "subreddit_name_prefixed": "r/news",
    "body": "/r/kenm",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1484276015.0,
    "date_created": "2017-01-12",
    "time_created": "13:53:35",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc9svw",
    "parent_id": "t1_dcc6ujh",
    "subreddit_name_prefixed": "r/news",
    "body": "It's not just the pharmacy staff they treat like trash. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1484274194.0,
    "date_created": "2017-01-12",
    "time_created": "13:23:14",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc8k8r",
    "parent_id": "t1_dcc6ujh",
    "subreddit_name_prefixed": "r/news",
    "body": "Just got a nice image there with the diaper, thanks. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1484272843.0,
    "date_created": "2017-01-12",
    "time_created": "13:00:43",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccgz6s",
    "parent_id": "t1_dcc6ujh",
    "subreddit_name_prefixed": "r/news",
    "body": "And yet I have to get my prescriptions there unless I want to pay more because my pharmacy benefits manager has decided that if I want to get 90 day drug fills, I either have to go to CVS at retail or mail it to caremark. (And starting this year my RX is no longer provided by my primary medical and I have a separate card from Caremark for prescriptions). Ugh.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484282115.0,
    "date_created": "2017-01-12",
    "time_created": "15:35:15",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccx8oo",
    "parent_id": "t1_dcc6ujh",
    "subreddit_name_prefixed": "r/news",
    "body": "This should be at the top. Widely regarded as a terrible place for pharmacists to work. Completely see-through PR grab with stopping tobacco sales. Most of all, the way they funnel people into their stores because CVS is a PBM that owns its own drug store chain. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484302187.0,
    "date_created": "2017-01-12",
    "time_created": "21:09:47",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc48qp",
    "parent_id": "t1_dcc306f",
    "subreddit_name_prefixed": "r/news",
    "body": "The Department of Defense had a contract with just CVS for two years which excluded Walgreens. They left CVS and went back to Walgreens because of poor service.",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1484268081.0,
    "date_created": "2017-01-12",
    "time_created": "11:41:21",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc7v7w",
    "parent_id": "t1_dcc3tdp",
    "subreddit_name_prefixed": "r/news",
    "body": "The price is listed at $110 for a 2 pack, so it is actually $50 a unit.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1484272101.0,
    "date_created": "2017-01-12",
    "time_created": "12:48:21",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccbwqx",
    "parent_id": "t1_dcc3tdp",
    "subreddit_name_prefixed": "r/news",
    "body": "It's $100 for 2, so only $50 each",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484276490.0,
    "date_created": "2017-01-12",
    "time_created": "14:01:30",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc1egm",
    "parent_id": "t1_dcbzlmg",
    "subreddit_name_prefixed": "r/news",
    "body": "Which is great if you're not going jnto anaphylactic shock.",
    "controversiality": 0,
    "ups": 178,
    "downs": 0,
    "score": 178,
    "created": 1484264786.0,
    "date_created": "2017-01-12",
    "time_created": "10:46:26",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc1zoe",
    "parent_id": "t1_dcbzlmg",
    "subreddit_name_prefixed": "r/news",
    "body": "Good luck getting the general population to draw up epinephrine in an accurate dose with a needle and then inject it, even while they aren't in anaphylactic shock.",
    "controversiality": 0,
    "ups": 77,
    "downs": 0,
    "score": 77,
    "created": 1484265494.0,
    "date_created": "2017-01-12",
    "time_created": "10:58:14",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc1m3s",
    "parent_id": "t1_dcbzlmg",
    "subreddit_name_prefixed": "r/news",
    "body": "Based on [this article](http://time.com/money/4481786/how-much-epipen-costs-to-make/) it's estimated that an EpiPen costs $20-$30 to make. Assuming the generic versions costs something similar, $50 sounds pretty reasonable to me. Especially compared to $300.\n\nEdit: Other [articles](http://www.mercurynews.com/2016/10/01/epipen-outrage-silicon-valley-engineers-figure-true-cost-to-make-lifesaving-auto-injector-about-10/) put the price of the physical package (of 2 EpiPens) in the sub $10 range to produce. That is obviously less good. Not  sure how much shipping, licence fees etc. would add. Oh, and someone has to pay the researchers who came up with this. ",
    "controversiality": 0,
    "ups": 131,
    "downs": 0,
    "score": 131,
    "created": 1484265044.0,
    "date_created": "2017-01-12",
    "time_created": "10:50:44",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc1svs",
    "parent_id": "t1_dcbzlmg",
    "subreddit_name_prefixed": "r/news",
    "body": "That's actually pretty good. They cost around $25 to make, as I recall. It's an artificial hormone, and those are a bitch to make. I'll gladly pay that and just be careful (I have a serious peanut allergy), if it means we don't keep transitioning to a single-payer healthcare system.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1484265273.0,
    "date_created": "2017-01-12",
    "time_created": "10:54:33",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc35gh",
    "parent_id": "t1_dcbzlmg",
    "subreddit_name_prefixed": "r/news",
    "body": "Is that bad?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484266855.0,
    "date_created": "2017-01-12",
    "time_created": "11:20:55",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc40i6",
    "parent_id": "t1_dcbzlmg",
    "subreddit_name_prefixed": "r/news",
    "body": "It's not like you use these daily lol. 50$ a year seems more than reasonable",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484267826.0,
    "date_created": "2017-01-12",
    "time_created": "11:37:06",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3jxt",
    "parent_id": "t1_dcc3gj2",
    "subreddit_name_prefixed": "r/news",
    "body": "I believe its called inelastic demand?",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1484267306.0,
    "date_created": "2017-01-12",
    "time_created": "11:28:26",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcclbcw",
    "parent_id": "t1_dcc632p",
    "subreddit_name_prefixed": "r/news",
    "body": "That's because they get drugs from different suppliers with different AWCs. There isn't very much markup with pharmacy prices; they pay around what the customer pays for drugs. If I order an EpiPen, it will cost the pharmacy around $600-$700 and we sell it to a patient for $0, we get a reimbursement from the insurance company for a little but more than $700. Reimbursements have actually been going down to so there isn't much profit in pharmacy once wages and rent is paid. I worked for a grocery chain the licensed out pharmacy software and everything with PDX and the profit for a large store, with pharmacy included was $50k...that was for the whole store! A pharmacy like CVS might be around $300-$500k/store since they have they are #7 fortune 500 and have the infrastructure in place that they don't have to license anything.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1484286917.0,
    "date_created": "2017-01-12",
    "time_created": "16:55:17",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc6n1a",
    "parent_id": "t1_dcc6fo5",
    "subreddit_name_prefixed": "r/news",
    "body": "Girlcott. Buy it all. ",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1484270755.0,
    "date_created": "2017-01-12",
    "time_created": "12:25:55",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2isj",
    "parent_id": "t1_dcbyll0",
    "subreddit_name_prefixed": "r/news",
    "body": "So… every minimum wage paying company?",
    "controversiality": 0,
    "ups": 171,
    "downs": 0,
    "score": 171,
    "created": 1484266132.0,
    "date_created": "2017-01-12",
    "time_created": "11:08:52",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc28uf",
    "parent_id": "t1_dcbyll0",
    "subreddit_name_prefixed": "r/news",
    "body": "I think people (when they get heated at a register) should take a moment to realize the take-home for even a full time employee in retail is overwhelmingly less than $400 a week. ",
    "controversiality": 0,
    "ups": 56,
    "downs": 0,
    "score": 56,
    "created": 1484265800.0,
    "date_created": "2017-01-12",
    "time_created": "11:03:20",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2zml",
    "parent_id": "t1_dcbyll0",
    "subreddit_name_prefixed": "r/news",
    "body": "I've never hated a job as much as I hated working for them. Honestly left every day wanting to cry ",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1484266673.0,
    "date_created": "2017-01-12",
    "time_created": "11:17:53",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc8b45",
    "parent_id": "t1_dcbyll0",
    "subreddit_name_prefixed": "r/news",
    "body": "Also have heard horror stories about how bad they treat their pharmacists. As a pharmacy student, I've been told more than once to stay away. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1484272572.0,
    "date_created": "2017-01-12",
    "time_created": "12:56:12",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2k30",
    "parent_id": "t1_dcbyll0",
    "subreddit_name_prefixed": "r/news",
    "body": "Think about it this way! Because CVS is a dick about wages they can afford to do these kind of things... Right? Maybe?",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484266174.0,
    "date_created": "2017-01-12",
    "time_created": "11:09:34",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2fde",
    "parent_id": "t1_dcbyll0",
    "subreddit_name_prefixed": "r/news",
    "body": "Probably because most of their employees can be replaced by machines",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1484266019.0,
    "date_created": "2017-01-12",
    "time_created": "11:06:59",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4ay5",
    "parent_id": "t1_dcbyll0",
    "subreddit_name_prefixed": "r/news",
    "body": "It's maddening, they'd rather just hire people off the street and pay them pennies instead of actually take care of their employees and give them incentive to stick around. There is no way the cost of hiring new people every month is offset by the low wages they get.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484268148.0,
    "date_created": "2017-01-12",
    "time_created": "11:42:28",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2w3i",
    "parent_id": "t1_dcbyll0",
    "subreddit_name_prefixed": "r/news",
    "body": "And sold Aloe Vera gel without any aloe.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484266560.0,
    "date_created": "2017-01-12",
    "time_created": "11:16:00",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3dcj",
    "parent_id": "t1_dcbyll0",
    "subreddit_name_prefixed": "r/news",
    "body": "All companies are though.  Care to cite what wage you are talking about?  Cashiers? Managers? Pharmtechs? Pharmacists?\n",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484267098.0,
    "date_created": "2017-01-12",
    "time_created": "11:24:58",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccg8du",
    "parent_id": "t1_dcc41eb",
    "subreddit_name_prefixed": "r/news",
    "body": "vernacular free market capitalism at work! it's great, until it isn't!\n\n\nseriously, though, some things need socialism.... like this and almost all health related things , prisons, police, fire department, education, water, roads, a lot of safety related items (fda, osha, etc), military, basic research..... pretty much anything worth doing that isn't or can't be justified by short or medium term profitably.\n\n\nhell, if we were smart as a country, we'd socialize our electric grid and find a way to make photovoltaic roofs cheaper and better than asphalt shingles, and then export our excess power to pay off our national debt.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484281286.0,
    "date_created": "2017-01-12",
    "time_created": "15:21:26",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3g4p",
    "parent_id": "t1_dcc1idk",
    "subreddit_name_prefixed": "r/news",
    "body": "*gurgling on floor* I wish I hadn't gone Great Value on this one!!",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1484267185.0,
    "date_created": "2017-01-12",
    "time_created": "11:26:25",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc5z3q",
    "parent_id": "t1_dcc56u3",
    "subreddit_name_prefixed": "r/news",
    "body": "Pharma suppliers basically buy off the doctors.  It's not likely to be a literal \"deal\".  But the brands are heavy in med school and pushed on practices by those mfgs who have insane markups to pay for that kind of advertising.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1484270025.0,
    "date_created": "2017-01-12",
    "time_created": "12:13:45",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccgjkx",
    "parent_id": "t1_dccg8hg",
    "subreddit_name_prefixed": "r/news",
    "body": "Too bad if you work for the company it's a shit show lol",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1484281636.0,
    "date_created": "2017-01-12",
    "time_created": "15:27:16",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc9q40",
    "parent_id": "t1_dcc3v5w",
    "subreddit_name_prefixed": "r/news",
    "body": "The government grants pharmaceutical companies a monopoly on drugs they've developed in order to encourage new drug development. The rest of the world gets to free-ride to some extent. It'd be great if our policy changed to share the costs with you guys a bit more, but for now it's not happening.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1484274109.0,
    "date_created": "2017-01-12",
    "time_created": "13:21:49",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccrplz",
    "parent_id": "t1_dccpazx",
    "subreddit_name_prefixed": "r/news",
    "body": "Government is enforcing the inability for anyone besides large drug companies with lobbyists to even enter the market. But it is Capitalism, that's for damn sure.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484294757.0,
    "date_created": "2017-01-12",
    "time_created": "19:05:57",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3caz",
    "parent_id": "t1_dcc0bl1",
    "subreddit_name_prefixed": "r/news",
    "body": "For medical technology, the price of production of a product or drug is almost irrelevant. The high prices come from the R&D. I don't know about epipens specifically, but the average drug costs $1-3billion to bring to market. On top of that, less than 1 in a 100 drugs make it to market. And then the patent then typically expires after 10-20yrs. \n\nSo in that time the drug has to make back it's billions, and compensate for all the other 100+ drugs that made zero money at all. That's why medical tech/drugs are expensive, the actual production is usually trivial. \n\nFrom what I gather, Epipens are indeed overpriced though, even with that in mind.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1484267065.0,
    "date_created": "2017-01-12",
    "time_created": "11:24:25",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc0o9r",
    "parent_id": "t1_dcc0bl1",
    "subreddit_name_prefixed": "r/news",
    "body": "http://www.mercurynews.com/2016/10/01/epipen-outrage-silicon-valley-engineers-figure-true-cost-to-make-lifesaving-auto-injector-about-10/\n\n\nAbout $8 for two of them.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1484263888.0,
    "date_created": "2017-01-12",
    "time_created": "10:31:28",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3pm0",
    "parent_id": "t1_dcc2hvr",
    "subreddit_name_prefixed": "r/news",
    "body": "Should we thank the media for putting a spotlight on it? ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1484267482.0,
    "date_created": "2017-01-12",
    "time_created": "11:31:22",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcce66e",
    "parent_id": "t1_dcce05f",
    "subreddit_name_prefixed": "r/news",
    "body": "It's amazing when the government doesn't help to quash competition. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1484278990.0,
    "date_created": "2017-01-12",
    "time_created": "14:43:10",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2pvc",
    "parent_id": "t1_dcc11r3",
    "subreddit_name_prefixed": "r/news",
    "body": "Except EpiPens used to be <$50 each, and the company just decided one day to increase that to >$300 each.\n\nTheir reasoning being \"what, are you just going to die instead?\"",
    "controversiality": 0,
    "ups": 66,
    "downs": 0,
    "score": 66,
    "created": 1484266362.0,
    "date_created": "2017-01-12",
    "time_created": "11:12:42",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc5o6t",
    "parent_id": "t1_dcc11r3",
    "subreddit_name_prefixed": "r/news",
    "body": "i'm amazed people constantly blame the corporations but don't get to the root cause of why corporations can charge basically whatever they want for drugs:  Patent laws.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484269685.0,
    "date_created": "2017-01-12",
    "time_created": "12:08:05",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3hoj",
    "parent_id": "t1_dcc37ms",
    "subreddit_name_prefixed": "r/news",
    "body": "Which is how free markets should work.  Hopefully EpiPen pricing will eventually go back down to where it should be and these pharmaceutical company trolls will have learned a lesson.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484267235.0,
    "date_created": "2017-01-12",
    "time_created": "11:27:15",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcbzcjj",
    "parent_id": "t1_dcbysnk",
    "subreddit_name_prefixed": "r/news",
    "body": "It just now occurred to me why the commercials say \"ask for it by name.\"",
    "controversiality": 0,
    "ups": 3510,
    "downs": 0,
    "score": 3510,
    "created": 1484262157.0,
    "date_created": "2017-01-12",
    "time_created": "10:02:37",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc24sw",
    "parent_id": "t1_dcbysnk",
    "subreddit_name_prefixed": "r/news",
    "body": "Adrenaclick: apply directly to the forehead Adrenaclick: apply directly to the forehead Adrenaclick: apply directly to the forehead Adrenaclick: apply directly to the forehead Adrenaclick: apply directly to the forehead Adrenaclick: apply directly to the forehead **Adrenaclick: apply directly to the forehead**",
    "controversiality": 0,
    "ups": 94,
    "downs": 0,
    "score": 94,
    "created": 1484265664.0,
    "date_created": "2017-01-12",
    "time_created": "11:01:04",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcbzyoc",
    "parent_id": "t1_dcbysnk",
    "subreddit_name_prefixed": "r/news",
    "body": "It sounds like a superheroes name ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1484262985.0,
    "date_created": "2017-01-12",
    "time_created": "10:16:25",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc1o56",
    "parent_id": "t1_dcbysnk",
    "subreddit_name_prefixed": "r/news",
    "body": "\"... no really rent is due Monday and you can die if you don't have this thing\"",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484265112.0,
    "date_created": "2017-01-12",
    "time_created": "10:51:52",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2jl8",
    "parent_id": "t1_dcbysnk",
    "subreddit_name_prefixed": "r/news",
    "body": "Side effects may include restlessness, increased heart rate, dysphoria, confused poops, spastic eyeball, and undeath.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484266158.0,
    "date_created": "2017-01-12",
    "time_created": "11:09:18",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4flv",
    "parent_id": "t1_dcbysnk",
    "subreddit_name_prefixed": "r/news",
    "body": "CVS Pharmacy Tech hijacking the top comment here!\n\nYou have to get a prescription for ADRENACLICK OR EPINEPHRINE in order for us to fill the medication. \n\nThere is also a patient assistance program that will allow you to receive Adrenaclick for free by the manufacturer Impax Laboratories. Here is the website (http://www.epinephrineautoinject.com) Present us the coupon at drop off with your prescription pretty please! ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484268295.0,
    "date_created": "2017-01-12",
    "time_created": "11:44:55",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4if9",
    "parent_id": "t1_dcbysnk",
    "subreddit_name_prefixed": "r/news",
    "body": "How do I make my comments extra large like that?",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484268383.0,
    "date_created": "2017-01-12",
    "time_created": "11:46:23",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc13le",
    "parent_id": "t1_dcbzf1m",
    "subreddit_name_prefixed": "r/news",
    "body": "A statement that can be applied to more and more articles these days unfortunately.\n\nNo probs.",
    "controversiality": 0,
    "ups": 114,
    "downs": 0,
    "score": 114,
    "created": 1484264415.0,
    "date_created": "2017-01-12",
    "time_created": "10:40:15",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc1rka",
    "parent_id": "t1_dcc1lmw",
    "subreddit_name_prefixed": "r/news",
    "body": "The injector systems are different. What it boils down to is the Epipen injector system automatically retracts the needle into a protective housing, whereas Adrenaclick's doesn't. The Epipen is also considered easier to use by people who have never been trained with it. \n\nAccidental needle sticks are taken very seriously, as they're a great way to transfer blood-borne pathogens.",
    "controversiality": 0,
    "ups": 214,
    "downs": 0,
    "score": 214,
    "created": 1484265229.0,
    "date_created": "2017-01-12",
    "time_created": "10:53:49",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc291d",
    "parent_id": "t1_dcc1lmw",
    "subreddit_name_prefixed": "r/news",
    "body": "Because the injection tool is different even though the drug is the same.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1484265806.0,
    "date_created": "2017-01-12",
    "time_created": "11:03:26",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2kaq",
    "parent_id": "t1_dcc23el",
    "subreddit_name_prefixed": "r/news",
    "body": "All drugs are periodically tested for purity and potency, when Auvi-Q was tested they discovered that the device was not consistently delivering the correct dose of epinephrine (not injecting enough). Since it's a life saving device/medicine, it was issued a class 1 recall (highest possible) and every unit was returned to the manufacturer and every patient ever given one had to be contacted from their pharmacy to be informed of the issue.",
    "controversiality": 0,
    "ups": 77,
    "downs": 0,
    "score": 77,
    "created": 1484266182.0,
    "date_created": "2017-01-12",
    "time_created": "11:09:42",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2fxj",
    "parent_id": "t1_dcc2039",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah it was. We all loved it. Pretty much fool-proof if you speak English, and it was way more portable than epipens. ",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1484266037.0,
    "date_created": "2017-01-12",
    "time_created": "11:07:17",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc47pz",
    "parent_id": "t1_dcc2039",
    "subreddit_name_prefixed": "r/news",
    "body": "Until it started talking. I don't take no shit from machines.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1484268049.0,
    "date_created": "2017-01-12",
    "time_created": "11:40:49",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4o1u",
    "parent_id": "t1_dcc2039",
    "subreddit_name_prefixed": "r/news",
    "body": "Looks like the Auvi-Q is reentering the market this year.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484268556.0,
    "date_created": "2017-01-12",
    "time_created": "11:49:16",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcceoif",
    "parent_id": "t1_dcc1ln9",
    "subreddit_name_prefixed": "r/news",
    "body": "If they can reasonably get a hold of your doctor. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1484279553.0,
    "date_created": "2017-01-12",
    "time_created": "14:52:33",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc28x6",
    "parent_id": "t1_dcbzuqe",
    "subreddit_name_prefixed": "r/news",
    "body": "You overestimate how quickly this process happens. I've made 4 phone calls and sent 3 faxes do a doctors office over 3 days about an interaction. No response. It happens way to commonly.\n\nIf people are informed, they can then prevent this process and get their medications quicker.\n\nMeanwhile patients commonly think \"well if the doctor wrote it, they must want me on it\". The profession is being treated to much like fast food workers.",
    "controversiality": 0,
    "ups": 58,
    "downs": 0,
    "score": 58,
    "created": 1484265803.0,
    "date_created": "2017-01-12",
    "time_created": "11:03:23",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc0mwh",
    "parent_id": "t1_dcbzuqe",
    "subreddit_name_prefixed": "r/news",
    "body": "It's easy to do when you're working in a store that fills 80 scripts a day. Then sure, I'll take the time to run both through your insurance to see which is cheaper and call your doctor to switch.\n\nWhen you're in a store that does 1500 scripts a day, and you're already backed up by a few hours, it's a whole different story. Sad but true.",
    "controversiality": 0,
    "ups": 266,
    "downs": 0,
    "score": 266,
    "created": 1484263839.0,
    "date_created": "2017-01-12",
    "time_created": "10:30:39",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc8r1r",
    "parent_id": "t1_dcbzuqe",
    "subreddit_name_prefixed": "r/news",
    "body": "As a pharmacist i would love to be able ro do that.  However there is so much shit that i have to get done that it gets difficult and spending 10 minutes to get the change from the dr office makes it even harder. I have to keep track of techs, make sure people are being served in a timely manner,  check scripts for accuracy and consult patients on new scripts.  If I spend more time than i have to on one parient I decrease the quality of care for other patients and increase the chances of making an error.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1484273047.0,
    "date_created": "2017-01-12",
    "time_created": "13:04:07",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc19l1",
    "parent_id": "t1_dcbzth7",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 75,
    "downs": 0,
    "score": 75,
    "created": 1484264622.0,
    "date_created": "2017-01-12",
    "time_created": "10:43:42",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc05wc",
    "parent_id": "t1_dcbzth7",
    "subreddit_name_prefixed": "r/news",
    "body": "It's because, for some reason, people expect the pharmacist to dispense something other than what the doctor prescribed. I cannot understand why this is such a difficult concept for people.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1484263244.0,
    "date_created": "2017-01-12",
    "time_created": "10:20:44",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcca3o9",
    "parent_id": "t1_dcca01g",
    "subreddit_name_prefixed": "r/news",
    "body": "Dude there are so many drugs out nowadays sometimes the first time I hear about them is TV commercials",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484274518.0,
    "date_created": "2017-01-12",
    "time_created": "13:28:38",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc0496",
    "parent_id": "t1_dcbzoot",
    "subreddit_name_prefixed": "r/news",
    "body": "I'd like to see this.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1484263186.0,
    "date_created": "2017-01-12",
    "time_created": "10:19:46",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc1qq7",
    "parent_id": "t1_dcbzoot",
    "subreddit_name_prefixed": "r/news",
    "body": "I don't see this on their 4 dollar list.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1484265200.0,
    "date_created": "2017-01-12",
    "time_created": "10:53:20",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2uxs",
    "parent_id": "t1_dcc2s3d",
    "subreddit_name_prefixed": "r/news",
    "body": "Uhm technically yes but you'd probably get the generic for adrenaclick before you got the brand epipen or we'd ask if you have a preference. It definitely makes it easier though since we could legally fill either. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484266522.0,
    "date_created": "2017-01-12",
    "time_created": "11:15:22",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccq6tx",
    "parent_id": "t1_dcc60pj",
    "subreddit_name_prefixed": "r/news",
    "body": "that that that worked",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1484292769.0,
    "date_created": "2017-01-12",
    "time_created": "18:32:49",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccjwi5",
    "parent_id": "t1_dccairq",
    "subreddit_name_prefixed": "r/news",
    "body": "First off, I agree that the patent and copyright system as they are today are so absurd that we'd probably be better off completely without them.\n\nThe patent system has a clever twist: If you want to patent something, you have to describe it. That means, you get a monopoly on it for 18 years or so, but after that, anyone can freely use the technology. The alternative would be companies hiding their knowledge as trade secrets. So the patent system may be worth fixing.\n\nHaving some way of rewarding content creators isn't bad either, copyright and its implications are just fucked up. Maybe restricting  it to commercial activity would be the best. Or just abolishing it, tbh.",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1484285334.0,
    "date_created": "2017-01-12",
    "time_created": "16:28:54",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccdk39",
    "parent_id": "t1_dccairq",
    "subreddit_name_prefixed": "r/news",
    "body": "what if you were an independent film maker who came up with a great idea for a movie. you spent your while life designing an amazingly original movie. you release it on the internet and it gets great reviews by many people and makes you 200 dollars in its first week! \n\na few months later your movie is popular in the underground community but you still have only made $1000 from it. you are disappointed that you can't advertise your movie because you are borderline broke as it is. \n\nyou read on a newspaper as you walk out of the store \"This Friday Disney to Release an Original Film.\" You have been a fan of disney so you go on friday to the premier. \n\nAs the commericials end before the movie you look up to see... The movie you made a couple months appear on the screen. You freak out. Disney had directly copyed your movie and is now trying to make money from it. You run out of the theatre and check that OMG! critics are loving the new disney film. Disney's newest original movie is predicted ti make 2 billion dollars in the next month!\n\nand you can't do anything about it. copyrights don't exist, the government doesn't care who copys who. now disney is profiting off your idea and you wont see a penny of revenue. Disney used their big name to influence people to come to the movie. and now the movie is spreading across the nation like wildfire.\n\nthis is why copyrights exist. to protect the small artists. not the big ones.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1484278305.0,
    "date_created": "2017-01-12",
    "time_created": "14:31:45",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2xqi",
    "parent_id": "t1_dcc1jj9",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah, if you get a prescription for \"EpiPen\" you won't be able to get the less expensive one",
    "controversiality": 0,
    "ups": 324,
    "downs": 0,
    "score": 324,
    "created": 1484266612.0,
    "date_created": "2017-01-12",
    "time_created": "11:16:52",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4zok",
    "parent_id": "t1_dcc1jj9",
    "subreddit_name_prefixed": "r/news",
    "body": "I wonder what it would take for \"Epipen\" to enter common lexicon much like it did for Xerox.",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1484268920.0,
    "date_created": "2017-01-12",
    "time_created": "11:55:20",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc6ds8",
    "parent_id": "t1_dcc1te7",
    "subreddit_name_prefixed": "r/news",
    "body": "I've never had a Dr. write a prescription for a brand name.  Do some actually do this?  Our Dr. always writes the Rx with the actual name of the drug, so that it doesn't matter which brand we get. ",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1484270478.0,
    "date_created": "2017-01-12",
    "time_created": "12:21:18",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccdr61",
    "parent_id": "t1_dcc3ym8",
    "subreddit_name_prefixed": "r/news",
    "body": "Definitely have two at all times -- not just for backup, but in case of a biphasic reaction. Often enough a second dose is needed in short order.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1484278524.0,
    "date_created": "2017-01-12",
    "time_created": "14:35:24",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccyr0g",
    "parent_id": "t1_dcc3ym8",
    "subreddit_name_prefixed": "r/news",
    "body": "Also important in case a caregiver fails to do it correctly the first time. It's really easy to hit muscle on a little kid, especially if you're inexperienced and panicked. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484304198.0,
    "date_created": "2017-01-12",
    "time_created": "21:43:18",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccf9wd",
    "parent_id": "t1_dcc3hsk",
    "subreddit_name_prefixed": "r/news",
    "body": "We get epi-pens for my son at zero out of pocket cost with our insurance and this coupon.  Without the coupon our insurance covers all but ~$50.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484280209.0,
    "date_created": "2017-01-12",
    "time_created": "15:03:29",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc5aqe",
    "parent_id": "t1_dcc3t5d",
    "subreddit_name_prefixed": "r/news",
    "body": "My insurance used to cover it but they stopped a few years ago. They usually last a little more than a year\n",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484269258.0,
    "date_created": "2017-01-12",
    "time_created": "12:00:58",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc6pj5",
    "parent_id": "t1_dcc5pz6",
    "subreddit_name_prefixed": "r/news",
    "body": "i GET $25 a month for child support from her. Doubt she would give me a penny more. I dont peruse it with her since she didnt give me a hassle when we were getting divorced she willingly handed over custody of our son to me  (she said she didnt have time to raise him since she was too busy screwing our neighbor) \n",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1484270831.0,
    "date_created": "2017-01-12",
    "time_created": "12:27:11",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2w1n",
    "parent_id": "t1_dcc1wm3",
    "subreddit_name_prefixed": "r/news",
    "body": "[The EpiPen manufacturer recommends room temperature](https://www.epipen.com/hcp/about-epipen/safety-and-storage):\n\n> EpiPen® and EpiPen Jr® (epinephrine injection, USP) Auto-Injectors should be stored in the carrier tube provided at a temperature of 25ºC (77ºF); however, temperature excursions between 15ºC and 30ºC (59ºF to 86ºF) are permitted.1 EpiPen® and EpiPen Jr® Auto-Injectors should not be stored in refrigerators or in a vehicle’s glove box.1 EpiPen® Auto-Injectors should not be exposed to extreme heat or cold and should be protected from light.\n\n[To avoid bacteria growth in food, the FDA recommends](http://www.fda.gov/ForConsumers/ConsumerUpdates/ucm093704.htm): \n> Keep the refrigerator temperature at or below 40° F (4° C).\n\nSo keeping EpiPens in the fridge puts them about 19° F too low for the 'excursion' temperature.\n\nEdits for clarification.",
    "controversiality": 0,
    "ups": 136,
    "downs": 0,
    "score": 136,
    "created": 1484266559.0,
    "date_created": "2017-01-12",
    "time_created": "11:15:59",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc51jr",
    "parent_id": "t1_dcc1wm3",
    "subreddit_name_prefixed": "r/news",
    "body": "By the way.. if an Epipen is past the expiration date, is it still useful in an emergency situation if you can't find the Epipen that is still before the expiration date?",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1484268977.0,
    "date_created": "2017-01-12",
    "time_created": "11:56:17",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2aaw",
    "parent_id": "t1_dcc1wm3",
    "subreddit_name_prefixed": "r/news",
    "body": "When I worked at CVS we kept the epi injections in a little mini fridge next to the pharmacist's workstation",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1484265849.0,
    "date_created": "2017-01-12",
    "time_created": "11:04:09",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccariu",
    "parent_id": "t1_dcc1wm3",
    "subreddit_name_prefixed": "r/news",
    "body": "Putting your EpiPen in the fridge is a surefire way of instantly wrecking it. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1484275232.0,
    "date_created": "2017-01-12",
    "time_created": "13:40:32",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccogvs",
    "parent_id": "t1_dccncjy",
    "subreddit_name_prefixed": "r/news",
    "body": "I really feel like this should be reversed. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1484290618.0,
    "date_created": "2017-01-12",
    "time_created": "17:56:58",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc1huc",
    "parent_id": "t1_dcbzhk5",
    "subreddit_name_prefixed": "r/news",
    "body": "Great, just what I need, a 30-foot long pdf.",
    "controversiality": 0,
    "ups": 942,
    "downs": 0,
    "score": 942,
    "created": 1484264899.0,
    "date_created": "2017-01-12",
    "time_created": "10:48:19",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc0a5s",
    "parent_id": "t1_dcbzhk5",
    "subreddit_name_prefixed": "r/news",
    "body": "Unless they don't ask you before they print it. Like at the drive thru window. :/",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1484263394.0,
    "date_created": "2017-01-12",
    "time_created": "10:23:14",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcca2c1",
    "parent_id": "t1_dcc4q2d",
    "subreddit_name_prefixed": "r/news",
    "body": "I can't be waiting around for that manuscript to print out, I've got shit to do.  And when I up and bail and the next person who's around for the final print out, they'll see I mean that literally.\n\n\"Preparation H and hot sauce, huh?  Someone likes to party.\" ^^Tom ^^Segura",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484274478.0,
    "date_created": "2017-01-12",
    "time_created": "13:27:58",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcby4gm",
    "parent_id": "t1_dcbxwg8",
    "subreddit_name_prefixed": "r/news",
    "body": "It became store policy, it is definitely hurting profits but they took a stand and many people in the healthcare community supported it.  I wouldnt be surprised if other major pharmacies enact a similar policy in the next 5 years",
    "controversiality": 0,
    "ups": 641,
    "downs": 0,
    "score": 641,
    "created": 1484260455.0,
    "date_created": "2017-01-12",
    "time_created": "09:34:15",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcby5o4",
    "parent_id": "t1_dcbxwg8",
    "subreddit_name_prefixed": "r/news",
    "body": "It's chain-wide, because they wanted to have on-site clinics in their stores (some states have laws prohibiting tobacco sales in medical offices, or something like that)",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1484260504.0,
    "date_created": "2017-01-12",
    "time_created": "09:35:04",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcbya8z",
    "parent_id": "t1_dcbxwg8",
    "subreddit_name_prefixed": "r/news",
    "body": "The cigarettes move was a corporate-level change, because of their self-state commitment to their customer's health and the incompatibility of cigarettes with that mission.\n***\nOn the issue of the homeopathic stuff, I don't think that's such a bad thing... But it should be easy enough to tell that it's not an actually tested drug, instead of bearing no specific markings about whether it's been approved as a treatment or not.  \nWhile trying to avoid opening a nasty can of worms on that debate, I feel that sometimes those products *can* be helpful. Like a natural supplement to help get more restful sleep (placebo effect perhaps, or maybe not), not like a miracle drug that cures arthritis.",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1484260689.0,
    "date_created": "2017-01-12",
    "time_created": "09:38:09",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc34uy",
    "parent_id": "t1_dcbxwg8",
    "subreddit_name_prefixed": "r/news",
    "body": "My friends dad owned a drug store back in the day that sold cigarettes. He said \"we'll help you in the back and kill you in the front.\"",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484266837.0,
    "date_created": "2017-01-12",
    "time_created": "11:20:37",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc6vdf",
    "parent_id": "t1_dcbxwg8",
    "subreddit_name_prefixed": "r/news",
    "body": "I was just reading your first paragraph and thinking, \"Yeah, but they sell that homeopathic crap next to the real medicine,\" and then, what do you know....",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484271005.0,
    "date_created": "2017-01-12",
    "time_created": "12:30:05",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc028a",
    "parent_id": "t1_dcbxwg8",
    "subreddit_name_prefixed": "r/news",
    "body": "When I went to the US, I was blown away by the fact that pharmacies were selling cigarettes. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484263114.0,
    "date_created": "2017-01-12",
    "time_created": "10:18:34",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3dge",
    "parent_id": "t1_dcc2534",
    "subreddit_name_prefixed": "r/news",
    "body": "A perfect example of why the free market and competition is great for the consumer.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1484267102.0,
    "date_created": "2017-01-12",
    "time_created": "11:25:02",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccg2j2",
    "parent_id": "t1_dcbxmry",
    "subreddit_name_prefixed": "r/news",
    "body": "I work at CVS, I'm going to have PTSD from coupons and couponers. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484281103.0,
    "date_created": "2017-01-12",
    "time_created": "15:18:23",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc9897",
    "parent_id": "t1_dcc7rzo",
    "subreddit_name_prefixed": "r/news",
    "body": "- They emailed my CEO (about 5 management levels above me) instead of my boss when I told them that I was unable to join their conference calls on Sunday mornings. \n- They called my cell phone 12 times on a Saturday night between 6pm and 9pm when I was a groomsmen in a friends wedding. I told them months in advance I was out of town that weekend for a wedding. I gave them alternative PMs contact information in the event emergencies arose. The \"emergency\" that prompted them to spam my cell phone during a wedding I was in was that they wanted to know if I could adjust 1 tasks timeline in my overall project plan. They never contact the other PMs whose info I gave them once. \n- When I didn't answer my cell phone during the wedding, they located my personal Facebook page and start spamming my inbox telling me, on Facebook, that I needed to call them immediately. Again, they knew I was at a wedding. \n- They told me, repeatedly, that \"they didn't care what they purchased\" and that they had the ability to \"change the scope without warning at any time\" because \"we work for them not the other way around\". Not entirely untrue, but still... fuck you. \n- They demanded a discount in pricing of our services because I had to leave work unexpectedly one day due to a family member unexpectedly going to the hospital with health issues. \n\nI could go on... I think you get the idea. \n\nEdit: Typo. ",
    "controversiality": 0,
    "ups": 120,
    "downs": 0,
    "score": 120,
    "created": 1484273569.0,
    "date_created": "2017-01-12",
    "time_created": "13:12:49",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc69mn",
    "parent_id": "t1_dcc5q85",
    "subreddit_name_prefixed": "r/news",
    "body": "I haven't worked for the company that worked with Mylan for about a year now, but I would prefer to not put anything specific enough out there to identify my former company. I wouldn't put it past one of those assholes I described to find this and lash out at my former company for this - they are *that* shitty. All I'll tell you is that I was a project manager who worked closely with directors in both their tech and operations departments and it was the worst 6 month project of my career. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1484270350.0,
    "date_created": "2017-01-12",
    "time_created": "12:19:10",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4dxr",
    "parent_id": "t1_dcc2qpp",
    "subreddit_name_prefixed": "r/news",
    "body": "The coupon is for 100 dollars off. Print it out and bring it in, if you are still in the time window and have your receipt they may be able to rebill it to the coupon and refund you the difference.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1484268242.0,
    "date_created": "2017-01-12",
    "time_created": "11:44:02",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccs6jt",
    "parent_id": "t1_dcc8mkv",
    "subreddit_name_prefixed": "r/news",
    "body": "How is that even legal in any developed country? ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1484295386.0,
    "date_created": "2017-01-12",
    "time_created": "19:16:26",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc9346",
    "parent_id": "t1_dcc54xq",
    "subreddit_name_prefixed": "r/news",
    "body": "I can confirm this. Every time I have to call a CVS for a transfer or something they sound so stressed out. ",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1484273415.0,
    "date_created": "2017-01-12",
    "time_created": "13:10:15",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc9rqg",
    "parent_id": "t1_dcc54xq",
    "subreddit_name_prefixed": "r/news",
    "body": ">12 hour shifts with no lunch breaks\n\nSounds illegal to me. Idk about states, but you're entitled to at least a half hour lunch if you work more than 5 hours.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1484274159.0,
    "date_created": "2017-01-12",
    "time_created": "13:22:39",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3fmd",
    "parent_id": "t1_dcc2wrc",
    "subreddit_name_prefixed": "r/news",
    "body": "I interviewed with CVS Health a few years ago right after they made the change. They told me that the loss in revenue from tobacco products was much less than the marketing value of the announcement that they would no longer sell any tobacco products at their pharmacies (in combination with their rebranding to CVS \"Health\"). So your alderman is basically on the money here as far as I can tell.",
    "controversiality": 0,
    "ups": 127,
    "downs": 0,
    "score": 127,
    "created": 1484267169.0,
    "date_created": "2017-01-12",
    "time_created": "11:26:09",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc7fvk",
    "parent_id": "t1_dcc2wrc",
    "subreddit_name_prefixed": "r/news",
    "body": "Tobacco products accounted for about two billion in sales annually:\nhttp://m.huffpost.com/us/entry/5762212\n\nThey are investing in their clinics and didn't feel it was appropriate to provide healthcare and sell cigarettes. There is speculation in this thread that there are laws against selling cigarettes in a healthcare setting, but no proof provided. I am pretty sure there is no law against CVS selling cigarettes. ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1484271642.0,
    "date_created": "2017-01-12",
    "time_created": "12:40:42",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc5tqr",
    "parent_id": "t1_dcc2wrc",
    "subreddit_name_prefixed": "r/news",
    "body": "Depends on if people customers are coming in for more than just cigarettes, i.e. buying other things while in the store (though in my experience, lots of cigarette buyers only come in for cigarettes).",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484269859.0,
    "date_created": "2017-01-12",
    "time_created": "12:10:59",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3qpr",
    "parent_id": "t1_dcc3b6p",
    "subreddit_name_prefixed": "r/news",
    "body": "the end result being no cigs and clinics in their stores?  I don't really see a problem even if it was just a pr move.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1484267518.0,
    "date_created": "2017-01-12",
    "time_created": "11:31:58",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccij77",
    "parent_id": "t1_dccgz6s",
    "subreddit_name_prefixed": "r/news",
    "body": "Why not take it to an independent pharmacy for 30 day refills? At least you know at an independent that they treat their patients and employees with respect.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1484283830.0,
    "date_created": "2017-01-12",
    "time_created": "16:03:50",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4s2q",
    "parent_id": "t1_dcc48qp",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1484268682.0,
    "date_created": "2017-01-12",
    "time_created": "11:51:22",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4cnv",
    "parent_id": "t1_dcc1zoe",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm a physician assistant student with a bee allergy and I wouldn't even trust myself to draw up epi while actively dying. \n\nI carry a generic autoinjector. It really does work differently than the epipen. I has two safeties (epipen has one) and doesn't come with a trainer like my old epipens did. Patients do need to know that they're getting something that works differently and that its a good idea to watch a video, read the directions and find the safeties while still healthy. \n\nBut it was ten bucks for two of them so I think it's a fair trade off for having to spend a few minutes reading the directions and finding the safties ",
    "controversiality": 0,
    "ups": 55,
    "downs": 0,
    "score": 55,
    "created": 1484268201.0,
    "date_created": "2017-01-12",
    "time_created": "11:43:21",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc27cv",
    "parent_id": "t1_dcc1m3s",
    "subreddit_name_prefixed": "r/news",
    "body": "CVS has to calculate storage, shipping, more storage, distribution, taxes, etc until you get it in your hands.  So, yeah, $50 to save my life?  I'll take it all day every day.",
    "controversiality": 0,
    "ups": 114,
    "downs": 0,
    "score": 114,
    "created": 1484265750.0,
    "date_created": "2017-01-12",
    "time_created": "11:02:30",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc21mh",
    "parent_id": "t1_dcc1m3s",
    "subreddit_name_prefixed": "r/news",
    "body": "And the cost to meet the federal regulations is also high. Not that it is a bad thing, but it is a cost. ",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1484265557.0,
    "date_created": "2017-01-12",
    "time_created": "10:59:17",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2dir",
    "parent_id": "t1_dcc1m3s",
    "subreddit_name_prefixed": "r/news",
    "body": "The drugs in the EpiPen costs less than a dollar, it's the injector that costs money to make and develop. That company spent a ton of time and money to create it so it could inject through jeans without getting pieces of fabric in the injection site that would later become infected. That's what's protected and where all of the costs (and monopoly power) come from.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1484265957.0,
    "date_created": "2017-01-12",
    "time_created": "11:05:57",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc8qve",
    "parent_id": "t1_dcc1m3s",
    "subreddit_name_prefixed": "r/news",
    "body": "Keep in mind, it's not just the cost of R&D (research and development) for *this* product.  Something like 199 out of 200 products do not succeed the path through lab testing, medical trials, and regulations.  So in many ways, the R&D costs of some 200 failed products is built into each successful one.  \n\nAlso, while it may only cost a small amount \"to make\" each unit, this probably does not cover the insane product liability risks of the production factories.  If just one person dies as a result of a very slightly imperfect unit, there's risk of public/media outcry, recalls, etc., which mean liability insurance can be incredibly expensive for medical product manufacturers.\n\n\nPeople (including /r/latestagecapitalism) tend to discount both the intrinsic value of IP and the often extreme R&D costs that it takes to produce and update/maintain.  This also goes for \n\n* branding/marketing intangibles -- why a shirt with a certain logo on it can cost several times more than a plain shirt\n* music, movies, and other media -- the creators often spent significant time and opportunity costs to create these things, and doing so  can be a very risky investments!  These people also have skills/features that are generally very rare in our society\n* software -- Sure, it costs nothing to make another digital copy, but it took ages and lots of people and money to create it\n* basically everything else where the item seems cheap to make in a factory but still costs quite a lot at the store.\n\nSource: tax attorney who deals with valuation of IP",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1484273041.0,
    "date_created": "2017-01-12",
    "time_created": "13:04:01",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2tbi",
    "parent_id": "t1_dcc1svs",
    "subreddit_name_prefixed": "r/news",
    "body": "Just curious.. as I'm sitting here reading what exactly makes up a single payer system, what is everyone's aversion to it? Best I can tell is that Canada and Taiwan are the only countries that have a true single payer system.\n\nEdit: OK.. after reading a bit more, I still don't understand why people refuse to want single payer. For example, I pay taxes. Some would argue I pay quite a bit more than people with children (tax deductions - AKA child subsidies). If I can make up the slack that people with children do not pay, why not have a single payer health care system too?",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1484266471.0,
    "date_created": "2017-01-12",
    "time_created": "11:14:31",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2v19",
    "parent_id": "t1_dcc1svs",
    "subreddit_name_prefixed": "r/news",
    "body": "Oh god prepare yourself. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484266526.0,
    "date_created": "2017-01-12",
    "time_created": "11:15:26",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc5u18",
    "parent_id": "t1_dcc3jxt",
    "subreddit_name_prefixed": "r/news",
    "body": "it is. epi-pen is actually the example I've had used in every Econ class I've taken",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1484269867.0,
    "date_created": "2017-01-12",
    "time_created": "12:11:07",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc9i8t",
    "parent_id": "t1_dcc6n1a",
    "subreddit_name_prefixed": "r/news",
    "body": "Girls do love shopping.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1484273870.0,
    "date_created": "2017-01-12",
    "time_created": "13:17:50",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc61yy",
    "parent_id": "t1_dcc2isj",
    "subreddit_name_prefixed": "r/news",
    "body": "They pay better than minimum wage for most positions",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1484270115.0,
    "date_created": "2017-01-12",
    "time_created": "12:15:15",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccf555",
    "parent_id": "t1_dcc2isj",
    "subreddit_name_prefixed": "r/news",
    "body": "*You know what that means when someone pays you minimum wage? You know what your boss was trying to say? \"Hey if I could pay you less, I would, but it's against the law.\"*\n\n– Chris Rock",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1484280057.0,
    "date_created": "2017-01-12",
    "time_created": "15:00:57",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2neg",
    "parent_id": "t1_dcc28uf",
    "subreddit_name_prefixed": "r/news",
    "body": "Depends on why they are getting heated i suppose. Being a low wage worker isn't an excuse for being a shit person ",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1484266282.0,
    "date_created": "2017-01-12",
    "time_created": "11:11:22",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4l6j",
    "parent_id": "t1_dcc3g4p",
    "subreddit_name_prefixed": "r/news",
    "body": "You can feel the value.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1484268467.0,
    "date_created": "2017-01-12",
    "time_created": "11:47:47",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc6ip8",
    "parent_id": "t1_dcc5z3q",
    "subreddit_name_prefixed": "r/news",
    "body": "It's not ethical for a physician to be influenced by any of that. We have free lunches every now and then provided by drug reps, but everyone takes them with a grain of salt as we know they're just trying to push their brand, and we all prescribe generic anyway.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484270627.0,
    "date_created": "2017-01-12",
    "time_created": "12:23:47",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccgw24",
    "parent_id": "t1_dccgjkx",
    "subreddit_name_prefixed": "r/news",
    "body": "CVS employees get treated like shit, their security is a joke, and they penalize pharmacy staff if they don't immediately take inventory after an armed robbery.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1484282021.0,
    "date_created": "2017-01-12",
    "time_created": "15:33:41",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc32wg",
    "parent_id": "t1_dcc0o9r",
    "subreddit_name_prefixed": "r/news",
    "body": "QA is not factored into the cost, and is a large manufacturing cost for drug makers. The FDA is incredibly strict about lemons.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1484266778.0,
    "date_created": "2017-01-12",
    "time_created": "11:19:38",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3230",
    "parent_id": "t1_dcc2pvc",
    "subreddit_name_prefixed": "r/news",
    "body": "Not defending the price hike, more laughing at people that think an epi-injector should be in the realm of $6-10 because they looked up a 1mL container of epinephrine that cost $5.",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1484266752.0,
    "date_created": "2017-01-12",
    "time_created": "11:19:12",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcbzsjg",
    "parent_id": "t1_dcbzcjj",
    "subreddit_name_prefixed": "r/news",
    "body": "\"Ask for it by name\", This allows the pharmacist to direct market to you by telling you to return to your doctor and get the other prescription, to save money. This seems like a conflict of interest, and another headache in a broken healthcare system that revolves around profit and not healthcare. ",
    "controversiality": 0,
    "ups": 2328,
    "downs": 0,
    "score": 2328,
    "created": 1484262762.0,
    "date_created": "2017-01-12",
    "time_created": "10:12:42",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc24cj",
    "parent_id": "t1_dcbzcjj",
    "subreddit_name_prefixed": "r/news",
    "body": "To me, this is silly.  I feel like it would be better if the doctors simply wrote the prescription the the drug as opposed to the product/brand.  This would give the patient the freedom to choose whichever is the best for them. ",
    "controversiality": 0,
    "ups": 63,
    "downs": 0,
    "score": 63,
    "created": 1484265647.0,
    "date_created": "2017-01-12",
    "time_created": "11:00:47",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcbzvzx",
    "parent_id": "t1_dcbzcjj",
    "subreddit_name_prefixed": "r/news",
    "body": "Directions unclear, injector stuck on forehead.\n\n\nEdit: Come to think of it, the last time I asked for something by name I ended up with Meow Mix. I want chicken I want liver Meow Mix Meow Mix please deliver.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1484262888.0,
    "date_created": "2017-01-12",
    "time_created": "10:14:48",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcbzsma",
    "parent_id": "t1_dcbzcjj",
    "subreddit_name_prefixed": "r/news",
    "body": "So they choose the name brand over the generic, precisely. ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1484262765.0,
    "date_created": "2017-01-12",
    "time_created": "10:12:45",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc36jy",
    "parent_id": "t1_dcbzcjj",
    "subreddit_name_prefixed": "r/news",
    "body": "As a pharmacist and a soccer mom, If I had a dollar for every 50 year old guy who asks for \"those tv commercial wiener pills so I can take a bath side by side with my wife on a hill overlooking a Hootie and the Blowfish concert with a raging hard-on\" I'd have a couple of bucks.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484266889.0,
    "date_created": "2017-01-12",
    "time_created": "11:21:29",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2i2l",
    "parent_id": "t1_dcc24sw",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah, Adrenaclick: apply directly to the mid-lateral thigh just doesn't have the same ring to it.",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1484266108.0,
    "date_created": "2017-01-12",
    "time_created": "11:08:28",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc5mrq",
    "parent_id": "t1_dcc24sw",
    "subreddit_name_prefixed": "r/news",
    "body": "Ask for it by meme. ",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1484269641.0,
    "date_created": "2017-01-12",
    "time_created": "12:07:21",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc38ci",
    "parent_id": "t1_dcc13le",
    "subreddit_name_prefixed": "r/news",
    "body": "They say \"don't read the comments\", but threads like this one show why sometimes you should.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1484266944.0,
    "date_created": "2017-01-12",
    "time_created": "11:22:24",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2d5x",
    "parent_id": "t1_dcc1rka",
    "subreddit_name_prefixed": "r/news",
    "body": "More than blood-borne pathogens. Epinephrine is a powerful vasoconstrictor if you accidentally inject one into your thumb it can completely block blood flow and kill the tissue = good bye thumb.",
    "controversiality": 0,
    "ups": 126,
    "downs": 0,
    "score": 126,
    "created": 1484265945.0,
    "date_created": "2017-01-12",
    "time_created": "11:05:45",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3akp",
    "parent_id": "t1_dcc1rka",
    "subreddit_name_prefixed": "r/news",
    "body": "This aspect is something people really don't think about their drugs. The container closures, methods of taking the drug (injection, topical, etc...), ease of use. It is all validated by drug companies. I never realized how much work goes into it until I had to go through it myself. The amount of comparison testing needed is pretty overwhelming. Use of a container that is made with a substance which can bind more proteins can completely change the stability or efficacy of a drug. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1484267013.0,
    "date_created": "2017-01-12",
    "time_created": "11:23:33",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc5jeh",
    "parent_id": "t1_dcc1rka",
    "subreddit_name_prefixed": "r/news",
    "body": "So why doesn't Adrenaclick just make a self-retracting needle?  Does EpiPen have the rights to that design?",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484269533.0,
    "date_created": "2017-01-12",
    "time_created": "12:05:33",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3ask",
    "parent_id": "t1_dcc2kaq",
    "subreddit_name_prefixed": "r/news",
    "body": "funny how in the video the other two are the ones dribbling in a little bit whole the auvi-Q was like a teen who found his dad's porn stash",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1484267020.0,
    "date_created": "2017-01-12",
    "time_created": "11:23:40",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2vgc",
    "parent_id": "t1_dcc2fxj",
    "subreddit_name_prefixed": "r/news",
    "body": "Looks like they are going to try again this year\n\nhttp://www.cnn.com/2016/10/26/health/auvi-q-epinephrine-autoinjector-returns/",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1484266539.0,
    "date_created": "2017-01-12",
    "time_created": "11:15:39",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2pir",
    "parent_id": "t1_dcc2fxj",
    "subreddit_name_prefixed": "r/news",
    "body": "Why was it recalled?",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1484266350.0,
    "date_created": "2017-01-12",
    "time_created": "11:12:30",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc431s",
    "parent_id": "t1_dcc2fxj",
    "subreddit_name_prefixed": "r/news",
    "body": "It's coming back this year!   \n\nhttps://www.auvi-q.com",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484267907.0,
    "date_created": "2017-01-12",
    "time_created": "11:38:27",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccs787",
    "parent_id": "t1_dcc28x6",
    "subreddit_name_prefixed": "r/news",
    "body": "People think I have a BatPhone that connects me directly to their doctor. Nope, I call the same line you do, wait on hold for 15 or 20 minutes, talk to the same receptionist you do, and then they take a message and say they'll call back. Spoiler: 75% of the time they don't call back. \n\nI don't entirely blame the prescribers, especially to patients. Insurance companies are the ones basically running the show, from what and how many you're given, to how it's prescribed, to how much you pay.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484295411.0,
    "date_created": "2017-01-12",
    "time_created": "19:16:51",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccd5st",
    "parent_id": "t1_dcc19l1",
    "subreddit_name_prefixed": "r/news",
    "body": "Here's what it comes down to, *Personal Responsibility*.  The average person needs to take personal responsibility for their own health as well as management of their own health and finances.\n\nA person with some personal responsibility who has to pay a huge sum out of pocket for a prescription is going to hound down their doctor and figure out an alternative, if there is one.  They'll go on google and find coupons, I've saved a lot on allergy medications doing this.\n\nIn an ideal world, we could all float along and let our doctors and pharmacists automatically optimize everything for us.  The reality is they're just overworked people (albeit very knowledgeable and intelligent people) and our health and money are our own, not theirs.  I just don't buy being uninformed as a valid excuse when the information is readily available, the average person needs to take responsibility for themselves.\n\n[edit]  I just want to clarify... if the doctor or pharmacist tells us something that's flat out medically incorrect, that's a huge problem.  If they just give us a correct scrip for a more expensive medication, it's on us to ask the question.  I also think that CVS dropping the prices and raising awareness of this alternative is amazing.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1484277877.0,
    "date_created": "2017-01-12",
    "time_created": "14:24:37",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2g9l",
    "parent_id": "t1_dcc19l1",
    "subreddit_name_prefixed": "r/news",
    "body": "> You're informed, the majority of people are most likely clueless.\n\n> I'd say that the witch hunt was pretty justified.\n\nOr maybe, instead of the media witch hunt, the media could have used the story to instead inform people of the alternative and how to leverage the alternative.",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1484266048.0,
    "date_created": "2017-01-12",
    "time_created": "11:07:28",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc0drw",
    "parent_id": "t1_dcc05wc",
    "subreddit_name_prefixed": "r/news",
    "body": "And usually if you go to a pharmacy and they offer a low cost alternative you can just call the doctor and have the prescription switched for free.\n\nAny time you get a prescription filled and it is more than $10 you should be talking to the pharmacist, asking for a low cost alternative.  They aren't always available and, even when they are, they might take a call to the doctor but it is often worth a call.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1484263520.0,
    "date_created": "2017-01-12",
    "time_created": "10:25:20",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2hl1",
    "parent_id": "t1_dcc05wc",
    "subreddit_name_prefixed": "r/news",
    "body": "This is an unnecessary burdensome regulation. People who do not have easy access to doctors can have a hard time going to the doctor once, forget contacting them twice. The pharmacist not being able to legally substitute something that is similar means it's more work to get it. If I recall, this was specifically lobbied for by the makers of the epi-pen, since they known some patients just wouldn't be able to get an alternative. Moreover, this means doctors are more likely to not know what the name of the alternative is, contributing to epi-pen's market share and so on. If it hadn't been for the news story blowing up, no one would know what the epi-pen alternative is anyway. The regulations need to be reformed to allow a pharmacist and patient to substitute a similar drug/treatment. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484266092.0,
    "date_created": "2017-01-12",
    "time_created": "11:08:12",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccrtst",
    "parent_id": "t1_dccq6tx",
    "subreddit_name_prefixed": "r/news",
    "body": "that that that that worked worked",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1484294914.0,
    "date_created": "2017-01-12",
    "time_created": "19:08:34",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcclwj9",
    "parent_id": "t1_dccjwi5",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm generally for full abolishment these days, since I don't see reform happening and the people with their hands in the pie are Big IP companies.\n\nThe descriptive element of patents was a great trade-off historically, but with the faster pace of modern technological advancement and greater tools for reverse engineering, it loses its purpose.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1484287587.0,
    "date_created": "2017-01-12",
    "time_created": "17:06:27",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccs2fd",
    "parent_id": "t1_dccjwi5",
    "subreddit_name_prefixed": "r/news",
    "body": ">The patent system has a clever twist: If you want to patent something, you have to describe it. That means, you get a monopoly on it for 18 years or so, but after that, anyone can freely use the technology. The alternative would be companies hiding their knowledge as trade secrets. \n\nAt least in software, this doesn't work as well as intended. Lawyers take the descriptions given to them by the inventors, and then obfuscate them into legalese. The resulting patents are often incomprehensible to engineers, and when deciphered are often missing all of the actual \"hard parts\" that wouldn't be immediately obvious to an end-user of the software.\n\nSource: I am listed as an inventor on a few software parents, and I can't even really tell them apart, that's how convoluted the language is.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484295234.0,
    "date_created": "2017-01-12",
    "time_created": "19:13:54",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcce6ky",
    "parent_id": "t1_dccdk39",
    "subreddit_name_prefixed": "r/news",
    "body": "All of this is accurate, except for when it comes to practice, which is what the comment to which you replied was about. As owner of a small business that has gone through the IP protection process, it's incredibly difficult and costly, and absolutely daunting when considering how easily I could be outmatched in court. My own mother-in-law lost her humble home-based business to a patent troll who patented a product years after it was available publicly, because she didn't have the means to fight back, despite it being obvious she was being taken advantage of by a legal bully. The laws are nice until it comes to application of them, then the brutal reality of \"my money versus your money\" comes into play.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1484279003.0,
    "date_created": "2017-01-12",
    "time_created": "14:43:23",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccimo3",
    "parent_id": "t1_dccdk39",
    "subreddit_name_prefixed": "r/news",
    "body": "That's the simplistic notion behind copyright's existence, but it doesn't work out that way in practice. If you have money, you can flex your copyright holdings' influence. If you don't, you'll be flattened in court. It doesn't do shit for the individual. What was originally intended to protect artists from large distributors is now mostly a cudgel large distributors use against unknown artists.\n\nAdditionally, it presupposes that art should be an industry. Art is it's own end, not a means to make money. Never mind the horrible ramifications the ever-creeping arm of copyright has had on the artistic process.\n\nThere's never anything truly novel. It all stands on the shoulders of goats and remixes on some level.\n\nI can name four folk songs that all use the same tune right now (Rising of the Moon, Wearing of the Green, The Orange and the Green and to a lesser extent Oh, Susanna). Would that happen in today's political climate? Hell, no. There would be lawsuits and whinging about the \"ownwrship\" of ideas and hot air. But that's a staple of musicmaking. A core part of the art—remixing—that has absurd legal impediments curbing the advancement of the art.\n\nDid somebody need a financial incentive and legal protection to write Greensleeves?",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1484283936.0,
    "date_created": "2017-01-12",
    "time_created": "16:05:36",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcclgmw",
    "parent_id": "t1_dccdk39",
    "subreddit_name_prefixed": "r/news",
    "body": "That's a touching story and all, but let's jump back to reality and look at what would actually happen in that situation, under current laws:\n\n- you accuse Disney of intellectual property theft\n\n- they sue you for libel\n\n- you become homeless",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1484287082.0,
    "date_created": "2017-01-12",
    "time_created": "16:58:02",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc6ydu",
    "parent_id": "t1_dcc2xqi",
    "subreddit_name_prefixed": "r/news",
    "body": "You can tell the pharmacy to call them back and rewrite it",
    "controversiality": 0,
    "ups": 87,
    "downs": 0,
    "score": 87,
    "created": 1484271099.0,
    "date_created": "2017-01-12",
    "time_created": "12:31:39",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc576p",
    "parent_id": "t1_dcc4zok",
    "subreddit_name_prefixed": "r/news",
    "body": "Well I didn't know it was a brand, so there's that. ",
    "controversiality": 0,
    "ups": 94,
    "downs": 0,
    "score": 94,
    "created": 1484269151.0,
    "date_created": "2017-01-12",
    "time_created": "11:59:11",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc5i0b",
    "parent_id": "t1_dcc4zok",
    "subreddit_name_prefixed": "r/news",
    "body": "I actually didn't know it was a brand until this whole debacle",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1484269488.0,
    "date_created": "2017-01-12",
    "time_created": "12:04:48",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc5sci",
    "parent_id": "t1_dcc4zok",
    "subreddit_name_prefixed": "r/news",
    "body": "It already did years (decades?) ago for people who use it.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484269816.0,
    "date_created": "2017-01-12",
    "time_created": "12:10:16",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc6rry",
    "parent_id": "t1_dcc6ds8",
    "subreddit_name_prefixed": "r/news",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1484270898.0,
    "date_created": "2017-01-12",
    "time_created": "12:28:18",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc996y",
    "parent_id": "t1_dcc6pj5",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm disabled on SSI and just got my child support dropped due to not being able to work. My minimum back payments are $50. Either you or your laws(I'm in WA, USA) are being too lenient with her.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484273597.0,
    "date_created": "2017-01-12",
    "time_created": "13:13:17",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc7ilo",
    "parent_id": "t1_dcc2w1n",
    "subreddit_name_prefixed": "r/news",
    "body": "This is why you never take advice from reddit. ",
    "controversiality": 0,
    "ups": 56,
    "downs": 0,
    "score": 56,
    "created": 1484271725.0,
    "date_created": "2017-01-12",
    "time_created": "12:42:05",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc6wrw",
    "parent_id": "t1_dcc51jr",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1484271049.0,
    "date_created": "2017-01-12",
    "time_created": "12:30:49",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2bny",
    "parent_id": "t1_dcc1huc",
    "subreddit_name_prefixed": "r/news",
    "body": ">30-foot long pdf\n\nNo tree were harmed in the making of this pdf.",
    "controversiality": 0,
    "ups": 243,
    "downs": 0,
    "score": 243,
    "created": 1484265896.0,
    "date_created": "2017-01-12",
    "time_created": "11:04:56",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc28kk",
    "parent_id": "t1_dcc0a5s",
    "subreddit_name_prefixed": "r/news",
    "body": "If you sign up for digital on their app, a receipt won't print by default.  Instead the cashier will have a look of confusion followed by the realization that a receipt won't actually print, but the transaction still went through.  It's actually quite entertaining.  If you take it up a notch and setup your card on the CVS app, you can basically pay by showing your rewards card.  They'll keep asking you \"did you swipe yet\".  ",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1484265790.0,
    "date_created": "2017-01-12",
    "time_created": "11:03:10",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2bty",
    "parent_id": "t1_dcc0a5s",
    "subreddit_name_prefixed": "r/news",
    "body": "No, once you opt into it, all future receipts are digital.  It is tied to your cvs card.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1484265901.0,
    "date_created": "2017-01-12",
    "time_created": "11:05:01",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2c61",
    "parent_id": "t1_dcc0a5s",
    "subreddit_name_prefixed": "r/news",
    "body": "Actually it's an option you can turn on with your CVS membership (forget what they call it). When they scan your bar code for your membership it tells the register to not even print a receipt.\n\nWhat I wish it still did was print a receipt. Like a validation of payment. I basically run my card through and stand there until the cashier looks at the terminal screen and says \"oh you have digital receipt!\" And then I can leave.\n\nIf it would just print out a small receipt that said your payment succeeded or something I think that would make the flow better. We, as a society, are not used to not getting a receipt. So we either stand there kind of awkwardly or try to leave too soon before the transaction is actually finished. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484265913.0,
    "date_created": "2017-01-12",
    "time_created": "11:05:13",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcbyh6v",
    "parent_id": "t1_dcby4gm",
    "subreddit_name_prefixed": "r/news",
    "body": "It's also so they can transition into having small clinics in store. Law says you cannot sell cigs in a medical clinic.",
    "controversiality": 0,
    "ups": 297,
    "downs": 0,
    "score": 297,
    "created": 1484260957.0,
    "date_created": "2017-01-12",
    "time_created": "09:42:37",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc04f5",
    "parent_id": "t1_dcby4gm",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1484263191.0,
    "date_created": "2017-01-12",
    "time_created": "10:19:51",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2i78",
    "parent_id": "t1_dcby4gm",
    "subreddit_name_prefixed": "r/news",
    "body": "As I understand, it'll actually earn them more in the long term because they're going to start doing clinic business.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484266112.0,
    "date_created": "2017-01-12",
    "time_created": "11:08:32",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4e49",
    "parent_id": "t1_dcby4gm",
    "subreddit_name_prefixed": "r/news",
    "body": "> it is definitely hurting profits\n\nNo it isn't.\n\nhttp://fortune.com/2015/06/04/biggest-companies-fortune-500/\n\nThis is from about a year after they stopped selling tobacco. It clearly didn't affect them at all, most likely because pharmaceutical industry incentives made up the difference.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484268248.0,
    "date_created": "2017-01-12",
    "time_created": "11:44:08",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcbycgu",
    "parent_id": "t1_dcby5o4",
    "subreddit_name_prefixed": "r/news",
    "body": "That makes more sense.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1484260776.0,
    "date_created": "2017-01-12",
    "time_created": "09:39:36",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc20qi",
    "parent_id": "t1_dcbya8z",
    "subreddit_name_prefixed": "r/news",
    "body": ">  Like a natural supplement to help get more restful sleep\n\nThat's not homeopathy, that's naturopathy, which is a very important distinction.\n\nHomeopathy is specifically a process of dilution to the point where it's literally just sugar pills that have been sprayed with water.",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1484265527.0,
    "date_created": "2017-01-12",
    "time_created": "10:58:47",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcbyzdr",
    "parent_id": "t1_dcbya8z",
    "subreddit_name_prefixed": "r/news",
    "body": "It's expensive sterile water. The Dasani up front has the same therapeutic effect. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1484261659.0,
    "date_created": "2017-01-12",
    "time_created": "09:54:19",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc1q6n",
    "parent_id": "t1_dcbya8z",
    "subreddit_name_prefixed": "r/news",
    "body": "It...would certainly be the placebo effect. I look into these sorts of things as a hobby, and most homeopathy-based treatments contain no active ingredient, or so little that you'd need to do a dilution calculation to find the amount of active ingredient per mL.\n",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1484265180.0,
    "date_created": "2017-01-12",
    "time_created": "10:53:00",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcbyfen",
    "parent_id": "t1_dcbya8z",
    "subreddit_name_prefixed": "r/news",
    "body": "> because of their self-state commitment to their customer's health and the incompatibility of cigarettes with that mission.\n\nOr, as another poster pointed out, the fact that some states won't let them have clinics and sell tobacco at the same time. Clinics are likely the more profitable option.\n\n>I feel that sometimes those products can be helpful.\n\nI totally disagree, placebo or not. ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1484260889.0,
    "date_created": "2017-01-12",
    "time_created": "09:41:29",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc39u2",
    "parent_id": "t1_dcbya8z",
    "subreddit_name_prefixed": "r/news",
    "body": "> But it should be easy enough to tell that it's not an actually tested drug, instead of bearing no specific markings about whether it's been approved as a treatment or not.\n\nThey put it on the same goddamn shelf.  There's a small sign but it's not blatantly obvious that it's not real medicine.  I almost bought that crap a couple of times before I read the label, but I'm one of the dying breed of consumers that actually looks at the label and knows what the drugs are in them and what they do.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484266990.0,
    "date_created": "2017-01-12",
    "time_created": "11:23:10",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3z3l",
    "parent_id": "t1_dcbya8z",
    "subreddit_name_prefixed": "r/news",
    "body": "I dont know they still sell booze, softdrinks, and powdered donuts.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484267783.0,
    "date_created": "2017-01-12",
    "time_created": "11:36:23",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3lz8",
    "parent_id": "t1_dcc028a",
    "subreddit_name_prefixed": "r/news",
    "body": "They really think of themselves as convenience stores.  Lots of locations, open late usually, many times 24 hrs.  Their assortments are so much more than just pharmacies when you walk in (and really the pharmacy isn't even open as long as the store itself).\n\nIf you look at them that way you can understand why they'll sell you anything that will make them money.\n\nBut I agree, a contradiction.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484267369.0,
    "date_created": "2017-01-12",
    "time_created": "11:29:29",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4jv1",
    "parent_id": "t1_dcc028a",
    "subreddit_name_prefixed": "r/news",
    "body": "When my French friend came to visit, he was like WTF!!! Even as an American, I think it's very strange.\n\nDrug stores here in the US are pharmacies, but also \"drogueries\" (like Rossmann). They sell shampoo, razors, etc. Some even sell small amounts of food items.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484268427.0,
    "date_created": "2017-01-12",
    "time_created": "11:47:07",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4njk",
    "parent_id": "t1_dcc3dge",
    "subreddit_name_prefixed": "r/news",
    "body": "Drugs aren't a good example of the free market at work.  Free markets assume that new entrants can freely enter the market but patent law makes new entrants illegal.  Furthering rent seeking is that even when good alternatives exist, like this one, people still have to make sure their doctor writes the script for the alternative.  People can't show up to their pharmacy with a script for \"EpiPen\" and get the cheaper competitor.",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1484268541.0,
    "date_created": "2017-01-12",
    "time_created": "11:49:01",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc8yu7",
    "parent_id": "t1_dcc3dge",
    "subreddit_name_prefixed": "r/news",
    "body": "CVS is far from a company that supports a free market.  They own CVS Caremark which is one of the US' largest PBMs.  They dictate the formulary which states what drugs you can get, your copays, the amount of reimbursement for your medications for the pharmacy you go to, whether CVS, local independent, Walgreens, Walmart, Costco, etc.  The things they've done for the health care industry has only made things more expensive for everyone.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484273285.0,
    "date_created": "2017-01-12",
    "time_created": "13:08:05",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc69by",
    "parent_id": "t1_dcc3dge",
    "subreddit_name_prefixed": "r/news",
    "body": "$300 for two doses of lifesaving medicine is 'great for the consumer'? Meanwhile, here in England with our evil socialist National Health Service, it'd cost £8.40.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1484270341.0,
    "date_created": "2017-01-12",
    "time_created": "12:19:01",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc9bmp",
    "parent_id": "t1_dcc9897",
    "subreddit_name_prefixed": "r/news",
    "body": "Wow, that is truly sad...",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1484273670.0,
    "date_created": "2017-01-12",
    "time_created": "13:14:30",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccd0cx",
    "parent_id": "t1_dcc9897",
    "subreddit_name_prefixed": "r/news",
    "body": "Now I am even more pleased that the company is getting burnt.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484277711.0,
    "date_created": "2017-01-12",
    "time_created": "14:21:51",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccabdr",
    "parent_id": "t1_dcc4dxr",
    "subreddit_name_prefixed": "r/news",
    "body": "I think they made it better (tech also), and had someone come in and directed them to the site that took 300 off the pen brought it down below 100 bucks.  I said the same thing you said but nope, apparently even better now.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1484274745.0,
    "date_created": "2017-01-12",
    "time_created": "13:32:25",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcd0wf3",
    "parent_id": "t1_dccs6jt",
    "subreddit_name_prefixed": "r/news",
    "body": "USA: richest third world country in the world. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484307087.0,
    "date_created": "2017-01-12",
    "time_created": "22:31:27",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccprj9",
    "parent_id": "t1_dcc9346",
    "subreddit_name_prefixed": "r/news",
    "body": "I worked at cvs for a year of my life. It was the most stressful place to work. They understaff the shit out of the pharmacy. Luckily I got a residency position and I'm not looking back.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1484292235.0,
    "date_created": "2017-01-12",
    "time_created": "18:23:55",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccbl1t",
    "parent_id": "t1_dcc9346",
    "subreddit_name_prefixed": "r/news",
    "body": "I refill like 6 different meds every 3 months and I've used a lot of pharmacies. Costco, Walmart, Walgreens, Kroger, and mom & pop. The only pharmacists that don't sound stressed out are the mom & pop pharmacies. \n\nI currently fill with Costco because they're the least stressed out and the local mom & pop pharmacy doesn't carry my expensive meds because they don't have enough clients with organ transplants otherwise I'd be with them.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1484276130.0,
    "date_created": "2017-01-12",
    "time_created": "13:55:30",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccclgg",
    "parent_id": "t1_dcc9346",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah, I know a girl who works for one. She's constantly on her feet doing something. Every phone call sounds a bit rushed, but I understand the employee's perspective so I can't get mad. Been getting prescriptions through the mail though recently, which I must say feels odd haha. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1484277252.0,
    "date_created": "2017-01-12",
    "time_created": "14:14:12",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcca60w",
    "parent_id": "t1_dcc9rqg",
    "subreddit_name_prefixed": "r/news",
    "body": "Lol CVS, Rite Aid, and Walgreens all don't have lunch breaks for pharmacists. Only Walmart and other low volume locations don't have them. Pharmacists are salaried so we aren't entitled to breaks.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1484274588.0,
    "date_created": "2017-01-12",
    "time_created": "13:29:48",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc5ez6",
    "parent_id": "t1_dcc3fmd",
    "subreddit_name_prefixed": "r/news",
    "body": "I mean, it's still a good thing to do",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1484269392.0,
    "date_created": "2017-01-12",
    "time_created": "12:03:12",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccljuy",
    "parent_id": "t1_dccij77",
    "subreddit_name_prefixed": "r/news",
    "body": "Because CVS owns Caremark, one of the largest Pharmacy Benefit Managers in the country.  If Caremark is your PBM, they dictate your copay, your formulary which lists what drugs you can get under insurance and what your independent/chain pharmacy gets reimbursed.   So, countless times I've had patients be forced to use CVS or be forced to use mail order to get their prescriptions.\n\nThey are a prime example why vertical integration is dangerous for consumers.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1484287182.0,
    "date_created": "2017-01-12",
    "time_created": "16:59:42",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccbgqf",
    "parent_id": "t1_dcc4cnv",
    "subreddit_name_prefixed": "r/news",
    "body": "Sadly, I don't trust the people around me to know how to stick me with a double-safety generic autoinjector.\n\nNot that they can't figure it out, but I discovered recently that the most pertinent people who would stick me (my coworkers; also known as humanities professors) had never seen an EpiPen before until I showed them where I was keeping it. I was dumbfounded that in a room full of middle aged PhDs, none of them had even seen one before or knew what an allergic reaction looked like.\n\nIn a twist, I had a reaction the day I brought my tester with me for them to practice with...didn't need to use my EpiPen, but my boss brought both pens to the ER because \"I didn't want to accidentally grab the wrong one.\" She was clearly flustered so expecting her to check was a little too much to hope for.\n\n/sigh.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1484276000.0,
    "date_created": "2017-01-12",
    "time_created": "13:53:20",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3h2r",
    "parent_id": "t1_dcc27cv",
    "subreddit_name_prefixed": "r/news",
    "body": "This so much, imagine these people realizing how much that name brand tshirt actually cost to make, and what they paid for it, most simple shirts cost like 3 bucks to make and sell for upwards of 20",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1484267216.0,
    "date_created": "2017-01-12",
    "time_created": "11:26:56",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccbt0h",
    "parent_id": "t1_dcc2dir",
    "subreddit_name_prefixed": "r/news",
    "body": "No.  They bought the technology,  they have no money invested in RnD of the epipen",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484276373.0,
    "date_created": "2017-01-12",
    "time_created": "13:59:33",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc5uq0",
    "parent_id": "t1_dcc2tbi",
    "subreddit_name_prefixed": "r/news",
    "body": "It ends up being considerably cheaper for the average person in the long run too.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484269889.0,
    "date_created": "2017-01-12",
    "time_created": "12:11:29",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3b8s",
    "parent_id": "t1_dcc2neg",
    "subreddit_name_prefixed": "r/news",
    "body": "True, but in my experience, most people get heated at the register for things that are out of an employee's control. ",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1484267034.0,
    "date_created": "2017-01-12",
    "time_created": "11:23:54",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcceyza",
    "parent_id": "t1_dcc2neg",
    "subreddit_name_prefixed": "r/news",
    "body": "Never really experienced an employee being a shit person because that means costing their job. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484279869.0,
    "date_created": "2017-01-12",
    "time_created": "14:57:49",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcchps6",
    "parent_id": "t1_dcc2neg",
    "subreddit_name_prefixed": "r/news",
    "body": "It's usually over something petty that's not even the cashier's fault. \n\nOne time I remember arguing with somebody that \"buy one get one free\" is the same thing as both items being 50% off. The customer couldn't understand that the price/item was the same regardless. She thought we were trying to screw her. \n",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484282939.0,
    "date_created": "2017-01-12",
    "time_created": "15:48:59",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc07v4",
    "parent_id": "t1_dcbzsjg",
    "subreddit_name_prefixed": "r/news",
    "body": "It's a conflict for the consumers actual health. The US is only [1 of 3](https://en.wikipedia.org/wiki/Direct-to-consumer_advertising) countries even allowed to do this, and the link that it influences consumers to want drugs they don't even *need* is obvious.",
    "controversiality": 0,
    "ups": 1114,
    "downs": 0,
    "score": 1114,
    "created": 1484263314.0,
    "date_created": "2017-01-12",
    "time_created": "10:21:54",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc1n5d",
    "parent_id": "t1_dcbzsjg",
    "subreddit_name_prefixed": "r/news",
    "body": "In my state, at least, the pharmacist can suggest the alternative and call the doctor for permission to substitute, and that is all that is required.",
    "controversiality": 0,
    "ups": 101,
    "downs": 0,
    "score": 101,
    "created": 1484265079.0,
    "date_created": "2017-01-12",
    "time_created": "10:51:19",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2d0f",
    "parent_id": "t1_dcbzsjg",
    "subreddit_name_prefixed": "r/news",
    "body": "EU citizen reporting in. Our pharmacists have a duty to inform patient that cheaper generic is available. Also, prescriptions are valid for both brand and generic drug, unless there's explicit \"do not change\" note from doctor written on it.",
    "controversiality": 0,
    "ups": 83,
    "downs": 0,
    "score": 83,
    "created": 1484265940.0,
    "date_created": "2017-01-12",
    "time_created": "11:05:40",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc5a5r",
    "parent_id": "t1_dcbzsjg",
    "subreddit_name_prefixed": "r/news",
    "body": "Lol, like pharmacists have time for that nonsense. As you get into more expensive drugs the reimbursement percentage from insurance goes down in the vast majority of cases. That along with volume rebates and lower inventory costs many times the pharmacy is making more money from the generic than the brand. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484269241.0,
    "date_created": "2017-01-12",
    "time_created": "12:00:41",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc428q",
    "parent_id": "t1_dcc24cj",
    "subreddit_name_prefixed": "r/news",
    "body": "Almost all doctors do.  In my experiences, when there is a brand drug that has a generic alternative, 98-99% of the time, the generic is the drug that is prescribed/dispensed at the pharmacy.  Even if a doctor prescribed 'Crestor' on their prescription slip, if they do not note to the pharmacist to DAW (dispense as written), the pharmacist has the right to give the patient the generic alternative.\n\n\nSometimes doctors will require the pharmacist to dispense the exact brand they prescribe, and sometimes patients insist on the brand drug instead of the generic for whatever reason, but it's very rare.",
    "controversiality": 0,
    "ups": 73,
    "downs": 0,
    "score": 73,
    "created": 1484267882.0,
    "date_created": "2017-01-12",
    "time_created": "11:38:02",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3wzn",
    "parent_id": "t1_dcc24cj",
    "subreddit_name_prefixed": "r/news",
    "body": "This is actually mandated by law in many countries (to provide the prescription with the generic name, that is).",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1484267715.0,
    "date_created": "2017-01-12",
    "time_created": "11:35:15",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc39zr",
    "parent_id": "t1_dcc24cj",
    "subreddit_name_prefixed": "r/news",
    "body": "Yes, and you'd think this would be common sense. The doctor should have no interest in what brand their patients use.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1484266995.0,
    "date_created": "2017-01-12",
    "time_created": "11:23:15",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc00ez",
    "parent_id": "t1_dcbzvzx",
    "subreddit_name_prefixed": "r/news",
    "body": "Here, this Head-On can fix that.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1484263048.0,
    "date_created": "2017-01-12",
    "time_created": "10:17:28",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc0wfp",
    "parent_id": "t1_dcbzvzx",
    "subreddit_name_prefixed": "r/news",
    "body": "You laugh but I once stuck an EpiPen into my thumb nail (oops held the wrong end!)",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1484264169.0,
    "date_created": "2017-01-12",
    "time_created": "10:36:09",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcbzzst",
    "parent_id": "t1_dcbzsma",
    "subreddit_name_prefixed": "r/news",
    "body": "No, it's so you can get the $100 brand name instead of the $600 brand name.",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1484263026.0,
    "date_created": "2017-01-12",
    "time_created": "10:17:06",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc122z",
    "parent_id": "t1_dcbzsma",
    "subreddit_name_prefixed": "r/news",
    "body": "In many states, it's required by state law that the pharmacy dispense the generic if there's one on the market. For example, if I type \"Lipitor\" while typing up a script, the system changes it to \"atorvastatin\" without me doing anything.\n\nThe patient, doctor, or insurance company actually has to specifically ask for the brand if a generic exists.",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1484264365.0,
    "date_created": "2017-01-12",
    "time_created": "10:39:25",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc8p4n",
    "parent_id": "t1_dcc2i2l",
    "subreddit_name_prefixed": "r/news",
    "body": "Apply directly to the thigh so you don't die.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1484272987.0,
    "date_created": "2017-01-12",
    "time_created": "13:03:07",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3ons",
    "parent_id": "t1_dcc38ci",
    "subreddit_name_prefixed": "r/news",
    "body": "Who the hell says that? Don't read *just* the comments, but you'd be doing yourself a massive disservice by completely ignoring the comments since they are often the most informative part of a post.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1484267454.0,
    "date_created": "2017-01-12",
    "time_created": "11:30:54",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc5oab",
    "parent_id": "t1_dcc38ci",
    "subreddit_name_prefixed": "r/news",
    "body": "I've only ever seen \"don't read the comments\" pertaining to stuff like YouTube, reddit is definitely better with comments. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484269688.0,
    "date_created": "2017-01-12",
    "time_created": "12:08:08",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2k02",
    "parent_id": "t1_dcc2d5x",
    "subreddit_name_prefixed": "r/news",
    "body": "ouch. sounds like something you could weaponize...",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1484266171.0,
    "date_created": "2017-01-12",
    "time_created": "11:09:31",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4wyc",
    "parent_id": "t1_dcc2d5x",
    "subreddit_name_prefixed": "r/news",
    "body": "My mom did that by accident, with an EpiPen, to her own thumb, but her digit didn't die.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484268836.0,
    "date_created": "2017-01-12",
    "time_created": "11:53:56",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc73if",
    "parent_id": "t1_dcc5jeh",
    "subreddit_name_prefixed": "r/news",
    "body": "I assume there is a patent, yes. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484271258.0,
    "date_created": "2017-01-12",
    "time_created": "12:34:18",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc34dq",
    "parent_id": "t1_dcc2pir",
    "subreddit_name_prefixed": "r/news",
    "body": "Above comment + research says that the dosage of adrenaline the Auvi-Q was injecting was not consistent.",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1484266823.0,
    "date_created": "2017-01-12",
    "time_created": "11:20:23",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3prs",
    "parent_id": "t1_dcc2g9l",
    "subreddit_name_prefixed": "r/news",
    "body": "They could have written many things. But the way media works is to drive clicks. So they continued the witch-hunt for that sweet sweet ad revenue.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1484267487.0,
    "date_created": "2017-01-12",
    "time_created": "11:31:27",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc7wma",
    "parent_id": "t1_dcc6ydu",
    "subreddit_name_prefixed": "r/news",
    "body": "I used to work at a retail pharmacy, it's bothersome and a hassle to do this, if you possibly can, try to do it with the doctor if you can remember while your there. As much as I loved to help customers it ties me up just waiting on the phone when I could have helped other people in line and I know/understand that you guys hate waiting in line and try to get to everyone in an orderly fashion.\n\nEdit: I used to work in retail as a tech. I fully understand that part of my job is those kinds of calls. But I'm trying to advise you of what you can do to help me, my coworkers, and the customers in line. You ever stand in line at a pharmacy and had to wait a long time before we could help you, guess what I may have been on the phone with insurance/doctors because I have to fix something, that is part of my job, that could have been resolved at the doctors office but now I got 5 people in line just waiting, tapping their feet, getting angrier by the minute, then maybe at some point decide to leave because waiting was unbearable. I put myself in your shoes many times because I'm a customer myself in many places such as banks, pharmacies, grocery stores, etc. \n\nI was always courteous and happy to help with any issues, believe me. One such incident I remember was a doctor telling a patient they were going to get amoxicillin and whoever gave the patient the prescription had it down for ampicillin. The only reason I made the call was because I was having small talk with the patient at the register and told them if they have ampicillin before. The person got confused because they were adamant that the doctor was going to prescribe amoxicillin. The patient never looked at the prescription and it was a printed text prescription, so none of that messy doctor writing. Conversely, they could have just thought that it was probably brand name. But you know what, no problem, call doctors office, give phone to pharmacist to take order and fixed. All in all about 10-15 minutes while the other techs helped those in line and I'm on the phone and instead of helping those in line change to filling electronic orders or refills.\n\nI'm just trying to give a little perspective on retail pharmacy. I used to work at a 24 hr CVS in Irvine and let me tell you, there was never any downtime. 5-6 pharmacist and 3 techs typing, 3 techs filling, and 2-3 on register. ",
    "controversiality": 0,
    "ups": 141,
    "downs": 0,
    "score": 141,
    "created": 1484272142.0,
    "date_created": "2017-01-12",
    "time_created": "12:49:02",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccczhb",
    "parent_id": "t1_dcc6ydu",
    "subreddit_name_prefixed": "r/news",
    "body": ">You can tell the pharmacy to call them back and rewrite it \n\nYou can ASK the pharmacy to do this",
    "controversiality": 0,
    "ups": 62,
    "downs": 0,
    "score": 62,
    "created": 1484277684.0,
    "date_created": "2017-01-12",
    "time_created": "14:21:24",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcckk7w",
    "parent_id": "t1_dcc6ydu",
    "subreddit_name_prefixed": "r/news",
    "body": "Or, you could do *your* job and have the doctor change it yourself. Pharmacists are busy enough as it is without you laziness.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1484286067.0,
    "date_created": "2017-01-12",
    "time_created": "16:41:07",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc6ccf",
    "parent_id": "t1_dcc576p",
    "subreddit_name_prefixed": "r/news",
    "body": "To be fair, most people who have allergies that cause anaphylactic shock - and therefore purchase EpiPens - do know.  Not all, but most. \n\nBut I get what you are saying. ",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1484270434.0,
    "date_created": "2017-01-12",
    "time_created": "12:20:34",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc7z66",
    "parent_id": "t1_dcc6rry",
    "subreddit_name_prefixed": "r/news",
    "body": "A few drugs actually work better as brand name than generic, I know for sure one of them is for seizures. It's a very short list however. ",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1484272218.0,
    "date_created": "2017-01-12",
    "time_created": "12:50:18",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc80gn",
    "parent_id": "t1_dcc6rry",
    "subreddit_name_prefixed": "r/news",
    "body": "I wish more people realized this. I work at a pharmacy and the amount of people that INSIST on brand name drugs over generics is absolutely absurd. The generic is the same thing, but cheaper. You're a fucking idiot if you want the brand over the generic, it's plain and simple.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1484272256.0,
    "date_created": "2017-01-12",
    "time_created": "12:50:56",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2pwh",
    "parent_id": "t1_dcc2bny",
    "subreddit_name_prefixed": "r/news",
    "body": "But billions of electrons were terribly inconvenienced. ",
    "controversiality": 0,
    "ups": 370,
    "downs": 0,
    "score": 370,
    "created": 1484266363.0,
    "date_created": "2017-01-12",
    "time_created": "11:12:43",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2gxn",
    "parent_id": "t1_dcc2bny",
    "subreddit_name_prefixed": "r/news",
    "body": "What about digital trees!",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1484266070.0,
    "date_created": "2017-01-12",
    "time_created": "11:07:50",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcce4kx",
    "parent_id": "t1_dcc28kk",
    "subreddit_name_prefixed": "r/news",
    "body": "Haha, I like using CVS Pay too. The automatic split of FSA eligible/non-FSA eligible payments in the barcode scan is nice.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1484278940.0,
    "date_created": "2017-01-12",
    "time_created": "14:42:20",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc33sf",
    "parent_id": "t1_dcc2bty",
    "subreddit_name_prefixed": "r/news",
    "body": "Sweet. I'll be using this, thanks.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484266805.0,
    "date_created": "2017-01-12",
    "time_created": "11:20:05",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcbz5ts",
    "parent_id": "t1_dcbyh6v",
    "subreddit_name_prefixed": "r/news",
    "body": "That can't be right. Rite aid here has a clinic and sells tobacco and alcohol",
    "controversiality": 0,
    "ups": 113,
    "downs": 0,
    "score": 113,
    "created": 1484261901.0,
    "date_created": "2017-01-12",
    "time_created": "09:58:21",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc20sr",
    "parent_id": "t1_dcbyh6v",
    "subreddit_name_prefixed": "r/news",
    "body": "OMG!  I love that CVS has the MinuteClinic in their stores.  It makes it soooo much easier for something small that I don't want to take a lot of time off to see the regular doctor.\n\nBut, the CVS we usually go to and the ones around our neighborhood don't look like they are struggling.  In fact, they have built so many more since banning the sale of tobacco products.  Let me think: 1,2,3, 4.  I can think of 4 CVS stores and pharmacies that are in my general home area.",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1484265529.0,
    "date_created": "2017-01-12",
    "time_created": "10:58:49",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcbyrd2",
    "parent_id": "t1_dcbyh6v",
    "subreddit_name_prefixed": "r/news",
    "body": "Mildly helps prep for medical marijuana sales?",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1484261353.0,
    "date_created": "2017-01-12",
    "time_created": "09:49:13",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcbyu3y",
    "parent_id": "t1_dcbyh6v",
    "subreddit_name_prefixed": "r/news",
    "body": "smart move",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484261460.0,
    "date_created": "2017-01-12",
    "time_created": "09:51:00",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3u6m",
    "parent_id": "t1_dcbyh6v",
    "subreddit_name_prefixed": "r/news",
    "body": "Actually, one of the reasons they did that was to hire younger people. The age of the store clerk is much more lenient with alcohol than it is with tobacco. Since they stopped selling cigs, every CVS checkout stand I've been to had someone that can't be older than 18.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484267628.0,
    "date_created": "2017-01-12",
    "time_created": "11:33:48",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc1mub",
    "parent_id": "t1_dcc04f5",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah, thats also a jurisdiction thing as many areas you can only buy certain alcoholic drinks in specific stores",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1484265069.0,
    "date_created": "2017-01-12",
    "time_created": "10:51:09",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc599a",
    "parent_id": "t1_dcc20qi",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah that's important to know. Natural supplements do work for some people (especially ones that have had established medical uses for decades.) Yeah there are some bullshit ones that are sold in stores, but those shouldn't discount the entire supplement industry as a whole.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1484269212.0,
    "date_created": "2017-01-12",
    "time_created": "12:00:12",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc8dga",
    "parent_id": "t1_dcc20qi",
    "subreddit_name_prefixed": "r/news",
    "body": "> Homeopathy is specifically a process of dilution to the point where it's literally just sugar pills that have been sprayed with water.\n\nIt's sometimes dilutions to the point where the \"active ingredients\" are subatomic in quantities.  There's only so few parts per quintillion that can exist before you have 0 particles in the entire batch. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1484272641.0,
    "date_created": "2017-01-12",
    "time_created": "12:57:21",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc05ra",
    "parent_id": "t1_dcbyzdr",
    "subreddit_name_prefixed": "r/news",
    "body": "Amazing medical benefits of Dasani Water unlocked! The results will astound you!!!",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1484263239.0,
    "date_created": "2017-01-12",
    "time_created": "10:20:39",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc39s1",
    "parent_id": "t1_dcc1q6n",
    "subreddit_name_prefixed": "r/news",
    "body": "Serious question: when I buy a 5 mg melatonin pill from the vitamin aisle am I not getting 5mg of melatonin? \n\n\nI ask because I really do feel like it helps me sleep",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484266988.0,
    "date_created": "2017-01-12",
    "time_created": "11:23:08",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc0mo7",
    "parent_id": "t1_dcbyfen",
    "subreddit_name_prefixed": "r/news",
    "body": "It really was a corporate change. Alongside the removal of all tobacco products from stores, they banned tobacco usage on all CVS owned property. Not only do you have to leave thr building if you want to smoke, but you actually have to leave the property altogether. It can be viewed as a PR move, but the company voluntarily gave up that revenue with nothing to really replace it. They really do seem to care. \n\nSource: I work for them (I'm just an IT worker drone though) ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1484263831.0,
    "date_created": "2017-01-12",
    "time_created": "10:30:31",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4s8j",
    "parent_id": "t1_dcc3lz8",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah, they're convenience stores with medication instead of gasoline.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1484268686.0,
    "date_created": "2017-01-12",
    "time_created": "11:51:26",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc6qsw",
    "parent_id": "t1_dcc4njk",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm not trying to start a discussion here, but patent law makes entry easier in many cases. If a huge pharmaceutical company could sell any drug developed by small companies, they would do so at a fraction of the cost since they have the means to mass produce cheaply. There would be absolutely no incentive for small companies to develop drugs. Also, big companies have a better distribution pipeline, which may mean that even if they did sell at a higher price, they may still out-sell their cheaper competitors.\n\nWhat IS hindering new companies from joining in, are the huge R&D costs of pharmaceuticals to get approved. But we don't really want that to change. \n\nOf course, all this concerns development of new drugs which you weren't talking about. I'm just trying to state one reason why patents are important in this field.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1484270868.0,
    "date_created": "2017-01-12",
    "time_created": "12:27:48",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc9fbq",
    "parent_id": "t1_dcc9bmp",
    "subreddit_name_prefixed": "r/news",
    "body": "I've been a PM of some sort for awhile. I can deal with a lot of shit in the workplace when it arises and think that I'm fairly good at minimizing issues and conflicts when they arise. That said, most of the issues I had with them weren't even in the workplace. They made it personal and vindictive. ",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1484273782.0,
    "date_created": "2017-01-12",
    "time_created": "13:16:22",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcccrji",
    "parent_id": "t1_dcca60w",
    "subreddit_name_prefixed": "r/news",
    "body": "Being salaried shouldn't affect your break times. Some of our managers are salaried and are still entitled to their breaks.\n\nEven if it's \"company policy\", it's not legal.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1484277439.0,
    "date_created": "2017-01-12",
    "time_created": "14:17:19",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccgnlz",
    "parent_id": "t1_dcc5ez6",
    "subreddit_name_prefixed": "r/news",
    "body": "The byproduct of a profitable move is good. Their action wasn't for the sole intention of being good. This I believe would be something of a positive market externality. Along the way of pursuing a profit, society is somewhat benefitted.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1484281759.0,
    "date_created": "2017-01-12",
    "time_created": "15:29:19",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcccr0e",
    "parent_id": "t1_dccbgqf",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah, I think there are definite upsides to the Epipen but if you can't afford it, it doesn't matter how much easier it is to use. \n\nI was carrying expired epipens until I asked my professor after a lecture on anaphylaxis about carrying a vial and syringes and she told me \"Terrible idea.\" and explained that I should call my pharmacy, ask which generic autoinjector they carry, and then call my provider and ask for that prescription specifically. \n\nI think in the future, I'll give patients the option of both but push for epipens for kids whose teachers/daycare people would be giving it (for your exact reason) if their insurance will cover it to a reasonable price. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1484277422.0,
    "date_created": "2017-01-12",
    "time_created": "14:17:02",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccp1th",
    "parent_id": "t1_dccbgqf",
    "subreddit_name_prefixed": "r/news",
    "body": "uh, why would a normal person (phd or not) have ever seen an epipen? I don't have weird allergies and I don't know anyone who does. Thus I've never seen an epipen in person.\n",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1484291330.0,
    "date_created": "2017-01-12",
    "time_created": "18:08:50",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc692n",
    "parent_id": "t1_dcc3h2r",
    "subreddit_name_prefixed": "r/news",
    "body": "Kayne Wests plain white t shirt for $120 sold out...a lot of people are stupid with money and as long as that's a human characteristic there will be people who try to profit off that. \n\nI've done it in MMO games and tried it in real life during the holidays last year...made enough to buy a new PS4 & some games. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1484270333.0,
    "date_created": "2017-01-12",
    "time_created": "12:18:53",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc7iuz",
    "parent_id": "t1_dcc3b8s",
    "subreddit_name_prefixed": "r/news",
    "body": "i've seen far more shitty customers than shitty cashiers, thats for sure - neither one is really excusable.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1484271733.0,
    "date_created": "2017-01-12",
    "time_created": "12:42:13",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2g0v",
    "parent_id": "t1_dcc07v4",
    "subreddit_name_prefixed": "r/news",
    "body": "Huh.  New Zealand and Brazil.  That seems unlikely company for US on this one.",
    "controversiality": 0,
    "ups": 405,
    "downs": 0,
    "score": 405,
    "created": 1484266040.0,
    "date_created": "2017-01-12",
    "time_created": "11:07:20",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2kn3",
    "parent_id": "t1_dcc07v4",
    "subreddit_name_prefixed": "r/news",
    "body": "Not only that! We provide *tax breaks* for direct consumer advertising for pharmaceuticals.",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1484266193.0,
    "date_created": "2017-01-12",
    "time_created": "11:09:53",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2i6e",
    "parent_id": "t1_dcc07v4",
    "subreddit_name_prefixed": "r/news",
    "body": "The fact that we're even having this conversation is already a huge problem. \n\nHow the fuck is the average person even supposed to figure out what to do?",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1484266112.0,
    "date_created": "2017-01-12",
    "time_created": "11:08:32",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc420h",
    "parent_id": "t1_dcc07v4",
    "subreddit_name_prefixed": "r/news",
    "body": "I was watching a documentary that claimed it began with the interpretation, if they didn't say what their medicine did, they didn't have to list the side effects. Back then they had to list every single side effect so it was impractical. That's why commecials looked like [this](https://youtu.be/mZkifbB6nT0).",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484267874.0,
    "date_created": "2017-01-12",
    "time_created": "11:37:54",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3udq",
    "parent_id": "t1_dcc1n5d",
    "subreddit_name_prefixed": "r/news",
    "body": "yes, that how it is in FL (at least it was when I was a CPhT several years ago), I have done that many times when a patient's insurance wouldn't cover the written drug, but would cover a similar one. As long as the Dr okays it and we have a hardcopy, it's all good. As long as it isn't a controlled substance, it isn't an issue. Also we automatically fill any available generic unless the patient asks for name brand or it's DAW. ",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1484267634.0,
    "date_created": "2017-01-12",
    "time_created": "11:33:54",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4g22",
    "parent_id": "t1_dcc1n5d",
    "subreddit_name_prefixed": "r/news",
    "body": "That's how it is in every state, just getting the doctor to make the change can take a while, especially when most pharmacies are understaffed these days. ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1484268309.0,
    "date_created": "2017-01-12",
    "time_created": "11:45:09",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3hy4",
    "parent_id": "t1_dcc2d0f",
    "subreddit_name_prefixed": "r/news",
    "body": ">Also, prescriptions are valid for both brand and generic drug, unless there's explicit \"do not change\" note from doctor written on it.\n\nThis is the same in the US, provided the generics are considered substitutable by the FDA, which almost all are. For example, if you are written a script for Prevacid, the pharmacy can fill it with generic Lansoprazole instead.\n\nCertain things, like EpiPen/Adrenaclick aren't actually subsititutable though. While they have the same purpose, EpiPen and Adrenaclick are used in slightly different ways, so a script written for an EpiPen *cannot* be filled with an Adrenaclick. It is similar to how if you are written a script for Prevacid, while it can be filled with Lansoprazole it cannot be filled with Prilosec/Omeprazole, even though the drugs have the same purpose. ",
    "controversiality": 0,
    "ups": 79,
    "downs": 0,
    "score": 79,
    "created": 1484267244.0,
    "date_created": "2017-01-12",
    "time_created": "11:27:24",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3av9",
    "parent_id": "t1_dcc2d0f",
    "subreddit_name_prefixed": "r/news",
    "body": "only if they are interchangeable. In case of using different delivery mechanisms, they wouldn't be interchangeable and therefore not brand/generic.\nSorry, not EU but applies to canada",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1484267022.0,
    "date_created": "2017-01-12",
    "time_created": "11:23:42",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2vcj",
    "parent_id": "t1_dcc2d0f",
    "subreddit_name_prefixed": "r/news",
    "body": "Same thing in Canada.",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1484266536.0,
    "date_created": "2017-01-12",
    "time_created": "11:15:36",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc48v8",
    "parent_id": "t1_dcc2d0f",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484268085.0,
    "date_created": "2017-01-12",
    "time_created": "11:41:25",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3tpo",
    "parent_id": "t1_dcc2d0f",
    "subreddit_name_prefixed": "r/news",
    "body": "In germany the insurances sometimes make contracts for e.g. lorazepam and you'll only get a specific generic out of the many available instead of the brandname even if the brandname is on the prescription (As long as the \"don't change\" box isn't ticked of course). \n\nSo if you have insurance A you'll get Generic A and if you have insurance B you'll get Generic B. In the end it doesn't really matter, both are the same and a box only costs a copay of 10% but those 10% have to be within €5-10.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484267613.0,
    "date_created": "2017-01-12",
    "time_created": "11:33:33",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4dr6",
    "parent_id": "t1_dcc2d0f",
    "subreddit_name_prefixed": "r/news",
    "body": "Slight difference t I. Brazil. We have 3 categories: reference, similar and generic. If the doc prescribed for he generic (which is the active principle) you can get any. If the doc prescribed a reference you can get any, but if he prescribes a similar, only the similar of the reference.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484268235.0,
    "date_created": "2017-01-12",
    "time_created": "11:43:55",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4jab",
    "parent_id": "t1_dcc428q",
    "subreddit_name_prefixed": "r/news",
    "body": "I did not know this about \"DAW\", thanks!\n\nI have heard of some people asking for the big labor brand drugs because using something \"tried and true\" can feel safer than what may look like a questionable drug.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1484268409.0,
    "date_created": "2017-01-12",
    "time_created": "11:46:49",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4pvj",
    "parent_id": "t1_dcc39zr",
    "subreddit_name_prefixed": "r/news",
    "body": "It was my understanding that if a doctor writes a prescription for, for example, Oxycontin, the pharmacist will fill generic oxycodone. If the doctor wants brand name, they will write \"DAW\", which stands for \"Dispense as Written\". Maybe I'm wrong but it's standard to get the generic if not explicitly asked for.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484268614.0,
    "date_created": "2017-01-12",
    "time_created": "11:50:14",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2x2r",
    "parent_id": "t1_dcc00ez",
    "subreddit_name_prefixed": "r/news",
    "body": "Instructions unclear. Applied directly to the penis.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484266591.0,
    "date_created": "2017-01-12",
    "time_created": "11:16:31",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2dej",
    "parent_id": "t1_dcc0wfp",
    "subreddit_name_prefixed": "r/news",
    "body": "Do you still have a thumb?",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484265953.0,
    "date_created": "2017-01-12",
    "time_created": "11:05:53",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2bka",
    "parent_id": "t1_dcc122z",
    "subreddit_name_prefixed": "r/news",
    "body": "Which is frustrating when you take synthroid.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1484265892.0,
    "date_created": "2017-01-12",
    "time_created": "11:04:52",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccbphu",
    "parent_id": "t1_dcc8p4n",
    "subreddit_name_prefixed": "r/news",
    "body": "(Cheesy 1990s rap beat and record-scratch sounds) ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1484276265.0,
    "date_created": "2017-01-12",
    "time_created": "13:57:45",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc6dpx",
    "parent_id": "t1_dcc3ons",
    "subreddit_name_prefixed": "r/news",
    "body": "Highly depends on the topic",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1484270476.0,
    "date_created": "2017-01-12",
    "time_created": "12:21:16",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc7smc",
    "parent_id": "t1_dcc3ons",
    "subreddit_name_prefixed": "r/news",
    "body": ">Who the hell says that? \n\nEverybody.\n\nDon't read the comments on news websites. Always read the reddit comments. If you ever read the comments on a news website you'll quickly become part of the everybody.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1484272024.0,
    "date_created": "2017-01-12",
    "time_created": "12:47:04",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2vza",
    "parent_id": "t1_dcc2k02",
    "subreddit_name_prefixed": "r/news",
    "body": "Eh. You can weaponize anything. I could probably figure out a way to weaponize this bag of Doritos given enough time.",
    "controversiality": 0,
    "ups": 110,
    "downs": 0,
    "score": 110,
    "created": 1484266557.0,
    "date_created": "2017-01-12",
    "time_created": "11:15:57",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc372z",
    "parent_id": "t1_dcc2k02",
    "subreddit_name_prefixed": "r/news",
    "body": "...do you really think it's a good idea to defend yourself by injecting your attacker with adrenaline? ",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1484266906.0,
    "date_created": "2017-01-12",
    "time_created": "11:21:46",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc33uj",
    "parent_id": "t1_dcc2k02",
    "subreddit_name_prefixed": "r/news",
    "body": "I mean, if you can inject something into someone, there's probably a longer list of things that can kill them than things that won't.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1484266807.0,
    "date_created": "2017-01-12",
    "time_created": "11:20:07",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc6jds",
    "parent_id": "t1_dcc34dq",
    "subreddit_name_prefixed": "r/news",
    "body": "It was only in tests that this was shown, lucky they recalled before any actual problems in the field occurred",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1484270646.0,
    "date_created": "2017-01-12",
    "time_created": "12:24:06",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccaffw",
    "parent_id": "t1_dcc34dq",
    "subreddit_name_prefixed": "r/news",
    "body": "Was that due to the disappearing needle? \n\nRetracts too soon? ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484274866.0,
    "date_created": "2017-01-12",
    "time_created": "13:34:26",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc9h2h",
    "parent_id": "t1_dcc7wma",
    "subreddit_name_prefixed": "r/news",
    "body": "my wife is a pharmacist and i get to hear her endless complaints about people wanting to do all sort of crazy stuff at the pharmacy instead of contacting their doctors and sort it out with their doctors. I feel your pain\n\nEdit: Also 9 out of 10 times when someone have problems with their insurance, the pharmacy staff always get all the blame and bitching ",
    "controversiality": 0,
    "ups": 69,
    "downs": 0,
    "score": 69,
    "created": 1484273833.0,
    "date_created": "2017-01-12",
    "time_created": "13:17:13",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc81lu",
    "parent_id": "t1_dcc7wma",
    "subreddit_name_prefixed": "r/news",
    "body": "Oh for sure if you can get it done at the office it's much better. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1484272291.0,
    "date_created": "2017-01-12",
    "time_created": "12:51:31",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccbpmv",
    "parent_id": "t1_dcc7z66",
    "subreddit_name_prefixed": "r/news",
    "body": "Keep in mind some drugs have more than one generic, it can pay to do your research and see what options are available. One of my friends takes levothyroxine, but makes sure his MD writes for a specific generic as the variations in inactive ingredients affects absorption heavily (which is not surprising in hormones with doses in micrograms).",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1484276269.0,
    "date_created": "2017-01-12",
    "time_created": "13:57:49",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc8zrq",
    "parent_id": "t1_dcc80gn",
    "subreddit_name_prefixed": "r/news",
    "body": "In general that's true, because the active ingredient is the same and in the same concentration, and it will end up at approximately the same concentration in the blood (there's a small amount of wiggle room, but it's negligible).\n\nBut, remember that in rare cases people can have allergic reactions to the inactive ingredients (binding materials, dyes, preservatives, flavoring agents, etc). Those inactive ingredients can vary substantially between manufacturers.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1484273314.0,
    "date_created": "2017-01-12",
    "time_created": "13:08:34",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3g2c",
    "parent_id": "t1_dcc2pwh",
    "subreddit_name_prefixed": "r/news",
    "body": "Idk, they seemed excited ",
    "controversiality": 0,
    "ups": 248,
    "downs": 0,
    "score": 248,
    "created": 1484267183.0,
    "date_created": "2017-01-12",
    "time_created": "11:26:23",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3fek",
    "parent_id": "t1_dcc2pwh",
    "subreddit_name_prefixed": "r/news",
    "body": "They were going to be inconvenienced in during printing either way.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484267162.0,
    "date_created": "2017-01-12",
    "time_created": "11:26:02",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2lak",
    "parent_id": "t1_dcc2gxn",
    "subreddit_name_prefixed": "r/news",
    "body": "Do we have digital Green Peace yet?  If not, those digital trees can suck it.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1484266215.0,
    "date_created": "2017-01-12",
    "time_created": "11:10:15",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc1zex",
    "parent_id": "t1_dcbz5ts",
    "subreddit_name_prefixed": "r/news",
    "body": "Could be right where s/he is and not where you are.  May vary by state.  ",
    "controversiality": 0,
    "ups": 92,
    "downs": 0,
    "score": 92,
    "created": 1484265485.0,
    "date_created": "2017-01-12",
    "time_created": "10:58:05",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc31vj",
    "parent_id": "t1_dcbz5ts",
    "subreddit_name_prefixed": "r/news",
    "body": "\"Clinic\", or \"they do flu vaccines\"?\n\nCVS actually has an in-store clinic (MinuteClinic) with NP's/PA's staffed in them.  They diagnose and treat \"basic\" ailments to ease the burden on urgent care/ER and make it easier to get in than having to get a sick visit at your doctors office...in addition to offering vaccines.",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1484266746.0,
    "date_created": "2017-01-12",
    "time_created": "11:19:06",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcbzaj4",
    "parent_id": "t1_dcbz5ts",
    "subreddit_name_prefixed": "r/news",
    "body": "Is it accessible from in the store or does it have a separate entrance?",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1484262078.0,
    "date_created": "2017-01-12",
    "time_created": "10:01:18",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc20zt",
    "parent_id": "t1_dcbz5ts",
    "subreddit_name_prefixed": "r/news",
    "body": "Alcohol laws are state level, not nationwide.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1484265536.0,
    "date_created": "2017-01-12",
    "time_created": "10:58:56",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc34ob",
    "parent_id": "t1_dcc20sr",
    "subreddit_name_prefixed": "r/news",
    "body": "I love mine too...but starting this year, my insurance now partnered with a service called \"Doctor On Demand\".  There's an app on our phones that lets us do a video conference with a doctor.  \n\nI used it the other day for a rash my baby had on his face and had a pediatrician on the screen less than 10 minutes after installing the app.\n\nTelemedicine will beat the pants off of retail clinics on stuff like that.  No doubt.",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1484266832.0,
    "date_created": "2017-01-12",
    "time_created": "11:20:32",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4pqz",
    "parent_id": "t1_dcc1mub",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah, in Connecticut anything other than beer is limited to dedicated liquor stores. Though a grocery store could sell wine if they had a separate entrance and exit for the wine store. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484268610.0,
    "date_created": "2017-01-12",
    "time_created": "11:50:10",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4iw2",
    "parent_id": "t1_dcc39s1",
    "subreddit_name_prefixed": "r/news",
    "body": "That's not homeopathy. Look up homeopathy it's really bogus. Basically they take an extract of an herb and add it to like a drum of distilled water and voilà. Package that water in tiny bottles and charge $$$$$.\n\nMelatonin pills is not homeopathy.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484268397.0,
    "date_created": "2017-01-12",
    "time_created": "11:46:37",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc82n3",
    "parent_id": "t1_dcc6qsw",
    "subreddit_name_prefixed": "r/news",
    "body": "I wasn't trying to make an argument for or against patents in general.  I was just saying that a truly free market doesn't recognize intellectual property as it allows rent seeking.\n\nI disagree with your conclusion that big firms would benefit more than small firms from a reduction in patent protection.\n\nI agree that without patent protection there wouldn't be R&D happening at for profit companies.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484272323.0,
    "date_created": "2017-01-12",
    "time_created": "12:52:03",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcccga3",
    "parent_id": "t1_dcc9fbq",
    "subreddit_name_prefixed": "r/news",
    "body": "That sucks, while in consulting you always run the risk of working for...Uh..How do I say it... Douchebags. Some people just love to be annoying.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1484277094.0,
    "date_created": "2017-01-12",
    "time_created": "14:11:34",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccducx",
    "parent_id": "t1_dcccrji",
    "subreddit_name_prefixed": "r/news",
    "body": "Depends on the state.  As far as I know there are no federal guidelines for breaks.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1484278624.0,
    "date_created": "2017-01-12",
    "time_created": "14:37:04",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcch02u",
    "parent_id": "t1_dccgnlz",
    "subreddit_name_prefixed": "r/news",
    "body": "People don't do the right thing until its profitable.  Slavery didn't stop until we found a way to make machines do the hard work. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484282144.0,
    "date_created": "2017-01-12",
    "time_created": "15:35:44",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc30p7",
    "parent_id": "t1_dcc2g0v",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah, and we started allowing it in NZ in a good 16 years before the US!\n\nUnlike the US, though we have a nationally-funded public drug programme called Pharmac that favours the most cost-effective solution, so the doctor almost always prescribes generics as they are essentially free for the consumer (minus the $5 prescription charge).\n\nSo when our commercials say \"ask for it by name\", it translates to \"pay through the nose for this drug because it's not publicly funded.\" It's also easy to tell when a name-brand drug has been replaced with a generic on the national Pharmac scheme because the commercials will start telling us \"you don't have to change your inhaler\" etc.",
    "controversiality": 0,
    "ups": 473,
    "downs": 0,
    "score": 473,
    "created": 1484266708.0,
    "date_created": "2017-01-12",
    "time_created": "11:18:28",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4u3q",
    "parent_id": "t1_dcc2g0v",
    "subreddit_name_prefixed": "r/news",
    "body": "And Brazil only allows advertising for non-prescription medication, I believe.",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1484268747.0,
    "date_created": "2017-01-12",
    "time_created": "11:52:27",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2pdc",
    "parent_id": "t1_dcc2g0v",
    "subreddit_name_prefixed": "r/news",
    "body": "the US ends up on quite a few short lists. This is still one of the list with better countries.",
    "controversiality": 0,
    "ups": 58,
    "downs": 0,
    "score": 58,
    "created": 1484266346.0,
    "date_created": "2017-01-12",
    "time_created": "11:12:26",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2p2z",
    "parent_id": "t1_dcc2g0v",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah, you never really think of those countries as having their shit together.",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1484266336.0,
    "date_created": "2017-01-12",
    "time_created": "11:12:16",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4cil",
    "parent_id": "t1_dcc2g0v",
    "subreddit_name_prefixed": "r/news",
    "body": "Seriously.. if you were telling me a joke with all three people from those 3 countries coming in to a bar, my brain would be wrinkled.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484268197.0,
    "date_created": "2017-01-12",
    "time_created": "11:43:17",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc5209",
    "parent_id": "t1_dcc2kn3",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm going to need proof or source for this claim.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1484268991.0,
    "date_created": "2017-01-12",
    "time_created": "11:56:31",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4byf",
    "parent_id": "t1_dcc2i6e",
    "subreddit_name_prefixed": "r/news",
    "body": "You're not meant to figure it out. If everyone figured it out, pharmaceutical companies wouldn't be making billions a year.",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1484268180.0,
    "date_created": "2017-01-12",
    "time_created": "11:43:00",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc41nf",
    "parent_id": "t1_dcc3hy4",
    "subreddit_name_prefixed": "r/news",
    "body": "Just chiming in that if you need Prevacid you may be able to.get the dosage needed of Lansoprazole over the counter rather than needing a prescription.  Always check with your doctor first, but hopefully this can save someone else like it has me. :)",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1484267863.0,
    "date_created": "2017-01-12",
    "time_created": "11:37:43",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc5lih",
    "parent_id": "t1_dcc3av9",
    "subreddit_name_prefixed": "r/news",
    "body": "If it's not interchangeable with the same dosage and ingredients, it's not a generic alternative.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484269601.0,
    "date_created": "2017-01-12",
    "time_created": "12:06:41",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc609k",
    "parent_id": "t1_dcc4jab",
    "subreddit_name_prefixed": "r/news",
    "body": "My wife is prescribed an albuterol inhaler for asthma. We had to go get the script reissued to specifically say \"Ventolin\" because the generic that our insurance mandates the pharmacy fill it with does *not* work, despite supposedly being the same thing.\n\nOddly enough, once the script was written specifically for that certain brand, it's now covered by insurance whereas before a Ventolin inhaler with an albuterol script is 100% out of pocket. It's mind boggling.",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1484270062.0,
    "date_created": "2017-01-12",
    "time_created": "12:14:22",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc9e1o",
    "parent_id": "t1_dcc4jab",
    "subreddit_name_prefixed": "r/news",
    "body": "Also for some types of drugs, there is a difference between manufacturers. Psychoactive meds in particular. Its the same drugs, but minor variations in manufacturing processes can result in a slightly different ratio of active ingredients, or a tiny difference in rate of uptake or release, or whatever. Not much, probably just a fraction of a percent on any given parameter, but brain chemistry is delicate as fuck so if you start off taking one brand of antidepressant or antipsychotic or something, you'll probably need to stick with that particular manufacturer\n\nFor pretty much any other kind of drug it doesn't natter though",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484273743.0,
    "date_created": "2017-01-12",
    "time_created": "13:15:43",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2kba",
    "parent_id": "t1_dcc2bka",
    "subreddit_name_prefixed": "r/news",
    "body": "You are not wrong. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484266182.0,
    "date_created": "2017-01-12",
    "time_created": "11:09:42",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc2zj7",
    "parent_id": "t1_dcc2vza",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm waiting.",
    "controversiality": 0,
    "ups": 47,
    "downs": 0,
    "score": 47,
    "created": 1484266670.0,
    "date_created": "2017-01-12",
    "time_created": "11:17:50",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc485w",
    "parent_id": "t1_dcc2vza",
    "subreddit_name_prefixed": "r/news",
    "body": "Sometimes I fantasize about weaponizing things like glitter. A mix of the extra fine and the big itchy kind. Can you imagine soaking your enemies with mineral oil, followed by a ton of sparkly glitter? The oil will make it so that simply washing off the glitter won't work.   \n\nYour enemies of war will slowly lose their sanity as the glitter destroys their morale, disturbs their sleep and comfort, prevents masturbation (unless you like pain), inspires ridicule, gets in their food and water, and makes them waste time trying to get rid of it. Not to mention mineral oil and glitter is cheap, so you could dump it over and over and over....  ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484268063.0,
    "date_created": "2017-01-12",
    "time_created": "11:41:03",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc5u3q",
    "parent_id": "t1_dcc2vza",
    "subreddit_name_prefixed": "r/news",
    "body": "Doritos are pretty flammable (no, really -- they make great fire-starting aids in a pinch!), so just light the bag on fire and hurl at your enemies.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1484269870.0,
    "date_created": "2017-01-12",
    "time_created": "12:11:10",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4qh1",
    "parent_id": "t1_dcc33uj",
    "subreddit_name_prefixed": "r/news",
    "body": "Air, for instance.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1484268632.0,
    "date_created": "2017-01-12",
    "time_created": "11:50:32",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccb48b",
    "parent_id": "t1_dcc6jds",
    "subreddit_name_prefixed": "r/news",
    "body": "And that's why medicine costs a lot to produce, because you need to catch every error and design flaw in testing. Can't release the product and do tech support if a 1% failure case comes up. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1484275618.0,
    "date_created": "2017-01-12",
    "time_created": "13:46:58",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccg5sy",
    "parent_id": "t1_dcc9h2h",
    "subreddit_name_prefixed": "r/news",
    "body": "Oh god, this is my life.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1484281205.0,
    "date_created": "2017-01-12",
    "time_created": "15:20:05",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc9w3v",
    "parent_id": "t1_dcc8zrq",
    "subreddit_name_prefixed": "r/news",
    "body": "I have to take xoponex rather than the generic albuterol, because xoponex makes me significantly less jumpy.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484274291.0,
    "date_created": "2017-01-12",
    "time_created": "13:24:51",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4gbz",
    "parent_id": "t1_dcc3g2c",
    "subreddit_name_prefixed": "r/news",
    "body": "Are you positive?",
    "controversiality": 0,
    "ups": 129,
    "downs": 0,
    "score": 129,
    "created": 1484268317.0,
    "date_created": "2017-01-12",
    "time_created": "11:45:17",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4zdh",
    "parent_id": "t1_dcc1zex",
    "subreddit_name_prefixed": "r/news",
    "body": "That's true. Didn't think about that",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1484268911.0,
    "date_created": "2017-01-12",
    "time_created": "11:55:11",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc55p5",
    "parent_id": "t1_dcc31vj",
    "subreddit_name_prefixed": "r/news",
    "body": "Well they definitely do a lot more than vaccines. My wife's been there a couple times but yea I think it's staffed with NP/PAs",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484269106.0,
    "date_created": "2017-01-12",
    "time_created": "11:58:26",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcbzlpm",
    "parent_id": "t1_dcbzaj4",
    "subreddit_name_prefixed": "r/news",
    "body": "In the same store. You have to enter the store to get to the clinic",
    "controversiality": 0,
    "ups": 48,
    "downs": 0,
    "score": 48,
    "created": 1484262507.0,
    "date_created": "2017-01-12",
    "time_created": "10:08:27",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccd4yo",
    "parent_id": "t1_dcc34ob",
    "subreddit_name_prefixed": "r/news",
    "body": "How was the doctor? I got the same thing this year but I haven't bothered setting it up since I mostly just assumed if I can get a doctor in 10min, 24/7, for free*, it was probably the level 1 helpdesk equivalent. Should probably do a little more research..",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484277852.0,
    "date_created": "2017-01-12",
    "time_created": "14:24:12",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc88j1",
    "parent_id": "t1_dcc4iw2",
    "subreddit_name_prefixed": "r/news",
    "body": "Homeopathy is also a marketing term for \"all natural\" and various stuff. [This](http://www.cvs.com/shop/vitamins/supplements/other-supplements/cvs-homeopathic-peaceful-sleep-chewable-tablets-60ct-prodid-414504#/Ingredients) is what CVS sells as homeopathic medicine.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484272497.0,
    "date_created": "2017-01-12",
    "time_created": "12:54:57",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccv8x6",
    "parent_id": "t1_dcch02u",
    "subreddit_name_prefixed": "r/news",
    "body": "Exactly this. Otherwise you are punishing people for doing the right thing. It's ideal and heroic when people make sacrifice to do the right thing but you can't ask or expect it from people.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484299523.0,
    "date_created": "2017-01-12",
    "time_created": "20:25:23",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc5eyc",
    "parent_id": "t1_dcc30p7",
    "subreddit_name_prefixed": "r/news",
    "body": "Actually, the U.S. is similar! Unless you ask for a name brand, the doctor will prescribe you a generic unless they do not think it would be a good fit for you. It's usually at the doctor's discretion. \n\n  The only difference (and it's a huge difference) is that some people do not have insurance so a generic is still insanely expensive for them. ",
    "controversiality": 0,
    "ups": 154,
    "downs": 0,
    "score": 154,
    "created": 1484269391.0,
    "date_created": "2017-01-12",
    "time_created": "12:03:11",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4s3d",
    "parent_id": "t1_dcc30p7",
    "subreddit_name_prefixed": "r/news",
    "body": "Hey, as a Kiwi living in the US for the last 10 years, this was really helpful. The topic (NZ and US allowing DTC pharma marketing) sometimes comes up in conversation, and I wasn't aware of this difference. Thanks!",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1484268682.0,
    "date_created": "2017-01-12",
    "time_created": "11:51:22",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc6ick",
    "parent_id": "t1_dcc4u3q",
    "subreddit_name_prefixed": "r/news",
    "body": "Yes, and the commercials have warnings at the end saying stuff about seeing a doctor, reading the instructions, etc. Source: I'm Brazilian. ",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1484270616.0,
    "date_created": "2017-01-12",
    "time_created": "12:23:36",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3dry",
    "parent_id": "t1_dcc2pdc",
    "subreddit_name_prefixed": "r/news",
    "body": "The US is the only country that hasn't ratified the [UN's Convention on the Rights of the Child](https://en.wikipedia.org/wiki/Convention_on_the_Rights_of_the_Child). Even South Sudan got around to it and it's only been an independent country for 6 years.\n\nEdit: Apparently some of my fellow Americans are butthurt because they think I meant South Sudan, a war-torn African nation with a fledgling central government, could somehow match the US in terms of civil rights. I was simply adding onto /u/Ovl233's comment as I remembered [the Convention on the Rights of the Child being brought up in this Vsauce video](https://www.youtube.com/watch?v=p7THJoRYA2c). I brought up South Sudan because it's mentioned alongside the US in the video and at the time it was uploaded South Sudan hadn't ratified it yet. Y'all need to relax.\n\n**Edit 2: Since some of you can't read, let me spell it out loud and clear:**\n\n#*SOUTH SUDAN IS NOT ON PAR WITH THE US IN TERMS OF CIVIL RIGHTS.*\n\n#*NOT CHILD'S RIGHTS.*\n\n#*NOT LGBT RIGHTS*\n\n#*NOT WOMEN'S RIGHTS*\n\n#*NOTHING. ZIP. ZILCH. NADA.*",
    "controversiality": 0,
    "ups": 136,
    "downs": 0,
    "score": 136,
    "created": 1484267112.0,
    "date_created": "2017-01-12",
    "time_created": "11:25:12",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3zp2",
    "parent_id": "t1_dcc2p2z",
    "subreddit_name_prefixed": "r/news",
    "body": "I am also an archer reference",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1484267800.0,
    "date_created": "2017-01-12",
    "time_created": "11:36:40",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3fk1",
    "parent_id": "t1_dcc2p2z",
    "subreddit_name_prefixed": "r/news",
    "body": " That is a great Archer quote, but I think this is one case where we're the ones that don't have our shit together.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1484267167.0,
    "date_created": "2017-01-12",
    "time_created": "11:26:07",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc5vge",
    "parent_id": "t1_dcc5209",
    "subreddit_name_prefixed": "r/news",
    "body": "Sure!:\n\nhttps://www.statnews.com/pharmalot/2016/03/04/drug-ads-taxes-al-franken/?s_campaign=trendmd\n\nFor the record, this bill died in Committee:\n\nhttps://www.congress.gov/bill/114th-congress/senate-bill/2623/text\n",
    "controversiality": 0,
    "ups": 53,
    "downs": 0,
    "score": 53,
    "created": 1484269911.0,
    "date_created": "2017-01-12",
    "time_created": "12:11:51",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4yv6",
    "parent_id": "t1_dcc4byf",
    "subreddit_name_prefixed": "r/news",
    "body": "Right on the nose!",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1484268896.0,
    "date_created": "2017-01-12",
    "time_created": "11:54:56",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccag05",
    "parent_id": "t1_dcc4byf",
    "subreddit_name_prefixed": "r/news",
    "body": "Thats right.  As long as our health system is run by for profit interests, it will always be a problem.  This whole thing about buying insurance, obamacare, proposed tax credits, possibly allowing buying insurance accross state lines etc is barking up the wrong tree.  All that is just a distraction from the true issue that for profits control our health care.  Healthcare should be automatically provided to all americans, and should be paid via taxes.  Pharma should not be for profit, and neither should hospitals.  For profits should continue to exist, but should not be the main contributors to pharma and medical care.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1484274884.0,
    "date_created": "2017-01-12",
    "time_created": "13:34:44",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc6mjd",
    "parent_id": "t1_dcc609k",
    "subreddit_name_prefixed": "r/news",
    "body": "> Oddly enough, once the script was written specifically for that certain brand, it's now covered by insurance\n\nI mean, there's nothing odd about this. It's no different than you trying to get blood/lab work done that your doctor doesn't order or designate as medically necessary. The insurance company is going to look at that invoice and say, \"ha, no\" without hesitation.\n\nHaving the customer themselves tell the pharamacy that they want brand X specifically is much different than doctor themselves saying \"You must dispense brand X and only brand X.\" Hell, you can get most OTC stuff covered if you have a doctor write a script saying it's medically required.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1484270740.0,
    "date_created": "2017-01-12",
    "time_created": "12:25:40",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc9mji",
    "parent_id": "t1_dcc609k",
    "subreddit_name_prefixed": "r/news",
    "body": "The second part of your post isn't too mind-boggling, actually.  It goes back to the DAW rules and how your benefits are setup.  More and more companies are putting DAW penalties in place to get people onto generics and off of the brands.  \n\n\nBasically, if your doctor writes the Rx for the generic inhaler and you go and ask specifically for Ventolin, that is what we call 'DAW 2', which means the substitution to the brand drug was requested by the patient.  In these cases, a lot of companies are putting 'DAW Penalties' in place - essentially making you pay a ton of money for that brand, because in their eyes you're just being irrational and you should get the generic, so why should your company foot the bill and not you?  The penalties vary by company - some only charge an extra $10-20, while some (as in your case) will make you pay for the whole cost.\n\n\nSome companies are even putting in place penalties on DAW1 prescriptions.  DAW1 means the doctor wrote the prescription for Ventolin, and essentially said 'only give the brand Ventolin, no generic alternative.'   It sounds like you're not subject to this, but some companies will STILL charge you a penalty because now they think your doctor is being irrational and she should be prescribing the generic, so again, why should the company foot the bill?!\n\n\nAs an FYI, there are always exceptions to this.  If this ever happens to you, you may have to jump through some hoops, but if you and your doctor can communicate to your benefits provider that the generic does not work and the brand is needed, they will not/should not subject you to these penalties and you should be able to get your Rx for the standard copay amounts.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1484274001.0,
    "date_created": "2017-01-12",
    "time_created": "13:20:01",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3bx9",
    "parent_id": "t1_dcc2zj7",
    "subreddit_name_prefixed": "r/news",
    "body": "Eat the Doritos,  now suffocate somebody with the empty bag.\n",
    "controversiality": 0,
    "ups": 79,
    "downs": 0,
    "score": 79,
    "created": 1484267055.0,
    "date_created": "2017-01-12",
    "time_created": "11:24:15",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3h17",
    "parent_id": "t1_dcc2zj7",
    "subreddit_name_prefixed": "r/news",
    "body": "I'll just crunch a bunch of them up and shove them in your mouth until one gets stuck between your teeth, then not give you a toothpick. Take that, ya jerk.",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1484267215.0,
    "date_created": "2017-01-12",
    "time_created": "11:26:55",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc48zh",
    "parent_id": "t1_dcc2zj7",
    "subreddit_name_prefixed": "r/news",
    "body": "Suffocate the person with the bag or with a fist full of doritos smashed into their mouth.\n\nFeed them enough over time and watch them die from obesity. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484268089.0,
    "date_created": "2017-01-12",
    "time_created": "11:41:29",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc52k8",
    "parent_id": "t1_dcc485w",
    "subreddit_name_prefixed": "r/news",
    "body": "A weapon of mass deridation!",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484269009.0,
    "date_created": "2017-01-12",
    "time_created": "11:56:49",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc5n50",
    "parent_id": "t1_dcc4gbz",
    "subreddit_name_prefixed": "r/news",
    "body": "That's a negative ",
    "controversiality": 0,
    "ups": 102,
    "downs": 0,
    "score": 102,
    "created": 1484269652.0,
    "date_created": "2017-01-12",
    "time_created": "12:07:32",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccdd6g",
    "parent_id": "t1_dccd4yo",
    "subreddit_name_prefixed": "r/news",
    "body": "She was very nice and she was an actual doctor.  I wasn't expecting a breakthrough diagnosis, it was a rash on his cheek.  Just wanted to know that it wasn't serious and how to treat it.  She said just let it go and it'll clear up on it's own, we're better off not putting anything on it (and we were thinking about putting hydrocortisone on it).  Lo and behold, it's clear as of this morning.\n\nIt's the type of thing that you should use your own judgement on before you use it, and I like that.  You gotta make the call and say \"Is this severe enough that I need to go to the ER/urgent care, or minor enough that I can wait a couple days for my GP?\"  If it's in-between, that's when you'd use the app.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1484278097.0,
    "date_created": "2017-01-12",
    "time_created": "14:28:17",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc8g19",
    "parent_id": "t1_dcc5eyc",
    "subreddit_name_prefixed": "r/news",
    "body": "That, and the US has very strict protections for pharmaceutical companies regarding generics. I've been taking Advair for over 10 years now. Still protected. Still no generic available. Used to cost me $350/mo before I discovered that a generic did exist, I just had to order it through Canada. \n\nSame for albuterol. When the government banned CFCs, somehow that granted the drug companies a new round of protection from generics, even thought the active ingredient didn't change. No more $4 rescue inhalers, now they're $60-80.\n\nAnd to top it all off, as a self-employed person I had to pay double the normal premiums for health insurance that refused to cover any asthma related expenses because it was a preexisting condition. Now I'm covered under obamacare... But my premiums doubled again.\n\nI pay twice as much on healthcare as I do on my mortgage. Something is severely fucked up with this system. ",
    "controversiality": 0,
    "ups": 146,
    "downs": 0,
    "score": 146,
    "created": 1484272717.0,
    "date_created": "2017-01-12",
    "time_created": "12:58:37",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc5rzj",
    "parent_id": "t1_dcc5eyc",
    "subreddit_name_prefixed": "r/news",
    "body": "There is also the concern in the US that as doctors themselves aren't publically funded they are more susceptible to being \"paid\" (in benefits usually) to perscribe non-generic medecines.\n\nThe NHS allows GPs to perscribe non-generics only with medical justification. If a doctor just decided to perscribe non-generics by default it would be flagged up.",
    "controversiality": 0,
    "ups": 105,
    "downs": 0,
    "score": 105,
    "created": 1484269804.0,
    "date_created": "2017-01-12",
    "time_created": "12:10:04",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccd0lb",
    "parent_id": "t1_dcc5eyc",
    "subreddit_name_prefixed": "r/news",
    "body": "Uh, not really at the doctors discretion. Every time I go to the pharmacist they ask if I'd like the generic because it's cheaper... ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484277718.0,
    "date_created": "2017-01-12",
    "time_created": "14:21:58",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcceudv",
    "parent_id": "t1_dcc5eyc",
    "subreddit_name_prefixed": "r/news",
    "body": "Definitely been my experience in the military. The doc still calls it by the name brand though, but it's always the generic instead.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484279731.0,
    "date_created": "2017-01-12",
    "time_created": "14:55:31",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc6jwv",
    "parent_id": "t1_dcc5eyc",
    "subreddit_name_prefixed": "r/news",
    "body": "it depends on the hospital and the doctor. Many doctors in the USA get paid bonuses based on how many people they prescribe certain medications to. For some reason pharmaceutical companies can still get away with it.  ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1484270662.0,
    "date_created": "2017-01-12",
    "time_created": "12:24:22",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4kvt",
    "parent_id": "t1_dcc3dry",
    "subreddit_name_prefixed": "r/news",
    "body": "Children are treated like property in the US, pretty much the only time you'll hear an official talk about children with any sort of responsibility as a human being in the same breath is when the topic is along the lines of \"tried as an adult\" or as a political message about abortion rights.",
    "controversiality": 0,
    "ups": 104,
    "downs": 0,
    "score": 104,
    "created": 1484268459.0,
    "date_created": "2017-01-12",
    "time_created": "11:47:39",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3prz",
    "parent_id": "t1_dcc3dry",
    "subreddit_name_prefixed": "r/news",
    "body": "Lots of american redditors think it's a great idea to hit your child.",
    "controversiality": 0,
    "ups": 62,
    "downs": 0,
    "score": 62,
    "created": 1484267487.0,
    "date_created": "2017-01-12",
    "time_created": "11:31:27",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3zgj",
    "parent_id": "t1_dcc3fk1",
    "subreddit_name_prefixed": "r/news",
    "body": "thatsthejoke.gif",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1484267793.0,
    "date_created": "2017-01-12",
    "time_created": "11:36:33",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc6gv7",
    "parent_id": "t1_dcc5vge",
    "subreddit_name_prefixed": "r/news",
    "body": "Props for sauce!",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1484270570.0,
    "date_created": "2017-01-12",
    "time_created": "12:22:50",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc8771",
    "parent_id": "t1_dcc4yv6",
    "subreddit_name_prefixed": "r/news",
    "body": "I hear there's a medicine for that! ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1484272459.0,
    "date_created": "2017-01-12",
    "time_created": "12:54:19",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc3j8a",
    "parent_id": "t1_dcc3bx9",
    "subreddit_name_prefixed": "r/news",
    "body": "Obesity and devoid of nutrition.  It's already weaponized and working effectively.  Same with sodas.",
    "controversiality": 0,
    "ups": 61,
    "downs": 0,
    "score": 61,
    "created": 1484267283.0,
    "date_created": "2017-01-12",
    "time_created": "11:28:03",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc8chc",
    "parent_id": "t1_dcc3h17",
    "subreddit_name_prefixed": "r/news",
    "body": "Stop. I can't handle this kind of cruelty.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1484272613.0,
    "date_created": "2017-01-12",
    "time_created": "12:56:53",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc9wxt",
    "parent_id": "t1_dcc5n50",
    "subreddit_name_prefixed": "r/news",
    "body": "Aw cute you guys are bonding",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1484274315.0,
    "date_created": "2017-01-12",
    "time_created": "13:25:15",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc66u7",
    "parent_id": "t1_dcc5n50",
    "subreddit_name_prefixed": "r/news",
    "body": "Well, give it 1/2 up spin to make it better.",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1484270265.0,
    "date_created": "2017-01-12",
    "time_created": "12:17:45",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccfbrz",
    "parent_id": "t1_dcc8g19",
    "subreddit_name_prefixed": "r/news",
    "body": "I was just bitching to myself about a small issue I have but wow did this just things into perspective for me.\nI really take health care for granted being in a country that has universal healthcare",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1484280268.0,
    "date_created": "2017-01-12",
    "time_created": "15:04:28",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccfet6",
    "parent_id": "t1_dcc8g19",
    "subreddit_name_prefixed": "r/news",
    "body": "How do you order the generic advair through Canada? Specifically? My wife was just diagnosed with asthma and it's still stupidly expensive. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1484280362.0,
    "date_created": "2017-01-12",
    "time_created": "15:06:02",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccsbn4",
    "parent_id": "t1_dcc8g19",
    "subreddit_name_prefixed": "r/news",
    "body": "The solution is single payer, but our political system is so far skewed to the right that Obamacare is seen as 'socialistic.'",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1484295576.0,
    "date_created": "2017-01-12",
    "time_created": "19:19:36",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcchxcr",
    "parent_id": "t1_dcc8g19",
    "subreddit_name_prefixed": "r/news",
    "body": "Gotta get that single payer done or we'll be health care's hostages forever.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484283168.0,
    "date_created": "2017-01-12",
    "time_created": "15:52:48",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccilgw",
    "parent_id": "t1_dcc8g19",
    "subreddit_name_prefixed": "r/news",
    "body": "I agree man. Our healthcare system is unbelievably broken, it's all about profit. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484283899.0,
    "date_created": "2017-01-12",
    "time_created": "16:04:59",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccnbys",
    "parent_id": "t1_dcc8g19",
    "subreddit_name_prefixed": "r/news",
    "body": "CFCs were still legal for inhalers, there were just more hurdles and the industry managed to get the generics off the shelfs. Which sucks for an asthmatic in an emergency who is out of refills. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484289250.0,
    "date_created": "2017-01-12",
    "time_created": "17:34:10",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccnm53",
    "parent_id": "t1_dcc8g19",
    "subreddit_name_prefixed": "r/news",
    "body": "Pharma and Insurence are strongly gouging their prices now so the public feels good when they repeal ACA ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484289584.0,
    "date_created": "2017-01-12",
    "time_created": "17:39:44",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccuipa",
    "parent_id": "t1_dcc8g19",
    "subreddit_name_prefixed": "r/news",
    "body": "Wow, sorry about that. I have a pre-existing condition and since one of the  the first actions of trump is going to be making pre-existing conditions a slam-dunk for refusing insurance it's not going to be a pretty future. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484298507.0,
    "date_created": "2017-01-12",
    "time_created": "20:08:27",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcdoswc",
    "parent_id": "t1_dcc8g19",
    "subreddit_name_prefixed": "r/news",
    "body": "What the fuck holy shit my perception of the US health system just gets worse every time I hear about it. So many things you just said would be flat out illegal in the country I live in. \n\nGenerics must still be approved according to very strict rules, but only in regard to bioactivity, i.e. they must contain the exact same active ingredient and be absorbed in the same way, but this is for the safety of the patient being prescribed the medicine (their choice of brand obviously shouldn't change the  effectiveness of the drug). \n\nPretty much all common drugs have generic versions, and if not it's because they are a new drug and protected because the chemical formula has not been published (but this is only allowed for five years, and only on cases where a completely new active ingredient has been created).\n\nSources: \n\n- [Generic drug info](https://www.tga.gov.au/community-qa/generic-prescription-medicines-fact-sheet)  \n\n- [Data exclusivity](http://www.davies.com.au/ip-news/data-exclusivity-provisions-under-the-therapeutic-goods-act-1989)            ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484352512.0,
    "date_created": "2017-01-13",
    "time_created": "11:08:32",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc7m46",
    "parent_id": "t1_dcc5rzj",
    "subreddit_name_prefixed": "r/news",
    "body": "As a doctor I can tell you that being paid (even in benefits) is illegal.  Hell, I miss the nice free pens we used to get.  Most doctors, myself included, tend to think of their patients needs first.  Very rarely have I seen a colleague make decisions based on what would profit him/her the most over the needs of the patient.\nEDIT: By very rarely I mean \"I can't recall seeing.\"  Sorry for the confusion. ",
    "controversiality": 0,
    "ups": 160,
    "downs": 0,
    "score": 160,
    "created": 1484271831.0,
    "date_created": "2017-01-12",
    "time_created": "12:43:51",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc734n",
    "parent_id": "t1_dcc5rzj",
    "subreddit_name_prefixed": "r/news",
    "body": "Hmmm. Am in US, have never heard of doctors getting paid differently based on what medicines they prescribe. Doctors get paid based on visit type and any interventions/procedures they do, not by what medicines the patient receives.\n\nUnless you're talking about like from a pharmaceutical company, which has been strictly regulated and is illegal. So if anyone's doing that, that's illegal.\n\nOr unless you're talking about a medicine that the doctor makes and prescribes, which is also illegal.\n\nETA: Certain drugs are a certain level of restriction, too, so some third party reviews the prescribing habits of each physician for drugs in certain classes, and if it's fishy, that gets shut down/something illegal is probably happening (\"pill mills\") and they get arrested/license revoked.\n\nWhat mainly determines generic vs. non-generic seems to be \"what is the most effective drug for this pt that will cost the PATIENT the least to receive.\" If it's generic, that's what they prescribe. If it's some fancy drug, then they get that prescribed.\n\n**ETA2:** I'm not saying that doctors don't receive money from pharmaceutical companies. Many do (although many practices straight-up ban it). But that's SEPARATE from their salary as physicians. They get $$ which then makes them more likely to prescribe brand name drugs. I have read PLENTY on it, had many lectures and classes on it, and deal with it very regularly. I know it's real and fairly common. :)",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1484271246.0,
    "date_created": "2017-01-12",
    "time_created": "12:34:06",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc81k5",
    "parent_id": "t1_dcc5rzj",
    "subreddit_name_prefixed": "r/news",
    "body": "But this really doesn't happen that often...",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484272289.0,
    "date_created": "2017-01-12",
    "time_created": "12:51:29",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccagnq",
    "parent_id": "t1_dcc5rzj",
    "subreddit_name_prefixed": "r/news",
    "body": "Didn't a few US doctors recently gryphon busted for over prescribing Fentanyl because they were getting \"benefits\" from the company? Thought I browsed an article awhile ago that had somethin like that in it.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484274903.0,
    "date_created": "2017-01-12",
    "time_created": "13:35:03",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc80fz",
    "parent_id": "t1_dcc5rzj",
    "subreddit_name_prefixed": "r/news",
    "body": "Drug companies also send out lobbyists to doctor's offices,  reps that bring marketing materials, sample packs, etc. That's where the free branded swag items come from. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484272256.0,
    "date_created": "2017-01-12",
    "time_created": "12:50:56",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dccb9ki",
    "parent_id": "t1_dcc4kvt",
    "subreddit_name_prefixed": "r/news",
    "body": "Bonus points for when they're tried as an adult for something that isn't illegal for an adult to do.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1484275782.0,
    "date_created": "2017-01-12",
    "time_created": "13:49:42",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc9321",
    "parent_id": "t1_dcc4kvt",
    "subreddit_name_prefixed": "r/news",
    "body": "Children are treated like property basically everywhere, other than not being allowed to seriously injure them. There really needs to be a global child liberation movement",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1484273413.0,
    "date_created": "2017-01-12",
    "time_created": "13:10:13",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc4fbv",
    "parent_id": "t1_dcc3prz",
    "subreddit_name_prefixed": "r/news",
    "body": "Like me, for instance.",
    "controversiality": 0,
    "ups": 210,
    "downs": 0,
    "score": 210,
    "created": 1484268286.0,
    "date_created": "2017-01-12",
    "time_created": "11:44:46",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc56l4",
    "parent_id": "t1_dcc3prz",
    "subreddit_name_prefixed": "r/news",
    "body": "Why do people want to hit /u/mtm5891's child?",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1484269132.0,
    "date_created": "2017-01-12",
    "time_created": "11:58:52",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc5j0a",
    "parent_id": "t1_dcc3prz",
    "subreddit_name_prefixed": "r/news",
    "body": "I've always been a fan of melting them, personally.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1484269520.0,
    "date_created": "2017-01-12",
    "time_created": "12:05:20",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc54sk",
    "parent_id": "t1_dcc3prz",
    "subreddit_name_prefixed": "r/news",
    "body": "True, but it actually has nothing to do with corporal punishment.  Just prohibits child slavery, military service, marriage, capital punishment,  et al. Things the United States doesn't participate in (legally, at least) anyhow. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1484269077.0,
    "date_created": "2017-01-12",
    "time_created": "11:57:57",
    "submission_id": "news-5njj2x"
  },
  {
    "id": "dcc60c3",
    "parent_id": "t1_dcc3j8a",
    "subreddit_name_prefixed": "r/news",
    "body": "Found the former mayor of New York",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1484270064.0,
    "date_created": "2017-01-12",
    "time_created": "12:14:24",
    "submission_id": "news-5njj2x"
  }
]