{"body":{"0":"One of the most interesting sentences to me, and one that holds great logical and philosophical (and clearly legal) weight:\n\n> Precedent protects the right of a married couple not to procreate, so the right to marry cannot be conditioned on the capacity or commitment to procreate.\n\nThe last sentence on page 3, from [the PDF of the majority decision published on the SC website](http:\/\/www.supremecourt.gov\/opinions\/14pdf\/14-556_3204.pdf).","2":"And gays across the country who have been relying on \"Hey, I'd love to get married, but it's not legal\" woke up to a *really* awkward conversation. ","3":"I've been using the whole \"I won't get married until the gays can\" excuse with my girlfriend.\n\nGentleman, it's been a privilege playing with you. ","5":"My Facebook will never be the same after this week. I'm going to buy stock in popcorn and butter, y'all. ","7":"I've seen a lot of people ask how the Supreme Court has the authority to decide this issue for states. For those interested, I am an American lawyer and I can answer that question with some insight.\n\nYes, the Supreme Court does have the authority to make sweeping decisions that invalidate any and all state laws which conflict with its ruling. The Supreme Court finds this authority in the Supremacy Clause of the U.S. Constitution and from the very significant court case of *Marybury vs. Madison* which more or less established the Supreme Court's absolute authority to literally \"say what the law is.\"\n\nStates do have autonomy to decide certain issues for themselves. These are judicial notions of 'comity' and 'parity,' the idea that state governments are better equipped to deal with local and regional issues rather than a distant Congress in Washington. In fact, the laws of contracts traditionally belong to states, which is why every state in the U.S. has slight legal differences in how contracts are formed, enforced, written, etc. Marriage, in its most basic legal form, is a contract entered into by two consenting adults, which is why marriage laws have been decided by state legislatures and state courts.\n\nBut there's an important amendment to the U.S. Constitution that (as of today) strips away the right of a state to define marriage in their laws as a union between one man and one woman: the Fourteenth Amendment (and more specifically the Equal Protection Clause) which states:\n\n> No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States; nor shall any State deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws.\n \nWithout getting too much into the nuances of the Supreme Court's varying standards of review (although I certainly can if you're interested), the Supreme Court traditionally reviews Equal Protection issues under what's called a 'rational basis review.' It is the most permissive standard the Court can adopt--that is, it is the least difficult standard to meet in order to successfully defend a law from being struck down. The review asks whether a law is rationally related to a legitimate government interest. With respect to the issue of marriage equality, the question is: Are state laws banning same-sex marriage rationally related to the legitimate government interest of protecting the institution of marriage?\n\nTo that question the Supreme Court has apparently said 'no.' The fact that the Supreme Court today could not find any rational basis for these state bans related to the stated goal of protecting the institution of marriage says *a lot*. The Court is literally saying there is no rational relationship between banning same-sex marriage and protecting marriage. Thus, same-sex marriage bans are unconstitutional under the Fourteenth Amendment, and every such law in the United States is immediately invalidated.\n\nThe Supreme Court has made sweeping judgments like this before, although decisions of this magnitude are quite rare. For examples, see *Brown vs. Board of Education* (which held that state laws enacting racial segregation were unconstitutional) and *Loving vs. Virginia* (which held that state laws banning interracial marriage were unconstitutional).\n\nTL;DR: Yes, the Supreme Court has the authority to say what the law is for the entire nation. Yes, marriage is traditionally an area kept to state law, but only up to a limit until a law runs headlong into the Fourteenth Amendment's Equal Protection Clause.\n\n**Important Edit:** It appears I've disseminated some amount of disinformation for which I apologize (I did not get around to actually reading the full opinion until now). As pointed out to me by \/u\/Armonster20, the Supreme Court **DID NOT** review this case under rational basis. Rather, it was decided under a strict scrutiny review. The majority opinion does not even make much mention at all of the words \"sexual orientation,\" instead focusing on the fundamental right of marriage. A lot of you have asked about the varying standards of review, but I must confess that constitutional law is outside my usual day-to-day practice and I'm doing the best I can to remember the basics I learned in law school. I could try to explain the standards of review in detail but I'm afraid of saying something inaccurate. The least I can do is direct you **[here](http:\/\/blogs.findlaw.com\/law_and_life\/2014\/01\/challenging-laws-3-levels-of-scrutiny-explained.html)**.\n\nBut to go into just a little more detail, the strict scrutiny test is the most demanding standard of review to which the Supreme Court can subject a law. The reason the Supreme Court chose to review this case under this very exacting test is quite logical actually: the Supreme Court has previously said that any law that abridges a \"fundamental right\" must meet the most demanding scrutiny, and the Supreme Court has previously deemed the right to marry as a fundamental right. Thus, because any state law that excludes an entire class of people from participating in marriage obviously implicates the fundamental right to marry, we get strict scrutiny. (FYI - Another fundamental right under the Constitution is the right to have an abortion.)\n\nWhat this means is that the majority made it damn-near impossible for the respondents (i.e., the states defending their same-sex marriage bans) to win in this case. What this does NOT mean is that any future LGBT issues will be given the same standard review, unless they of course deal with marriage. Most likely, any future litigation on LGBT issues will be subject to rational basis review or something that's informally been called \"rational basis review with a bite\"--a standard somewhere between normal rational basis and intermediate scrutiny.","8":"That's it, my wife and I are getting a divorce.","10":"This is destroying the sanctity of Bristol Palin's marriage.\n\nEDIT: more gold pls","11":"RIP pastor in texas who said he would light himself on fire when this day came..","13":"The final two paragraphs of the Court's opinion:\n\n> No union is more profound than marriage, for it embodies\nthe highest ideals of love, fidelity, devotion, sacrifice,\nand family. In forming a marital union, two people become\nsomething greater than once they were. As some of\nthe petitioners in these cases demonstrate, marriage\nembodies a love that may endure even past death. It\nwould misunderstand these men and women to say they\ndisrespect the idea of marriage. Their plea is that they do\nrespect it, respect it so deeply that they seek to find its\nfulfillment for themselves. Their hope is not to be condemned\nto live in loneliness, excluded from one of civilization's\noldest institutions. They ask for equal dignity in the\neyes of the law. The Constitution grants them that right.\nThe judgment of the Court of Appeals for the Sixth\nCircuit is reversed.\n\n> It is so ordered.\n\n----\n\nEdit: And the walls came tumbling down!\n\n~~Texas's gay marriage ban~~\n\n~~Kentucky's gay marriage ban~~\n\n~~Alabama's gay marriage ban~~\n\n> From Associated Press: Same-sex couples in Texas begin obtaining marriage licenses from county clerks. Kentucky's governor  instructs county clerks to issues marriage licenses to same sex couples.\n\n> [Marriage windows at the Mobile [Alabama] Probate Office opened at 11 a.m Friday.](http:\/\/www.al.com\/news\/index.ssf\/2015\/06\/us_supreme_court_rulings_2015.html) For months, the windows were closed pending the Supreme Court decision. Julie Fey, 52, and Dottie Pippin, 60, were married at 11 a.m. at the Mobile Probate Office.\n\n> Pike County Judge Wes Allen says he is getting out of the marriage business:\n\n> The word 'may' provides probate judges with the option of whether or not to engage in the practice of issuing marriage licenses and I have chosen not to perform that function. My office discontinued issuing marriage licenses in February and I have no plans to put Pike County back into the marriage business. The policy of my office regarding marriage is no different today than it was yesterday.\"\n\n~~Arkansas's gay marriage ban~~\n\n[Carroll County and Washington County clerks say their offices will immediately issue marriage licenses to same-sex couples following a landmark ruling by the U.S. Supreme Court.](http:\/\/www.4029tv.com\/news\/the-latest-arkansas-counties-begin-to-issue-samesex-marriage-licenses\/33790702)\n\n~~Ohio's gay marriage ban~~\n\nMagistrate Fred Meister, who hugged the couple and read over the opinion with them, said he never liked the job of turning away Beall, Ross and other same-sex couples who wanted to wed.\n\n[\"They used to come on Valentine's Day, and I came up and talked to them and said, 'I can't give you a license, because the law won't allow it.' But you're nice people, and I love you.'''](http:\/\/www.dispatch.com\/content\/stories\/local\/2015\/06\/26\/local-couples-apply-for-marriage-licenses.html)\n\n~~Michigan's gay marriage ban~~\n\n[Midland County Clerk Ann Manary already had performed the marriage of a same-sex couple by noon, two hours after a 5-4 decision was handed down by the Supreme Court to make gay marriage legal in all 50 states.](http:\/\/www.mlive.com\/news\/saginaw\/index.ssf\/2015\/06\/midland_clerk_performs_first_s.html)\n\n~~Georgia's gay marriage ban~~\n\n[The Probate Court of Fulton County began issuing marriage licenses to same-sex couples immediately upon the justices' 5-4 ruling.](http:\/\/www.bizjournals.com\/atlanta\/blog\/capitol_vision\/2015\/06\/fulton-county-issuing-same-sex-marriage-licenses.html)\n\n~~Nebraska's gay marriage ban~~\n\n[Some Nebraska counties have begun issuing marriage licenses to same-sex couples following the U.S. Supreme Court ruling. For couples wishing to be married on the date of the historic ruling, a mass wedding ceremony has been set for 1 p.m. Friday at the Assembly Hall of the Fulton County Government Center, 141 Pryor St. SW.](http:\/\/www.bizjournals.com\/atlanta\/blog\/capitol_vision\/2015\/06\/fulton-county-issuing-same-sex-marriage-licenses.html)\n\n----\n\nEdit Three days later, ~~Louisiana's gay marriage ban~~\n\n[Jefferson Parish became the first parish in Louisiana to issue same-sex marriage licenses, granting one to a female couple shortly before 11 a.m.](http:\/\/www.wwltv.com\/story\/news\/local\/jefferson\/2015\/06\/29\/jefferson-parish-gay\/29463189\/?c=n)","15":"My mom is pretty conservative and just asked if this was good or bad news.\n\nOf course it's good news, mom. Other people are happy and it doesn't affect or hurt you in anyway. Literally free happiness.","17":"Shit.  First people start taking down the Confederate flag, then they uphold the Affordable Care Act, and now this.  Now I'm going to have to endure the most insane bitching and moaning from my crazy bigoted family when I go home for 4th of July.  Couldn't this have waited a few weeks?\n\nThanks Obama!","19":"Dogs and cats living together! \n\nPandemonium!","21":"I'm going to stay away from Facebook today.... \n\nEdit: imma answer some questions because of all these comments I'm gettin here. \n\n1. No I'm not a bigot just because I have some ignorant friends and older family friends. \n\n2. My time line has been very positive! Although, there are some young kids preaching how this law is illegal, anti God, etc. \n\n3. This post was meant to be kinda of a joke anyways. Yes, there will be some ignorant folks on my Facebook time line, but the majority have been praising this decision ","22":"Let's see... My son was born, Fallout 4 announced and releasing, gay marriage legalized.... 2015 will go down as the best year ever.","24":"Sounds like it's time to finally drop the \"T\" from cantaloupe.","25":"Full opinion:\n\nhttp:\/\/www.supremecourt.gov\/opinions\/14pdf\/14-556_3204.pdf\n\n**Highlights from the Majority**\n\n> * The nature of injustice is that we may not always see it in our own times.  The generations that wrote and ratified the Bill of Rights and the Fourteenth Amendment did not presume to know the extent of freedom in all of its dimensions, and so they entrusted to future generations a charter protecting the right of all persons to enjoy liberty as we learn its meaning.  When new insight reveals discord between the Constitution's central protections and a received legal stricture, a claim to liberty must be addressed\n\n> * Many who deem same-sex marriage to be wrong reach that conclusion based on decent and honorable religious or philosophical premises, and neither they nor their beliefs are disparaged here. But when that sincere, personal opposition becomes enacted law and public policy, the necessary consequence is to put the imprimatur of the State itself on an exclusion that soon demeans or stigmatizes those whose own liberty is then denied. \n\n> * No union is more profound than marriage, for it embodies the highest ideals of love, fidelity, devotion, sacrifice, and family. In forming a marital union, two people become something greater than once they were. As some of the petitioners in these cases demonstrate, marriage embodies a love that may endure even past death. It would misunderstand these men and women to say they disrespect the idea of marriage. Their plea is that they do respect it, respect it so deeply that they seek to find its fulfillment for themselves. Their hope is not to be condemned to live in loneliness, excluded from one of civilization's oldest institutions. They ask for equal dignity in the eyes of the law. The Constitution grants them that right.\n\n**Highlights from the Roberts Dissent**\n\n> * When decisions are reached through democratic means, some people will inevitably be disappointed with the results. But those whose views do not prevail at least know that they have had their say, and accordingly are--in the tradition of our political culture--reconciled to the result of a fair and honest debate. ... But today the Court puts a stop to all that. By deciding this question under the Constitution, the Court removes it from the realm of democratic decision. There will be consequences to shutting down the political process on an issue of such profound public significance. Closing debate tends to close minds. People denied a voice are less likely to accept the ruling of a court on an issue that does not seem to be the sort of thing courts usually decide.\n\n> * If you are among the many Americans--of whatever sexual orientation--who favor expanding same-sex marriage, by all means celebrate today's decision. Celebrate the achievement of a desired goal. Celebrate the opportunity for a new expression of commitment to a partner. Celebrate the availability of new benefits. But do not celebrate the Constitution. It had nothing to do with it.\n\n**Highlights from the Scalia Dissent**\n\n> * This is a naked judicial claim to legislative--indeed, super-legislative--power; a claim fundamentally at odds with our system of government.\n\n> * But what really astounds is the hubris reflected in today's judicial Putsch.\n\n> * If, even as the price to be paid for a fifth vote, I ever joined an opinion for the Court that began: \"The Constitution promises liberty to all within its reach, a liberty that includes certain specific rights that allow persons, within a lawful realm, to define and express their identity,\" I would hide my head in a bag. The Supreme Court of the United States has descended from the disciplined legal reasoning of John Marshall and Joseph Story to the mystical aphorisms of the fortune cookie.\n\n**Highlights from the Alito Dissent**\n\n> * By imposing its own views on the entire country, the majority facilitates the marginalization of the many Americans who have traditional ideas. Recalling the harsh treatment of gays and lesbians in the past, some may think that turn-about is fair play. But if that sentiment prevails, the Nation will experience bitter and lasting wounds.\n\n**Highlights from the Thomas Dissent**\n\n> * (LOL, not worth including)","27":"My parents emigrated to this country to give us a better life. They sacrificed so much in order to escape my corrupt country and join in the march towards the American Dream. In my 29 years of being here, I've accomplished so much and been in total debt to this wonderful country. America, you've made me once again very proud to be in your country. I won't take it for granted. Promise. ","29":"I got embroiled in this fight 11 years ago. It has cost me, dearly. I lost my faith, the love of my family, the companionship of the friends I had previously respected, and at least one job. \n\nIt is so good to hear this news. I'm going to remember this day forever. For all those who did not stand idle, who fought for this: We did it. We really did it. It truly would not have happened without us.","31":"case dismissed. bring in the dancin' lobsters. \nabout damn time.","33":"I'm irrationally happy about this as a straight man. ","35":"As a heterosexual man I am appalled. This ruling affects my life fundamentally.  Oh wait, it doesn't at all.\n\nCongrats to all those who have waited decades for this ruling.  It's about damn time.","37":">Roberts from bench: \"Today 5 lawyers have ordered every state to change their definition of marriage. Just who do we think we are?\"\n\nYou're the supreme court, it's literally what you do.....\n\n","39":"Come mothers and fathers\n\nThroughout the land\n\nAnd don't criticize\n\nWhat you can't understand\n\nYour sons and your daughters\n\nAre beyond your command\n\nYour old road is\n\nRapidly agin'\n\nPlease get out of the new one\n\nIf you can't lend your hand\n\nFor the times they are a-changin'.\n\n-- Bob Dylan","41":"They didn't legalize it. They found that the Fourteenth Amendment didn't allow same-sex marriage bans or bans on their recognition.\n\nIt's a beautiful day.","43":"Random question: Can we set up a subreddit to collect responses from the conservative rants on this? I feel like it would be a popcorn-worthy event. \n\nMaybe something like r\/muhmarriage","44":"So... Gay marriage legalized, Obamacare taken care of... What is the republican platform going to be for the next election? ","46":"This is a huge thing to happen on my birthday","47":"Great!\n\nNow, can we *finally* stop calling it same-sex marriage?\n\nIt's just marriage now. No distinction is to be had. It's just marriage. Please, do everyone affected by this (that is, all couples who can now legally marry) a **huge** favor and make a conscious effort to not use the term 'same-sex marriage'.","49":"Westboro Baptist Church must be losing it's shit right now.\nEDIT: Apparently they are happy about it.\n\nhttps:\/\/twitter.com\/WBCSaysRepent\/status\/614442362408947712","50":"I'm a straight male who is having a wedding with a straight woman in October.   I've also watched the first 5 episodes of Daredevil, so I've seen a lot of lawyer stuff in my time, and have a deep understanding of the nuances of the law. \n\nBasically, this means that my wedding now has to be a gay wedding.   That's going to be a logistical nightmare. ","52":"I'm crying at work right now. I can't process this right now. \n\nI was at the printer when my phone went off with the news. \n\nIt looks like I'm crying over fucking color copies. \n\nFuck, I need to go sit down. My cousin can finally get real-married. She can get health insurance now. Holy shit. This is such a great day\n\n----\n\n\nEdit:  I posted support on Facebook and my old conservative grandpa commented that he was so happy to attend my cousins marriage. He used to be so homophobic that my cousin wasnt allowed to holiday dinner. over the years, he got better about it, but now has publically accepted it!\n\nThis is a great day for my family!","54":"Kennedy wrote majority opinion. Four dissents, one by each justice, whose tears I will happily drink.\n\nEdit: 64 pages of dissents. While Roberts was somewhat gracious, and congratulated gay couples on their new right (while rejecting the idea that it comes form the Constitution), [Scalia is straight out tantruming](http:\/\/www.huffingtonpost.com\/2015\/06\/26\/antonin-scalia-dissent_n_7671110.html).","56":"Showed my dad this and he said \"great, everyone deserves to be miserable.\"","58":"Only someone miserable with their own shitty life would try and deny 2 other people from getting married","60":"[Comments on Fox News](http:\/\/www.foxnews.com\/politics\/2015\/06\/26\/supreme-court-same-sex-couples-can-marry-in-all-50-states\/) are gold.","61":"I had an appointment at 10am this morning, and emerged from it to find a country forever changed for the better.  I'm a straight man, and have never felt romantic love for another.  But I have known gay men and women who wanted nothing more than to be able to express and celebrate such love in whatever matter they chose.  And they weren't all able to.  Until now.  I am a straight man and can't wipe the smile off my face, or make the tears stop just yet.  I don't want to.  Congratulations to all the people who have waited too long for this day to come.","63":"[Full text of the decision and four separate dissents.](http:\/\/www.supremecourt.gov\/opinions\/14pdf\/14-556_3204.pdf) ","64":"This post is well on track to become the top post in \/r\/all. And holy shit, it's going to look amazing.\n\nCongratulations, America.","66":"The Supreme Court must feel like Oprah right about now: \"You get to have your marriage recognized by the law, you get to have your marriage recognized by the law...everybody gets the right to have their marriage recognized by the LAWWW!!!\"","68":"Law triumphs over religion. A great right has occured this day.","70":"I'd like to give a shout out to the Westboro Baptist Church today. I don't believe today would've been possible if they hadn't shown the country exactly how ugly homophobic hatred can be. ","71":"First upholding the Affordable Care Act and now this? They are crushing it lately.","73":"San Francisco will have an insane Friday night","74":"This a major step in our society. I'm glad that this is finally legal, as it should have been a long time ago. \n ","75":"Yup, there had been cases in the past about marriage and infertility. ","77":"You gotta wait until the trashiest gays get married and then build up enough acrimonious bullshit to get divorced (EDIT: on national daytime television).\n\nI give it six  months.","79":"https:\/\/www.youtube.com\/watch?v=Jitocz4kB3k","81":"You played the long con and lost. \n\nSafe travels comrade, and may your password be for ever secure.","83":"Please go backpacking here when marijuana is up for legalization","84":"Man, I live in San Francisco so I get no drama at all. Just happiness and celebration. What a bummer. ","85":"Fox News comment section has never been better than this week. It's like watching an ugly drunk throw up on themselves over and over and over.","87":"I'm gonna take a shot every time I read  \"Wake Up People!\".\r\rGet the stomach pumps ready...","89":"this would be me. lol\n\nI'd go down to the courthouse tomorrow, but he has dreams of a huge wedding on the beach with like 1000 guests and a weekend-long extravaganza and like, I don't want to pay for that shit. it's an absurd expense.","91":"I know.  It's a shame.  I really loved my wife.  I loved her more than life itself.  But this morning when I woke up that love was just gone.  Then I read this and I realized what happened.  I'm going to miss her so much.  I hope my new husband can cook half as well as she does.","92":"[Context](http:\/\/www.telegraph.co.uk\/news\/worldnews\/australiaandthepacific\/australia\/11680168\/Australian-couple-declare-divorce-if-gay-marriage-legalised.html)","94":"From: \/u\/sexysexytimes99\n\nTo: Bristol Palin\n\nRe: kt","96":"the night is dark and full of terrors ","98":"Gay marriage made him a flamer?","100":"The whole \"he'll set himself on fire\" hooplah was a ridiculous misinterpretation of what he actually said. He said he was willing to burn, in a list of ways he'd be willing to be persecuted. He was still painfully silly - implying he'd be burned at the stake for opposing same sex marriage - but it was ridiculous how people took his words and decided he meant he'd self immolate.","102":"he was waiting for this moment for years to comment this","104":"Who wrote the opinion?","106":"Wow, \"Their hope is not to be condemned to live in loneliness\" there is so much humanity in this ruling. ","108":"From the first of four dissents, this one by Roberts:\n>Although the policy arguments for extending marriage\nto same-sex couples may be compelling, the legal arguments\nfor requiring such an extension are not. The fundamental\nright to marry does not include a right to make\na State change its definition of marriage. And a State's\ndecision to maintain the meaning of marriage that has\npersisted in every culture throughout human history can\nhardly be called irrational. In short, our Constitution does\nnot enact any one theory of marriage. The people of a\nState are free to expand marriage to include same-sex\ncouples, or to retain the historic definition.\n\n> Today, however, the Court takes the extraordinary step\nof ordering every State to license and recognize same-sex\nmarriage. Many people will rejoice at this decision, and I\nbegrudge none their celebration. But for those who believe\nin a government of laws, not of men, the majority's approach\nis deeply disheartening. Supporters of same-sex\nmarriage have achieved considerable success persuading\ntheir fellow citizens--through the democratic process--to\nadopt their view. That ends today. Five lawyers have\nclosed the debate and enacted their own vision of marriage\nas a matter of constitutional law. Stealing this issue from\nthe people will for many cast a cloud over same-sex marriage,\nmaking a dramatic social change that much more\ndifficult to accept. \n\nPrediction: Downvoted into oblivion, by a 5-4 margin. \n\nEDIT: Added clarifying information to first line. ","110":"That's going to be iconic","112":"https:\/\/youtu.be\/s7YW045deBY","114":"Stone the gays! ^^:please ^^don't ^^let ^^this ^^get ^^taken ^^out ^^of ^^context:","115":"That's really all we wanted all along, to be better than Australia.","117":"We achieved that by electing Abbott.","119":"Mate, we've been running full pelt in the opposite direction for over a year now. Well done America, I'm proud.","121":"Free happiness? Good, now I can settle more cities!  \n  \nShout out to \/r\/civ","123":"And on the third day, God created the Remington bolt-action rifle, so that Man could fight the dinosaurs. And the homosexuals.","125":"This was my first thought, too. I might have to be \"working\" every holiday until July 4th 2016. Thanksgiving is going to be nothing but [this](http:\/\/media2.giphy.com\/media\/a3YeYzPL2SsEg\/giphy.gif)","127":"Don't forget any benefits you get from work may apply to your spouse now! Go talk to HR, you have the supreme court backing you .","129":"Mass hysteria!","131":"I used to live in a city that was mostly conservative before I moved to a liberal campus (and then liberal city for my job). By now, most of my conservative \"friends\" have defriended me for being too pro-LGBT. \n\nWELL FUCK THEM. TODAY IS A GOOD DAY. MY ENTIRE FACEBOOK WALL IS RAINBOWS AND I FUCKING LOVE IT.","133":"I'm not sure why you have Fallout 4 as second place. Time to bring out my pitchfork.\n\n------E","135":"My straight marriage is still intact as well but... well it's just not the same somehow. Like it just got a little gayer maybe? Can't quite place it.\n\nEDIT Figured it out, guys. We were just out of milk. Boy was I off.","136":">Edit 2:  I heard a loud knock at the door so I grabbed my guns to protect my marriage. It was just the UPS guy. Will continue to monitor.\n\nYou didn't accept his package? It's the law now. Do it. ","138":"I'm a woman who is also straight-married to her husband and expecting our first in-wedlock sex-for-procreation-only child. I have felt no amorous stirring for my fellow females since the Supreme court has legalized same-sex marriage. However, my husband has not texted me from his work for three hours now and I despair that some beefcake has taken him from my loving, heterosexual arms. *weeps inconsolably*","140":"It's 1:07 here in Texas, and I'm still single. Why ain't I married yet!?!? For the love of god somebody love me!!!","142":"Might not have reached Kentucky yet, but I just saw a goat marry a mailbox.  Clearly, these are the End Times.","143":"Also in Kentucky. All horses are now gay married. Air feels fabulous. ","145":"Took me a moment haha ","147":"Some of Scalia's dissent is bizarre. This from page 8: \"(Huh?   How can a better informed understanding of how constitutional imperatives [whatever that means] define [whatever that means] an urgent liberty [never mind], give birth to a right?)\"\n\nDo judges normally write like that?","148":"What the fuck is Scalia talking about? Did he have a stroke while writing his dissent?","149":"Nononono! Don't let Thomas off that easily; his discussion of the semantics of dignity is mind-blowing. \n\n\"The corollary of that principle is that human dignity cannot be taken away by the government. Slaves did not lose their dignity (any more than they lost their humanity) because the government allowed them to be enslaved. Those held in internment camps did not lose their dignity because the government confined them. And those denied governmental benefits certainly do not lose their dignity because the government denies them those benefits. The government cannot bestow dignity, and it cannot take it away.\"","151":"We are not done. In many states it is legal to fire someone based on their sexuality. The fight for gay rights did not begin with the debate over same sex marriage and it will not end with same sex marriage either.","152":"I also live in Texas, and my parents can finally be married now!!! It's a happy day for the southern LGBT world!","154":"Congratz from a fellow Texan!","155":"Well my situation is almost completely opposite. I woke up this morning to all of this and when I told my mom she turned around with the biggest look of disgust I've seen and said \"Did they really\". Not in a good way either. Then my dad spouted off something that made no sense that their must be more gays than straight people. Made me remember why I want to move out so bad and will be soon. Also I'm straight but still I can't fucking stand blind hatred of things that have no real reason to be disliked. \n\nAlso the end times are almost here according to my mother. -_-","157":"I'm completely rationally happy about this as a *human being*.","159":"Nothing irrational about wanting everyone to be treated equally.","161":"I am also heterosexual and outraged. How am I supposed to explain to my child that two people of the same gender love each other and that's okay?\n\nWait, I just answered my own question...","163":"No kidding.  San Francisco is gonna be a madhouse this weekend.  ","165":"Or, if you live in a state like mine, an exciting drag into the current century.\n\nEdit- Mississippi, for everyone asking ","167":"This has been an amazing week for SCOTUS and the nation.","169":"It is defacto legalized. ","171":"Isn't that effectively the same thing? If you can't ban it then you're legalizing it, right?","173":"This is actually good for the GOP, in a sense, because they no longer have the gay marriage issue hanging over their heads. The SCOTUS took care of that. So one of their contentious issues is no longer a problem. ","175":"I can see this being read at a lot of ceremonies in the next few months ","176":"Jeez fine. Picky picky. I'll go hop in my same-sex Jeep, head over to lesbian breakfast and celebrate my \"marriage\". ","178":"Rumor has it they may be planing a protest....","180":"Color copies can be quite emotional, bro.  I understand.","182":"Personally, I can't believe this passed with a narrower margin than the Obamacare ruling yesterday.\n\nI knew it would pass, but who would have thought Obamacare would have a bigger margin?","184":"Scalia (from that article): \"I join THE CHIEF JUSTICE's opinion in full. I write separately to call attention to this Court's threat to American democracy. The substance of today's decree is not of immense personal importance to me. It is of overwhelming importance, however, who it is that rules me. Today's decree says that my Ruler, and the Ruler of 320 million Americans coast-to-coast, is a majority of the nine lawyers on the Supreme Court.\"\n\nEdit (to the guy below): I quoted this section because I thought it was ridiculously over the top.","186":"Can I come? More importantly, will there be an open bar?","188":"Didn't someone say they'd set themselves on fire if this happened?\n\nI'm waiting.","190":"\"You can now marry your 20 wives AND your goat!\" is what one of those comments said. This is the hardest I've laughed in years I think.","191":"> YOU HAVE BEEN TOUCHED BY THE GAY GENIE! SEND THIS TO FIVE PEOPLE OR YOU WILL TURN GAY.\n\nMy fucking sides. While this is truly a happy day, I do enjoy myself some drama. I'm just waiting for some politicians to say something they can't take back.\n\nAlright this is too entertaining. But the website is so slow\n\n> One unintended consequence is that legalized gay marriage does lead to legalized gay divorce. \n\n\n> So when are they going to start making the little plastic figures of a sheep and a guy for wedding cakes? That's gotta be the next step in the Progressive Revolution\n\n\n>  Thanks George Bush.\n\n> allahu akbar\n\n\n>  Jesus will abandon America because of obamacare and the gays!!!\n\n> Im glad liberal \"humans\" think they can affect and regulate love, the climate, the air quality, etc.\n\n\n> God made Adam and Eve - He did not make Adam and Steve. \n\n\n> FLASH FLOOD WARNING....From all the GOP tears\n\n\n> SCOTUS ruling is irrelevant, as it has no constitutional authority to issue it.\n\n\n>  Now Donald Trump can marry his scalp!\n\n\n> When I clicked the link to read the ruling I got 504 \"Bad Gateway\" No truer words have I ever gotten on a computer\n\n> I'm already married to my cell phone...\n\n> How did the children of Adam and Eve procreate? Did they copulate with their own siblings or with their dad?\n\n> The next thing that's gonna happen is women folks and blackies votin'\n\n>  Does this mean that the Obama's are now legally married?\n\n> As a scientific matter, this should lead to a significant decline in gay people over time\n\n> Let the civil war begin...\n\n> Monsanto GMO foods are working turning people into living freaks\n\n> Obama is the gayest president ever\n\n> Christianity has been outlawed.\n\n> Great decision. Someone can now marry their cat, dog, 2 men, 1 woman, a cow and a bird if they want too because you love them. Justice Kennedy said you could.\n\n> Gay people need no longer be prisoners of religious dogma. \n- I can now marry my dog, ma. \n\n\n\n\n","193":"So much hatred, you could bottle it.","195":"Utah has had legalized gay marriage for some time(their circuit court ruled in favor of gay marriage and the supreme court denied appeal)","197":"that's...that's kinda sweet.\n\n\n\nhugs & kisses,\n\nbig fat gay man","199":"An honest question: Why are you homophobic? I ask because it's difficult for me to understand *why* someone would feel this way, despite understanding it may be a negative thing to think\/feel.","201":"I think it was specifically marriage and *contraception*, not sure about *infertility*.\n\nSame reasoning applies, regardless.","203":"we gonna rent the moon and fill it with rosssesesesesesesess!","205":"Well Matt Bomer (Neal Caffrey) is both gay and has been married to his partner for a few years now. Makes sense that the show would approach those topics","207":"Just like mine. \n\nEDIT: Username no longer accurate","209":"I'll invite you to get high and then my gay wedding of this happens.","211":"Or backpack back into time before Citizens United.","213":"Living in Louisville is interesting, it's a northern-ish city in a mostly southern state. So I get a get a pretty good mix of people freaking out on both ends of the spectrum whenever something like this happens.","215":"Yeah my facebook is afire with pissed off \"Southern Christians\".  Ah, the joys of living and growing up in the South, watching as they fuss and rage at being dragged kicking and screaming into the 21st century.  Especially since most have managed to resist being dragged into the 20th century....","217":"Compromise with a destination wedding. Only those who can afford the trip will show up and it will limit the guest list. You won't have to take an extra flight for a honeymoon, you'll already be at your destination!","219":"You should expand your horizons. Doesn't have to be a husband. You could marry a dog. I've been told that would be the inevitable outcome of this anyway.","221":"Cupcakes? I'll attend. ","223":"Explain this joke for an Englishman whose only has the vaguest concept of who or what a Bristol Palin is? ","225":"but he is warm for the rest of his life","227":"I'm burning with anticipation.","229":"If I hear that song one more god damned time!","231":"And it is *so* ordered. ","233":"Scalia. \n\nNope. Couldn't keep a straight face.","235":"It's almost as good as \"So let it be written, so let it be done!\"\n\nEdit: Haha wow. Did not know about the song.","236":"I think \"so\" should have been in italics, to stand with the gay community.","238":"I love the finality.  It's not often in modern times that you see such a righteous, absolute decree.","239":"[Hue-manatee](https:\/\/33.media.tumblr.com\/aa69209aab5938b4a323324fdd7a0a1e\/tumblr_n81hgqZA651sdq8fbo1_500.gif)\n\nHas there ever been a better time for this?","241":"Equality for stoners and non stoners alike. ","242":"I can't wait till im legally smoking pot at my buddies gay wedding. That's some true freedom right there. ","244":"Roberts' dissent is rational, and the argument that letting public opinion and state legislatures gradually accept the inevitable path of history could be more effective in swaying on-the-fence holdouts makes sense as far as it goes.\n\nBut he doesn't make a compelling argument for why the Equal Protection Clause of the 14th Amendment would apply to all areas of the law save one. And the very same argument was made by \"reasonable\" opponents of the civil rights movement of the 50s and 60s, who said pretty much exactly the same thing -- \"Yeah, we believe in equality, but we don't want to upset the people who don't.\"\n\nRoberts is articulate, calm, and compassionate. But he's also wrong.","246":"It's crazy that so many ordinary people were denied such a fundamental right for so long. What a great victory for human rights as a whole, and a step in the right decision for the US.","248":">Stone the gays! please\n\n- \/u\/Delphizer, June 2015","250":"Always living in Australia's shadow... well look who's laughing now roo-fuckers!","251":"So they couldn't talk about how backward we are anymore","253":"I believe \"Rekt\" is the only appropriate response here.","255":"Good god this sums up dinner with the grandmother perfectly","257":"Real wrath of god type stuff!","259":"I have a cuckoo uncle who, during one Christmas dinner, warned me and my cousins that if we weren't wary and careful, when gay marriage passed, we would all be forced to have a \"homosexual experience\". One of my cousins laughed, thinking it was a joke. He hasn't talked to her since. The funny thing is, the son of that uncle insists that he's closeted. ","261":"RIP Kentucky couple","263":"Around back","265":"Scalia does. It's part of his character. He's the guy that knows he has peaked in life, and can't get fired, so many judges in his position stop caring about being highly formal and professional. Scalia especially, since he likes to mess around in his dissents. ","267":"A judicial tantrum, really.","269":"He basically hates whenever the Supreme Court affirms anything that wasn't explicitly, unambiguously drafted into law already. Hates any kind of interpretation or stretch or assumption going into a ruling. So he hates this, because he doesn't think it's explicitly in the constitution and thus should go through the standard legislative process.\n\nHe's also mocking the language of the decision as being trite and fluffy rather than grounded on what he considers hard legal basis in the last bullet.","271":"I don't know any of you people but I'm so happy for you!!","272":"In just over a week my SO and I will be signing papers to place our daughter with an amazing same sex couple here in Texas. This truly is an amazing ruling and I couldn't be happier. Also congrats to your parents!","274":"Wow...That's insane. My mother taught me to live and let live. It's been a wonderful life guiding philosophy for me. ","276":"So it's a win-win for both of us?\n","278":"Now they can trick gay marry you. Run!","279":"Ha! Good point.  ","281":"Bu...bu...but .... TRADITION!","283":"The same argument was used here in Iowa - the judges were \"legislating from the bench\"\n\nProblem being they didn't make any new laws, and if they *can't* do it we may as well not have judges period since they'd become entirely useless as this is effectively their entire job. The only difference is some people don't like it this time.","285":"Or if have grandparents like mine, a good step towards modern thinking","287":"He never said he would kill himself, his comment was taken out of context by the media.\n\n[His quote was ](http:\/\/www.independent.co.uk\/news\/world\/americas\/texas-pastor-rick-scarborough-is-willing-to-be-burned-to-death-to-oppose-gay-marriage-10333602.html)\"We are not going to bow, we are not going to bend, and if necessary we will burn.\"\n\nIt's clearly metaphorical, not a literally \"I'm going to immolate myself\".","289":"Depending on the gender of the married couple, tradition is either an assortment of preserved cased meats or a spread of clams. ","290":"Or de jure legalized 147 years ago?","292":"Yes, but it's even stronger than that.  If congress had simply passed a law legalizing same-sex marriage, a later session could repeal it.\n\nInstead, the Supreme Court has decided that no law can ban same-sex marriage, this making it safe from future legislation.\n\nSame-sex couples should now be able to breathe a sigh of relief, as it is just a matter of time until individual state bans are challenged and wiped from the books.","294":"It's a distinction without a difference. ","296":"There's that whole \"religious freedom\" thing now. That's going to be the hot button topic. Can we keep the gays out of our stores?","297":"[The Onion: After Obama Victory, Shrieking White-Hot Sphere Of Pure Rage Early GOP Front-Runner For 2016](https:\/\/www.youtube.com\/watch?v=jjonGtrCyVE)","299":"So would you say you're eating out for this breakfast?","301":"I should start printing rainbows","303":"Anyone who paid attention to the Obamacare case knows that it was not long for the court anyways. It was a semantics argument on word usage in a very esoteric part of the bill. It was not the fundamental healthcare knock-down drag-out fight the media made it out to be. ","305":"History will not be kind to Scalia. He truly is a political hack in a black robe. ","307":"That was just a sensationalized headline.","309":"I'll take the hug.","311":"To be fair, he's probably using \"homophobic\" in its true sense - an *irrational* fear of gay people.  It sounds like he knows it's irrational and still thinks of gay people as people who deserve equality, but he's irrationally afraid of them.\n\nI had an extreme phobia of needles (I would need to be held down for shots when I was young; I'm better now but still have a slight phobia of them, though I can at least get them without totally freaking out).  It makes no sense.  Needles don't hurt much and I know that, and they generally are used for beneficial reasons (not including illegal drugs).  That doesn't stop me from being irrationally afraid of them though.\n\nI'm assuming it's a similar thing with that guy; just a crazy, irrational fear that he knows makes no sense.","312":"Regardless, what this sentence gets at fundamentally is the quite silly 'biological objection,' which gets bandied about surprisingly often. As a biologist, I'm quite happy to see the SCOTUS coming down like a ton of bricks on crap pseudoscience.","314":"I thought he said he was going to fill it will [rose](https:\/\/en.wikipedia.org\/wiki\/Ros%C3%A9).","316":"Username checks out.","318":"\"Backpack to the Future\"","320":"Yeah! No more wage gap dragging your combined income down!","322":"I'll eat gay cupcakes any day. ","324":"Bristol Palin (daughter of a conservative former governor turned talking head) has been pregnant twice (while preaching abstinence only) while never being married. She was supposed to get married a few months ago but they broke it off days before the wedding and then she announced she's pregnant again (though she did not say if the ex-fiance is the baby daddy).","326":"\"Build a man a fire, and he'll be warm for a day. Set a man on fire, and he'll be warm for the rest of his life.\" - Terry Pratchett, Jingo, RIP","328":"Come on now, let's not add any more fuel to the fire","330":"What are you waiting for?","332":"Like, *so* ordered.","333":"It is known. ","335":"Kennedy has written each of the Court's gay rights decisions (*Romer*, *Lawrence*, *Windsor*, and now *Obergefell*).","337":"I thought it was 'So it shall be written. So it shall be done.' You're talking Yul Brynner from the Ten Commandments, right?","339":"Hah. I'm gay and that's hilarious. ","340":"-Did you order the pizza yet?\n\n-It is so ordered.","342":"Just wait for Scalia's. I'm sure that will be entertaining.\n\nEdit: Scalia bitches about hubris and the court being egotistical. The irony. ","343":"Exactly, if you read the opinion and substitute \"same-sex marriage\" for \"interracial marriage\" I don't think as many people would consider it as reasonable as a lot of people is giving him credit for.","344":"Yup. You can't say that the *Loving v. Virginia* ruling was the right one but that this is the wrong one. It's the same idea. Unless he's saying that ruling was also no bueno.","346":"Tonight I will put *two* shrimp on the barbie. ","348":"That hole in the ozone just got a lot bigger. ","350":"Is this true?","351":"Fuck you, you cani-deiphobe. If my little guy is in love with Artemis, who the fuck are you to tell him it's wrong?","353":"It's not that it's funny, it actually makes a lot of sense when you think about it. These people who are very vocally anti-gay talk like it's just one slip up and everyone will be forced to be gay. They talk like this because they have deep feelings of attraction to the same sex, but have been told it is wrong for their whole life. So they need to be on guard to protect themselves from this gay feeling which is what they think the gays want to exploit. Since they are themselves gay or bisexual they don't understand that straight people don't actually feel sexual attraction to the same sex.\n\nSo all this guilt and confusing feelings that they don't understand are not present in most people leads to this.","355":"RIP Kentouple","357":"He also (page 6) holds that a Californian is not a Westerner (as in the west of the USA, not 'the West').\n\nHe further says the opinion of the majority \"is couched in a style that is as pretentious as its content is egotistic\" (page 7) and that it is full of \"mummeries and straining-to-be-memorable passages\" (page 4). Not especially classy.","359":"Now kiss?","361":"When I had this same discussion with my 7 year old step son, he said he was probably going to marry a boy because \"they're more fun.\" I said, \"whatever floats your boat, son. Just remember to marry someone you like.\"","362":"Homophobe. Mary needs some lovin' too you know.","364":"...are good foundations, but could always use improvement and re-examination from time to time.","366":"Spoiler alert: he's not.","368":"The spread clam is after the reception. ","370":"We have to wait 100 years before it's de jure legalized. For now it's de facto legalized.","372":"The majority opinion actually said that they *don't* have to wait for legislation and lower courts to align that it should be immediately made legal everywhere because fundamental rights don't have to wait for judicial alignment.","374":"The GOP's biggest issue is that they have to win a Primary full of people who are against these types of things. Case and Point: Mitt Romney, the Governor, and Mitt Romney, the Presidential Candidate. ","376":"Oh my fucking god, this is so amazing.\n","378":"I'm crying","380":"\"It really speaks to me, usually through my television and my nightmares.\"","382":"I think so, Brain, but how are we going to afford a bigger military AND promise to reduce taxes without negatively effecting the citizenry?","384":"It is so ordered.","386":"The liberal technocrat consensus was actually to be very worried. A case came out earlier in the month dealing with ambiguity and even Kagan leaned on the literal interpretation. In this particular case, the literal interpretation was just too stupid for Roberts and Kennedy to believe it was intended.","388":"Heres a thing for you to think about, as a gay man, straight sex freaks me out and is actually disgusting to me to even think about.  I dont think youre homophobic, just your sexuality finds specific things attractive and other things not (its supposed to do that). ","390":"It's like Back to the Future, but with a gay romance subplot.","392":"Well, there's always a GAP to fulfill","393":"Rainbow sprinkles are so much better than chocolate anyway","395":"It's the same entity. Lord of Light = Red God = R'hllor. R'hllor is the actual name of the god.","397":"Thank you for writing this.  This actually is really helpful in understanding the ruling.  They didn't strike down same-sex marriage bans because they affected gay people, but because they affected marriage.","399":":') thank you","401":"Immediately made me think of [this guy](https:\/\/youtu.be\/mYkB5f1X-yM?t=22)\n\nedit: [link](https:\/\/twitter.com\/louisvirtel) to his twitter which I encourage you to follow, very funny dude.","403":"He makes a joke [about hippies](https:\/\/twitter.com\/AdamSerwer\/status\/614441956127690752).","404":"Jiggery pokery all day long.","406":"Yes, this man has no penis.","408":"He might has well have gone full Peter Griffin, \"Yes, I found the opinion of Justice Kennedy to be shallow and pedantic.\"","410":"I recently went to a stag weekend (US translation - bachelor party I guess? I'm British..) for a gay friend of mine who is getting married this summer. The amount of adult colleagues I have who joked about this and found this notion hard to comprehend really surprised me. They were all like, \"Oh, so which one is being the bride?\" and \"So does the other one have a hen do? (Bachelorette party?)\". \n\nHowever, when my ten year old son wanted an explanation of what a stag weekend was, he then asked if my friend's wife-to-be was going to have a party too. I said well, my friend is marrying another man and he is having his own party too. The boy didn't bat an eyelid and was just like \"cool\". Yay for the next generation!","412":"He's more of a hobophobe, given that he's A-OK with homosexuality as long as you are supporting yourself.","414":"Who, day and night, must scramble for a living,\nFeed a wife and children, say his daily prayers?","416":"Or if you are like me, young straight dude, then it is kind of a \"Oh, cool... glad we are doing that.  Alright where are the production reports?\"","418":"...or during. Nobody has a monopoly on tasteless drunkenness.","420":"Always felt GOP really effed over Romney, in reality he's much more moderate but they made him toe the party line.","422":"So grows the orb.","424":"Don't put it in your username","426":"That's racist. ","427":"They see me R'holling, they hatin","429":"dude is June 26th gonna be a holiday in the future?","431":"I'm surprised this hasn't been turned into a gfycat and spammed all over this thread by now\n\nEDIT:  nevermind, just did it myself: http:\/\/gfycat.com\/AptFlawedHornedtoad","432":"Of course he did. \n\nI read that three times and I really have no clue what point he's trying to make. ","434":"It's kind of sad when you think about it. :(","436":"Also 19 year old male who's kissless, where you want to meet bby? ;)","438":"And who has the right, as master of the house,\nTo have the final word at home?","439":"An abomination of Obama's nation ","441":"Well you see, the reports were supposed to be done. But QA hasn't signed off on them yet.","442":"Yea, I think we knew that already though.","444":"he was basically a democrat while governor of massachusetts","445":"The same thing happened to McCain in '08. He even tried to pick a more 'conservative' candidate with Palin...and well we saw how that turned out.","447":"Oh, roight, I forgot!  NARF!","449":"White sprinkles and ONLY white sprinkles. ","451":"You left out the crucial pose at the end :(","453":"Well, that's what I heard! ","455":"I think it's because it sounds Latiny. \n\nsource: I ain't a linguist.","457":"Or, if you're a young straight dude, but you've always been a little curious, then PM me maybe?","459":"Name me Keeper of the Swans and invite me to your party, then we'll see. ","461":"Or you could matrilineally marry him to your daughter, then kill him the moment she gets pregnant.","463":"If you'll rest at this smelly inn for a while, your opinion won't matter anymore.","465":"He also put into law what pretty much amounted to Universal Health Care there, a decade ago.\n\nhttps:\/\/en.wikipedia.org\/wiki\/Massachusetts_health_care_reform\n\nEdit: Also fun to note: Chief Justice Robert's decision cited Romney's law heavily, in explaining why he made his decision to uphold the federal subsidies for the ACA.  Romney saved the ACA! haha\n\nhttp:\/\/www.msnbc.com\/msnbc\/how-mitt-romney-saved-obamacare","467":"I would say to leave the password as trolling just to see how a public account would turn out...\n\nBut you already answered the question.  Someone would steal it.","469":"So fuck it,  Just make the entire month of June, LGBT Pride Month.","470":"Don't quote me on this Lenny, but I think this court decision is a sign from God.","472":"The gay folks!","474":"I don't have parties, I have Blots. You're welcome to come as long as you don't get sick all over the place or have sex on the dinner table.","476":"But but, it's ok because it was the *state * doing it and he only signed the bill. It's not like he wrote it or anything. \n\nParaphrased from my father. ","478":"oh... I see... Good... Good then.  Very good.  *walks out*","480":"Okay, so now that this is official, when can I watch Gay Divorce Court? ","481":"And gays across the country who have been relying on \"Hey, I'd love to get married, but it's not legal\" woke up to a *really* awkward conversation. ","483":"My first day in America backpacking and this happens! I don't wanna say it was ALL because of me but...\n\nEdit: I'm in LA (seeing California), spend all day seeing sights and I come back to this anarchy. Happy gay pride wedding day... thing. You're so welcome.","485":"I wonder how many gays ran to their partners like YEA WE CAN GET MARRIED NOW....\n\nand their partner is like..... FUCK","487":"That's it, my wife and I are getting a divorce.","488":"Opinion [here](http:\/\/www.supremecourt.gov\/opinions\/14pdf\/14-556_3204.pdf) (pdf).","490":"RIP pastor in texas who said he would light himself on fire when this day came..","492":"The final two paragraphs of the Court's opinion:\n\n> No union is more profound than marriage, for it embodies\nthe highest ideals of love, fidelity, devotion, sacrifice,\nand family. In forming a marital union, two people become\nsomething greater than once they were. As some of\nthe petitioners in these cases demonstrate, marriage\nembodies a love that may endure even past death. It\nwould misunderstand these men and women to say they\ndisrespect the idea of marriage. Their plea is that they do\nrespect it, respect it so deeply that they seek to find its\nfulfillment for themselves. Their hope is not to be condemned\nto live in loneliness, excluded from one of civilization's\noldest institutions. They ask for equal dignity in the\neyes of the law. The Constitution grants them that right.\nThe judgment of the Court of Appeals for the Sixth\nCircuit is reversed.\n\n> It is so ordered.\n\n----\n\nEdit: And the walls came tumbling down!\n\n~~Texas's gay marriage ban~~\n\n~~Kentucky's gay marriage ban~~\n\n~~Alabama's gay marriage ban~~\n\n> From Associated Press: Same-sex couples in Texas begin obtaining marriage licenses from county clerks. Kentucky's governor  instructs county clerks to issues marriage licenses to same sex couples.\n\n> [Marriage windows at the Mobile [Alabama] Probate Office opened at 11 a.m Friday.](http:\/\/www.al.com\/news\/index.ssf\/2015\/06\/us_supreme_court_rulings_2015.html) For months, the windows were closed pending the Supreme Court decision. Julie Fey, 52, and Dottie Pippin, 60, were married at 11 a.m. at the Mobile Probate Office.\n\n> Pike County Judge Wes Allen says he is getting out of the marriage business:\n\n> The word 'may' provides probate judges with the option of whether or not to engage in the practice of issuing marriage licenses and I have chosen not to perform that function. My office discontinued issuing marriage licenses in February and I have no plans to put Pike County back into the marriage business. The policy of my office regarding marriage is no different today than it was yesterday.\"\n\n~~Arkansas's gay marriage ban~~\n\n[Carroll County and Washington County clerks say their offices will immediately issue marriage licenses to same-sex couples following a landmark ruling by the U.S. Supreme Court.](http:\/\/www.4029tv.com\/news\/the-latest-arkansas-counties-begin-to-issue-samesex-marriage-licenses\/33790702)\n\n~~Ohio's gay marriage ban~~\n\nMagistrate Fred Meister, who hugged the couple and read over the opinion with them, said he never liked the job of turning away Beall, Ross and other same-sex couples who wanted to wed.\n\n[\"They used to come on Valentine's Day, and I came up and talked to them and said, 'I can't give you a license, because the law won't allow it.' But you're nice people, and I love you.'''](http:\/\/www.dispatch.com\/content\/stories\/local\/2015\/06\/26\/local-couples-apply-for-marriage-licenses.html)\n\n~~Michigan's gay marriage ban~~\n\n[Midland County Clerk Ann Manary already had performed the marriage of a same-sex couple by noon, two hours after a 5-4 decision was handed down by the Supreme Court to make gay marriage legal in all 50 states.](http:\/\/www.mlive.com\/news\/saginaw\/index.ssf\/2015\/06\/midland_clerk_performs_first_s.html)\n\n~~Georgia's gay marriage ban~~\n\n[The Probate Court of Fulton County began issuing marriage licenses to same-sex couples immediately upon the justices' 5-4 ruling.](http:\/\/www.bizjournals.com\/atlanta\/blog\/capitol_vision\/2015\/06\/fulton-county-issuing-same-sex-marriage-licenses.html)\n\n~~Nebraska's gay marriage ban~~\n\n[Some Nebraska counties have begun issuing marriage licenses to same-sex couples following the U.S. Supreme Court ruling. For couples wishing to be married on the date of the historic ruling, a mass wedding ceremony has been set for 1 p.m. Friday at the Assembly Hall of the Fulton County Government Center, 141 Pryor St. SW.](http:\/\/www.bizjournals.com\/atlanta\/blog\/capitol_vision\/2015\/06\/fulton-county-issuing-same-sex-marriage-licenses.html)\n\n----\n\nEdit Three days later, ~~Louisiana's gay marriage ban~~\n\n[Jefferson Parish became the first parish in Louisiana to issue same-sex marriage licenses, granting one to a female couple shortly before 11 a.m.](http:\/\/www.wwltv.com\/story\/news\/local\/jefferson\/2015\/06\/29\/jefferson-parish-gay\/29463189\/?c=n)","494":"My mom is pretty conservative and just asked if this was good or bad news.\n\nOf course it's good news, mom. Other people are happy and it doesn't affect or hurt you in anyway. Literally free happiness.","496":"Shit.  First people start taking down the Confederate flag, then they uphold the Affordable Care Act, and now this.  Now I'm going to have to endure the most insane bitching and moaning from my crazy bigoted family when I go home for 4th of July.  Couldn't this have waited a few weeks?\n\nThanks Obama!","497":"I just started crying at work. My wife and I had to go to California to get married, but in our state we had no protections as a married couple. That ends today and I couldn't be happier about it. Time to go get my name changed, suck it Texas.","499":"I am an ordained minister in central Kentucky, I will officiate your wedding at no cost, but you gotta give me some notice so I can press my clothes :)"},"category":{"0":"People & Society","2":"People & Society","3":"","5":"Online Communities","7":"Law & Government","8":"","10":"","11":"","13":"People & Society","15":"News","17":"","19":"","21":"","22":"","24":"","25":"Law & Government","27":"People & Society","29":"Arts & Entertainment","31":"","33":"","35":"People & Society","37":"Law & Government","39":"","41":"Law & Government","43":"Arts & Entertainment","44":"News","46":"","47":"","49":"People & Society","50":"Arts & Entertainment","52":"","54":"News","56":"","58":"","60":"","61":"","63":"","64":"","66":"People & Society","68":"","70":"","71":"","73":"","74":"","75":"","77":"Arts & Entertainment","79":"","81":"Arts & Entertainment","83":"","84":"Arts & Entertainment","85":"News","87":"Arts & Entertainment","89":"Arts & Entertainment","91":"","92":"","94":"","96":"","98":"","100":"Arts & Entertainment","102":"","104":"","106":"","108":"Law & Government","110":"","112":"","114":"","115":"","117":"","119":"","121":"","123":"","125":"","127":"","129":"","131":"News","133":"Games","135":"Online Communities","136":"","138":"","140":"Arts & Entertainment","142":"","143":"","145":"","147":"","148":"","149":"","151":"People & Society","152":"","154":"","155":"Arts & Entertainment","157":"","159":"","161":"Health","163":"","165":"Arts & Entertainment","167":"","169":"","171":"","173":"News","175":"","176":"","178":"","180":"","182":"","184":"Law & Government","186":"","188":"Arts & Entertainment","190":"Arts & Entertainment","191":"People & Society","193":"","195":"People & Society","197":"","199":"","201":"Health","203":"","205":"","207":"","209":"","211":"","213":"","215":"","217":"Hobbies & Leisure","219":"","221":"","223":"Arts & Entertainment","225":"","227":"","229":"","231":"","233":"","235":"Arts & Entertainment","236":"","238":"Arts & Entertainment","239":"","241":"","242":"Arts & Entertainment","244":"Law & Government","246":"People & Society","248":"","250":"","251":"","253":"","255":"","257":"","259":"Arts & Entertainment","261":"","263":"","265":"Law & Government","267":"","269":"Law & Government","271":"","272":"","274":"Arts & Entertainment","276":"","278":"","279":"","281":"","283":"","285":"","287":"","289":"","290":"","292":"","294":"","296":"","297":"","299":"","301":"","303":"","305":"","307":"","309":"","311":"","312":"","314":"","316":"","318":"","320":"","322":"","324":"","326":"","328":"","330":"","332":"","333":"","335":"","337":"","339":"","340":"","342":"","343":"","344":"","346":"","348":"","350":"","351":"","353":"","355":"","357":"","359":"","361":"","362":"","364":"","366":"","368":"","370":"","372":"","374":"","376":"","378":"","380":"","382":"","384":"","386":"","388":"","390":"","392":"","393":"","395":"","397":"","399":"","401":"","403":"","404":"","406":"","408":"","410":"","412":"","414":"","416":"","418":"","420":"","422":"","424":"","426":"","427":"","429":"","431":"","432":"","434":"","436":"","438":"","439":"","441":"","442":"","444":"","445":"","447":"","449":"","451":"","453":"","455":"","457":"","459":"","461":"","463":"","465":"","467":"","469":"","470":"","472":"","474":"","476":"","478":"","480":"","481":"","483":"","485":"","487":"","488":"","490":"","492":"","494":"","496":"","497":"","499":""}}