[
  {
    "id": "dfigxn8",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "If an idea is false, it deserves to be ridiculed.   And if it's true, no amount of ridicule will make it false.   Either way, blasphemy shouldn't be an offence.\n",
    "controversiality": 0,
    "ups": 54,
    "downs": 0,
    "score": 54,
    "created": 1490738821.0,
    "date_created": "2017-03-28",
    "time_created": "10:07:01",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi4bfe",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "All religions, being cults based on ancient ideas, should be examined, questioned and, if necessary, ridiculed for the mass hysteria that they are. ",
    "controversiality": 0,
    "ups": 572,
    "downs": 0,
    "score": 572,
    "created": 1490710065.0,
    "date_created": "2017-03-28",
    "time_created": "02:07:45",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi791d",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Religion is like a dildo: (1) only use it in private (2) don't show it to the kids (3) don't use it as a weapon (4) don't shove it down other people's throats ",
    "controversiality": 0,
    "ups": 106,
    "downs": 0,
    "score": 106,
    "created": 1490717912.0,
    "date_created": "2017-03-28",
    "time_created": "04:18:32",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi67a8",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You're free to criticize Islam, it's fucking stupid, like all religions, but it's no more special than any other excuse people have made to pretend their violence is just. But lots of people need it, like other religions, so I can't condemn those people. \n\nWhat is interesting though, is this attitude of, we can't do X, where X is something everyone does. We can't say Christmas anymore, we can't discuss immigrants anymore, we can't criticize Islam. Victim status is highly sought after. Why?",
    "controversiality": 0,
    "ups": 170,
    "downs": 0,
    "score": 170,
    "created": 1490714811.0,
    "date_created": "2017-03-28",
    "time_created": "03:26:51",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi58m2",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You are free to criticise Islam. If you weren't, half the posters on /r/ukpolitics would be in prison.\n\nWhat you're not free to do is incite hatred against Muslims as a group or invite discrimination against them.",
    "controversiality": 0,
    "ups": 298,
    "downs": 0,
    "score": 298,
    "created": 1490712272.0,
    "date_created": "2017-03-28",
    "time_created": "02:44:32",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi55pe",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Whilst I don't disagree entirely, I'm not sure how this is supposed to make anyone feel better about last week's events. ",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1490712073.0,
    "date_created": "2017-03-28",
    "time_created": "02:41:13",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi6klu",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "We had a huge opportunity to do this at the time of the Danish Mohammed cartoon controversy and what did the Times do?  Not fucking print them.  The whole media industry should have taken a collective decision and printed the cartoons together on mass, all of the arguments of sensitivity were totally bogus (look at the anti-semitic cartoons from the Arab press) and if everybody had done it then we would have had solidarity in numbers.  I am not 100% sure but from memory I think only Channel Four news actually showed them.",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1490715866.0,
    "date_created": "2017-03-28",
    "time_created": "03:44:26",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfijqr5",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It truly is worrying that one is being proposed. We're not willing to do the same for Christianity, not that I would accept that either. Islam should not be respected more than any other religion and religion should be ridiculed for being what it is. If you want to believe in a magical sky being who is condemning people to hell, then fine. But I stand by my right to take the piss. \n\nIslam has numerous toxic ideas and people need to learn that and abandon them. As does Christianity, although I'm pretty sure we've come quite far on that front and the church has been forced to reform.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1490742210.0,
    "date_created": "2017-03-28",
    "time_created": "11:03:30",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi652w",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "My view on what is needed:\n\nA guaranteed secular education for every child - if a child is born into a very religious family, they're already going to have more than enough experience of their in their general family life and at places of religious worship. School should be somewhere free of that, where they can experience the other side. We can ensure that things like sex education, evolution, the Big Bang and other contested topics can be taught to every child. A significant minority are currently trapped in a cycle of religious family life, religious worship and religious schooling with little hope of escape.\n\nThe ending of religious privileges - there are currently things that are legal unless they are done for religious purposes, in which case they are illegal. A good example is not stunning animals before slaughtering. This is illegal as a general rule, but there is a specific exemption for religious slaughter under Schedule 12 of The Welfare of Animals (Slaughter or Killing) Regulations 1995. This is wrong. Not stunning is either right or wrong; it cannot become right simply because it is done for religious reasons. This perpetuates the idea that religious belief gives a special entitlement over and above ordinary people.\n\nSecular clothing - this is linked to the above. If an employer sets a dress code, that dress code should be followed by all employees. Religion cannot be an exemption. Again, this treats religious belief as giving a special entitlement and normalises this belief in the minds of both those who practice it and those who observe it. To illustrate, I'm pretty sure that if I said somebody shouldn't wear a hat in the office, everybody would be in agreement. If I said the same thing about a hijab, I'd be in trouble. Yet there is no real difference between them. They're just fabrics put on a persons head. Clearly though the idea of religious privilege is widespread.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1490714637.0,
    "date_created": "2017-03-28",
    "time_created": "03:23:57",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi6zvz",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "What? Reading reddit I don't think how anyone could come to the conclusion that the 'right' to criticise Islam is under any threat. Virtually any degree of criticism of Islam, I have seen here.",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1490717125.0,
    "date_created": "2017-03-28",
    "time_created": "04:05:25",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi8kd8",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Science is mainly concerned with what are called falsifiable questions. You present a hypothesis then you also state the results that would prove your hypothesis wrong. It's an important part of scientific theory.\n\n'If I drop a ball on earth in a vacuum it will accelerate at a rate of 9.8 ms^-2' is a falsifiable statement. I can do the experiment and if the ball accelerates differently according to my measurements then I'm wrong.\n\n'God created the universe 5 minutes ago' is not falsifiable. What experiment could I do to disprove this that can't be countered with 'god made it that way'. That doesn't mean it isn't true, and this is actually a bit of a problem even for scientists. The second law of thermodynamics seems to imply it is in fact *more* likely that the universe popped into existence recently (I.e. The atoms randomly jiggled their way into this current formation) than the universe starting in the low entropy state of the Big Bang. \n\nThat's not to say I think that God did it, just that scientists don't have all the answers, take some things on faith and that some questions may never be answered.\n\nScience makes all sorts of philosophical assumptions, called axioms, that are not provable. We assume the outside world exists. We assume the universe is isotropic. We even make contradictory assumptions for different physical theories: 'The mathematics of quantum mechanics describes a real phenomena' vs 'the mathematics of quantum mechanics is an incomplete model of reality' \n\nBasically. There's room for both and theological and philosophical discussion is, IMHO, just as important.\n\n",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1490722083.0,
    "date_created": "2017-03-28",
    "time_created": "05:28:03",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiaa0g",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Not a Christian myself, but they get absolutely ridiculed and made fun of - why no outrage there?",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1490727224.0,
    "date_created": "2017-03-28",
    "time_created": "06:53:44",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi5m03",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "One of the problems, and the reasons racism is closely linked with Islamophobia, is that Islam is very much intrinsic to the culture of many people groups. It can't just be removed because it's so deeply intertwined with many peoples, communities, and lives.\n\nI think the best way for us to support quality discourse over Islam is to promote those progressive voices within Islamic communities, giving them platforms and resources, and engaging in dialogue with those willing.\n\nMocking a radical fringe is very rarely a good way to convince people to your side and when so many communities feel alienated for the Islamic beliefs that are intrinsic to them we only widen the gap between them and us.\n\nI feel like the same goes for all groups to some extent. Good discourse should be based on respect for the other's humanity and their ability to think as a rational being (if we don't believe in this then we may as well already concede). Through showing that there's a place for these people in our society, even if that place is contingent on their renouncing or softening certain beliefs, we can begin to mend the gaps that give birth to radical extremists.\n\nThe battle for hearts and minds is the most important one but the one that we least like to fight because it's very difficult.",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1490713222.0,
    "date_created": "2017-03-28",
    "time_created": "03:00:22",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfilyir",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I don't see why religions should enjoy a status higher than that of  other ideologies. Anarchism, Marxism, feminism - they're all just ideas. Nothing more, nothing less.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1490744644.0,
    "date_created": "2017-03-28",
    "time_created": "11:44:04",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfigisx",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'm glad that this has been upvoted here so strongly",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490738286.0,
    "date_created": "2017-03-28",
    "time_created": "09:58:06",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfipdsl",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'd quite like freedom of speech in this country.\n\nClearly sometimes it shouldn't be an option in very rare cases, but it's sad that people are scared to share their views on things.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490748249.0,
    "date_created": "2017-03-28",
    "time_created": "12:44:09",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfix4us",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No superstition is exempt from ridicule!",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490756387.0,
    "date_created": "2017-03-28",
    "time_created": "14:59:47",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfjabh0",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I guess I'm sheltered? This shit isn't even an issue where I live.  We ridicule the fuck out of all religions full stop.  Imo it's fucking insanity to believe in a book written 2000 years ago... Take all the moral teachings you want... But fact? And real life events? Fuck off.  Stop this shit, it's the 21st century and this is the UK. Grow the fuck up.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490771494.0,
    "date_created": "2017-03-28",
    "time_created": "19:11:34",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi68v7",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Whilst on the subject this whole #prayforlondon or etc for Paris etc is so hilarious.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1490714933.0,
    "date_created": "2017-03-28",
    "time_created": "03:28:53",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi4ovj",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1490710935.0,
    "date_created": "2017-03-28",
    "time_created": "02:22:15",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi56hg",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "What's funnier is poking fun at the feeble minded PC types who think it's racist (yes, I know) and \"islamophobic\" to poke fun and be critical of Islam.",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1490712128.0,
    "date_created": "2017-03-28",
    "time_created": "02:42:08",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiece7",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Blasphemy was an offence in the UK until 2008.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490735256.0,
    "date_created": "2017-03-28",
    "time_created": "09:07:36",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfix2o3",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Religion is holding us back as humans, i dont know why we follow some guys writing from 1000s of years ago. \n\nSurely in 2017 our knowledge of the world has surpassed theirs 100 times over. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1490756320.0,
    "date_created": "2017-03-28",
    "time_created": "14:58:40",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi5cs4",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Not being able to laugh at yourself is a huge flaw in a person.\n\nBecoming violent and hostile because people draw attention to your stupidity is infantile, we take the piss so we don't fight. \n\nIslam has deified the male ego to such an extreme point that any perceived slight is responded to with a fucking tantrum.\n\nThe total suppression of the female characteristics of that religion has deformed the minds of the men who practice it.\n\nMen are taught that the feminine is something to be dominated and controlled, they have taken control of the breeding process and decide (based of mantainence of power/wealth/property)  who the women marry.\n\nThis is the cause of many birth defects, the male ego manifested to it's extreme is islam, good for us that is has built into itself a self destruct button in the form of inbreeding, just gotta get out of the way long enough for it to blow itself up",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1490712569.0,
    "date_created": "2017-03-28",
    "time_created": "02:49:29",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi5fda",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[removed]",
    "controversiality": 1,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1490712750.0,
    "date_created": "2017-03-28",
    "time_created": "02:52:30",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfibulh",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The Quran has 109 War relate verses. It's a cancer. An example would be: \"Quran (8:12) - \"I will cast terror into the hearts of those who disbelieve. Therefore strike off their heads and strike off every fingertip of them\" No reasonable person would interpret this to mean a spiritual struggle.  The targets of violence are \"those who disbelieve\" - further defined in the next verse (13) as \"defy and disobey Allah.\" Nothing is said about self-defense.  In fact, the verses in sura 8 were narrated shortly after a battle provoked by Muhammad, who had been trying to attack a lightly-armed caravan to steal goods belonging to other people.  \"",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1490730872.0,
    "date_created": "2017-03-28",
    "time_created": "07:54:32",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfia7r1",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "This myth that people can't criticise Islam needs to die.  It's easily the most criticised religion of our time.  There is a big difference in criticising aspects of Islam and the entire Muslim population.\n\nFor example I find Christianity can be both ridiculous and abhorrent, however I don't describe all Christians as monsters.  At the end of the day most people are just people, they want the same things.  A good job and a good upbringing for their kids.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490727059.0,
    "date_created": "2017-03-28",
    "time_created": "06:50:59",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi79sx",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Absolutely.\n\nI've personally never understood why anyone takes religion seriously.\n\n\"i have an invisible friend in the sky that tells me what to do\" ~ Mental patient.\n\n\"we have an invisible friend in the sky that tells us what to do\" ~ Religious people.\n\nAs far as I can make out, the difference between a loony and a religious person is that the religious person has friends as equally mental as they are - but that somehow makes it ok?",
    "controversiality": 1,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1490717972.0,
    "date_created": "2017-03-28",
    "time_created": "04:19:32",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfib30z",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Where is this belief, that you're not allowed to criticise Islam, coming from? \n\nWe have free speech laws, you can say what you like. \n\nOnly limitation is inciting hatred and threatening behaviour. \n\nThis is nothing but plain and simple Victimhood. Get a grip lads. ",
    "controversiality": 1,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1490729199.0,
    "date_created": "2017-03-28",
    "time_created": "07:26:39",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiay1i",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Article written by Matt Ridley a moronic Viscount of somewhere that doesn't believe [in climate change ](http://www.thetimes.co.uk/article/matt-ridley-my-life-as-a-climate-change-lukewarmer-8jwbd8xz6dj) and almost all his writings and though are out of touch and reality.",
    "controversiality": 1,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1490728884.0,
    "date_created": "2017-03-28",
    "time_created": "07:21:24",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi5fgs",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Religion in general should be treated like my racist, homophobic grandma, ignore her long enough and she'll die of natural cause. ",
    "controversiality": 1,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1490712757.0,
    "date_created": "2017-03-28",
    "time_created": "02:52:37",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7r4w",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Is critiquing Islam actually under threat in a legal sense ? \n\nI was under the impression it was vague cultural fear of violent repercussion from extremists and political correctness that curtailed some folks criticism. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1490719472.0,
    "date_created": "2017-03-28",
    "time_created": "04:44:32",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfidzus",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[removed]",
    "controversiality": 1,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1490734717.0,
    "date_created": "2017-03-28",
    "time_created": "08:58:37",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfidk3v",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Here's an interesting story that reflects on this. \n\nThere were two schools of Salafi Islam growing in Germany, at the turn of the century. One was led by a man who was considerate of western values, progressive in his approach to accepting women's equality and homosexuality. The other was led by a real radical conservative who believed that scripture should be applied to the letter. \n\nThe former was initially successful in uniting Muslim's under a more modern and accepting form of Islam, while the latter became a smaller splinter movement. Unfortunately, the media didn't care to understand the difference, and applied the same scrutiny and suspicion to both, which was reflected in public opinion.\n\nEventually the more tolerant school began to fragment, because its members didn't understand why they would strive to integrate with a society that levelled such negativity at them. So the two schools merged, and adopted the more conservative and radical position. \n\nThe key to all of this is not to treat Islam as monolith. It is not. There are a variety of schools and interpretations, some of which are entirely compatible with western living. These we should embrace. ",
    "controversiality": 1,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490734012.0,
    "date_created": "2017-03-28",
    "time_created": "08:46:52",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi733m",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "This needs a wider discussion, not just limited to Islam.\n\nDiscussing and poking fun at Islam has never, personally got me into trouble. However, criticising British foreign policy has gotten a friend's teeth kicked in. People have a visceral reaction to you criticising things that are held very closely to them and make part of their being. Be it your religion, political ideology or your national identity.\n\nOn a spectrum of things we are and are *not* allowed to talk about or critique in this country, Islam is very far down the list of social taboo's and to me of least concern, mainly because there are *plenty* of voices criticising Islam already.\n\nEdit: the downvote(s) only furthers my point.\n",
    "controversiality": 1,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490717406.0,
    "date_created": "2017-03-28",
    "time_created": "04:10:06",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfic4q7",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Uh, you totally can criticise Islam. No one is stopping you from doing that. \n\nJust make sure your criticisms are based in fact. That's all anybody is asking. ",
    "controversiality": 1,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1490731445.0,
    "date_created": "2017-03-28",
    "time_created": "08:04:05",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiyig6",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Islam is a backwards 7th century fairy tale which was started and spread by a man who was a pedo and a warlord. Who married a girl when she was 6 and raped her when she was 9. Thank god the crusades stopped Islam in its tracks, and before it ended islam had taken nearly a million square miles.\n\nIf anyone is interested in further reading, I suggest \"The decline of eastern christianity under islam\" by Bat Ye'or.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490757865.0,
    "date_created": "2017-03-28",
    "time_created": "15:24:25",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7nhr",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Videos in this thread: [Watch Playlist &#9654;](http://subtletv.com/_r61xng1?feature=playlist)\n\nVIDEO|COMMENT\n-|-\n[Hitchens - free speech](http://www.youtube.com/watch?v=jyoOfRog1EM&t=767s)|[+18](https://www.reddit.com/r/ukpolitics/comments/61xng1/_/dfi9692?context=10#dfi9692) - Christopher Hitchens and Richard Dawkins are two people who spring to mind that vehemently criticised Islam in public and suffered no negative legal consequences as a result.   Bad consequences occupy a lot more space than simple 'legal consequences'...\n[A Picture of Mohamed](http://www.youtube.com/watch?v=1VwpwP_fIqY)|[+8](https://www.reddit.com/r/ukpolitics/comments/61xng1/_/dfi7o4n?context=10#dfi7o4n) - just re posting this the issue is basically summarized here. AS far as I'm aware there are no other religions where youll get murdered for drawing a stick man.\n[Dara O'Briain - On Muslim Jokes](http://www.youtube.com/watch?v=QJHzwiYG8bM)|[+2](https://www.reddit.com/r/ukpolitics/comments/61xng1/_/dfi8rdb?context=10#dfi8rdb) - I would agree. Whilst the papers are happy to poke fun at the Church of England or the Vatican, you won't see them running cartoons about child abuse in the church or portraying some grisly stereotype of all Christian priests as child molestors, beca...\n(1) [Robert Spencer: Islam Cannot be Reformed Because its Already Evil at its Core](http://www.youtube.com/watch?v=y8bOBqc6PHg) (2) [The Basics of Islam 5: Robert Spencer on the Peaceful Verses in the Qur'an](http://www.youtube.com/watch?v=h_SkhmsyYag) (3) [The Basics of Islam 6: Robert Spencer on Is ISIS Islamic?](http://www.youtube.com/watch?v=0y-5PKm4jWw) (4) [Where are the moderate American Muslims? Robert Spencer](http://www.youtube.com/watch?v=LcalFrQpPGo) (5) [Robert Spencer on why non-devout Muslims sometimes turn to jihad terror](http://www.youtube.com/watch?v=d--C-GbF0JU)|[+2](https://www.reddit.com/r/ukpolitics/comments/61xng1/_/dfi6tup?context=10#dfi6tup) - ...think the best way for us to support quality discourse over Islam is to promote those progressive voices within Islamic communities, giving them platforms and resources, and engaging in dialogue with those willing.   Which of these 'progressives' ...\n[God is not a Good Theory (Sean Carroll)](http://www.youtube.com/watch?v=ew_cNONhhKI)|[+1](https://www.reddit.com/r/ukpolitics/comments/61xng1/_/dfie9zi?context=10#dfie9zi) - Morality is very interesting from a scientific point of view. Perhaps like you I started as more agnostic but gradually I've moved towards atheism, as I've noted the lack of intrinsic utility in religions and religious discourse in general.   Religio...\n[Dispatches: Undercover Mosque - Real Stories](http://www.youtube.com/watch?v=Btx0mm5KCMI)|[+1](https://www.reddit.com/r/ukpolitics/comments/61xng1/_/dfinoa1?context=10#dfinoa1) - They could stop allowing Saudi Arabia to fund preachers who teach that non-muslims are scum.\n[Tommy Robinson - Main Speech](http://www.youtube.com/watch?v=_YQ94jFg_4A)|[+1](https://www.reddit.com/r/ukpolitics/comments/61xng1/_/dfit2id?context=10#dfit2id) - You may be interested in this talk where he discusses the problems in Luton which led to the formation of the EDL.\n(1) [Holy Flying Circus trailer](http://www.youtube.com/watch?v=xO3gFDMZLN0) (2) [Monty Python's Holy Flying Circus - Muslim Scene](http://www.youtube.com/watch?v=2j--0gzT2rk)|[+1](https://www.reddit.com/r/ukpolitics/comments/61xng1/_/dfijdsg?context=10#dfijdsg) - Hijacking top comment to say that everyone needs to remember Life of Brian and the shit Monty Python had to go through just to criticize Christianity:     Especially this scene:\nI'm a bot working hard to help Redditors find related videos to watch. I'll keep this updated as long as I can.\n***\n[Play All](http://subtletv.com/_r61xng1?feature=playlist&ftrlnk=1) | [Info](https://np.reddit.com/r/SubtleTV/wiki/mentioned_videos) | Get me on [Chrome](https://chrome.google.com/webstore/detail/mentioned-videos-for-redd/fiimkmdalmgffhibfdjnhljpnigcmohf) / [Firefox](https://addons.mozilla.org/en-US/firefox/addon/mentioned-videos-for-reddit)",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490719146.0,
    "date_created": "2017-03-28",
    "time_created": "04:39:06",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfij9ut",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You know, the human mind is a really funny thing. Typing this right now I can say that I don't really believe in the existence of a god. But if I was suddenly shot and was bleeding out and there was a priest that just happened to be there. You can bet that I would want my last rites read to me and a blessing before I died....cant really say why tbh",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490741673.0,
    "date_created": "2017-03-28",
    "time_created": "10:54:33",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfio51k",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'd agree. Remove religion from politics and it should be open to criticism.\n\nHowever, a lot of the criticism of muslims I see usually are by people who stereotype all of them based on the actions of a few extremists. Their religion is definitely not perfect, but at the same time they're stereotyped way too often.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490746955.0,
    "date_created": "2017-03-28",
    "time_created": "12:22:35",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfj3lfo",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Haven't we been criticizing Islam non stop since 2001?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490763366.0,
    "date_created": "2017-03-28",
    "time_created": "16:56:06",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfj67o1",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The only religions I'd try and get rid of or secularize are the Abrahamic ones which just seem to be \"fuck you merriment prohibited murder the unbelievers\" with occasional \"be nice to your ingroup\" thrown in to make stupid people believe they're benevolent. The other mainstream religions have problems but the reason the Abrahamic religions have the biggest share of believers on the planet is because they're violently expansionist.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490766404.0,
    "date_created": "2017-03-28",
    "time_created": "17:46:44",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfj7wft",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "How about our right to freedom of speech? \n\nI'd get just as much resistance (probably a lot more) if I started shouting down the street how great Trump is or if I wrote a piece for a major newspaper defending Islam and posted it on Twitter.\n\nHow I see it, people will believe any batshit idea if they're brought up to believe it - as John Rohn said 'you are the average of the 5 people you're closest with'. That applies to beliefs, too. The government shouting at them telling them to belief a certain way or you get arrested isn't ever going to work. Change is slow and steady. \n\nWhether it's white supremacy, extreme religion, sexism, racism, homophobia or whatever it shouldn't be accepted but it also shouldn't be banned as long as it's not abusive to individuals.\n\nMore than anything, we should defend all liberal values. Not just your right to voice your individual opinion about Islam.\n",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490768449.0,
    "date_created": "2017-03-28",
    "time_created": "18:20:49",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfjb0t7",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Blind acceptance of the writings of some nutter born 1500 years ago is only trumped by blind adherence to the writings of some blokes about another bloke 2000 years ago...\n\nBut seriously, I have no problem with people following a religion.  I do have a problem with them not questioning it, following instructions written 1500 years ago as though they are still applicable today, and following instructions that run completely contrary to the nation state they live in.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490772378.0,
    "date_created": "2017-03-28",
    "time_created": "19:26:18",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfjfwb7",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Wow, even multiple papers now with articles on this. Makes a change from them smearing critics I suppose.\n\nI guess it's confirmed, the far-right is taking over.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490778517.0,
    "date_created": "2017-03-28",
    "time_created": "21:08:37",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfjl94l",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think that religion is a fundamentally personal and private set of beliefs. Whilst you have every right to hold these beliefs they should not be forced upon others by you, by a state or by a group of radicals. \n\nThere should always be places for rational discussion and debate as this benefits everyone's understanding and lets us progress as a society. \n\nHowever, if we are to ask for that respect from people who hold religious beliefs we should also refrain from 'poking fun' at these peoples expense; all that does is alienate people for holding different opinions to us and pushes them towards more militant crowds. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490785187.0,
    "date_created": "2017-03-28",
    "time_created": "22:59:47",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiar9y",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It is criticised. Vocally, fucking *constantly*. We get it. Now people whine they can't criticise it? ",
    "controversiality": 1,
    "ups": -1,
    "downs": 0,
    "score": -1,
    "created": 1490728438.0,
    "date_created": "2017-03-28",
    "time_created": "07:13:58",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7n7q",
    "parent_id": "t3_61xng1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "this is a great highlighting of the issue imho\n\nhttps://www.youtube.com/watch?v=1VwpwP_fIqY",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490719123.0,
    "date_created": "2017-03-28",
    "time_created": "04:38:43",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi5y3c",
    "parent_id": "t1_dfi4bfe",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "We should ensure secularism in education and government etc, but religion itself has its place. \n\nIf someone obtains hope and meaning from believing in a mythical being, then who am I to stop them. ",
    "controversiality": 0,
    "ups": 99,
    "downs": 0,
    "score": 99,
    "created": 1490714103.0,
    "date_created": "2017-03-28",
    "time_created": "03:15:03",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi5it8",
    "parent_id": "t1_dfi4bfe",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 274,
    "downs": 0,
    "score": 274,
    "created": 1490712989.0,
    "date_created": "2017-03-28",
    "time_created": "02:56:29",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi95go",
    "parent_id": "t1_dfi4bfe",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1490723953.0,
    "date_created": "2017-03-28",
    "time_created": "05:59:13",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi536k",
    "parent_id": "t1_dfi4bfe",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I don't understand why we ridicule flat Earthers and anti vaccinators, yet we must be apologists for religion because we might offend some people.\n\nIncredible.",
    "controversiality": 0,
    "ups": 68,
    "downs": 0,
    "score": 68,
    "created": 1490711906.0,
    "date_created": "2017-03-28",
    "time_created": "02:38:26",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi90gq",
    "parent_id": "t1_dfi4bfe",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It's funny, as someone who thinks it's unfair to ask all Muslims to do something to act against Islamic terrorism, I do so while thinking their religion is total nonsense - as all religions are - and don't really have a problem with people insulting the religion itself. ",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1490723514.0,
    "date_created": "2017-03-28",
    "time_created": "05:51:54",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi5b04",
    "parent_id": "t1_dfi4bfe",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 54,
    "downs": 0,
    "score": 54,
    "created": 1490712439.0,
    "date_created": "2017-03-28",
    "time_created": "02:47:19",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi5w8k",
    "parent_id": "t1_dfi4bfe",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You do realise every religion bar one ... is happily mocked?",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1490713962.0,
    "date_created": "2017-03-28",
    "time_created": "03:12:42",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dficw7e",
    "parent_id": "t1_dfi4bfe",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "And all ideologies, being cults based on moden ideas, should be examined, questioned and, if necessary, ridiculed for the mass hysteria that they are.\n\nFunnily enough though, the same independent thinking skeptics who ridicule religious faith tend to go into paroxysms of outrage when you question modern articles of faith like \"diversity is our strength\".",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490732885.0,
    "date_created": "2017-03-28",
    "time_created": "08:28:05",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfidvl9",
    "parent_id": "t1_dfi4bfe",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Classic cop out when it comes to criticizing Islam.\n\nIslam has very specific problems with it: cousin marriages and banning the public display of Muhammad. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490734531.0,
    "date_created": "2017-03-28",
    "time_created": "08:55:31",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfizmqw",
    "parent_id": "t1_dfi4bfe",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "One question I have, is that why do we allow religions to be subsidised with our taxes, in that many of them are simply profitable corporations dressed in a preachers robe?  \n\nHow quickly would the more extreme religions change if their revenue stream was threatened by taxing institutions that taught principles that encourage discrimination?  \nCan a private school teach that gays are evil and should die?  \nCan a company run staff training sessions telling them to ignore single mothers?  \nWhy then can a church prosper under our tax exemptions while they do this?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490759062.0,
    "date_created": "2017-03-28",
    "time_created": "15:44:22",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfj2ua5",
    "parent_id": "t1_dfi4bfe",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Too simplistic when religion is often interwoven into family values. Particularly when most of those families abhor the attacks and bring their youngsters up to be peaceful and contributors to society.\n\nI'm not religious myself but I do respect other cultures and the different way they do things. It's extremely difficult to find a solution because if you ridicule a faith demographic you entrench and alienate them even more and then you get more radicalisation.\n\nThe only way to get the positive aspects of faith is to firstly to try to understand the people who follow them and why they do and second to tolerate the things that conflict with logic and science as quirks of an outdated culture that some people are brought up to, and still feel comforted to, follow.  ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490762528.0,
    "date_created": "2017-03-28",
    "time_created": "16:42:08",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfj9nsp",
    "parent_id": "t1_dfi4bfe",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The ironic thing is that generally the most vicious Muslim bashers are generally the same ones that describe Britain as a 'Christian country' and campaigned to keep blasphemy laws fifteen years ago when New Labour were trying to get rid of them. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490770643.0,
    "date_created": "2017-03-28",
    "time_created": "18:57:23",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfjv047",
    "parent_id": "t1_dfi4bfe",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Could it be that they're post-truth? Almost reminds me of something ...\n\nOh yes: until recently the right-wingers used to be religious conservatives. Funny that!",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490804879.0,
    "date_created": "2017-03-29",
    "time_created": "04:27:59",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi6873",
    "parent_id": "t1_dfi4bfe",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 1,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1490714881.0,
    "date_created": "2017-03-28",
    "time_created": "03:28:01",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfijdsg",
    "parent_id": "t1_dfi791d",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Hijacking top comment to say that everyone needs to remember Life of Brian and the shit Monty Python had to go through just to criticize Christianity:\n\nhttps://www.youtube.com/watch?v=xO3gFDMZLN0\n\nEspecially this scene:\n\nhttps://www.youtube.com/watch?v=2j--0gzT2rk",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1490741798.0,
    "date_created": "2017-03-28",
    "time_created": "10:56:38",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfinghq",
    "parent_id": "t1_dfi791d",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1490746226.0,
    "date_created": "2017-03-28",
    "time_created": "12:10:26",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfjiiy0",
    "parent_id": "t1_dfi791d",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "They can however, go stick their religion up their ass",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490781711.0,
    "date_created": "2017-03-28",
    "time_created": "22:01:51",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfidbch",
    "parent_id": "t1_dfi67a8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">We can't say Christmas anymore, we can't discuss immigrants anymore, we can't criticize Islam.\n\nI actually see newspapers complaining about it more than I see it in real life, I've never heard anyone say we shouldn't be able to say Christmas besides obscure tumblr pages which no one gives a shit about anyway. From what I've seen, the Muslims who give a shit are in the minority aswell. Most of these stories are exaggerated to fit a narrative. \n\nNot saying it doesn't exist though, and people on the left should be less sensitive when discussing immigrants, although some of the stuff I've heard from the right about immigrants is just outrageous aswell.\n",
    "controversiality": 0,
    "ups": 58,
    "downs": 0,
    "score": 58,
    "created": 1490733609.0,
    "date_created": "2017-03-28",
    "time_created": "08:40:09",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfik8e0",
    "parent_id": "t1_dfi67a8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> We can't say Christmas anymore,\n\nI once had someone say that to me, while stood in front of a sign saying \"Merry Christmas\"\n\nI was just dumbfounded",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1490742763.0,
    "date_created": "2017-03-28",
    "time_created": "11:12:43",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7wum",
    "parent_id": "t1_dfi67a8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Free to criticise yes, but what we want is to be free of violent consequences. Every high profile critic of Islam lives under police protection, that's not the way it's supposed to be.",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1490719980.0,
    "date_created": "2017-03-28",
    "time_created": "04:53:00",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi6iam",
    "parent_id": "t1_dfi67a8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> What is interesting though, is this attitude of, we can't do X, where X is something everyone does. We can't say Christmas anymore, we can't discuss immigrants anymore, we can't criticize Islam. Victim status is highly sought after. Why?\n\nBecause they need victimhood to feed their narrative and belief that Muslims in general are a cancer that needs excising.",
    "controversiality": 0,
    "ups": 53,
    "downs": 0,
    "score": 53,
    "created": 1490715680.0,
    "date_created": "2017-03-28",
    "time_created": "03:41:20",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfihjbr",
    "parent_id": "t1_dfi67a8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Because guilt is the most effective influence tool.\n\nFear and hope are effective. But if you really want to convince someone to do something guilt them into it.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490739581.0,
    "date_created": "2017-03-28",
    "time_created": "10:19:41",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfinasa",
    "parent_id": "t1_dfi67a8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The American left.\n\nI'll be downvoted and people will deflect with \"but hurr durr Republicans/Trump!\" but facts remain facts. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490746057.0,
    "date_created": "2017-03-28",
    "time_created": "12:07:37",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi9tsn",
    "parent_id": "t1_dfi67a8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 1,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1490725982.0,
    "date_created": "2017-03-28",
    "time_created": "06:33:02",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfjvrhm",
    "parent_id": "t1_dfi67a8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> We can't say Christmas anymore, we can't discuss immigrants anymore, we can't criticize Islam. Victim status is highly sought after. Why?\n\nExcept this isn't actually true, is it? It wouldn't have been true last year either.\n\nGiven the hysteria of the type you exemplify, it would be far more true to say that we can't give an account of why regressing to essentially 1960s attitudes on race and 1930s views on nationhood is an absolutely terrible idea. Because when one does make that case, one gets the comment buried by the right-wing brigade around here who downvote anything that they don't like.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490807276.0,
    "date_created": "2017-03-29",
    "time_created": "05:07:56",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfjz9he",
    "parent_id": "t1_dfi67a8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490816999.0,
    "date_created": "2017-03-29",
    "time_created": "07:49:59",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi5ap1",
    "parent_id": "t1_dfi58m2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "One wonders how many would do so without the veil of anonymity. I know I wouldn't, and I think that says a lot.",
    "controversiality": 0,
    "ups": 91,
    "downs": 0,
    "score": 91,
    "created": 1490712418.0,
    "date_created": "2017-03-28",
    "time_created": "02:46:58",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi8ylj",
    "parent_id": "t1_dfi58m2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1490723349.0,
    "date_created": "2017-03-28",
    "time_created": "05:49:09",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi5gkq",
    "parent_id": "t1_dfi58m2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Cartoonists at Charlie Hebdo and Bill Leak in Australia and the danish cartoonists would like a word, please. ",
    "controversiality": 0,
    "ups": 58,
    "downs": 0,
    "score": 58,
    "created": 1490712835.0,
    "date_created": "2017-03-28",
    "time_created": "02:53:55",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi82wr",
    "parent_id": "t1_dfi58m2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "This [article](https://www.gatestoneinstitute.org/7497/france-islamophobia) gives you an idea of the consequences of criticising Islam in france. TL;DR: police protection for every high profile critic. \n\nAt best, if you're not threatened with violence, you're branded a bigot (which doesn't happen if you make fun of the pope or Mormons for example). There is a huge taboo around Islam. People are scared to criticise it openly, every leftwing media and politician have now adopted the ludicrous notion of \"islamophobia\". It's really frightening that we now have a negative word to describe the criticism of a religion. I consider myself a christanophobe and islamophobe, but I don't hate the followers of these religions, just what they believe in. ",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1490720522.0,
    "date_created": "2017-03-28",
    "time_created": "05:02:02",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7nlk",
    "parent_id": "t1_dfi58m2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">You are free to criticise Islam\n\nYou and me are, but can muslims do it?",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490719156.0,
    "date_created": "2017-03-28",
    "time_created": "04:39:16",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi5rr8",
    "parent_id": "t1_dfi58m2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That's where the whole PC stuff comes in that is so criticized now, because the line between \"criticism\" and \"inciting hatred\" is not clearly defined and difficult to put into law, too open for interpretation.",
    "controversiality": 1,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490713636.0,
    "date_created": "2017-03-28",
    "time_created": "03:07:16",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfikqlj",
    "parent_id": "t1_dfi58m2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "And therein lies the fine line. \n\nWhen the government is free to make the distinction, they will eventually make an example out of someone. Hopefully it isn't you. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490743323.0,
    "date_created": "2017-03-28",
    "time_created": "11:22:03",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7dyq",
    "parent_id": "t1_dfi55pe",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Well for one I haven't seen any evidence reported that it was religiously motivated.",
    "controversiality": 1,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1490718324.0,
    "date_created": "2017-03-28",
    "time_created": "04:25:24",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7fjw",
    "parent_id": "t1_dfi6klu",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The problem with the Danish cartoons is that, yes they were offensive to nutters that want to cut people's heads off for insulting Mohammed, but they were also offensive to the vast swathe of Muslims in the country that really respect the rule of law. So you end up shitting on a whole group of innocent bystanders just to make a point to a small fringe.\n\nI mean, newspapers as a rule don't go out of their way to publish things whose purpose is to offend religious or cultural groups. Making an exception for Islam because of some terrorist threats or even acts like Charlie Hebdo is silly.\n\nAnd if the point is to promote social cohesion and limit radicalisation, I think publishing the cartoons in a provocative manner is likely counterproductive.\n\nThere are probably better ways to do this.",
    "controversiality": 1,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1490718461.0,
    "date_created": "2017-03-28",
    "time_created": "04:27:41",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7al7",
    "parent_id": "t1_dfi652w",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "On secular clothing - if the law of the land says people can/can't wear particular clothing (as long as it doesn't have a health and safety issue) then it's the business that's at fault if it opposes it.  The government is above business, so that example doesn't hold.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1490718037.0,
    "date_created": "2017-03-28",
    "time_created": "04:20:37",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfida9u",
    "parent_id": "t1_dfi652w",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "In cold practicality your position sounds very appealing. We should live in a society with no exceptions and no discrimination. Religion is a personal choice, and therefore is only a personal consideration.\n\nUnfortunately that's not quite how all of this works. \n\nIf you make sex education mandatory then you will have Muslim families pulling their children out of school.\n\nIf you make the halal slaughter of animals illegal then you effectively develop a black market for meat, otherwise Muslims would all have to become vegetarian. \n\nIf you allow employers to ban visible religious wear, it is effectively a ban on the hijab by another name (though also orthodox jews). You make it more difficult for Muslim women to go out and seek employment - which can already be difficult for them, as a  break away from cultural norms. \n\nSo yes while your ideas sound nice in theory, they would actually drive more of a wedge between the Muslim community and the rest of society.\n\nLet's look at these issues from a saner perspective. \n\nIf you allow Muslim families to exempt their children from sex education then at least they still receive a mainstream education in the sciences and history etc. \n\nHalal slaughter actually doesn't preclude stunning before slaughtering. The point of contention is that stunning itself can't be what kills the animal. If you stigmatise halal (including by the proliferation of false information) then you marginalise Muslims via the food they eat. \n\nIf you allow without question the Hijab in the workplace (except for where it may be a safety concern, machinery etc) then you encourage Muslim women to participate in society, and you help to solve a significant problem in wealth disparity for the Muslim community. \n\nAnd why not allow it? It is not harming anyone else. That used to be the foundation of British values: As long as you obey the law of the land and don't annoy anyone else, you can do what you want. Unfortunately we now have a whole concept of being annoyed on behalf of other people for manufactured reasons. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490733559.0,
    "date_created": "2017-03-28",
    "time_created": "08:39:19",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfja5dc",
    "parent_id": "t1_dfi652w",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "So you want to forbid hunting.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490771270.0,
    "date_created": "2017-03-28",
    "time_created": "19:07:50",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7iau",
    "parent_id": "t1_dfi6zvz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Victimhood Is necessary for their kind of politics. See big turk erdogan, calling Europe fascists and aggressors, while escalating things further.  They'd love more attacks to validate their beliefs,  look at this subreddit since the attack to see why.  They love the opportunity to incite hatred towards their chosen group ",
    "controversiality": 1,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1490718704.0,
    "date_created": "2017-03-28",
    "time_created": "04:31:44",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfim3it",
    "parent_id": "t1_dfi6zvz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 1,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490744792.0,
    "date_created": "2017-03-28",
    "time_created": "11:46:32",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfidb7m",
    "parent_id": "t1_dfi8kd8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I don't really see how your post addresses the topic of \"is it OK to criticise islam\". But I do agree with you to a certain extent. \n\nI'd agree that philosophy runs alongside science perfectly well and is equally important. But I see religion as philosophy+ (or minus...). It's philosophy with added bloat. Myths, ridiculous assertions, pointless rituals and traditions and an unhealthy dose of woo. I see philosophy more as the natural evolution of religion, that should have put the final nails in that coffin.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1490733603.0,
    "date_created": "2017-03-28",
    "time_created": "08:40:03",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfih7em",
    "parent_id": "t1_dfi8kd8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">The second law of thermodynamics seems to imply it is in fact more likely that the universe popped into existence recently (I.e. The atoms randomly jiggled their way into this current formation) than the universe starting in the low entropy state of the Big Bang.\n\nIt does no such thing.\n\nTo claim that a universe created five minutes ago is more probable than a universe with a big bang (and justifying something on the basis of the second law of thermodynamics is just a fancy way of saying \"it's more probable\") you need to propose a 'universe generating mechanism' that pops out different types of universes with different probabilities. No such mechanism has been hypothesized, so no such statement as yours can be made.\n\n>Science makes all sorts of philosophical assumptions, called axioms, that are not provable.\n\nThat's not entirely wrong, but I'd put it differently: philosophy makes assumptions on science's behalf, whereas science just sort of gets on with it.\n\nEveryone agrees that *something* needs to be assumed at the outset in order to justify scientific statements (theories, consequences of those theories etc), but it's very unclear what that is, and the work that goes into investigating this is not itself science.\n\n>We assume the outside world exists.\n\nThe statement \"the outside world exists\" doesn't really have a scientific meaning.\n\n>We assume the universe is isotropic.\n\nWe don't *assume* the universe is isotropic, we hypothesize it on the basis of the fact that (i) it looks isotropic and (ii) we have no theoretical reason to think it isn't. But this could easily be overturned if new evidence contradicted it.\n\n>We even make contradictory assumptions for different physical theories: 'The mathematics of quantum mechanics describes a real phenomena' vs 'the mathematics of quantum mechanics is an incomplete model of reality'\n\nSorry, that doesn't make sense to me (your statement, not the putative contradiction).",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490739169.0,
    "date_created": "2017-03-28",
    "time_created": "10:12:49",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfib6se",
    "parent_id": "t1_dfiaa0g",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "One reason is that we had that fight already. Blasphemy against Christianity was illegal until 2008. A lot of work has gone into the criticism and mockery of Christianity being as commonly accepted as it is today.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1490729440.0,
    "date_created": "2017-03-28",
    "time_created": "07:30:40",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi61mw",
    "parent_id": "t1_dfi5m03",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "People's feelings are not sufficient excuse to deny us our right to mock things. ",
    "controversiality": 0,
    "ups": 45,
    "downs": 0,
    "score": 45,
    "created": 1490714376.0,
    "date_created": "2017-03-28",
    "time_created": "03:19:36",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi8zte",
    "parent_id": "t1_dfi5m03",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Mocking a radical fringe\n\nThe fringe that is at least 78% of the UK's Muslims, and higher elsewhere in the world?",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1490723459.0,
    "date_created": "2017-03-28",
    "time_created": "05:50:59",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi6tup",
    "parent_id": "t1_dfi5m03",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[removed]",
    "controversiality": 1,
    "ups": -2,
    "downs": 0,
    "score": -2,
    "created": 1490716625.0,
    "date_created": "2017-03-28",
    "time_created": "03:57:05",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfjg2rt",
    "parent_id": "t1_dfipdsl",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think it's quite good that some people are concerned that their views will be ridiculed ... when they're stupid views.\n\nQuite happy to see climate change deniers, those who think gays cause hurricanes, etc, mocked for their beliefs.\n\nNot beaten up or jailed, but mocked, sure.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490778726.0,
    "date_created": "2017-03-28",
    "time_created": "21:12:06",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7r0w",
    "parent_id": "t1_dfi68v7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Plus the coloured filters",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490719463.0,
    "date_created": "2017-03-28",
    "time_created": "04:44:23",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi4sjw",
    "parent_id": "t1_dfi4ovj",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">every word of the Qur'ran is, word-for-word, the perfect, unchangeable\n\nHorseshit for halfwits. \n\n",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1490711179.0,
    "date_created": "2017-03-28",
    "time_created": "02:26:19",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi5f9t",
    "parent_id": "t1_dfi4ovj",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I mean that's why there is absolutely no variation in the practice or sects of Islam at all...\n\nYour understanding of Islam is hilariously, worryingly skewed. Modern interpretations of Islam owe far more to local and regional geopolitics than a requirement to literalism, I would really recommend reading up on the history of Islam, especially in the late 19th century, when more moderate and varied beliefs started to flourish.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1490712742.0,
    "date_created": "2017-03-28",
    "time_created": "02:52:22",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi5kc1",
    "parent_id": "t1_dfi56hg",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "And their partner in tedium, the 2edgy4u crew who don't get that breaking a taboo is neither sufficient nor necessary for satire. ",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1490713102.0,
    "date_created": "2017-03-28",
    "time_created": "02:58:22",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi65fy",
    "parent_id": "t1_dfi56hg",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "A big problem, and I'm guilty of this at times too, is separating actual criticism from thinly veiled bigotry and hatred. Islam gets so many loud far right nuts openly hating it, and all muslims, that it's easy to develop a knee jerk reaction that just ends up 8p defending islam with few conditions. I've done my best to stop doing this but it's a common trend I see among left types.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1490714666.0,
    "date_created": "2017-03-28",
    "time_created": "03:24:26",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi6qhz",
    "parent_id": "t1_dfi5cs4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">Not being able to laugh at yourself is a huge flaw in a person.\n>\n>Becoming violent and hostile because people draw attention to your stupidity is infantile, we take the piss so we don't fight. \n>\n>Islam has deified the male ego to such an extreme point that any perceived slight is responded to with a fucking tantrum.\n>\n>The total suppression of the female characteristics of that religion has deformed the minds of the men who practice it.\n>\n>Men are taught that the feminine is something to be dominated and controlled, they have taken control of the breeding process and decide (based of mantainence of power/wealth/property)  who the women marry.\n>\n>This is the cause of many birth defects, the male ego manifested to it's extreme is islam, good for us that is has built into itself a self destruct button in the form of inbreeding, just gotta get out of the way long enough for it to blow itself up \n\nAll true.  ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1490716349.0,
    "date_created": "2017-03-28",
    "time_created": "03:52:29",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi6r86",
    "parent_id": "t1_dfi5fda",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> deport all pseudo-citizens.\n\nGo on, say what you're trying to subtly say. You know you want to....",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1490716407.0,
    "date_created": "2017-03-28",
    "time_created": "03:53:27",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfit4pc",
    "parent_id": "t1_dfi5fda",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> look forward to a future under Islam \n\nA couple terrorist attacks happen coinciding with the downfall of Isis and suddenly we're under threat of the caliphate... Terribly hyperbolic. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490752105.0,
    "date_created": "2017-03-28",
    "time_created": "13:48:25",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi5txd",
    "parent_id": "t1_dfi5fda",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Found the BNP voter.",
    "controversiality": 1,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490713793.0,
    "date_created": "2017-03-28",
    "time_created": "03:09:53",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7iov",
    "parent_id": "t1_dfi79sx",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Ok so it's not for you ",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490718736.0,
    "date_created": "2017-03-28",
    "time_created": "04:32:16",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfim6m8",
    "parent_id": "t1_dfib30z",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1490744881.0,
    "date_created": "2017-03-28",
    "time_created": "11:48:01",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfipmvy",
    "parent_id": "t1_dfib30z",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I could be wrong, but I don't think we actually do have freedom of speech, definitely not in the sense that the US has it anyway.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1490748509.0,
    "date_created": "2017-03-28",
    "time_created": "12:48:29",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfj48m7",
    "parent_id": "t1_dfib30z",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Are you having a laugh? You can legally express views  in public sure, but it's not the legality that stops criticism of Islam in the places that matter like newspapers and government, it's fear of being killed. The Danish cartoonist, the poor souls at Charlie hebdo, filmmaker theo Van Gogh in the Netherlands... criticising Islam comes with a very serious risk. Public figures who criticise Islam, like former Dutch politician Ayaan Hirsi Ali and writer Sam Harris have to literally have bodyguards now. Salman Rushdie had to have 24/7 police protection for years, just for writing a book which was interpreted as criticism of Islam! I'm not sure if you didn't know about this stuff or if you're deliberately misdirecting from it, but saying that people are free to criticise Islam is woefully naive. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490764088.0,
    "date_created": "2017-03-28",
    "time_created": "17:08:08",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiodiv",
    "parent_id": "t1_dfiay1i",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That doesn't disprove anything he said",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1490747198.0,
    "date_created": "2017-03-28",
    "time_created": "12:26:38",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7shk",
    "parent_id": "t1_dfi5fgs",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I don't know why people insist on saying the rest of the major religions are as bad. They simply aren't.",
    "controversiality": 1,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490719589.0,
    "date_created": "2017-03-28",
    "time_created": "04:46:29",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi8bka",
    "parent_id": "t1_dfi7r4w",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Not in this country, I think the opposte with the freedom of speech in university drive. Canada are passing a legislation that codified islamaphobia, which is possibly goinga bit far...",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1490721290.0,
    "date_created": "2017-03-28",
    "time_created": "05:14:50",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfibc6p",
    "parent_id": "t1_dfi733m",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Except Islam is the one faith where mocking it can get you into trouble. With the police, who arrest Quran burners and Twitter jokers, and with the violent lot who shot up Charlie Hebdo and murdered Theo van Gogh. \n\nYou talk about political ideology and national identity but I don't see the police arresting anyone for mocking Theresa May or Jeremy Corbyn and I have yet to see crowds of angry Conservatives violently attacking anyone [but point taken, it does seem to happen with the left](http://www.ibtimes.co.uk/conservatives-party-conference-journalist-spat-torty-attendee-egged-by-angry-protesters-15223910). As for national identity, some people equate this to racism, but I'd be happy to have a wider discussion, as I believe speech should be really be as free as possible. It's only through discussion and debate that we progress as a society. \n\n>On a spectrum of things we are and are not allowed to talk about or critique in this country, Islam is very far down the list of social taboo's and to me of least concern, mainly because there are plenty of voices criticising Islam already.\n\nSuch as? What can you not talk about or critique without the fear of arrest or violent retaliation?\n\n",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1490729777.0,
    "date_created": "2017-03-28",
    "time_created": "07:36:17",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfj4dbx",
    "parent_id": "t1_dfic4q7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yeah, tell that to Theo Van Gogh, or Salman Rushdie, or the Danish cartoonist. \"Don't worry lads, you're free to criticise Islam, go right ahead\". Give me a break",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1490764236.0,
    "date_created": "2017-03-28",
    "time_created": "17:10:36",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfip2ah",
    "parent_id": "t1_dfiar9y",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[Some guy was arrested for reading a Churchill quote about Islam](http://www.telegraph.co.uk/news/uknews/crime/10792895/Election-candidate-arrested-over-Churchill-speech.html)\n\nGranted the guy seems like a bit of a cunt, but that's not a crime. Or at least it shouldn't be in my opinion.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1490747911.0,
    "date_created": "2017-03-28",
    "time_created": "12:38:31",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfip3p2",
    "parent_id": "t1_dfiar9y",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Who is the highest profile figure who has criticised islam without being accused of racism?",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1490747952.0,
    "date_created": "2017-03-28",
    "time_created": "12:39:12",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi60y0",
    "parent_id": "t1_dfi5y3c",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Religion as source of hope and meaning is abused as a means of social control. Historically this has rarely led to good things. ",
    "controversiality": 0,
    "ups": 57,
    "downs": 0,
    "score": 57,
    "created": 1490714320.0,
    "date_created": "2017-03-28",
    "time_created": "03:18:40",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi6v9o",
    "parent_id": "t1_dfi5y3c",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 1,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490716743.0,
    "date_created": "2017-03-28",
    "time_created": "03:59:03",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfisajd",
    "parent_id": "t1_dfi5y3c",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "We have cognitive behaviour therapy now. You only need to do it for a few weeks to get the benefits, not devote your whole life.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490751238.0,
    "date_created": "2017-03-28",
    "time_created": "13:33:58",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi5nvk",
    "parent_id": "t1_dfi5it8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Having a religion is like having a penis. It's OK to have one, but don't talk about it all the time, don't let it rule your life, and don't force it onto other people.",
    "controversiality": 0,
    "ups": 134,
    "downs": 0,
    "score": 134,
    "created": 1490713354.0,
    "date_created": "2017-03-28",
    "time_created": "03:02:34",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi89v4",
    "parent_id": "t1_dfi5it8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "At the risk of being down voted heavily. I don't want religion to go away. I myself am not religious nor did I come from a family that was. \n\nBut it seems one of the things that actually bind people together, no matter what you think of most religion the basic premise is good intentioned.\n\nSo many people are so entwined with the system of belief that to take that away from everyone could possibly leave a giant hole in our lives. The way I've heard it explained is the human mind craves irrationality so that it can continue being rational where it counts. Whether that is the case or not I think that with utterly no religion we'd be worse off as a species. \n\n ",
    "controversiality": 0,
    "ups": 66,
    "downs": 0,
    "score": 66,
    "created": 1490721133.0,
    "date_created": "2017-03-28",
    "time_created": "05:12:13",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi9cw7",
    "parent_id": "t1_dfi5it8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Governments and People in power have always wanted to control the masses, Religion was just the way in the old days, now they want to use technology to do it",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1490724595.0,
    "date_created": "2017-03-28",
    "time_created": "06:09:55",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfidarn",
    "parent_id": "t1_dfi5it8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I can't believe that the Canadians have just enacted a blasphemy law. I also can't believe that the UK gymnastics association recently enforced a blasphemy edict on one of its own athletes. \n\nSo what if you take the piss out of a religion? We would never have gotten this far without it. At some point it was offensive to say that the earth was globular and not at the centre of the heavens. Should we protect those religious sensitivities too?  \n\n\n/rant\n\n(Sorry - I know you agree...)",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1490733583.0,
    "date_created": "2017-03-28",
    "time_created": "08:39:43",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi6blm",
    "parent_id": "t1_dfi5it8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I completely agree. If it was perceived as a hobby there would be far less problems.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1490715146.0,
    "date_created": "2017-03-28",
    "time_created": "03:32:26",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi5quj",
    "parent_id": "t1_dfi5it8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Moved on from what, wanting answers to fundamental questions about the nature of the universe, life and death?",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1490713572.0,
    "date_created": "2017-03-28",
    "time_created": "03:06:12",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfib7yc",
    "parent_id": "t1_dfi5it8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> religion has no place in school ... It should be treated the same as magic and fantasy and ghost stories\n\nSo you're saying that magic, fantasy and ghost stories have no place in schools? Damn - what will Harry Potter fans do now?",
    "controversiality": 0,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1490729515.0,
    "date_created": "2017-03-28",
    "time_created": "07:31:55",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi74o5",
    "parent_id": "t1_dfi5it8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> It should be treated the same as magic and fantasy and ghost stories.\n\napart from the centuries and centuries of civilisation, culture and history that's tied to religion, but sure, this works as a snappy reddit comment.",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490717545.0,
    "date_created": "2017-03-28",
    "time_created": "04:12:25",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfib471",
    "parent_id": "t1_dfi5it8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Well, consider this; we've had evidence of religion stretching back as long as 30,000 years.  Maybe, true or false, society needs religion. Maybe some necessary archetypes in a human societal group of significant size need a structured precedent for ideas to be introduced to them without logical explanation.  There's a cold, empirical way of looking at it of which I'm not a particular fan.\n\nTo put it another way: shit often goes south when you forcibly remove religion from the cultural melting pot (a pot of which no-one is really clear on the ingredients).  Maybe we need it perhaps?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490729272.0,
    "date_created": "2017-03-28",
    "time_created": "07:27:52",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfijpk9",
    "parent_id": "t1_dfi5it8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think I might go as far as allowing religious texts to be studied in school, in much the same way as Literature classes would study Shakespeare etc. and analyse the work and write essays about styles, themes and meanings.\n\nBecause there is some insight to be drawn from various holy books, that is entirely distinct from assertions around their provenance. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490742171.0,
    "date_created": "2017-03-28",
    "time_created": "11:02:51",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfjvk5c",
    "parent_id": "t1_dfi5it8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Humans should have moved on by now.\n\nThis is an amazingly naive statement when Trump is president of the U.S. and the UK is equally full of brainwashed post-truth cretins that get their news from the Daily Mail and the Sun.\n",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490806625.0,
    "date_created": "2017-03-29",
    "time_created": "04:57:05",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi8jew",
    "parent_id": "t1_dfi5it8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490722001.0,
    "date_created": "2017-03-28",
    "time_created": "05:26:41",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi97tu",
    "parent_id": "t1_dfi95go",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yes, it is a completely feudal system of undemocratic control. That's why it should be subject to even more scrutiny, imho.\n",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1490724165.0,
    "date_created": "2017-03-28",
    "time_created": "06:02:45",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfj3m37",
    "parent_id": "t1_dfi95go",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Because conservative Sunni Islam is essentially just a cult.\nTells you what you can eat, drink, wear, how to dress, who you associate with, how you structure your day even changing you damn name.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490763386.0,
    "date_created": "2017-03-28",
    "time_created": "16:56:26",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi5nbu",
    "parent_id": "t1_dfi536k",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1490713314.0,
    "date_created": "2017-03-28",
    "time_created": "03:01:54",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi8cm8",
    "parent_id": "t1_dfi536k",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You don't understand because you aren't actually thinking about it, the former two are deluded scientific (as in, they're material and can be objectively assessed) ideas believed in direct contravention with established, proven fact, whereas the latter is an umbrella word for the philosophical approaches to ethereal questions on existence's origin and purpose. Whilst religions can and do push in many areas unscientific beliefs, you can not dismiss and ridicule the entire subject out of hand as unscientific because the topic is not primarily a scientific one. You can of course choose to ridicule all religion out of hand under the pretence of science, but to do so is to be little better than a snob and a school bully who taunts those with different interests.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1490721385.0,
    "date_created": "2017-03-28",
    "time_created": "05:16:25",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfib3fr",
    "parent_id": "t1_dfi536k",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Or indeed political views. We all have them (or we wouldn't be here). We also sit down every day to see and hear our views criticised, mocked and ridiculed by those who oppose our views, and accept that as the price of living in a free society. Would any of us really want to live in a one party state, where just one political view, even if it were our own, was the only one that beyond criticism? Where mockery and satire of that view were banned? And yet that's what Islam asks for today. \n\nIt is through ridicule and satire and mockery that debate and discussion occur, and it strikes me as strange that people in this thread seem to think that we ought to debate in a respectful manner. Would they argue that TV like Spitting Image ought to be banned as well for being disrespectful? ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490729226.0,
    "date_created": "2017-03-28",
    "time_created": "07:27:06",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfie41m",
    "parent_id": "t1_dfi90gq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Nothing Muslims can really do to counter act other Muslims murdering non believers,  It is in their holy book after all ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1490734897.0,
    "date_created": "2017-03-28",
    "time_created": "09:01:37",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi5qys",
    "parent_id": "t1_dfi5b04",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Reddit in a nutshell with those \"edgy\" and \"edgelord\" comments.\n\nAmerica is still very religious I suppose. ",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1490713580.0,
    "date_created": "2017-03-28",
    "time_created": "03:06:20",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi6pwo",
    "parent_id": "t1_dfi5b04",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It's a meme because there are people who are atheists but never mention it (Can't remember the last time I actually mentioned I was an atheist in literally years) and then there are insufferable atheists who will basically complain about religion in between breaths and use the most incredibly sensationalist language to do it.\n\nLike calm down buddy we get that you're a rebel because you told mum and dad you're not going to church any more.",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1490716301.0,
    "date_created": "2017-03-28",
    "time_created": "03:51:41",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfia7ei",
    "parent_id": "t1_dfi5b04",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">but in a society which values rationality or critical thinking\n\nThere's your problem. We don't exist in a society which values either of those things. If we did elections and referendums wouldn't be fought on platitudes and lies and reality TV wouldn't exist.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1490727032.0,
    "date_created": "2017-03-28",
    "time_created": "06:50:32",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfieh7z",
    "parent_id": "t1_dfi5b04",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Unfortunately I don't think we do value critical thinking or rationality as a society. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490735457.0,
    "date_created": "2017-03-28",
    "time_created": "09:10:57",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfio89m",
    "parent_id": "t1_dfi5b04",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "People adopt a meme to try and belittle you when they have no rational point to make that might invalidate your position.\n\nIt shouldn't be a surprise its offended religious people that have to resort to that, I mean what else are they going to do, say 'no sky fairies are totally real man cos of erm…. oh shit its bollocks isn't it'.\n\nI think its the american part of reddit that does it the most, their societies have far more church goers than here so in dismissing religion you're against their 'norm' which makes them uncomfortable.\n\nTo be fair it can be hard to accept youve been fooled, I feel sorry for them more than anything else.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1490747049.0,
    "date_created": "2017-03-28",
    "time_created": "12:24:09",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7oad",
    "parent_id": "t1_dfi5b04",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">I wonder why there's a backlash against edgy atheists on reddit????\n\n>compares religion to fairy tales in a thread where multiple other posters compare it to a cult or mental illness\n\nYeah I'm really stumped by that one fella, can't figure it out for the life of me.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1490719217.0,
    "date_created": "2017-03-28",
    "time_created": "04:40:17",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiebj0",
    "parent_id": "t1_dfi5b04",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I agree with your first point, but I completely disagree with your second. Rather than placing religion in the realm of fairy tales which itself seems a bit belittling I think it would be better to discuss it like philosophy. There is an overlap to fairy tales because of the many moral allegories in religious texts, but as a whole I've always seen religion as more of a philosophy and each one choosing a different path to answers to existential questions and discussing respective ideals on morality. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490735219.0,
    "date_created": "2017-03-28",
    "time_created": "09:06:59",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi6r13",
    "parent_id": "t1_dfi5w8k",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "...jainism?",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1490716392.0,
    "date_created": "2017-03-28",
    "time_created": "03:53:12",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi5ys4",
    "parent_id": "t1_dfi5w8k",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "you don't say!",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1490714156.0,
    "date_created": "2017-03-28",
    "time_created": "03:15:56",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi662n",
    "parent_id": "t1_dfi5w8k",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Which one, Islam or Judaism? ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1490714713.0,
    "date_created": "2017-03-28",
    "time_created": "03:25:13",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfj9xgm",
    "parent_id": "t1_dfi5w8k",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[Sure mate](https://youtu.be/Fru-hI1hu5M). Christians are just as retarded. And people don't mock Judaism because they keep to themselves and most attacks on them are from deeply troubling people. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490770984.0,
    "date_created": "2017-03-28",
    "time_created": "19:03:04",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfja0cx",
    "parent_id": "t1_dficw7e",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I mean, you're a literal fascist so you should probably turn the mirror round with that 'political ideologies are cults' idea. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490771091.0,
    "date_created": "2017-03-28",
    "time_created": "19:04:51",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfjwics",
    "parent_id": "t1_dfjv047",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "it's just a coincidence. Or is it a miracle? A sign! He's left us a sign!",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490809647.0,
    "date_created": "2017-03-29",
    "time_created": "05:47:27",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi9u7r",
    "parent_id": "t1_dfi6873",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Kind of agree, kind of disagree.\n\n>Faith and religion are two different things, you can have faith in a god without going to a building once a week to sing, or by cutting a bit of your genitals off, or wear this, don't wear this, don't eat this, grow this and so and so on.\n\nAgree - faith and organised religion are different.  \n\nAnd some of the practices of organised religion should be critically examined, to work out if they have any place now.  Context should be examined in determining whether a practice has anything to do with \"faith\", or whether it is an established tradition which no longer serves the purpose it once did.\n\nThe Torah contains hundreds and thousands of rules and regulations, which served a purpose at the time they were written.  Food handling, hygiene, disease control etc etc - most of which have little or no relevance to the world we live in.  \n\nSome see those rules as a path to god, others follow them because they have been told to.  And that brings me to the bit I disagree with...  I don't see a problem with \"organised religion\", though I have (obviously) a massive problem with what has been done, and is done, in the \"name\" of those religions.\n\nIf a religion expects behaviour that the wider population deems wrong (rather than stupid or illogical) then that behaviour should be stopped - but if people decide they don't want to shave, or they want to have two fridges, what harm does it do anyone else? ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490726017.0,
    "date_created": "2017-03-28",
    "time_created": "06:33:37",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfisqh0",
    "parent_id": "t1_dfijdsg",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That was a good bit of acting from a man who isn't John Cleese as John Cleese on behalf of John Cleese.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1490751698.0,
    "date_created": "2017-03-28",
    "time_created": "13:41:38",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfirshr",
    "parent_id": "t1_dfinghq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490750732.0,
    "date_created": "2017-03-28",
    "time_created": "13:25:32",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfikgmb",
    "parent_id": "t1_dfidbch",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "With the amount of shitty photoshopping that far-right Facebook groups do to \"prove\" how they're being opressed by stuff.\n\nI half expect most of those Tumblr/Twitter stuff to be made by them.\n\nBritain First is fucking incapable of doing it properly either\n\nhttps://s-media-cache-ak0.pinimg.com/736x/a3/b9/0c/a3b90c2bb20bf64a6e461f826cd00955.jpg\n\nhttps://exposingbf.files.wordpress.com/2016/03/ebf-bf-michelle-obama-photoshop-voting-trump.png?w=700\n\nhttps://pbs.twimg.com/media/Cg0nzxoWwAEocQt.jpg\n\nhttps://intothatdarkness.files.wordpress.com/2016/07/ebf-bf-photoshop-refugee-lies.jpg?w=616\n\n[And UKIP](https://1.bp.blogspot.com/-I_OQMgsOXqc/WJnXY0yDoJI/AAAAAAAADIM/Kgs-EpXRsj4XcDnMBy4xhVgEbYrAKwB4QCLcB/s1600/UKIP%2Bfake%2Bcorbyn%2Bphoto%2BStoke.png)",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1490743021.0,
    "date_created": "2017-03-28",
    "time_created": "11:17:01",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiws0l",
    "parent_id": "t1_dfidbch",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Instead of interpreting such complains literally, try looking at why people are actually annoyed and you might understand the reason people are complaining.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490755999.0,
    "date_created": "2017-03-28",
    "time_created": "14:53:19",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiflpf",
    "parent_id": "t1_dfi7wum",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "that's a impossible request, all we can do is have a robust legal framework for keeping society as safe as realistically possible.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1490737058.0,
    "date_created": "2017-03-28",
    "time_created": "09:37:38",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfieri8",
    "parent_id": "t1_dfi7wum",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "But if that's the issue then what's the point of saying we should 'stand up for our right'? I mean no fucking shit people shouldn't have to be afraid for their lives after criticising Islam, but murder is a crime, death threats are a crime, the state provides protection for those who are at risk and actively works to find and detain people who might be involved in plots against them. There's not much more that can physically be done to stop a handful of people hellbent on murder, so how are we as random individuals meant to 'stand up' exactly?",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1490735879.0,
    "date_created": "2017-03-28",
    "time_created": "09:17:59",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiajkz",
    "parent_id": "t1_dfi7wum",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Every European state and its services work tirelessly to provide protection from violent consequences for criticizing Islam. You can't have it much better from that side.\n\nThe thing is, many people go from that point to a desire of doing *something* with potential perpetrators, the general Muslim population, and succumb to all kinds of violent fantasies.",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1490727913.0,
    "date_created": "2017-03-28",
    "time_created": "07:05:13",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7o4n",
    "parent_id": "t1_dfi6iam",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "just re posting this the issue is basically summarized here. AS far as I'm aware there are no other religions where youll get murdered for drawing a stick man.\n\nhttps://www.youtube.com/watch?v=1VwpwP_fIqY",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1490719204.0,
    "date_created": "2017-03-28",
    "time_created": "04:40:04",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfio4uy",
    "parent_id": "t1_dfinasa",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You'll have to expand? Or was this under the wrong comment.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490746949.0,
    "date_created": "2017-03-28",
    "time_created": "12:22:29",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi9y1y",
    "parent_id": "t1_dfi9tsn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Why is God on my money? Why is God in my national anthem? Why are laws still present in NI based on outdated religious nonsense? Why do I have to have Easter off? You are either understating the affect other religions have on our lives, or you're overstating what Islam is.\n\nIt is just another religion, in a world where religion is far too powerful, and its fucking stupid, just like all the rest.",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1490726326.0,
    "date_created": "2017-03-28",
    "time_created": "06:38:46",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dficjh3",
    "parent_id": "t1_dfi9tsn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> and wants those who are not Islamic to abide by those same laws.\n\nSome extreme or fundamentalist interpretations of Islam do. Most do not. Sharia law, for most, is a code of law for Muslims to follow. \n\nMeanwhile, laws in the west for a **very long time** have been based on Christian values, such as rulings on homosexuality or gay marriage. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1490732238.0,
    "date_created": "2017-03-28",
    "time_created": "08:17:18",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfjvtkd",
    "parent_id": "t1_dfjvrhm",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "This is the third time that someones replied, using that quote specifically, and I can't tell if you're saying people don't actually say these things (they do, i provided some links), or you're saying these things are actually true (they're not), or you've misread it.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490807460.0,
    "date_created": "2017-03-29",
    "time_created": "05:11:00",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfjzapy",
    "parent_id": "t1_dfjz9he",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Read my fucking post dude :D",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490817071.0,
    "date_created": "2017-03-29",
    "time_created": "07:51:11",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi61rn",
    "parent_id": "t1_dfi5ap1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Christopher Hitchens and Richard Dawkins are two people who spring to mind that vehemently criticised Islam in public and suffered no negative legal consequences as a result.",
    "controversiality": 0,
    "ups": 73,
    "downs": 0,
    "score": 73,
    "created": 1490714385.0,
    "date_created": "2017-03-28",
    "time_created": "03:19:45",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi9x54",
    "parent_id": "t1_dfi5ap1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That reasoning is pretty circular in many cases - it's not surprising that people who hate Muslims and think they're violent wouldn't speak out against Islam if they're not anonymous.\n\nThat doesn't \"say a lot\".",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490726253.0,
    "date_created": "2017-03-28",
    "time_created": "06:37:33",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiavit",
    "parent_id": "t1_dfi8ylj",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Why are [children being arrested for burning The Quran?](http://www.dailymail.co.uk/news/article-1332877/Girl-arrested-Facebook-footage-Koran-burning-school.html)\n\nHow does that incite hatred against Muslims as a group or invite discrimination against them? Would those children have been arrested for burning a Bible or a copy of The Communist Manifesto?",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1490728723.0,
    "date_created": "2017-03-28",
    "time_created": "07:18:43",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi60lp",
    "parent_id": "t1_dfi5gkq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Were they legally prohibited from criticising Islam? No. The people attacking them however were cowardly cunts (although I'm not familiar with Bill Leak).",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1490714297.0,
    "date_created": "2017-03-28",
    "time_created": "03:18:17",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi695f",
    "parent_id": "t1_dfi5gkq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "All those three were allowed to say what they want with no legal consequences. There were then protests/illegal violence but they were still free to criticise Islam and did",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1490714956.0,
    "date_created": "2017-03-28",
    "time_created": "03:29:16",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7hxv",
    "parent_id": "t1_dfi5gkq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "As would a Glasgow shopkeeper ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1490718671.0,
    "date_created": "2017-03-28",
    "time_created": "04:31:11",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfj0bln",
    "parent_id": "t1_dfi82wr",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Phobia means irrational fear. If your gay cousin said that they were going on vacation to Mecca, would your fear for them be irrational? There's no such thing as cancerphobia, as having a fear of being ill is rational. There's no such thing as Islamaphobia because certain groups have reason to fear how Islam could impact their life negatively.\n\nI support Trump, if someone told me that they had a phobia of Trump, I would tell them that their fear isn't irrational. With Trump came a different set of ideas that the US hadn't experienced in years, so I get that it's not irrational for them to fear for how their lives may change. It's the same with Islam except the religion has seemingly emerged from hibernation since the 7th Century which makes it more harming for society than changes to some fiscal and domestic policies.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490759809.0,
    "date_created": "2017-03-28",
    "time_created": "15:56:49",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfjoy38",
    "parent_id": "t1_dfi82wr",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Right? Imagine if people started calling pro-choice people \"christanophobes\". ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490790718.0,
    "date_created": "2017-03-29",
    "time_created": "00:31:58",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiasyz",
    "parent_id": "t1_dfi82wr",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The French get a lot of unfair flack for difficulties in their last few wars but *this* cowardice  - *this* fear to even attempt to protect their own culture in their own nation - is startling and it somewhat justifies the mocking that they get for surrendering easily. ",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490728553.0,
    "date_created": "2017-03-28",
    "time_created": "07:15:53",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7pk6",
    "parent_id": "t1_dfi7nlk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yeah. Many do.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1490719333.0,
    "date_created": "2017-03-28",
    "time_created": "04:42:13",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi605f",
    "parent_id": "t1_dfi5rr8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "There's a reason for that, because incitement to hatred can take many forms that won't necessarily stay the same or be the same in every case. It's right that it be interpreted, by judges and the CPS.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1490714262.0,
    "date_created": "2017-03-28",
    "time_created": "03:17:42",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi9vs9",
    "parent_id": "t1_dfi7dyq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1490726142.0,
    "date_created": "2017-03-28",
    "time_created": "06:35:42",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfibfo7",
    "parent_id": "t1_dfi7dyq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "If you hear hooves, think horses. Let's not be silly now. MI5 were monitoring them for a reason.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1490729986.0,
    "date_created": "2017-03-28",
    "time_created": "07:39:46",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiai18",
    "parent_id": "t1_dfi7dyq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Come off it. Islamophobes suck, but don't play blind",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490727802.0,
    "date_created": "2017-03-28",
    "time_created": "07:03:22",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfibt2a",
    "parent_id": "t1_dfi7dyq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Oh goodness, please don't be so naive. It was a scumbag imfluenced by his barbaric and ridiculous religion to commit the acts he did. Probably radicalized in prison. We all knew it waa a muslim before we found out, we don't have fucking hindus commiting regular terror acts in the west do we. Please.",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490730788.0,
    "date_created": "2017-03-28",
    "time_created": "07:53:08",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi8dh1",
    "parent_id": "t1_dfi7fjw",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Read the wiki entry on it.  The cartoons were printed in a small newspaper, no one paid attention until a group of Danish imams went to the middle east to advertise them (and even add their own fake caricatures to make the Danes look even worse). They wanted to incite violence and show the west that we can't mess with them. And it worked. Charlie Hebdo reprinted them as a show of solidarity and the rest is history. Now we even have many well meaning people who say that the caricaturists went \"too far\", and this was islamists' end game, to blame ourselves for their own violence. In the end the Danish newspaper and Charlie hebdo were both very small newspapers that had been making fun of religion (for decades in the case of CH, with much worse caricatures of christianity) , and no one would have paid attention if islamists didn't intervene. Now they've managed to shut us down and we won't see anymore caricatures of their religion, and many well meaning people will think it's a great thing. Respect earned through violence. ",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1490721463.0,
    "date_created": "2017-03-28",
    "time_created": "05:17:43",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfio76q",
    "parent_id": "t1_dfi7fjw",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">they were also offensive to the vast swathe of Muslims in the country that really respect the rule of law\n\nThat's their problem though. Offense is taken, not given.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1490747017.0,
    "date_created": "2017-03-28",
    "time_created": "12:23:37",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi8794",
    "parent_id": "t1_dfi7fjw",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think the whole question comes down to the right to be offensive, is that part of free speech or not?  Look at the horrific anti-semitic cartoons (please google if you have not seen them) that the Arab papers in the middle east print, look at our papers with regards to other religions / terrorists, then look again at the Mohammed cartoons, is there any difference?  \n\nRegarding provocation, I understand its sensitive, which is why they should have printed them with essays, one saying they should not have been published and one saying why they should.\n\nAlso we have competing ideals here, is our right to free speech (& by proxy to offend) more important than your right not to be offended?  I think we have to say yes, otherwise other people's fears become a kind of tyranny.  It also has to be put into its historical context, this idea of death if you depict Mohammed is quite a recent phenomena, there are lots of depictions in Islamic history & its not even mentioned in the Quran.\n\nAt the end of the day, in a free society, your freedom to declare death to a cartoonist for a one frame picture is not greater than that cartoonist's (or by proxy any publisher of said cartoon) right to draw and show that cartoon.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1490720902.0,
    "date_created": "2017-03-28",
    "time_created": "05:08:22",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiapgj",
    "parent_id": "t1_dfi7fjw",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "And? Christian beliefs are mocked on a daily basis all across the West (and deservedly so), and I can't recall a single \"liberal\" ever being outraged about being \"offensive to the vast swathe of Christians\" who are decent people. Only the Muslims.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1490728317.0,
    "date_created": "2017-03-28",
    "time_created": "07:11:57",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfijbro",
    "parent_id": "t1_dfi7fjw",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">  they were also offensive to the vast swathe of Muslims in the country that really respect the rule of law. So you end up shitting on a whole group of innocent bystanders just to make a point to a small fringe.\n\nYou mean like Life of Brian?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490741734.0,
    "date_created": "2017-03-28",
    "time_created": "10:55:34",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfjciep",
    "parent_id": "t1_dfi7fjw",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> but they were also offensive to the vast swathe of Muslims in the country that really respect the rule of law. So you end up shitting on a whole group of innocent bystanders just to make a point to a small fringe.        \n\nWho cares? I see things that offend me every day, without the urge for violence.         \n\nA particular sky pixie belief does not give you the right to never be offended.         \n\n",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490774271.0,
    "date_created": "2017-03-28",
    "time_created": "19:57:51",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7k0v",
    "parent_id": "t1_dfi7fjw",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No the problem was papers didn't want to be attacked. \n\nChilling effect.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1490718846.0,
    "date_created": "2017-03-28",
    "time_created": "04:34:06",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi80e1",
    "parent_id": "t1_dfi7al7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It's actually allowed now\n\nhttps://www.google.co.uk/amp/s/amp.theguardian.com/law/2017/mar/14/employers-can-ban-staff-from-wearing-headscarves-european-court-rules",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490720294.0,
    "date_created": "2017-03-28",
    "time_created": "04:58:14",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi8fc3",
    "parent_id": "t1_dfi7iau",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No, people like me criticise Islam online because aside from right wing nutters we don't see anyone else doing it publicly. It's frustrating, Islam is like conservative Christians,  I wish they were both treated equally bad by humourists, politicians and journalists. ",
    "controversiality": 1,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1490721633.0,
    "date_created": "2017-03-28",
    "time_created": "05:20:33",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfidks3",
    "parent_id": "t1_dfidb7m",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I was replying to someone who asked me about questions science can't answer. There are many.\n\nAs to the original point, I am arguing that we clearly do have the right to criticise religion, a right that is protected in law. This article (as far as I can tell) is basically asking for the right to say mean things about a group they don't like without any consequence whatsoever.\n\nWhich I do not agree with.\n\nIf I was being less generous I might say the article is dog whistling racists (xenophobes? Creedists? What is the word for people who hate other religions?) into taking political action against a religious group. Which, naturally I also disagree with.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490734042.0,
    "date_created": "2017-03-28",
    "time_created": "08:47:22",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiisoa",
    "parent_id": "t1_dfidb7m",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think his point was to strike a reasonable ground whereasmostof what's going on in this thread is \"lol religion dumb\".",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490741118.0,
    "date_created": "2017-03-28",
    "time_created": "10:45:18",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfirmxz",
    "parent_id": "t1_dfidb7m",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> I don't really see how your post addresses the topic of \"is it OK to criticise islam\".\n\nI think it's in response to several of the current top comments, which are in the /r/atheism-style \"all believers are idiots anyway\" vein.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490750575.0,
    "date_created": "2017-03-28",
    "time_created": "13:22:55",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfjfmsj",
    "parent_id": "t1_dfidb7m",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Religion isn't philosophy. Maybe for the founder, but for the rest, it's just blind acceptance.\n\nReligions sometimes catch philosophy though, and they're never the same after.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490778196.0,
    "date_created": "2017-03-28",
    "time_created": "21:03:16",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi6f16",
    "parent_id": "t1_dfi61mw",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Nobody's talking about denying you any rights.",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1490715418.0,
    "date_created": "2017-03-28",
    "time_created": "03:36:58",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi6llk",
    "parent_id": "t1_dfi61mw",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I don't think anybody wants to deny you your rights, I think many would like to see productive and mature dialogue occur, though, instead.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1490715948.0,
    "date_created": "2017-03-28",
    "time_created": "03:45:48",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfidx99",
    "parent_id": "t1_dfi61mw",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "criticism=/=being denied rights ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490734603.0,
    "date_created": "2017-03-28",
    "time_created": "08:56:43",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi73iq",
    "parent_id": "t1_dfi61mw",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yeah, you have a right to be a cunt, but that doesn't me you have an obligation to be one.\n\nI think the suggestion is that if you actually care about making the world better, getting along with each other, then being respectful will get you further than yelling \"go home Paki\" from your speeding Honda Accord on a Friday night.",
    "controversiality": 1,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1490717442.0,
    "date_created": "2017-03-28",
    "time_created": "04:10:42",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfif17j",
    "parent_id": "t1_dfi61mw",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "He didn't suggest denying you your right to mock things\n\nHe also didn't argue that you shouldn't mock things due to \"people's feelings\", it was a far more complex argument than that \n\n...oh well. ",
    "controversiality": 0,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1490736261.0,
    "date_created": "2017-03-28",
    "time_created": "09:24:21",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfjab2k",
    "parent_id": "t1_dfi8zte",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Source your ass.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490771480.0,
    "date_created": "2017-03-28",
    "time_created": "19:11:20",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfit9vm",
    "parent_id": "t1_dfi6tup",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Wow, you could have spent your time learning instead of reading all that shit. Try a history book, they're much better for putting religion in to context. Theologists tend to have an axe to grind. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490752254.0,
    "date_created": "2017-03-28",
    "time_created": "13:50:54",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfklf28",
    "parent_id": "t1_dfjg2rt",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It's kind of good, but you have to remember that half of the time those doing the mocking are also ignorant of the facts.\n\nThe majority of people generally don't know what they're on about. I've been guilty of it myself before, as with everyone else.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490843345.0,
    "date_created": "2017-03-29",
    "time_created": "15:09:05",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi5pl5",
    "parent_id": "t1_dfi5f9t",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Didn't Wahhabism form in the 18th/19th century?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490713479.0,
    "date_created": "2017-03-28",
    "time_created": "03:04:39",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi5zdc",
    "parent_id": "t1_dfi5f9t",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Exactly. Islam has far more to do with geopolitics than 'staying true to the good book'",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490714201.0,
    "date_created": "2017-03-28",
    "time_created": "03:16:41",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfid06o",
    "parent_id": "t1_dfi5kc1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> And their partner in tedium, the 2edgy4u crew who don't get that breaking a taboo is neither sufficient nor necessary for satire.\n\nCharlie Hebdo?",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1490733082.0,
    "date_created": "2017-03-28",
    "time_created": "08:31:22",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfihmjk",
    "parent_id": "t1_dfi65fy",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Personally, the more I've been called a Nazi or a racist, the less effort I put into adding disclaimers (eg. not all muslims) and peppering my words.\n\nThe word police are just irritating. It's self-fulfilling.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1490739693.0,
    "date_created": "2017-03-28",
    "time_created": "10:21:33",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi6qh9",
    "parent_id": "t1_dfi65fy",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That's the other funny thing. Your politics could be to the left of Karl Marx, but make a critical comment about Islam and some left leaning wingnut will describe you as an extreme right wing fascist.",
    "controversiality": 1,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1490716348.0,
    "date_created": "2017-03-28",
    "time_created": "03:52:28",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfj3twy",
    "parent_id": "t1_dfi6qhz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I only found out about the inbreeding recently. It's been happening for thousands of years though, and doesn't appear to have any impact on fertility. Just leads to birth defects and mental issues from what i can recall. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490763623.0,
    "date_created": "2017-03-28",
    "time_created": "17:00:23",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfic3ys",
    "parent_id": "t1_dfi6r86",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[I wonder how we'll identify these \"pseudo-citizens\"...](http://erin-gee.ca/wp-content/uploads/2015/11/B8S86rCCEAIqP1e.png)",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1490731401.0,
    "date_created": "2017-03-28",
    "time_created": "08:03:21",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7lwk",
    "parent_id": "t1_dfi7iov",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "absolutely not.\n\nI just don't get how having more loonies is somehow makes it acceptable?",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1490719008.0,
    "date_created": "2017-03-28",
    "time_created": "04:36:48",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfijjih",
    "parent_id": "t1_dfi7iov",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I mean, it's not real...",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490741978.0,
    "date_created": "2017-03-28",
    "time_created": "10:59:38",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfighrz",
    "parent_id": "t1_dfi7shk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "More blood has been shed in the name of Christ than all other religions combined. There was a period of 800 or so years where anyone that disagreed with the Catholic church was tortured until they recanted and then burned at the stake. And let's not forget the child sex rings that we keep finding in the Catholic church.\n\nBut yeah, totally not as bad as Muslims.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1490738246.0,
    "date_created": "2017-03-28",
    "time_created": "09:57:26",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfib2d4",
    "parent_id": "t1_dfi7shk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Because I think all religions are regressive and I learn from history to not compare them. A lot of People nod their heads in approval when moderate Christians ignore illogical or hateful scriptures, yet the same people can't cope with the idea there are moderate Muslims who would do the same. \n\nSay we got rid of Islam, then what? What is to stop Buddhist from saying Christianity is a hateful religion with a history of bloodshed and start a religious war(I would love to see Shaoling vs Crusader). Comparing religions is pointless, proving one religion is more peaceful than another doesn't mean people will jump ship and convert. \n",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490729158.0,
    "date_created": "2017-03-28",
    "time_created": "07:25:58",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfj4yl5",
    "parent_id": "t1_dfj4dbx",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "or Charlie Hebdo.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1490764915.0,
    "date_created": "2017-03-28",
    "time_created": "17:21:55",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi65uy",
    "parent_id": "t1_dfi60y0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Indeed it is, hence why secularism is key. There are however countless millions of people who have been 'saved ' by religion. I think it has its place and can be a force for good",
    "controversiality": 0,
    "ups": 55,
    "downs": 0,
    "score": 55,
    "created": 1490714697.0,
    "date_created": "2017-03-28",
    "time_created": "03:24:57",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7x83",
    "parent_id": "t1_dfi6v9o",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Your a nasty piece of work aren't you? People finding comfort in belief in a higher power, and enjoying the community and strength that faith gives them does not make them mentally ill. Intolerant atheist fundamentalists like you are little different from the same religious extremists you despise. ",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490720013.0,
    "date_created": "2017-03-28",
    "time_created": "04:53:33",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi8iv6",
    "parent_id": "t1_dfi6v9o",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Why so smug in speaking of mental illness? Religion, broadly speaking is like science in that is a field of enquiry, not into the observable measurable physical world but on such topics as purpose and the origin of existence, are these questions not valid simply because you can't try to explain them in a lab? To dismiss a subject that has been on the mind of humankind throughout its existence as a mental illness is to wilfully ignore the fact that religion is not there to comfort and respond to a set of needs, but because humans are inquisitive and intelligent and will seek to understand the world, and this characteristic has powered scientific discovery but also driven attempts to understand and answer the bigger questions, hence religion. ",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490721951.0,
    "date_created": "2017-03-28",
    "time_created": "05:25:51",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi6to8",
    "parent_id": "t1_dfi5nvk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "And certainly don't force it down kids' throats!",
    "controversiality": 0,
    "ups": 153,
    "downs": 0,
    "score": 153,
    "created": 1490716609.0,
    "date_created": "2017-03-28",
    "time_created": "03:56:49",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi6ixd",
    "parent_id": "t1_dfi5nvk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "deleted  ^^^^^^^^^^^^^^^^0.7650  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/14485)",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1490715730.0,
    "date_created": "2017-03-28",
    "time_created": "03:42:10",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfit3gf",
    "parent_id": "t1_dfi5nvk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I dunno, I look down on people for having religion, having a penis isn't a person's fault.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490752067.0,
    "date_created": "2017-03-28",
    "time_created": "13:47:47",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiej3w",
    "parent_id": "t1_dfi5nvk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The same is true of the right to criticise or ridicule a religion.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490735534.0,
    "date_created": "2017-03-28",
    "time_created": "09:12:14",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfidnf7",
    "parent_id": "t1_dfi89v4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "To quote the true genius of Terry Pratchett: \n\n>REALLY? AS IF IT WAS SOME KIND OF PINK PILL? NO. HUMANS NEED FANTASY TO BE HUMAN. TO BE THE PLACE WHERE THE FALLING ANGEL MEETS THE RISING APE.\n>\n>\"Tooth fairies? Hogfathers? Little—\"\n>\n>YES. AS PRACTICE. YOU HAVE TO START OUT LEARNING TO BELIEVE THE LITTLE LIES.\n>\n>\"So we can believe the big ones?\"\n>\n>YES. JUSTICE. MERCY. DUTY. THAT SORT OF THING.\n>\n>\"They're not the same at all!\"\n>\n>YOU THINK SO? THEN TAKE THE UNIVERSE AND GRIND IT DOWN TO THE FINEST POWDER AND SIEVE IT THROUGH THE FINEST SIEVE AND THEN SHOW ME ONE ATOM OF JUSTICE, ONE MOLECULE OF MERCY. AND YET—Death waved a hand. AND YET YOU ACT AS IF THERE IS SOME IDEAL ORDER IN THE WORLD, AS IF THERE IS SOME...SOME RIGHTNESS IN THE UNIVERSE BY WHICH IT MAY BE JUDGED.\n>\n>\"Yes, but people have got to believe that, or what's the point—\"\n>\n>MY POINT EXACTLY.” ",
    "controversiality": 0,
    "ups": 51,
    "downs": 0,
    "score": 51,
    "created": 1490734164.0,
    "date_created": "2017-03-28",
    "time_created": "08:49:24",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfidow8",
    "parent_id": "t1_dfi89v4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Religion may bind some people together, but with the big picture in mind religions have mainly caused divides in the human race.\n\nI say mainly as not all religions or variants of are so inflexible with other types of beliefs/ways of life.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1490734232.0,
    "date_created": "2017-03-28",
    "time_created": "08:50:32",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfio26o",
    "parent_id": "t1_dfi89v4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Read up on sociology, you just outlined one of Durkheim's original points he made as he founded the field back in the 19th century. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490746870.0,
    "date_created": "2017-03-28",
    "time_created": "12:21:10",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfick67",
    "parent_id": "t1_dfi89v4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I agree with you to a certain extent. But, just pointing out that the guy you're replying to didn't advocate abolishing religion wholesale. He said it has no place in work, school or government. Do you disagree with that? ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490732275.0,
    "date_created": "2017-03-28",
    "time_created": "08:17:55",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfibprf",
    "parent_id": "t1_dfi89v4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Where human society may have benefited from the social cohesion that religion fostered, there's no place for it in a modern society. \n\nSure people can find comfort in it. But you can find comfort in a kitten. \n\nReligion has never been good intentioned. Read the various scriptures. They are almost all thoroughly immoral. At best! The Christian church certainly tries to sell itself as loving and forgiving but that's not what their holy book says. Even the Jesus character in that book introduced the concept of hell to those that sinned. Good intentions my arse. ",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490730599.0,
    "date_created": "2017-03-28",
    "time_created": "07:49:59",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfixhvk",
    "parent_id": "t1_dfi9cw7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yeah you're right Jesus and St Paul were actually all searching for power to take over the world and governments and people in power never actually believe the religions they say",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490756779.0,
    "date_created": "2017-03-28",
    "time_created": "15:06:19",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi5tf6",
    "parent_id": "t1_dfi5quj",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "if you're looking for those answers in the Abrahamic religions you may be sadly disappointed with the results",
    "controversiality": 0,
    "ups": 59,
    "downs": 0,
    "score": 59,
    "created": 1490713755.0,
    "date_created": "2017-03-28",
    "time_created": "03:09:15",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi5vfu",
    "parent_id": "t1_dfi5quj",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 1,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1490713903.0,
    "date_created": "2017-03-28",
    "time_created": "03:11:43",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfj4arf",
    "parent_id": "t1_dfi5quj",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I have no problem with the concept of religion. Faith, belief, etc.\n\nMy problems with it come from the fact that it looks backwards instead of forwards. The basis of virtually every religion out there is some old book that promotes horrifically outdated and archaic values, and we're somehow supposed to find relevance in there for today's issues.\n\nWhy isn't there a 21st century God with 21st century commandments that actively encourages peace and love to ALL of humankind instead of 'everyone but the women, the gays, the infidels and assorted others'?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490764155.0,
    "date_created": "2017-03-28",
    "time_created": "17:09:15",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfibdy3",
    "parent_id": "t1_dfib7yc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490729882.0,
    "date_created": "2017-03-28",
    "time_created": "07:38:02",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7kaq",
    "parent_id": "t1_dfi74o5",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 1,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1490718869.0,
    "date_created": "2017-03-28",
    "time_created": "04:34:29",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfibfec",
    "parent_id": "t1_dfib471",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490729970.0,
    "date_created": "2017-03-28",
    "time_created": "07:39:30",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfibtz3",
    "parent_id": "t1_dfib471",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "There's evidence of cannibalism going that far back as well. Maybe we still need it in modern society?",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490730838.0,
    "date_created": "2017-03-28",
    "time_created": "07:53:58",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiewhp",
    "parent_id": "t1_dfib471",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "We also had polio and infanticide.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490736076.0,
    "date_created": "2017-03-28",
    "time_created": "09:21:16",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfimled",
    "parent_id": "t1_dfijpk9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490745310.0,
    "date_created": "2017-03-28",
    "time_created": "11:55:10",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi9azg",
    "parent_id": "t1_dfi8jew",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> they think it makes them more enlightened than they actually are\n\nFunnily enough, that's my main criticism of religion. It leaves many people satisfied with nonsense 'answers' to our core, existential, questions. Thankfully it also inspires some, like Newton, to dig deeper, and uncover information that can be directly put to use. Despite this information directly contradicting religious texts. \n\nHowever, the fact is that no one knows why, and we may never know. But with applied science, we may eventually know *how* things came to be. \n\nIt's a big universe, and I don't think goat farmers and carpenters figured it all out a few thousand years ago. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1490724431.0,
    "date_created": "2017-03-28",
    "time_created": "06:07:11",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi9gye",
    "parent_id": "t1_dfi5nbu",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Poor lass. No one should be threatened over a cartoon. Except maybe, for My Little Pony pornography. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1490724939.0,
    "date_created": "2017-03-28",
    "time_created": "06:15:39",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dficr64",
    "parent_id": "t1_dfi8cm8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'm cool with people having a faith, just don't govern by it. Govern with facts. Religion is the furthest from fact you can get. They really are made up stories by man. No fucking \"divine\" intervention happened that spurned the creation of ANY holy book. Because even though religion isn't based in science, we know magic doesn't exist.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490732632.0,
    "date_created": "2017-03-28",
    "time_created": "08:23:52",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfif1dv",
    "parent_id": "t1_dfi8cm8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> you can not dismiss and ridicule the entire subject out of hand as unscientific \n\nWhat? Yes you can. Religion literally isn't scientific. No part of any major religion even pretends to follow the scientific method.\n\nI agree with your point that religion provides philosophical insight into difficult questions, but no part of the answers given by Christianity, Islam, Judaism or any other major religion are in any way scientific.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1490736268.0,
    "date_created": "2017-03-28",
    "time_created": "09:24:28",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi9v94",
    "parent_id": "t1_dfi8cm8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "And what do you call someone who kills people because of their religion? I'd rather be a snob than a murderer.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490726101.0,
    "date_created": "2017-03-28",
    "time_created": "06:35:01",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfjeg41",
    "parent_id": "t1_dfi8cm8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">you can not dismiss and ridicule the entire subject out of hand as unscientific because the topic is not primarily a scientific one.\n\nBut you can and should dismiss and ridicule the entire subject out of hand as *irrational* because religion is a fundamentally irrational belief.\n\nAnd while everyone is entitled to their own beliefs, there's such a thing as public discourse of which religion current plays a big part. The idea that acknowledging the irrational nature of religion makes someone equivalent to a \"snob\" or a \"bully\" is absurd. Because the logical consequence of your position is that the act of publicly criticising religious beliefs for being irrational makes you a bad person.\n\nPeople shouldn't engage in bullying or snobbery when criticising religious beliefs, but you're suggesting the act of criticising religious belief is itself an example of bullying or snobbery.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490776718.0,
    "date_created": "2017-03-28",
    "time_created": "20:38:38",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiio4j",
    "parent_id": "t1_dfie41m",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Its all about liberalizing the religion. Christianity and Judaism have been liberalized, Islam has not. Put pressure on them to change.\n\nStart with getting them to give up on being against public display of Muhammad. Next come out strong against cousin marriages. Both of those things are exclusive to Islam and could easily be changed within one generation. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1490740965.0,
    "date_created": "2017-03-28",
    "time_created": "10:42:45",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiftoc",
    "parent_id": "t1_dfie41m",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Well, I don't think that's 100% true. They could reform the religion, make official doctrine that those passages are metaphorical etc - sort of like what believers of the Old Testament do.\n\nBut that's obviously far easier said than done. And who do I even mean when I say \"they\". Don't see how some dude from Oldham is going to do that!",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1490737362.0,
    "date_created": "2017-03-28",
    "time_created": "09:42:42",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiz6p9",
    "parent_id": "t1_dfie41m",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Actually, we can give support to the people like those in /r/exmuslim, many who fear for their own lives, to show that believing muslims must also stand up for them.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490758587.0,
    "date_created": "2017-03-28",
    "time_created": "15:36:27",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfk5vf6",
    "parent_id": "t1_dfi5qys",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Which is interesting, considering it (in theory) has a more robust/explicit separation of church and state than we do. But in practice their politics ends up being far more focused on Christianity.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490826923.0,
    "date_created": "2017-03-29",
    "time_created": "10:35:23",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dficgk9",
    "parent_id": "t1_dfi7oad",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1490732079.0,
    "date_created": "2017-03-28",
    "time_created": "08:14:39",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfih7im",
    "parent_id": "t1_dfi6r13",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yeah, but if they mess with Jainism, they've got Tarzan to deal with.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490739173.0,
    "date_created": "2017-03-28",
    "time_created": "10:12:53",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfinl32",
    "parent_id": "t1_dfi6r13",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "So a Jainist, a Zoroastrian, and a Bah'hai walk into a pub.. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490746364.0,
    "date_created": "2017-03-28",
    "time_created": "12:12:44",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfibomj",
    "parent_id": "t1_dfi662n",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Judaism is mocked all the time in popular culture. See south park for example. They tried to do the same with Islam and show Muhammad and were censored by the networks.\n\nThe problem with Jewish jokes there is a fine line of misunderstanding. This is due to the fact that that when some people laugh at a jewish joke for absurdity (eg. A the classic Jew being a stingy money hoarder) the actual anti-Semites think the same thing literally. This isn't the same with Islam. \n\n",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1490730533.0,
    "date_created": "2017-03-28",
    "time_created": "07:48:53",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiw094",
    "parent_id": "t1_dfirshr",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490755166.0,
    "date_created": "2017-03-28",
    "time_created": "14:39:26",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiokwq",
    "parent_id": "t1_dfikgmb",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Wow, that's mental.\n\nWhat is funny is that UKIP probably didn't realise that picturing Gareth Snell with Corbyn would be far more damaging than picturing him with a Muslim.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1490747409.0,
    "date_created": "2017-03-28",
    "time_created": "12:30:09",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfj6zbv",
    "parent_id": "t1_dfikgmb",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think they're self-aware dude",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490767323.0,
    "date_created": "2017-03-28",
    "time_created": "18:02:03",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfinoa1",
    "parent_id": "t1_dfiflpf",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[They could stop allowing Saudi Arabia to fund preachers who teach that non-muslims are scum.](https://www.youtube.com/watch?v=Btx0mm5KCMI)",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1490746460.0,
    "date_created": "2017-03-28",
    "time_created": "12:14:20",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiodre",
    "parent_id": "t1_dfieri8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "its really not a handful.  Its countries full.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490747204.0,
    "date_created": "2017-03-28",
    "time_created": "12:26:44",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfihbne",
    "parent_id": "t1_dfieri8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "ONE MONTH after the terrorist attack against Charlie Hebdo, THOUSANDS of muslims [marched london](https://www.theguardian.com/world/2015/feb/08/british-muslims-london-protest-against-muhammad-cartoon-charlie-hebdo) demanding respect for their prophet, they were condemning violence but they were still reminding us that blasphemy was off limits. Of course this wasn't very advertised, most people don't even know it happened. Personally I find it shocking that after a terrorist attack their priority was to remind us why the victims were killed. This is a big issue in the muslim world, they'll tell you \"we condemn violence... **but**...\".",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490739317.0,
    "date_created": "2017-03-28",
    "time_created": "10:15:17",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiac5k",
    "parent_id": "t1_dfi7o4n",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Go to the Congo and start talking shit about Jesus, see how long you last. ",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1490727380.0,
    "date_created": "2017-03-28",
    "time_created": "06:56:20",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfikcnu",
    "parent_id": "t1_dfi9y1y",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Why do I have to have Easter off\n\nWinter is over, it's spring time",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1490742903.0,
    "date_created": "2017-03-28",
    "time_created": "11:15:03",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfib11a",
    "parent_id": "t1_dfi9y1y",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 1,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1490729072.0,
    "date_created": "2017-03-28",
    "time_created": "07:24:32",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfidaop",
    "parent_id": "t1_dficjh3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490733578.0,
    "date_created": "2017-03-28",
    "time_created": "08:39:38",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfjw88s",
    "parent_id": "t1_dfjvtkd",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "As far as I can see, you posted two links to the Telegraph: one of them a Whitehall guide on language use for politicians from 2014 and the other an opinion piece.\n\nAre you so impoverished in critical thinking that you cannot see why neither of these things count as evidence to back up the claims you made?\n\nEdit: The fact that this guy has accumulated so many upvotes speaks volumes about the right-wingers around here.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490808756.0,
    "date_created": "2017-03-29",
    "time_created": "05:32:36",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi9692",
    "parent_id": "t1_dfi61rn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">Christopher Hitchens and Richard Dawkins are two people who spring to mind that vehemently criticised Islam in public and suffered no negative legal consequences as a result.\n\n[Bad consequences occupy a lot more space than simple 'legal consequences'](https://youtu.be/jyoOfRog1EM?t=12m47s).",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1490724026.0,
    "date_created": "2017-03-28",
    "time_created": "06:00:26",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi6oja",
    "parent_id": "t1_dfi61rn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "deleted  ^^^^^^^^^^^^^^^^0.4123  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/46494)",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1490716192.0,
    "date_created": "2017-03-28",
    "time_created": "03:49:52",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi66mq",
    "parent_id": "t1_dfi61rn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'm talking about one's own health, than legal repercussions. Plus, that was about 5-10yrs ago. I wonder how Hitch would be treated nowadays.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1490714758.0,
    "date_created": "2017-03-28",
    "time_created": "03:25:58",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi8v9u",
    "parent_id": "t1_dfi61rn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "A guy on reddit from the UK was charged with racism and fined for insulting a Muslim. Bridget Bardot has been charged 5 times in France over the past few decades for criticising Islam. It happens all over Europe. ",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1490723056.0,
    "date_created": "2017-03-28",
    "time_created": "05:44:16",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiooml",
    "parent_id": "t1_dfi61rn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "can you think of anyone who has suffered violent consequences for criticising islam?  Or you just gonna pull 2 examples where it hasnt happened and decide theres no problem?\n\nIs this a troll account or what?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490747513.0,
    "date_created": "2017-03-28",
    "time_created": "12:31:53",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfivslw",
    "parent_id": "t1_dfi61rn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Same goes for Sam Harris. The man's a dick, mind, but he hasn't come to any harm being a dick about religion and Islam specifically.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490754940.0,
    "date_created": "2017-03-28",
    "time_created": "14:35:40",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfizp7k",
    "parent_id": "t1_dfi61rn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Because it would reinforce a lot of what they said and most of the laws are very recent and wouldn't be much trouble for wealthy people I imagine. And let's face it, Christopher Hitchens and Richard Dawkins are very good at what they do, if you used half baked idiotic arguments then I think people would have less patience with you and be more likely to get you in legal trouble. \n\nAlso because it's fair to assume that people like Christopher Hitchens and Richard Dawkins have had reasonable success and are well equipped to criticise Islam due to their experience. Do you think that some may favour finding legal ways to trouble them as they aren't as well equipped to argue in favour of Islam?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490759135.0,
    "date_created": "2017-03-28",
    "time_created": "15:45:35",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfia2sd",
    "parent_id": "t1_dfi9x54",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> That reasoning is pretty circular in many cases - it's not surprising that people who hate Muslims and think they're violent wouldn't speak out against Islam if they're not anonymous.\n> \n> \n> \n> That doesn't \"say a lot\".\n\nOften times it's not about \"hating Muslims\". That seems a tad disingenuous. Sometimes it is, sure -- no doubt. But often it's just criticism of Islam.\n\nI feel comfortable publicly espousing my hatred of almost every ideology but Islam. You name it. Capitalism, Moral Relativism, Communism, Nationalism, Christianity, Fiscal Conservativism, Monarchism,... you get the gist.\n\nI do not feel comfortable criticizing the ideology of Islam publicly. I believe many others feel the same way, and I *do* think that says a lot.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1490726688.0,
    "date_created": "2017-03-28",
    "time_created": "06:44:48",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dficxmm",
    "parent_id": "t1_dfi60lp",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "So Islam made these people commit those horrendous attacks?",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490732955.0,
    "date_created": "2017-03-28",
    "time_created": "08:29:15",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfipr9h",
    "parent_id": "t1_dfi60lp",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Leak was a wanker australian cartoonist. i can't find a single example of him being attacked for criticising islam, though.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490748632.0,
    "date_created": "2017-03-28",
    "time_created": "12:50:32",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfjotzy",
    "parent_id": "t1_dfi60lp",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "So should the government do nothing while their citizens get murdered for showing pictures of Muhammad? Obviously not, but thats what seems to be happening. \n\nI have never ever heard a politician bring up that specific criticism of Islam. It pisses me off. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490790527.0,
    "date_created": "2017-03-29",
    "time_created": "00:28:47",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi9wku",
    "parent_id": "t1_dfi695f",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You have a really fucked up idea as to what freedom is.",
    "controversiality": 1,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1490726207.0,
    "date_created": "2017-03-28",
    "time_created": "06:36:47",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfjuqp7",
    "parent_id": "t1_dfj0bln",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">If your gay cousin said that they were going on vacation to Mecca,\n\nI know its not your point but just as a side point, as a non Muslim he wouldn't even be allowed in! Or he's a gay Muslim in which case..\n Good luck with that! Not a very tolerant place. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490804067.0,
    "date_created": "2017-03-29",
    "time_created": "04:14:27",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfib7nf",
    "parent_id": "t1_dfiasyz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">it somewhat justifies the mocking that they get for surrendering easily. \n\nFrench were the only ones to reprint the caricature, the british press didn't. France is confronted by a lot of resistance from Islam because it is also much more secular than the UK, no sharia courts, burqas or hate preachers allowed on campuses. I believe that you see us as surrendering because at least we're trying to fight the rising tide, while the UK just lets religion creep back into public life without much resistance.\n\n",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1490729497.0,
    "date_created": "2017-03-28",
    "time_created": "07:31:37",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfilv5p",
    "parent_id": "t1_dfi605f",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I don't like the definition being loosely defined on what language is allowed to be used and I don't trust where the power to interpret such a thing rests.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490744544.0,
    "date_created": "2017-03-28",
    "time_created": "11:42:24",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfia58p",
    "parent_id": "t1_dfi9vs9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Probably because they know they will get attacked for not condemning an attack immediately if it turns out to be islamic extremism. And they are human and can condemn attacks purely because they find them deplorable.",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1490726871.0,
    "date_created": "2017-03-28",
    "time_created": "06:47:51",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfie80r",
    "parent_id": "t1_dfibfo7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> If you hear hooves, think horses.\n\nOr, you know, you could wait for evidence.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1490735071.0,
    "date_created": "2017-03-28",
    "time_created": "09:04:31",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiam4z",
    "parent_id": "t1_dfiai18",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "What do you mean?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490728087.0,
    "date_created": "2017-03-28",
    "time_created": "07:08:07",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfjaw95",
    "parent_id": "t1_dfi8dh1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> this was islamists' end game, to blame ourselves for their own violence.\n\nThe first time I've ever heard anyone phrase it like that, and that sums it up beautifully. I'm stealing it.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1490772218.0,
    "date_created": "2017-03-28",
    "time_created": "19:23:38",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dficifn",
    "parent_id": "t1_dfi8dh1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Point of order, your timeline of events is completely messed up. The Jyllands-Posten cartoons debacle was in 2005, a full six years before the first terrorist attack on Charlie Hebdo, and ten years before the famous attack in 2015. The attack on Charlie Hebdo was not the proximate cause for the 2015 attack - CH published a large amount of satirical cartoons mocking Muhammad and Islam on its own in the years following the JP controversy. \n\nAlso, CH did not cease production after the shootings - they depicted Muhammad on the front cover of the very next issue, along with a bunch of cartoons mocking the attackers. CH is still in print, though I don't know if they've depicted Muhammad or explicitly mocked Islam since (I'd be surprised if they hadn't).\n\nEDIT: bonjouratous is right that [CH have said they won't draw Muhammad again.](https://www.washingtonpost.com/news/worldviews/wp/2015/07/17/charlie-hebdo-editor-says-the-paper-is-done-with-prophet-muhammad-cartoons/?utm_term=.035a4495d1b3 )",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490732182.0,
    "date_created": "2017-03-28",
    "time_created": "08:16:22",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfidby5",
    "parent_id": "t1_dfi80e1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "This is not yet UK law, and the response to it in parliament was a pretty unilateral panning - and rightly so. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490733637.0,
    "date_created": "2017-03-28",
    "time_created": "08:40:37",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7j94",
    "parent_id": "t1_dfi6f16",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yes they are. You denying it at every turn makes you seem quite biased.",
    "controversiality": 1,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1490718783.0,
    "date_created": "2017-03-28",
    "time_created": "04:33:03",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi782a",
    "parent_id": "t1_dfi73iq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "\"Go home Paki\" isn't making jokes at Islam's expense. In what way do you think that it is? I can't fathom how that can be framed as either a joke, or as one directed at Islam.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1490717832.0,
    "date_created": "2017-03-28",
    "time_created": "04:17:12",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfifpyy",
    "parent_id": "t1_dfif17j",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It was my interpretation that he was. In response to a thread calling for us to defend the right to poke fun at Islam, he's suggesting we shouldn't be mocking them, because it will make them feel \"alienated\".\n\nI understood that as disagreement with the article's point.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1490737221.0,
    "date_created": "2017-03-28",
    "time_created": "09:40:21",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfkmmad",
    "parent_id": "t1_dfklf28",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Totally fair point",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490844603.0,
    "date_created": "2017-03-29",
    "time_created": "15:30:03",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi60cd",
    "parent_id": "t1_dfi5pl5",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "it did (early 19th IIRC), but there were other more liberal strains in the Levant, Turkey, and the Maghreb ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490714277.0,
    "date_created": "2017-03-28",
    "time_created": "03:17:57",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfieyar",
    "parent_id": "t1_dfid06o",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yes. Let's just assume that he was talking shit about dead people. For fucks sake, dude, take a breath. ",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490736147.0,
    "date_created": "2017-03-28",
    "time_created": "09:22:27",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiaqlc",
    "parent_id": "t1_dfi6qh9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Because the majority of random comments provided without the context tends to be exactly that, or very close to. With opinion so polarized, it is really hard not to be drawn into a back-and-forth, especially in the wider internet where people just scream out their thoughts.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1490728393.0,
    "date_created": "2017-03-28",
    "time_created": "07:13:13",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7bxs",
    "parent_id": "t1_dfi6qh9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It does go both ways though. You could be a for right authoritarian, but not call muhammad a pedophile warlord and you're an islam apologist to some.",
    "controversiality": 0,
    "ups": -1,
    "downs": 0,
    "score": -1,
    "created": 1490718150.0,
    "date_created": "2017-03-28",
    "time_created": "04:22:30",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfj56ey",
    "parent_id": "t1_dfj3twy",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">I only found out about the inbreeding recently. \n\nWhy do muslamic fundamentaloids always marry their first cousins? \n\nThey need to keep producing people stupid enough to believe in islam. \n\nThat's me on a list. Again. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490765177.0,
    "date_created": "2017-03-28",
    "time_created": "17:26:17",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfjaylu",
    "parent_id": "t1_dfighrz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">More blood has been shed in the name of Christ than all other religions combined.\n\nSource? Even compared to the Islamic invasion of India?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490772300.0,
    "date_created": "2017-03-28",
    "time_created": "19:25:00",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiiepx",
    "parent_id": "t1_dfighrz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The difference is one religion no longer lives over 1000 years in the past",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490740653.0,
    "date_created": "2017-03-28",
    "time_created": "10:37:33",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfic8pw",
    "parent_id": "t1_dfib2d4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490731666.0,
    "date_created": "2017-03-28",
    "time_created": "08:07:46",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfirfv7",
    "parent_id": "t1_dfi65uy",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I don't think anyone is arguing whether or not religion can be good, but our right to make fun of it. Religion isnt a person, it shouldn't have rights.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1490750371.0,
    "date_created": "2017-03-28",
    "time_created": "13:19:31",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi8uqu",
    "parent_id": "t1_dfi7x83",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1490723009.0,
    "date_created": "2017-03-28",
    "time_created": "05:43:29",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi8xnj",
    "parent_id": "t1_dfi8iv6",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 1,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490723264.0,
    "date_created": "2017-03-28",
    "time_created": "05:47:44",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi82yy",
    "parent_id": "t1_dfi6to8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I had a Christian trying to convince me about it all, and they said I had to look at it with a child's mind for it to make sense. As if having an idea that only makes sense to naive irrational people was a good thing.",
    "controversiality": 0,
    "ups": 72,
    "downs": 0,
    "score": 72,
    "created": 1490720526.0,
    "date_created": "2017-03-28",
    "time_created": "05:02:06",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi6yl4",
    "parent_id": "t1_dfi6to8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "hahaha! 9:02am. Choked on first coffee of the day. Brilliant!",
    "controversiality": 1,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490717016.0,
    "date_created": "2017-03-28",
    "time_created": "04:03:36",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfit3wx",
    "parent_id": "t1_dfi6to8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "While they're at school!",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490752081.0,
    "date_created": "2017-03-28",
    "time_created": "13:48:01",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi77kb",
    "parent_id": "t1_dfi6ixd",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Err what else is it for?",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1490717790.0,
    "date_created": "2017-03-28",
    "time_created": "04:16:30",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfig3dd",
    "parent_id": "t1_dfidnf7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "\"TO BE THE PLACE WHERE THE FALLING ANGEL MEETS THE RISING APE\"\n\nThat line is incredible.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1490737722.0,
    "date_created": "2017-03-28",
    "time_created": "09:48:42",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfif0jr",
    "parent_id": "t1_dfidow8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Some of the biggest divides have been ideological in nature. But yes there have been plenty of \"holy wars\" and the like. But most religions have moved past that era. They have entered the scientific age somewhat gracefully if we take into account the last 50-100 years.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490736233.0,
    "date_created": "2017-03-28",
    "time_created": "09:23:53",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfidd60",
    "parent_id": "t1_dfick67",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">Humans should have moved on by now\n\nSpecifically the part I was referring to. ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1490733695.0,
    "date_created": "2017-03-28",
    "time_created": "08:41:35",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfid52j",
    "parent_id": "t1_dfibprf",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Where human society may have benefited from the social cohesion that religion fostered, there's no place for it in a modern society.\n\nYeah, except it seems that the \"Modern society\" you think is so superior and no longer needs religion seems to be fundamentally unsustainable, internally riven by division and polarisation and unable to protect itself against external threats or internal subversion. This modern society seems to be on the road to oblivion.\n\nYour infantile view of religion doesn't add to the credibility of your arguments either.",
    "controversiality": 1,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490733314.0,
    "date_created": "2017-03-28",
    "time_created": "08:35:14",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi6dzt",
    "parent_id": "t1_dfi5tf6",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You mean you disagree.",
    "controversiality": 1,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490715336.0,
    "date_created": "2017-03-28",
    "time_created": "03:35:36",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi6e6h",
    "parent_id": "t1_dfi5vfu",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You know what, I used to think the way you do, but frankly I don't have time for it. If some people take solace in thinking there's a man in the sky and they don't try and force it on me or make anyone else's life a misery as a result, more power to them.\n\nYeah it's not rational, yeah I don't agree with them, but fuck it, if it helps them out who am I to judge?",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1490715353.0,
    "date_created": "2017-03-28",
    "time_created": "03:35:53",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi6ayq",
    "parent_id": "t1_dfi5vfu",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Metaphysics is not a science.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1490715095.0,
    "date_created": "2017-03-28",
    "time_created": "03:31:35",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi5znm",
    "parent_id": "t1_dfi5vfu",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yeah, I wish the government part wasn't so prevalent.\n\nThe ironic part is people don't realise they replaced religion with government. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1490714222.0,
    "date_created": "2017-03-28",
    "time_created": "03:17:02",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7tuq",
    "parent_id": "t1_dfi7kaq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "no, i'm just saying it's clearly more important than magic, fantasy and ghost stories, considering how important a part of our society it's been.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1490719705.0,
    "date_created": "2017-03-28",
    "time_created": "04:48:25",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfic7ze",
    "parent_id": "t1_dfibfec",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "How do you propose finding out?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490731626.0,
    "date_created": "2017-03-28",
    "time_created": "08:07:06",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfic7l2",
    "parent_id": "t1_dfibtz3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "But we do live, by and large, in a cannibal-free society.  I'd say that separates the two, wouldn't you?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490731604.0,
    "date_created": "2017-03-28",
    "time_created": "08:06:44",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfimoqp",
    "parent_id": "t1_dfimled",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Now you've said that, I want to see the Star Wars \"faith school\". Jedi made the UK census, after all....",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490745405.0,
    "date_created": "2017-03-28",
    "time_created": "11:56:45",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfifbvk",
    "parent_id": "t1_dfif1dv",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You've misunderstood me and skipped over the end of the sentence, my point is not that all religion is immune from scientific criticism, but that exactly as you say it's simply not science- so criticising religion all in one go on that premise is false. You can't criticise the premise of religion for being unscientific because it is philosophy, and as such distinct from science. I'm not saying that individual beliefs can't be criticised from a scientific perspective, simply that religion as a concept at its most basic level is just a different subject from science altogether. Does that make sense?",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1490736675.0,
    "date_created": "2017-03-28",
    "time_created": "09:31:15",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiamul",
    "parent_id": "t1_dfi9v94",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Do you really need to have explained to you the difference between religious belief as a whole as a field of enquiry and topic of interest, and individual people who follow it down uniquely extreme and violent paths? And since when do you have to choose between either thoughtlessly mocking all religion and being called a snob and murdering people in the name of a God? What a ridiculous pair of questions, neither of which had anything to do with my point.",
    "controversiality": 1,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1490728137.0,
    "date_created": "2017-03-28",
    "time_created": "07:08:57",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiirhs",
    "parent_id": "t1_dfiftoc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think its happening, or at the very least I actually do hear Imams on the radio talking about liberalizing the religion. So there is hope. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490741078.0,
    "date_created": "2017-03-28",
    "time_created": "10:44:38",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfip3nq",
    "parent_id": "t1_dficgk9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Isn't the line between \"cult\" and \"religion\" just a certain critical mass of believers?  All major religions were probably considered cults at one time, until they amassed enough followers to be considered a religion.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1490747951.0,
    "date_created": "2017-03-28",
    "time_created": "12:39:11",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfij6ou",
    "parent_id": "t1_dfibomj",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "South Park tried to air that episode about how ridiculous it is that they can't show a simple depiction of Muhammad, but then get death threats to the point that they had to pull the episode...fuck that noise.\n\nFunny thing about that episode is that it got South Park banned in Bangladesh. Not for the Muhammad thing, but for showing Buddha snorting cocaine! ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1490741573.0,
    "date_created": "2017-03-28",
    "time_created": "10:52:53",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfizat1",
    "parent_id": "t1_dfibomj",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I watched a PragerU video recently and the guy basically confirmed that Jews are good with money. That's also why when Palestine ejected the Jews that a lot of capital and finance people disappeared which led to many problems. \n\nI also remember a Family Guy episode where some event caused a lot of disturbance so the Jews took off and flew to a rooftop I think by their sideburns or propeller hats. It seems like a stupid joke but it was quite a poignant joke at the time.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490758708.0,
    "date_created": "2017-03-28",
    "time_created": "15:38:28",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiai5z",
    "parent_id": "t1_dfiac5k",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Go to the Congo and start talking shit about anything,see how long you last.\n\nOk so you're saying we should expect our country to have the same rule of law and social norms as a country in a state of near perpetual civil war\n\n-because you think avoiding someones offense is more important than ensuring the right to be able to express yourself in such basic ways as drawing and labeling stick figures?",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1490727812.0,
    "date_created": "2017-03-28",
    "time_created": "07:03:32",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfj2wu5",
    "parent_id": "t1_dfiac5k",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yeah I mean that's the difference isn't it, Europe is a slightly more advanced society than the Congo. Except apparently for one group...",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490762606.0,
    "date_created": "2017-03-28",
    "time_created": "16:43:26",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfibfcm",
    "parent_id": "t1_dfib11a",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "To me religion is a way of life for people who cannot think for themselves, you seem to think when I use religion that I'm using it in some wishy-washy way and that Islam is something more than that because of a few choice examples. It simply isn't, it's a way of life for those too bereft of thought or inexperienced to live by their own conscience, and like all other religions, most people practising it are doing it to please someone else, or out of habit, and there are people using it for their own nefarious means, like other ideologies. It will be eradicated like all other religions. It is not special.\n\nI'm sure you've done more research than me, but it hardly helps when you just work yourself up into a frenzy.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1490729967.0,
    "date_created": "2017-03-28",
    "time_created": "07:39:27",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfie0qc",
    "parent_id": "t1_dfib11a",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Irrespective of the rest of your points, I certainly know a lot of Muslims in the U.K. who are very much moderate muslims who don't take literal interpretation of the scripture. While largely it's followers are more fundamental, the idea there isn't (or can't) be moderate muslims is just wrong. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1490734755.0,
    "date_created": "2017-03-28",
    "time_created": "08:59:15",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfikxha",
    "parent_id": "t1_dfib11a",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Plenty of British laws are based on 'morality' such as pornography laws. These have their roots in 'Christian morals. They're outdated and ridiculous",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490743532.0,
    "date_created": "2017-03-28",
    "time_created": "11:25:32",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfik22m",
    "parent_id": "t1_dfib11a",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Well, there are the 10 commandments which set out a bunch of rules and punishments. \n\nAnd stuff like Leviticus. \n\nIt's not exactly a moral highground.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490742567.0,
    "date_created": "2017-03-28",
    "time_created": "11:09:27",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfj9gbr",
    "parent_id": "t1_dfib11a",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Islam is not open to interpretation.\n\nIs the affirmation of someone who does not care about truth. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490770382.0,
    "date_created": "2017-03-28",
    "time_created": "18:53:02",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfidwc7",
    "parent_id": "t1_dfidaop",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Islam is the literal word of Allah, and cannot be questioned. The literal interpretation, and to live a life as Mohammed did, is the only accepted lifestyle according to Islamic scripture.\n\nThe concept that islamic scripture in its literal interpretation should be applied to modern life is one restricted to two notoriously fundamental schools of thought: Wahhabism and Salafism. Both of these are understood by the majority of Muslims to be an unhealthy interpretation of the religion. \n\nYou are right that Sharia law is a more literal legal framework than any connection between Christian values and western law. That said, as long as it is considered to apply only to Muslims and not to the wider population (a position supported by the majority of Muslims) I have no real problem with it provided it does not conflict with the laws of the land. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490734562.0,
    "date_created": "2017-03-28",
    "time_created": "08:56:02",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfjwa19",
    "parent_id": "t1_dfjw88s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I still can't tell what you're arguing against. Are you saying that I'm wrong and in fact saying Christmas is banned, that nobody can talk about immigration?\n\nedit: read my comment again dude, specifically this bit \"What is interesting though, is this attitude of, we can't do X, where X is something everyone does.\" Those are examples of what people say we can't do, when we can, like criticizing Islam, now delete all your comments like everyone else who wades in without reading, or apologise.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490808910.0,
    "date_created": "2017-03-29",
    "time_created": "05:35:10",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi6vb4",
    "parent_id": "t1_dfi6oja",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "To have left the EDL you necessarily had to have joined (and led!) the EDL, which is a little bit beyond \"criticising Islam\" given that they're a group that regularly held rallies outside mosques in general and according to Wikipedia were formed out of football casual groups.",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1490716746.0,
    "date_created": "2017-03-28",
    "time_created": "03:59:06",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi8tk7",
    "parent_id": "t1_dfi6oja",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think it's pretty naive to ever take ~~Stephen Christopher Yaxley-Lennon~~ ~~Andrew McMaster~~ ~~Paul Harris~~ Tommy Robinson at his word given his history of lying about this stuff. He later claimed that he was tricked into doing the anti-radicalism stuff by an MP. He changes his tune depending on who he talks to. One voice for the oxford union, an entirely different one for his twitter page. ",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490722906.0,
    "date_created": "2017-03-28",
    "time_created": "05:41:46",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi6br1",
    "parent_id": "t1_dfi66mq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "And you're still extremely unlikely to get your teeth smashed in for criticising Islam.\n\nSorry, I don't buy it.",
    "controversiality": 1,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490715157.0,
    "date_created": "2017-03-28",
    "time_created": "03:32:37",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfja2cx",
    "parent_id": "t1_dfi66mq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "He'd be completely fine, just like Dawkins, Farage and Trump. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490771163.0,
    "date_created": "2017-03-28",
    "time_created": "19:06:03",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiatc3",
    "parent_id": "t1_dfi8v9u",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> A guy on reddit from the UK was charged with racism and fined for insulting a Muslim.\n\n> Bridget Bardot has been charged 5 times in France over the past few decades for criticising Islam.\n\nCitations, please. As usually happens with cases like these, there tends to be more to them than the glib assessments say.\n\nEDIT: In the case of \"charged with racism and fined for insulting a Muslim\", [here's what actually happened](http://www.liverpoolecho.co.uk/news/liverpool-news/watch-moment-web-troll-who-11918656); Mzee Mohammed died in police/security guard custody, and this brave man of the people's response was:\n\n> O’Connell took to social media website Reddit, where he made baseless allegations, labelling Mzee a “good for nothing, spice smoking, Toxteth monkey”.\n\n> He added: “As I say, who gives a f***.”\n\nSo that's not \"charged with racism and fined for insulting a Muslim.\" He was charged with \"sending a communication of an indecent or offensive nature\" and fined for that.\n\nEDIT 2: And with Brigitte Bardot: she wasn't \"criticising Islam\", [she was criticising \"the Muslim community\"](http://www.reuters.com/article/us-france-bardot-muslims-idUSL1584799120080415) (huge distinction) by saying \"I am fed up with being under the thumb of this population which is destroying us, destroying our country and imposing its acts\", a quote which is followed by Reuters saying:\n\n> Bardot has previously said France is being invaded by sheep-slaughtering Muslims and published a book attacking gays, immigrants and the unemployed, in which she also lamented the \"Islamisation of France\".\n\nThat's pretty much textbook incitement to racial hatred, specifically against the Muslim community as people rather than Islam as a religion.\n\nSo... bollocks.",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1490728578.0,
    "date_created": "2017-03-28",
    "time_created": "07:16:18",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfia6cm",
    "parent_id": "t1_dfia2sd",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> I do think that says a lot.\n\nIt says that a lot of people think that they will be subject to violence for doing so.\n\nIt doesn't say (which you're trying to imply) that people are actually more likely to be subjected to violence.\n\nGo on twitter and you'll find essentially a limitless number of identifiable people criticising Islam without repercussion.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490726954.0,
    "date_created": "2017-03-28",
    "time_created": "06:49:14",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfisqdx",
    "parent_id": "t1_dficxmm",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Pretty sure they made the call themselves.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490751696.0,
    "date_created": "2017-03-28",
    "time_created": "13:41:36",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfifixd",
    "parent_id": "t1_dficxmm",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "that has nothing to do with the argument",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490736952.0,
    "date_created": "2017-03-28",
    "time_created": "09:35:52",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfjweiy",
    "parent_id": "t1_dfjotzy",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> So should the government do nothing while their citizens get murdered for showing pictures of Muhammad? Obviously not, but thats what seems to be happening. \n\nOddly enough they don't, the people that do that tend to be arrested and imprisoned.\n\n> I have never ever heard a politician bring up that specific criticism of Islam. It pisses me off. \n\nBecause mental people existing and doing mental things in the name of a religion is not a criticism of Islam.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490809304.0,
    "date_created": "2017-03-29",
    "time_created": "05:41:44",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfia234",
    "parent_id": "t1_dfi9wku",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "How so? You can't expect to be free to say what many would consider offensive without expecting a reaction because *that* would be against free speech.",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1490726634.0,
    "date_created": "2017-03-28",
    "time_created": "06:43:54",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfisn8i",
    "parent_id": "t1_dfi9wku",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "But they were free to do so and they did. Then some nutjob attacked them which was an illegal action. Your argument is like saying people weren't free to campaign for Remain in the referendum because Jo Cox was murdered.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490751606.0,
    "date_created": "2017-03-28",
    "time_created": "13:40:06",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfim8ue",
    "parent_id": "t1_dfilv5p",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Impartial judges? Because that's who tend to judge things that appear in court.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490744946.0,
    "date_created": "2017-03-28",
    "time_created": "11:49:06",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiaxzl",
    "parent_id": "t1_dfiam4z",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It was blatantly religiously motivated. Car attacks like that have been common amongst Daeshbags and their fanboys",
    "controversiality": 1,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1490728880.0,
    "date_created": "2017-03-28",
    "time_created": "07:21:20",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfihjfc",
    "parent_id": "t1_dficifn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "AFAIR they said they wouldn't print caricatures of the prophet anymore. This is a situation where the terrorists literally won. No one will caricature muhammed in cartoons anymore in the west. Many people will see this as a good thing because \"respect\", and muslims will be satisfied to have frightened us into submission while pretending to support freedom of speech. Personally I think it's deplorable, imagine if we couldn't make fun of Jesus, or the pope. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490739584.0,
    "date_created": "2017-03-28",
    "time_created": "10:19:44",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiiw4f",
    "parent_id": "t1_dfi7j94",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Don't be fucking ridiculous, there's a difference between having your rights denied and everyone telling you to shut the fuck up because they're sick of you spouting the same unproductive shit all the time.",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1490741230.0,
    "date_created": "2017-03-28",
    "time_created": "10:47:10",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfikzuf",
    "parent_id": "t1_dfi7j94",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I can see the opresseion pouring out of your keyboard.\n\nYou're drowning in it",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1490743603.0,
    "date_created": "2017-03-28",
    "time_created": "11:26:43",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfn49h3",
    "parent_id": "t1_dfieyar",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I wasn't, but those Mohammed cartoons could have been funnier. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490974411.0,
    "date_created": "2017-03-31",
    "time_created": "03:33:31",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7u7w",
    "parent_id": "t1_dfi7bxs",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Honestly, how is he not a pedophile warlord though? He married a six year old and spread his religion through a \"join us, die or pay high taxes\" method. ",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1490719740.0,
    "date_created": "2017-03-28",
    "time_created": "04:49:00",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiixt9",
    "parent_id": "t1_dfiiepx",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yeah, they've brought their hate all the way into the 21st century. Now they condemn other religions while running child sex rings. They continuously beat the drums of war all the while claiming to worship a guy that literally said that if someone attacks you, you should turn the other cheek and tell them that you love them like a brother.\n\nOhh and let's not forget about The Inquisition, I mean you just said it was a thousand years ago but here you are claiming that, in the name of the better religion, people need to know about the Muslim threat. I wonder where it will lead you this time around.\n\nThe hypocrisy of modern Christians is palpable.",
    "controversiality": 1,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490741285.0,
    "date_created": "2017-03-28",
    "time_created": "10:48:05",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfighqc",
    "parent_id": "t1_dfic8pw",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "If we are looking at religious text, Christian bibles have some pretty horrible stuff too.  Was there not a crusade? Did people not colonise and enslave others in the name of God? Were there no hate crimes committed by Christians? Hate is something we are all capable of, it is up to an individual to decide when and how they use it. I have a lot of Christian friends who are gay friendly and pro-choice, they too can easily gone the other way. I been out in a gay bar with my Muslim friends too, they could've gone down a violent route but they didn't. The argument should not be about what's been written, it is how one react to it that matters. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490738245.0,
    "date_created": "2017-03-28",
    "time_created": "09:57:25",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi92vm",
    "parent_id": "t1_dfi8xnj",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I say smug because you seem remarkably sure of yourself in dismissing millenia of human thought on a subject because you simply don't care for it. You clearly haven't thought what I've written through as I am not talking about an abrahamic religion but religious belief as a whole, and of its nature as the attempt to understand life's big questions. Why is it not valid to try to understand why and how existence came about? That is, at its core, what religion is- why do you disparage the pursuit in and of itself?\n\nAnd I never equated religion to science, simply compared them as being two (distinct) avenues in human attempts to understand life and its meaning. Please don't accuse me of not thinking my post through when you can barely be bothered to read it. ",
    "controversiality": 1,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490723729.0,
    "date_created": "2017-03-28",
    "time_created": "05:55:29",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi8gkw",
    "parent_id": "t1_dfi82yy",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Hey, even the kids aren't buying it.\n\nMy 8 year old goes to a catholic school and told me last year she didn't think God was real ",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1490721746.0,
    "date_created": "2017-03-28",
    "time_created": "05:22:26",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi78za",
    "parent_id": "t1_dfi77kb",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "deleted  ^^^^^^^^^^^^^^^^0.4294  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/90162)",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1490717906.0,
    "date_created": "2017-03-28",
    "time_created": "04:18:26",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfie37q",
    "parent_id": "t1_dfidd60",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Should have is very different to should immediately cease existance. If religion was forcibly removed all at once of course that would have implications. This isn't the point, it's a theoretical point about the value of religion. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1490734862.0,
    "date_created": "2017-03-28",
    "time_created": "09:01:02",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi6tg5",
    "parent_id": "t1_dfi6dzt",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It's not a matter of agree or disagree.  The scientific method is the ONLY tool we have to discover new facts about the universe because it has predictive validity.\n\nReligions were our first steps to answering the big questions.  But guesses that don't accurately predict anything are not useful for discovering new knowledge.  If we discovered science before religion there's no way religions would have gained any traction.\n\n/sigh if you're going to down vote say where you think i'm wrong. I've said nothing controversial.  Science uncovers new knowledge.  Religions do not and cannot.\n",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1490716590.0,
    "date_created": "2017-03-28",
    "time_created": "03:56:30",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi6ui2",
    "parent_id": "t1_dfi6dzt",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No,  he means it's wrong. ",
    "controversiality": 1,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1490716679.0,
    "date_created": "2017-03-28",
    "time_created": "03:57:59",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi6ubd",
    "parent_id": "t1_dfi6dzt",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You mean you want to divert the conversation from discussing whether religion (in this case Islam) *can* be criticised?  \n\nTell you what, show us repeatable evidence of Religion healing specific cancers and we'll call it quits.  No?  \nWe'll go easier. Tell us how belief in a religion (any) helped cure smallpox or polio.  \n\nHmm, maybe I'm shooting too high.  \nI know, name one moon landing by a religious movement.   \n\nNo?  \nWell seeing as most people in the UK are now less familiar with the texts of the Abrahamic religions, could you direct us to the verses where a benevolent God, in his utmost wisdom and care for his respective \"chosen people\", gives them the advice to boil their water to avoid cholera.  \n",
    "controversiality": 1,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490716664.0,
    "date_created": "2017-03-28",
    "time_created": "03:57:44",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfik6hr",
    "parent_id": "t1_dfi6dzt",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "We've gotten much further using science than we have from reading a book that is thousands of years old and doesn't understand how things like planets and stars are formed. Even if you believe it to be God's plan, you should still study science for the answers of the universe. We know how we exist, how our planet exists, how our stars exist and so on until the beginning of the universe where the maths breaks down. We've achieved things believed magical by our ancestors. And all because we turned away from what we could dream about and asked what is.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490742702.0,
    "date_created": "2017-03-28",
    "time_created": "11:11:42",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi6rxk",
    "parent_id": "t1_dfi6e6h",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yeah, I'm a lot more passive about it these days, however I would like to see religion taken out of schools. Teaching Religious Education is fine, but reciting prayers and singing hymns needs to stop. ",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1490716465.0,
    "date_created": "2017-03-28",
    "time_created": "03:54:25",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfikm90",
    "parent_id": "t1_dfi6e6h",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Unfortunately they tell others that there's a man in the sky. And some of those people are children. Who are their children and never get the opportunity to exercise religious freedom because they're indoctrinated before they grow old enough to think for themselves. Or worse they're in our schools teaching everyone else's children that there's a magical sky being as teachers. Teachers are authority in schools and so it ends up leaving a lasting impression. If it were just something that they kept to themselves, I would feel differently about it. Children have the right to think for themselves. They cannot do this if they're informed about what they believe in before they can ask whether or not they believe in it.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490743188.0,
    "date_created": "2017-03-28",
    "time_created": "11:19:48",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfibn9o",
    "parent_id": "t1_dfi6e6h",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "People would judge me if i believed in a man in the sky though, I'd potentially be sectioned. Unless he was one of the men in the sky millions of others believes in, then it's normal?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490730447.0,
    "date_created": "2017-03-28",
    "time_created": "07:47:27",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfii0mf",
    "parent_id": "t1_dfi6e6h",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I don't mind if people want to do that. I have more of a problem with promoting wilful ignorance. \n\nIn many ways, it's like the anti-vaccination movement. It's harmful to spread lies and uncertainty, and it's harmful to the population as a whole to refuse the herd immunity. \n\nAnd religion isn't necessarily like that, but sometimes it is. And it's this latter that bothers me loads. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490740178.0,
    "date_created": "2017-03-28",
    "time_created": "10:29:38",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfj7fu6",
    "parent_id": "t1_dfi6e6h",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It can be used to justify immorale actions though, like discrimination against gays and women. That sort of thing crosses the line.\n\nAlso children need an opportunity to choose for themselves, they shouldn't be spoonfed an idealogy from birth, that's pretty damaging to their overall education and well being.\n\nIf parents can stay away from both of those, as I believe the majority of religious people do, then I'm cool with it.\n",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490767879.0,
    "date_created": "2017-03-28",
    "time_created": "18:11:19",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi6utf",
    "parent_id": "t1_dfi6ayq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "and they didn't mention metaphysics.  \nYour point is?",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1490716706.0,
    "date_created": "2017-03-28",
    "time_created": "03:58:26",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7u7j",
    "parent_id": "t1_dfi5znm",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Have we? Does that mean I could get Jezza to ask Theresa 'where do we go after we die?' at the next PMQs?",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1490719740.0,
    "date_created": "2017-03-28",
    "time_created": "04:49:00",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi85sv",
    "parent_id": "t1_dfi7tuq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Kinda like medievalist medicine. Interesting. Used to be life or death. Shouldn't be anymore.",
    "controversiality": 1,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1490720776.0,
    "date_created": "2017-03-28",
    "time_created": "05:06:16",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfj5lx0",
    "parent_id": "t1_dfimoqp",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Hell yeah. 'what form are you in at school?' 'OB1'",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490765688.0,
    "date_created": "2017-03-28",
    "time_created": "17:34:48",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiapgh",
    "parent_id": "t1_dfiamul",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Perhaps you could explain the difference between Flat Earthers, Scientologists and Religions Which Must Not Be Mocked?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490728317.0,
    "date_created": "2017-03-28",
    "time_created": "07:11:57",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfing6m",
    "parent_id": "t1_dfiirhs",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I hope so, but more conservative preachers probably wouldn't go on the radio and declare their regressive beliefs publicly.\n\nA big problem is that the Saudi version of Islam is one of the most fucked up, and they spend [billions of dollars a year](https://en.wikipedia.org/wiki/Wahhabism#Funding_factor) on missionary work to try to make their version the dominant one.\n\nIt's a bit like if the Westboro Baptist Church found half the world's oil supply in their back garden.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490746216.0,
    "date_created": "2017-03-28",
    "time_created": "12:10:16",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiyy49",
    "parent_id": "t1_dfip3nq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No.  \nWhile many religions may assume \"cult-like\" aspects, the modern definition of a cult is usually meant to be one that features the elements of the [BITE](https://freedomofmind.com/bite-model/) model.  \n\nFeatures such as controlling your sources of information, who you may communicate and interact with, demanding obedience to cult authority, discouraging criticism, etc.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1490758329.0,
    "date_created": "2017-03-28",
    "time_created": "15:32:09",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfijyxz",
    "parent_id": "t1_dfij6ou",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That same episode, they had a big speech about how they shouldn't let fear stop people making comedy, from making their own decisions. Don't be ruled by fear. The studio fucking censored the entire speech. It's so fucking stupid.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1490742470.0,
    "date_created": "2017-03-28",
    "time_created": "11:07:50",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfibjum",
    "parent_id": "t1_dfiai5z",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That's fair enough, however...\n\nGo to the East end of Glasgow and start talking shit about Catholics.\n\nOr further south and start talking shit about Protestants \n\nIs probably a far better example",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1490730244.0,
    "date_created": "2017-03-28",
    "time_created": "07:44:04",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiowxx",
    "parent_id": "t1_dfiai5z",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You don't have to go to Congo. Go to any christian african country.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490747753.0,
    "date_created": "2017-03-28",
    "time_created": "12:35:53",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfioj6k",
    "parent_id": "t1_dfie0qc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It depends how you define 'muslim'.  There are millions of people in the world who would identify themselves as 'muslim' who would violently (literally) disagree that these 'moderate muslims' are 'muslims' at all.\n",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490747361.0,
    "date_created": "2017-03-28",
    "time_created": "12:29:21",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfinypj",
    "parent_id": "t1_dfikxha",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490746767.0,
    "date_created": "2017-03-28",
    "time_created": "12:19:27",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfipblq",
    "parent_id": "t1_dfidwc7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">The concept that islamic scripture in its literal interpretation should be applied to modern life is one restricted to two notoriously fundamental schools of thought: Wahhabism and Salafism. Both of these are understood by the majority of Muslims to be an unhealthy interpretation of the religion.\n\nIt's actually a mainstream view in Islamic theology. The vast majority of Muslims believe that each letter of the Qur'an is an essential part of Allah's direct revelation to mankind and is to remain unchanged for all time. The kinds of things that mainstream scholars debate debate the literal truth of are pretty esoteric and include the unveiling of Allah's \"shin\" on the day of judgement to the faithful.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490748184.0,
    "date_created": "2017-03-28",
    "time_created": "12:43:04",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfit2id",
    "parent_id": "t1_dfi6vb4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You may be interested in this talk where he discusses the problems in Luton which led to the formation of the EDL. https://youtu.be/_YQ94jFg_4A",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1490752040.0,
    "date_created": "2017-03-28",
    "time_created": "13:47:20",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfia24v",
    "parent_id": "t1_dfi6vb4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It seems the EDL if not exactly positive early on was no where near the racist and violent organisation it is today. He left the EDL when it was taken over by white supremacists. \n\nThat doesn't make him a good guy but he was not as bad as is often presented. ",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1490726637.0,
    "date_created": "2017-03-28",
    "time_created": "06:43:57",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi72pz",
    "parent_id": "t1_dfi6vb4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "deleted  ^^^^^^^^^^^^^^^^0.9581  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/26201)",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490717373.0,
    "date_created": "2017-03-28",
    "time_created": "04:09:33",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi6j7l",
    "parent_id": "t1_dfi6br1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Tell that to Rushdie, Charlie Hebdo, the Danish Cartoonists, The Innocence of Muslims creators, Theo van Gogh, the Copenhagen terror attack victims...\n\nShall I go on? How many examples would I have to find to change your mind?",
    "controversiality": 0,
    "ups": 47,
    "downs": 0,
    "score": 47,
    "created": 1490715751.0,
    "date_created": "2017-03-28",
    "time_created": "03:42:31",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfj6bjs",
    "parent_id": "t1_dfi6br1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Come to Luton town with a placard critiquing Islam and walk around. Let me know how you get on. In fairness I will hold an anti CoE placard outside my local church on Sunday so we can compare experiences. Good luck.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490766533.0,
    "date_created": "2017-03-28",
    "time_created": "17:48:53",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfibdef",
    "parent_id": "t1_dfiatc3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Think he's talking about this one?\n\nhttps://www.reddit.com/r/unitedkingdom/comments/53y1wi/a_redditor_was_arrested_and_fined_for_an/\n\nBecause he was charged with racism because he was racist.  No doubt about it\n\nBridget Bardot?\n\nClaimed Muslims were destroying France (a bit harsh, but you see how that could encite hatred against regular law abiding citizens) however her earlier claims seem to have been much less insidious and so I'd have to agree with OP on those\n",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1490729848.0,
    "date_created": "2017-03-28",
    "time_created": "07:37:28",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfidkur",
    "parent_id": "t1_dfiatc3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Both of those should have no legal consequences. Grow the fuck up. What is happening these days? It's surreal watching all these professional victims hand waving and flapping over nothing yet still getting their way.\n\nI have never felt so disillusioned with the direction we are headed. The so called \"liberals\" (i.e. progressives) are against free speech and want to increase government powers to crack down on dissenting opinions. Madness.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1490734045.0,
    "date_created": "2017-03-28",
    "time_created": "08:47:25",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfib42r",
    "parent_id": "t1_dfiatc3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Citations, please\n\nYou can google both things they wrote; enough information is presented to find the stories.\n\n> As usually happens with cases like these, there tends to be more to them than the glib assessments say.\n\nCitations, please.",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490729266.0,
    "date_created": "2017-03-28",
    "time_created": "07:27:46",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiaoue",
    "parent_id": "t1_dfia6cm",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> It says that a lot of people think that they will be subject to violence for doing so.\n\nRight. A concern that I believe is justified.\n\n> It doesn't say (which you're trying to imply) that people are actually more likely to be subjected to violence.\n\nIf I produce statistics showing the number of hate-crimes, terror attacks committed in Europe by Muslims in response to criticism of Islam -- compared to the number of Buddhists, Sikhs, Hindus in response to criticism of their religion, would you change your mind? (Provided that the former was greater than the latter?)\n\n> Go on twitter and you'll find essentially a limitless number of identifiable people criticising Islam without repercussion.\n\nThat's exactly my point. They're in cyberspace.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490728276.0,
    "date_created": "2017-03-28",
    "time_created": "07:11:16",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfianvw",
    "parent_id": "t1_dfia234",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "If someone's going to shoot you for doing a thing you are not free to do it.",
    "controversiality": 1,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490728211.0,
    "date_created": "2017-03-28",
    "time_created": "07:10:11",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfimzqt",
    "parent_id": "t1_dfim8ue",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I don't trust any governing body to have jurisdiction over what language is allowable. If the only thing preventing violence against minorities is that it's illegal to call for, it we've already failed.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1490745729.0,
    "date_created": "2017-03-28",
    "time_created": "12:02:09",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfib21d",
    "parent_id": "t1_dfiaxzl",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "But there is no actual evidence that it was. As far as police can tell he acted alone with no coaching or communication with anyone else about the attack. Isis have claimed it but they will literally claim fucking anything so it means nothing. A note hasn't been found that explains his motives. And most importantly he was a historically violent man, long before he was a muslim, who was known for knife violence, crack binges and irrational behaviour. To pin this on Islam, when he was a clear example of a violent and unstable man, is pretty ridiculous.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1490729137.0,
    "date_created": "2017-03-28",
    "time_created": "07:25:37",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfil15g",
    "parent_id": "t1_dfiiw4f",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'm always a fan of someone, using \"free speech\" by posting something on the internet.\n\nThen get all whiny because people dare to have an opinion on it\n\n#MY FREEZE PEACH, NOBODY ELSE!",
    "controversiality": 1,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1490743640.0,
    "date_created": "2017-03-28",
    "time_created": "11:27:20",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi8ayp",
    "parent_id": "t1_dfi7u7w",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Well I guess it's the judging of a person from 1400 years ago by the same standards as today. The problem is that Muhammad being revered means some will try to justify pedophilia and violence by saying muhammad did it. But it's quite well established in Islamic doctrine that times do change and islamic rulings are influenced by the changing thoughts of the time. For example, most schools of thought now say slavery is not acceptable anymore. But the types of people who would still murder, war, and marry kids by using the justification that Muhammad did it are often the people who will cherry pick what suites them and their desires. Take ISIS. They claim to be the re-emergence of \"Real Islam\". When they are really a disguise for people to go to war and pay out sick fantasies of murder and rape. They willingly ignore numerous explicit islamic rulings and laws and use Islam to justify slavery when Islamic thought now rejects it. These people must already be fucked up if they can be led astray into such fucked up acts.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1490721233.0,
    "date_created": "2017-03-28",
    "time_created": "05:13:53",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfip25y",
    "parent_id": "t1_dfighqc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490747907.0,
    "date_created": "2017-03-28",
    "time_created": "12:38:27",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi9txe",
    "parent_id": "t1_dfi92vm",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1490725994.0,
    "date_created": "2017-03-28",
    "time_created": "06:33:14",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfia8va",
    "parent_id": "t1_dfi8gkw",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "At my C of E primary school I spent one rainy afternoon reading a big book of ancient Norse myths and soon realised there was no reason that Christianity was any more true than they were. ",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1490727140.0,
    "date_created": "2017-03-28",
    "time_created": "06:52:20",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfibe7w",
    "parent_id": "t1_dfi8gkw",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Once you figure that Santa isn't real, it's not a far stretch to eliminate the rest of them as well.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1490729900.0,
    "date_created": "2017-03-28",
    "time_created": "07:38:20",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfikv8r",
    "parent_id": "t1_dfi8gkw",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "When i was like 5 they asked me to do a drawing of god. I drew a winged snake sitting on a cloud. They got mad and told me that God can't be an animal, and that besides, snakes were a tool of satan.\n\nFell out with them right there. Still a follower of Quetzcotal though.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1490743463.0,
    "date_created": "2017-03-28",
    "time_created": "11:24:23",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi95ar",
    "parent_id": "t1_dfi8gkw",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Smart kid",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1490723940.0,
    "date_created": "2017-03-28",
    "time_created": "05:59:00",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi8txj",
    "parent_id": "t1_dfi78za",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "If we can't twirl our willie's around in public, what's this all about? What are we working towards!?  ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1490722939.0,
    "date_created": "2017-03-28",
    "time_created": "05:42:19",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7f9s",
    "parent_id": "t1_dfi6tg5",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I am a physics student in my final year. I also consider myself an atheist, though as a scientist I don't like to say anything for sure.\n\nScience cannot and is not built to answer all questions. The Big Questions are often not interesting to scientists. There are questions that may never be answerable by anyone let alone scientists. Religion can provide a forum for the discussion of these issues. Religion can also be a comfort to people who are struggling with life and need something to hold on to. I don't think it is surprising that secularism seems to be correlated with quality of life. Most religious people I know what what everyone wants, to live good, happy fulfilling lives. They consider the fundamentalists of their faith to be harmful nutters.  \n\nReligion also brings with it a lot of its own pain and suffering, it can be used to shame and control people. However, banning/restricting freedom of religion will only drive these abuses underground. Religion can and is often criticised (very loudly and at length, if this thread is anything to go by). I'm okay with that. It's allowed. It's legal.\n\nWhat I'm not okay with is ostracising and judging people for how they wish to live their lives or where they're from. You can say all the anti-religious stuff you like, but its also my and other people's right to call out prejudice. ",
    "controversiality": 0,
    "ups": 53,
    "downs": 0,
    "score": 53,
    "created": 1490718434.0,
    "date_created": "2017-03-28",
    "time_created": "04:27:14",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7tkb",
    "parent_id": "t1_dfi6ui2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "How does he know?",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1490719680.0,
    "date_created": "2017-03-28",
    "time_created": "04:48:00",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7t7y",
    "parent_id": "t1_dfi6ubd",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "This is a spurious and frankly, a stupid comment. Science and religion are separate pursuits. You might as well build a house and say \"WOW BRICKLAYING 1 RELIGION 0\".",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1490719653.0,
    "date_created": "2017-03-28",
    "time_created": "04:47:33",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7vja",
    "parent_id": "t1_dfi6ubd",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "He's not saying that religion shouldn't be criticised, he's saying that it can answer questions that science can't; because religion, as theology, is a branch of philosophy. \n\nScience can't answer metaphysical questions about ethics, or epistemology, or why we should be governed and what the best way to be governed is. That doesn't mean science should be dismissed because it can't answer those questions, and religion and philosophy shouldn't be dismissed because it's less concerned with the physical world. Religion still has its place in the world. \n\n> the advice to boil their water to avoid cholera\n\nBe more helpful to not mix drinking water with shit, but I wouldn't expect that to be in the Bible because it's a religious history book, not *Medicine for Dummies.*",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490719858.0,
    "date_created": "2017-03-28",
    "time_created": "04:50:58",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfic12f",
    "parent_id": "t1_dfi6ubd",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[Buzz Aldrin](https://www.theguardian.com/commentisfree/belief/2012/sep/13/buzz-aldrin-communion-moon) took communion on the moon. It was the first food and drink ever consumed on the moon. Or had you imagined astronauts must all be staunch atheists?\n\n",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490731238.0,
    "date_created": "2017-03-28",
    "time_created": "08:00:38",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi6t79",
    "parent_id": "t1_dfi6rxk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I agree with that. Religion should play no role in education except in the context of educating about different faiths in a neutral way.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1490716569.0,
    "date_created": "2017-03-28",
    "time_created": "03:56:09",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfikspf",
    "parent_id": "t1_dfi6rxk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think you should have religious education taken out of your primary school level also. I remember sitting round to hear the bible taught to us as if it all happened. We weren't even supposed to be at a religious school. Whereas the same thing happened in high school. But we were all old enough to know that just because \n written down doesn't mean it's actually true.\n\nLet religious education be taught, but teach it in secondary school with a complete disinterest in treating any religion as real. I'd also teach mythology in primary school making it clear how we feel about mythology.\n\nAlso, free schools need to stop. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490743387.0,
    "date_created": "2017-03-28",
    "time_created": "11:23:07",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7u73",
    "parent_id": "t1_dfi6utf",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "My point is the scientific method is not a viable means of obtaining knowledge of all things, and if you think it is then you need to spend less time on r/atheism.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1490719739.0,
    "date_created": "2017-03-28",
    "time_created": "04:48:59",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfikd94",
    "parent_id": "t1_dfi7u7j",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Do it. It'd be interesting to drag out the full religious nutjob. Sufficiently well baited, we could seriously concern a lot of people. This isn't America and being overly religious is less tolerated.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490742920.0,
    "date_created": "2017-03-28",
    "time_created": "11:15:20",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi8o1v",
    "parent_id": "t1_dfi85sv",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "well yeah, agreed. just saying, stupid to dismiss religion as entirely unimportant.",
    "controversiality": 1,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1490722413.0,
    "date_created": "2017-03-28",
    "time_created": "05:33:33",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiax2u",
    "parent_id": "t1_dfiapgh",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I explained it in the initial comment, perhaps you didn't read it. I didn't say individual religions should not be mocked, only that to mock religion in and of itself is, as I said, snobbish, bullying, and ignorant of the fact that all religion is not the same. By all means, criticise flat-earthers and scientologists for the fact the former is utterly, demonstrably false, and that the second is a creepy, controlling organisation we know to be founded by a science fiction obsessive which unashamedly swindles its adherents out of fuckloads of money. But in my opinion dismissing religion as a whole is to ignore its basic nature as the pursuit of an understanding of humankinds purpose; by all means, criticise any particular religion you like if the criticism is fair. ",
    "controversiality": 1,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490728821.0,
    "date_created": "2017-03-28",
    "time_created": "07:20:21",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfinmoi",
    "parent_id": "t1_dfing6m",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Ehh, Im not a fan of any of it. Public display of Muhammad is punished in all form of Islam. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490746412.0,
    "date_created": "2017-03-28",
    "time_created": "12:13:32",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfjwlqi",
    "parent_id": "t1_dfiyy49",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That seems like a very convenient re-definition of the word, in favour of the larger cult/religions who help influence such definitions.\n\nPulling the ladder up behind them.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490809955.0,
    "date_created": "2017-03-29",
    "time_created": "05:52:35",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfk8mwo",
    "parent_id": "t1_dfiyy49",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "What do you consider Scientology to be?  What was it considered when it was founded?  What did the Romans consider Christianity to be?  What was Mormonism considered to be, for the first hundred years of its existence?\n\nJust because your religion is hundreds of years old (or more) and has millions of believers (or more) doesn't mean it was never seen as a cult.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490830014.0,
    "date_created": "2017-03-29",
    "time_created": "11:26:54",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfint8o",
    "parent_id": "t1_dfijyxz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Dont get mad at the studio, get mad at Islam. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1490746608.0,
    "date_created": "2017-03-28",
    "time_created": "12:16:48",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfioutu",
    "parent_id": "t1_dfioj6k",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I do appreciate that, but it's no more the fundamentalist's place to denounce moderates than the moderates to denounce fundamentalists. It's a spectrum, and I feel recognising this helps show that radical islam is as much a product of sociology-economic factors etc as it is a poisoned ideology. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490747692.0,
    "date_created": "2017-03-28",
    "time_created": "12:34:52",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfixtpl",
    "parent_id": "t1_dfinypj",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "They have their own rules though, which are often legalised whether acceptable or not. Look at circumcision. No right minded government would allow it under objective circumstances",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490757136.0,
    "date_created": "2017-03-28",
    "time_created": "15:12:16",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfis87n",
    "parent_id": "t1_dfipblq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'm afraid that is just incorrect. \n\nYes the Quran is the ultimate truth and is not up for debate. What is *entirely* debatable is the consideration for context around quotes for the Quran, and the need to adapt understanding for modern considerations. \n\nMost western Muslims are what could be described as 'modernists', an ideology that aims to reconcile Islam with western values. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490751173.0,
    "date_created": "2017-03-28",
    "time_created": "13:32:53",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiapjf",
    "parent_id": "t1_dfia24v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You do have to wonder though why organisations ostensibly against Islamism (with some notable exceptions such as Quilliam) tend to wind up full of white supremacists who hate Muslims and Islam in general. He also cannot really escape blame for that given he was the founder and leader of the group.\n\nI don't really give him that much credit.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1490728323.0,
    "date_created": "2017-03-28",
    "time_created": "07:12:03",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiixjz",
    "parent_id": "t1_dfi72pz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> regularly held rallies outside mosques.\n\nWhy would they do this?",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490741277.0,
    "date_created": "2017-03-28",
    "time_created": "10:47:57",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfieol9",
    "parent_id": "t1_dfibdef",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That guy wasn't charged with racism actually, he was charged for being offensive.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490735761.0,
    "date_created": "2017-03-28",
    "time_created": "09:16:01",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfigxud",
    "parent_id": "t1_dfidkur",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Professional victims like him and Brigitte Bardot being arseholes and you then whining when they're pulled up on it?\n\nI'm quite happy for such people to be prosecuted. It makes me happy to see racists and general dickheads get fined.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1490738828.0,
    "date_created": "2017-03-28",
    "time_created": "10:07:08",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfib4zc",
    "parent_id": "t1_dfib42r",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No, you asserted, you prove. That's how it works. You're the one trying to prove a point. You prove it, not me.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1490729324.0,
    "date_created": "2017-03-28",
    "time_created": "07:28:44",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiatbu",
    "parent_id": "t1_dfianvw",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It's not a rule that someone has to shoot you for saying something! You can say you're not free from breathing because someone *could* shoot you for it. Plenty of people have insulted Islam without getting shot",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1490728577.0,
    "date_created": "2017-03-28",
    "time_created": "07:16:17",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfifpmn",
    "parent_id": "t1_dfianvw",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You can criticize Islam right this second and not get shot.",
    "controversiality": 1,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490737208.0,
    "date_created": "2017-03-28",
    "time_created": "09:40:08",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfine5o",
    "parent_id": "t1_dfimzqt",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Well, it pretty much is. We ban hate speech because that was the only solution to rampant hate speech that actually worked.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490746157.0,
    "date_created": "2017-03-28",
    "time_created": "12:09:17",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfibb4x",
    "parent_id": "t1_dfib21d",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'm not pinning it on Islam at all, and I agree with most of your points, but I still strongly suspect he used ISIS's cause as an excuse for his rampage. Why do you think he did it, just pissed off with traffic?",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490729710.0,
    "date_created": "2017-03-28",
    "time_created": "07:35:10",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi8hbe",
    "parent_id": "t1_dfi8ayp",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Aren't a lot of the things extremists do explicitly permitted in the Quran though? And coupled with it being *the* word of God and infallible, surely that makes the people *not* doing those things the cherry pickers? The Bible on the other hand isn't seen as infallible, which makes reforming the religion much more palatable for Christians than ignoring the Quran would be for very strict Muslims.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1490721809.0,
    "date_created": "2017-03-28",
    "time_created": "05:23:29",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiaifk",
    "parent_id": "t1_dfi9txe",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think you are smug because your self-confidence in your points seems excessive when what you're doing is taking a massive subject and a huge number of people and reducing both to a tiny number of your own criteria, you've already been the one to bring up 2000 year old books and your repeat mentioning of the notion of \"blind faith\" suggests a bit of an obsession with a certain popular religion on that timescale which in protestant UK is centred around salvation by grace through faith; this is not representative of religion as a whole, which is the the philosophical exploration of life's big questions whether based on blind faith or not. \n\nI find it a tad rich that you accuse me of ridiculously reducing your argument when you initially replied to me with dotted lines, do you have any self-awareness whatsoever? Your definition of religion is neither representative nor fair, would you characterise followers of buddism, shinto and sikhism with it? Or again, do you have a bit of an unhealthy obsession with christianity, which regardless of your thoughts on it is not what we're talking about?\n\nGiven the colossal amounts of literature detailing thousands of years of attempting to understand the world through the religious prism and the huge divides within religious groups, your idea of religion simply being stagnant unthinking belief makes no sense. Furthermore it is ok to be ok with not knowing, because there are certain fields in which it is impossible to definitively know or demonstrably prove, and to abandon these fields altogether for that reason would surely be another example of being ok with not knowing?\n\nPlease quote me equating religion to science? I compared them by definition not substance and you know it, don't be silly. ",
    "controversiality": 1,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490727833.0,
    "date_created": "2017-03-28",
    "time_created": "07:03:53",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfincyq",
    "parent_id": "t1_dfia8va",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "deleted  ^^^^^^^^^^^^^^^^0.0991  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/47956)",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1490746122.0,
    "date_created": "2017-03-28",
    "time_created": "12:08:42",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfivn1u",
    "parent_id": "t1_dfia8va",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The timeline is what made me question. Where was the Judeo/Christian god for the first 10,000 years of known human history. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490754773.0,
    "date_created": "2017-03-28",
    "time_created": "14:32:53",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfic06w",
    "parent_id": "t1_dfibe7w",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "She's smart enough to still pretend to believe in Santa ",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1490731189.0,
    "date_created": "2017-03-28",
    "time_created": "07:59:49",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfibaa9",
    "parent_id": "t1_dfi7f9s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Science cannot and is not built to answer all questions.\n\nAbsolutely agreed. However, saying \"magic sky fairy did it\" is not a suitable alternative. What's wrong with \"we simply don't know, and probably never will\"?",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1490729659.0,
    "date_created": "2017-03-28",
    "time_created": "07:34:19",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi81oc",
    "parent_id": "t1_dfi7f9s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I suppose I am an atheist although I dislike the term as it's plain weird to have to have a name for a non-belief in something for which there is no evidence.  I don't need a special label for my non-belief in unicorns for example.\n\nYou say \"as a scientist I don't like to say anything for sure\" which I consider a weird position.  I think it's perfectly OK to say \"I don't believe in anything for which there is no evidence.\"  There is an equal lack of evidence for fairies but I bet you don't claim to be open about their existence.  This is just one of the ways religion gets unfair treatment.  It's no different in terms of supporting evidence to any one of a massive number of supernatural claims yet we laugh most of them off without fear of causing offence or claims of \"prejudice\".\n\nCan you give an example of a question science is not built to answer?  What do you mean by the Big Questions?  I don't really buy into the idea that \"there's just some things we'll never know\" or realms of knowledge that are forever unattainable.\n\nIf religion is a forum for ideas outside of science that provide comfort well ok...  I guess there is nothing wrong with believing something if it makes you feel good.  Doesn't make it true though.  And if it's outside of science it seems to me it's unfalsifiable.  Indistinguishable from fantasy so what's the point?  To merely feel good is small comfort.  \n\nBesides most of the push back against religion has nothing to do with how it makes its adherents feel.  It's that they claim to have special knowledge that requires us to change the way we live our lives.\n\nI'm not advocating banning religion.  I just think criticising bad ideas should be OK no matter what the topic is.  I agree banning religion would be counter-productive.\n\nIf i'm \"prejudiced\" against ideas that have no evidence to support them I'm OK with that.  I think we all should be.  I don't make it a practice to attack people. In fact I carefully word my responses even online because religion lives close to the part of the brain where people store their personal identity and they are very unlikely to change their minds when you criticise religious ideas even when you bend over backwards to do it politely.\n\nYou don't sound like you are that ok with criticism of religion.  When you say \"it's legal\" you imply it's allowable begrudgingly but undesirable.  I feel the same way about loud exhausts on cars.  I recognise it's legality but find it annoying. \n\nI would argue we should all desire for bad ideas to be openly criticised without fear of offence or reprisal.  It's just better for people and society to foster open forums where people can defend their ideas or change their mind when they recognise their belief is incorrect.\n\n\n\n",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1490720410.0,
    "date_created": "2017-03-28",
    "time_created": "05:00:10",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7sji",
    "parent_id": "t1_dfi7f9s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think you went off on a bit of a tangent there. No one suggested banning religions. The point you're responding too is that we should all be allowed to ridicule religion and call it a bit silly, if we want.",
    "controversiality": 1,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490719594.0,
    "date_created": "2017-03-28",
    "time_created": "04:46:34",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfihd3p",
    "parent_id": "t1_dfi7f9s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Well, my stance shifts a bit. I mean, when it comes to anti-vaccinations types - I'm not prepare to 'live and let live', because ... it's harmful to refuse to vaccinate your children, and it's harmful to repeat fear, uncertainty and doubts to convince others to do the same.\n\nAnd likewise if you start denying provable things like the shape and age of the world, or that climate change is a Real Thing, then I have a problem with that too. \n\nBut the problem here is - religion _sometimes_ overlaps on that.  There's some stuff inherently unprovable (like \"is there a God\" - we can't exhaustively search for something we wouldn't be able to recognise anyway) and I'm ok to let that be the province of philosophy and speculation. \n\nBut promoting ignorance? That's pretty toxic. Not so good for the individual, harmful to their children, and catastrophic when they enter public office. Not all religions do this, but certainly some do. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490739367.0,
    "date_created": "2017-03-28",
    "time_created": "10:16:07",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiwzb0",
    "parent_id": "t1_dfi7f9s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Hammer on nail.\n\nAs a scientist, if by the very definition of a miracle is that it's not repeatable or verifiable and by definition any God is not observable through any type of controlled experimentation I'm not interested.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490756220.0,
    "date_created": "2017-03-28",
    "time_created": "14:57:00",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dficyn6",
    "parent_id": "t1_dfic12f",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "They asked for a moon landing done by a \"religious movement\". Just because Buzz Aldrin is christian it doesn't mean Christians got a man to the moon.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490733005.0,
    "date_created": "2017-03-28",
    "time_created": "08:30:05",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dficx8n",
    "parent_id": "t1_dfic12f",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "And which church sent him there?  \nI didn't ask if any religious people had ever been there.  \nHe was not a religious representative, and no religion has made the effort to place a person there, although many people subscribing to numerous religions have been there.  \nYour own link backs this up:  \n>\"Perhaps, if I had it to do over again, I would not choose to celebrate communion.  \nAlthough it was a deeply meaningful experience for me, it was a Christian sacrament, and we had come to the moon in the name of all mankind – be they Christians, Jews, Muslims, animists, agnostics, or atheists.\"",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490732937.0,
    "date_created": "2017-03-28",
    "time_created": "08:28:57",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi872h",
    "parent_id": "t1_dfi6t79",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I went to a Catholic school and always remember one of my teachers asking people to put up their hand if they didn't believe in a single thing from the bible, then absolutely ridiculing me when I was the only one who did.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1490720886.0,
    "date_created": "2017-03-28",
    "time_created": "05:08:06",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfic8xg",
    "parent_id": "t1_dfi6t79",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "And even then, we should teach about different cultures, not faiths. Faith is part of culture but you're missing a big opportunity to dispel other misconceptions.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490731677.0,
    "date_created": "2017-03-28",
    "time_created": "08:07:57",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiyxwn",
    "parent_id": "t1_dfi6t79",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I went to school in London and at no point did I learn that Muslims believe that their prophet came down on a flying horse. But we certainly learnt about the Great Flood and Moses splitting the sea which a lot of my friends generally considered as nonsensical. According to the Bible God has killed over 2 million people while Satan only killed 10, also when are kids mature enough to learn that Satan was a fallen angel? \n\nShould we also teach kids in school what Mohammed did in his day to day life (pillaging and such) like how kids know that Jesus was a carpenter? When we learn about Historical figures we don't eradicate the bad aspects of their life even if they were great Presidents and such. But it seems that schools aren't teaching religions in a neutral way.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490758322.0,
    "date_created": "2017-03-28",
    "time_created": "15:32:02",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7x6g",
    "parent_id": "t1_dfi7u73",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">My point is the scientific method is not a viable means of obtaining knowledge of all things,  \n\nThen it was a badly made point.  \nRoamingCentaurin never claimed metaphysics was science.\n\n/r/Atheism?  \nI don't go there, but obvious bullshit is obvious.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490720009.0,
    "date_created": "2017-03-28",
    "time_created": "04:53:29",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi7yzh",
    "parent_id": "t1_dfi7u73",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That's true, but religion won't give the answers to any questions. People might ask spiritual questions such as what is the meaning of life? But there is no meaning to life; it exists simply because the physical ingredients for it to do so exist. Religion asks stupid questions which there are no answers to.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490720171.0,
    "date_created": "2017-03-28",
    "time_created": "04:56:11",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfjxha5",
    "parent_id": "t1_dfjwlqi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Well, some of those even meet the standards outlined in that model.  \nAn organisation doesn't have to use *all* of them to be cultish.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490812619.0,
    "date_created": "2017-03-29",
    "time_created": "06:36:59",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfk9b3m",
    "parent_id": "t1_dfk8mwo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You misunderstand.  \nI'm pointing out that the current use of the word \"cult\" has deviated from \"group of people with religious beliefs\" to \"organisation with dangerous manipulative attributes\".\n\n>Just because your religion is hundreds of years old (or more) and has millions of believers (or more) doesn't mean it was never seen as a cult.  \n\nThat's right. Increased numbers do not lend legitimacy to cults.\n\n> What was Mormonism considered to be, for the first hundred years of its existence?\n\nIt was, and still is a cult *according to the BITE model* and *not* simply due to people from other sects wanting to give it a derogatory name.  \nThe modern view of the term is that a group is a cult due to the way it treats its adherents, rather than the manner in which those outside the group view it.  \n\"Cult\" should not just be a general label to be thrown at those we don't like or disagree with.  \nDoing that reduces the value of the word and makes the public less concerned about preventing people falling victim to their practices.  \n\n",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490830734.0,
    "date_created": "2017-03-29",
    "time_created": "11:38:54",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfjc5ro",
    "parent_id": "t1_dfint8o",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "In that case, both.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490773816.0,
    "date_created": "2017-03-28",
    "time_created": "19:50:16",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dficnaz",
    "parent_id": "t1_dfiapjf",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Well I think any more moderate opposition sort of struggles to capture peoples imaginations as well as how easily and quickly they would be condemend. \"We are against Islamism but want to make it abundantly clear we do not hate Muslims.\" However much they would make a claim to being against Islam and not Muslims in general they would still get slandered as being Islamaphobic. I mean Maajid Nawaz and Ayaan Hirsi Ali are not down as supposed figures of hate by the SPLC because moderates are accepted. Anyone moderate who stands up is accused of being a white supremacist or racist. Moderates will usually back down in those circumstances leaving only more extreme individuals standing. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490732437.0,
    "date_created": "2017-03-28",
    "time_created": "08:20:37",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiiqtf",
    "parent_id": "t1_dfigxud",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Sorry but you calling them professional victims doesn't make it so. The people offended by what was said are the professional victims, no one else.\n\nIt's like that new trend of the bleeding heart progressives calling Trump supporters snowflakes as if it somehow makes sense. You are the one getting your panties in a twist over some meaningless words, not him. People complaining about a government overstepping its reach are right to do so, someone whinging because they have had their feelings hurt is not.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490741055.0,
    "date_created": "2017-03-28",
    "time_created": "10:44:15",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfibvp0",
    "parent_id": "t1_dfib4zc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "2 minutes googling...\n\nhttp://www.reuters.com/article/us-france-bardot-muslims-idUSL1584799120080415",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490730936.0,
    "date_created": "2017-03-28",
    "time_created": "07:55:36",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfjva0p",
    "parent_id": "t1_dfifpmn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The context here is literally Charlie Hebdo.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490805723.0,
    "date_created": "2017-03-29",
    "time_created": "04:42:03",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfink2w",
    "parent_id": "t1_dfine5o",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Rampant hate speech or rampant violence against minorities? ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490746333.0,
    "date_created": "2017-03-28",
    "time_created": "12:12:13",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dficntd",
    "parent_id": "t1_dfibb4x",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "He was reported to have told someone before his conversion that he felt a strong desire to kill.\n\nIt might have been an excuse for his rampage, but I think he would have found an excuse either way. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490732464.0,
    "date_created": "2017-03-28",
    "time_created": "08:21:04",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiby3l",
    "parent_id": "t1_dfibb4x",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That I do agree with to be honest. I've started thinking of it in a similar way to mass shootings in america and serial killers. The media circus surrounding attacks inspires copycats and encourages potential attackers to go through with it to get their 15 minutes of infamy. And ISIS have been incredibly adept at using shock to spread their message through the media.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490731072.0,
    "date_created": "2017-03-28",
    "time_created": "07:57:52",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi8ub6",
    "parent_id": "t1_dfi8hbe",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">Aren't a lot of the things extremists do explicitly permitted in the Quran though? \n\nNo really. So many things extremists do are permitted in certain contexts and times. A few of the commonly quoted \"kill the infidel\"/ \"kill them where you find them\" verses were said during war when they were fighting an explicitly non-muslim army who were aggressively attacking the muslims. So acknowledging the true context wouldn't allow extremists to send suicide bombers into market places, or kill civilians etc. But the extremists purposefully ignore the true context for their own ends, which in my opinion is  huuuuge problem in Islam. It requires a tonne of context and back knowledge to properly intepret and this leaves it wide open to abuse. And even some of the correctly interpreted rulings are unacceptable in my opinion.\n\n>The Bible on the other hand isn't seen as infallible, which makes reforming the religion much more palatable for Christians than ignoring the Quran would be for very strict Muslims.\n\nYou are completely right that reforming Islam would be more difficult. It's technically already been through a progressive reformation and the more recent changes are back to conservatism. And this is for numerous reasons that are linked to everything from poverty to decades and decades of spiraling problems in the geopolitics of the middle east.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1490722972.0,
    "date_created": "2017-03-28",
    "time_created": "05:42:52",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfju3ct",
    "parent_id": "t1_dfivn1u",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Which period would that be? One of the earliest recorded religions is Judaism, it predates the Egyptians.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490802127.0,
    "date_created": "2017-03-29",
    "time_created": "03:42:07",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfin7mt",
    "parent_id": "t1_dfic06w",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "My God, you're raising a potential Tory Prime Minister.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1490745966.0,
    "date_created": "2017-03-28",
    "time_created": "12:06:06",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfibk3v",
    "parent_id": "t1_dfibaa9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "So instead of people providing answers that you are at liberty to disagree with, you think no answers are permissible at all? Sounds familiar...",
    "controversiality": 1,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1490730259.0,
    "date_created": "2017-03-28",
    "time_created": "07:44:19",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfihvax",
    "parent_id": "t1_dfi81oc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'd argue the point - we can describe a Unicorn, and scope the problem search space. E.g. we could look at the whole planet, and would reasonably expect to see evidence of unicorns if they existed. \n\nWe have found no such evidence, and therefore can assert a high degree of certainty there are no unicorns.\n\nBut a deity? We don't even know what we're looking for. Nor do we necessarily know that any 'test' of \"is this God\" would actually be reliable. Inherent in the definition is that the thing is unprovable. \n\nI think that's a different class of philosophical argument - can you see an invisible thing? No, because the definition of invisible literally precludes seeing it. Anything you _could_ see... wouldn't be. \n\nCan you prove (or disprove) the existence of God? No, because the definition of a deity precludes you ever doing so. \n\nI'm generally prepared to let that one go as such an argument, and something that is unknowable. \n\nBut I also don't hold that it follows that you can build on an unknowable thing into any sort of chain of logic.\n\nYou can read a book (any book), and enjoy the story, draw wisdom from it, gain some insight and perhaps even understand some of the historical context. And this is true of Holy Books too. \n\nBut I don't see how the chain of logic of 'inherently unknowable God' leads to an assertion of any sort of extra 'weight' to the various holy texts of the world. That's not to say they can't be insightful and moving, and convey useful messages through narrative and metaphor though. But this is true of many books, not just a select list of 'special' ones. \n\nSo by all means, lets debate a piece of scripture and the message and wisdom within. But this is something that either stands in it's own right - or not. It doesn't get a special pass because faith. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490739996.0,
    "date_created": "2017-03-28",
    "time_created": "10:26:36",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi82xm",
    "parent_id": "t1_dfi7sji",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You're a few comments to far into the chain to be saying that",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1490720523.0,
    "date_created": "2017-03-28",
    "time_created": "05:02:03",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfij7zf",
    "parent_id": "t1_dfihd3p",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yeah I agree with this.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490741612.0,
    "date_created": "2017-03-28",
    "time_created": "10:53:32",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfidsce",
    "parent_id": "t1_dficyn6",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It wasn't \"atheists\" who got to the moon either. It was a space agency. He was making a specious point.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490734388.0,
    "date_created": "2017-03-28",
    "time_created": "08:53:08",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfidrnw",
    "parent_id": "t1_dficx8n",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "My point was it wasn't \"atheists\" who got to the moon either. It was a space agency. You were making a specious point.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490734358.0,
    "date_created": "2017-03-28",
    "time_created": "08:52:38",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi9ct3",
    "parent_id": "t1_dfi872h",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Tell you what, show us repeatable evidence of Religion healing specific cancers and we'll call it quits. No?\n> \n\nwell if the question was phrased like that then that would be a ridiculous thing to say.  you don't believe in the existence of jews? ;D\n",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1490724586.0,
    "date_created": "2017-03-28",
    "time_created": "06:09:46",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfichjo",
    "parent_id": "t1_dfi872h",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I don't think teachers should ever ridicule children, but I'm assuming that now as an adult you would no longer claim that you don't believe \"a single thing from the bible\"? If you still do that kind of would deserve ridicule.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490732133.0,
    "date_created": "2017-03-28",
    "time_created": "08:15:33",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfii6fu",
    "parent_id": "t1_dfi872h",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Dunno, that's a pretty broad sort of question. I'm pretty sure there's some stuff in the Bible that if it's not literally true, at least doesn't require much suspension of disbelief. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490740377.0,
    "date_created": "2017-03-28",
    "time_created": "10:32:57",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi9w3f",
    "parent_id": "t1_dfi7x6g",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No he didn't. I provided it as an example of how science does not provide answers that religion does. Science can tell us that everything is made of quarks and leptons and such, but it cannot tell us what \"existing\" means, or why there is something instead of nothing. That is the job of metaphysical paradigms, such as religion.\n\nUnless you think it's the government's job?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490726167.0,
    "date_created": "2017-03-28",
    "time_created": "06:36:07",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi9spj",
    "parent_id": "t1_dfi7yzh",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You are presupposing your own nihilistic viewpoint here.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490725893.0,
    "date_created": "2017-03-28",
    "time_created": "06:31:33",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiitz5",
    "parent_id": "t1_dfiiqtf",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Sorry but you calling them professional victims doesn't make it so. The people offended by what was said are the professional victims, no one else.\n\nOh so professional victims are basically anyone who doesn't like something someone says, are they?\n\nLike me saying that?\n\nCretin.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1490741161.0,
    "date_created": "2017-03-28",
    "time_created": "10:46:01",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfica21",
    "parent_id": "t1_dfibvp0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Right, so that's someone who wasn't \"criticising Islam\", she was criticising \"the Muslim community\" (huge distinction) by saying \"I am fed up with being under the thumb of this population which is destroying us, destroying our country and imposing its acts\", a quote which is followed by Reuters saying:\n\n> Bardot has previously said France is being invaded by sheep-slaughtering Muslims and published a book attacking gays, immigrants and the unemployed, in which she also lamented the \"Islamisation of France\".\n\nThat's pretty much textbook incitement to racial hatred, specifically against the Muslim community as people rather than Islam as a religion.\n\nSo... bollocks.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1490731739.0,
    "date_created": "2017-03-28",
    "time_created": "08:08:59",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi9qpt",
    "parent_id": "t1_dfi8ub6",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Reading you're replies have been extremely insightful, thanks.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490725724.0,
    "date_created": "2017-03-28",
    "time_created": "06:28:44",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfjxodp",
    "parent_id": "t1_dfju3ct",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Judaism is estimated to have been established about 1800 BCE. There are about 5000 more years of known civilization before that and at least 45000 more years between what we known Judaisms founding date is and the aborigines arriving in Australia. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490813175.0,
    "date_created": "2017-03-29",
    "time_created": "06:46:15",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfiegrk",
    "parent_id": "t1_dfibk3v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "But they're not providing an \"answer\", they're providing platitudes and excuses for not having an answer.\n\nIt's no more a valid answer than me saying \"anything we don't understand can be ascribed to a purple sock-eating monster that lives inside my washing machine\".\n\nWould that be a suitable \"answer\" in your mind, or in the mind of any sane creature? No of course not. So please explain why \"god did it\" is any more valid?\n\n> you think no answers are permissible at all?\n\nI think simply saying \"we don't know\" is the only permissible answer that's actually logical.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1490735437.0,
    "date_created": "2017-03-28",
    "time_created": "09:10:37",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfie5r0",
    "parent_id": "t1_dfibk3v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I mean, they're free to use religion as an answer, but at least to me that answer is worthless since it has no basis on evidence.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490734975.0,
    "date_created": "2017-03-28",
    "time_created": "09:02:55",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfig94e",
    "parent_id": "t1_dfibk3v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Nowhere did he forbid the answer from being given, he merely afforded it criticism.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490737929.0,
    "date_created": "2017-03-28",
    "time_created": "09:52:09",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfj0zuv",
    "parent_id": "t1_dfihvax",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Your unicorn test can be applied to Deity's.  We have found no evidence to suggest any deity's (or indeed anything supernatural) exists and, as you say, we can therefore reasonably not believe in them.  \n\nI dispute we don't know what we are looking for when we speak of Deity's.  Depending on which particular one you want to look for you could absolutely devise a method of seeking it out.  Various scriptures make a myriad of testable claims. \n\nOf course we can't prove a negative.  That is why we can also dismiss without evidence the assertions that such things exist.  The burden of proof rests on those claiming a god exists. \n\nI agree that if something is unknowable it's time to let it go.  This is the crucial point I think we differ at. It seems to me at this point you decide \"well I can't know that it's false so I'll stay on the fence.\" Whereas I think this is the point at which gods fall into the same category of \"things for which there is no evidence\" that should be automatically not believed in as a kind of consistency of thought. \n\nEnjoyable discussion!  I feel like we are pretty much on the same page a couple of wrinkles of logic notwithstanding.  I agree with you that invoking deity status or \"inherently unknowable\" adds no weight to an argument.  As you say, and I wholeheartedly agree, arguments should stand or fall on their own merit.  Discussing the claims and messages of scripture, some of which, I agree are moving and insightful is a worthy project.  Of at least equal importance is pointing out the failures of the disturbing and destructive parts.  \n\n",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490760540.0,
    "date_created": "2017-03-28",
    "time_created": "16:09:00",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfih681",
    "parent_id": "t1_dfidsce",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I never said it was athiests. It was scientists; so you know, not a religious movement.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1490739126.0,
    "date_created": "2017-03-28",
    "time_created": "10:12:06",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dficor3",
    "parent_id": "t1_dfichjo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It depends what you mean. There are moral lessons to be learned from the bible etc. but in a theological sense no I don't believe any part of the bible that refers to a deity in any way.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490732509.0,
    "date_created": "2017-03-28",
    "time_created": "08:21:49",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfias98",
    "parent_id": "t1_dfi9w3f",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I agree that the scientific method isn't appropriate for every kind of question. But your original point implied (to me) that religion is useful because it is a good way to approach metaphysics or the \"big questions\".\n\nIs religion any better than science at this? I'd be with you if you were saying that secular academic philosophy is the best method. Religion, in my experience, is about discussing these questions within the narrow confines of long-established dogma.\n\nThere's a reason why religious answers to the big questions so often run into our scientific understanding of the world and our modern ethics.\n\nScience might be no good at answering these questions. Is there any reason to think that religions are good at coming up with good answers to these questions?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1490728505.0,
    "date_created": "2017-03-28",
    "time_created": "07:15:05",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfidqfw",
    "parent_id": "t1_dfi9w3f",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> That is the job of metaphysical paradigms, such as religion.\n\nThe problem being, science knows where it needs to try and explain things and where philosophy starts.  \nReligion's problem is not knowing that boundary and thinking it can provide valid explanations for things that are scientific in nature.  \n\nI have yet to also witness *any* religion providing satisfactory answers to those types of questions, otherwise we would all have found our way to that source of wisdom, not so?",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1490734301.0,
    "date_created": "2017-03-28",
    "time_created": "08:51:41",
    "submission_id": "ukpolitics-61xng1"
  },
  {
    "id": "dfi9whe",
    "parent_id": "t1_dfi9spj",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "How is it nihilistic to say that there is no meaning to life? Human beings always try to rationalise that there must be a higher purpose or plan if we exist, but the fact that there is matter in the universe is cause enough; after however many billions of years, life was bound to spawn somewhere. Doesn't mean that it was created so that it would follow some divine plan.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1490726200.0,
    "date_created": "2017-03-28",
    "time_created": "06:36:40",
    "submission_id": "ukpolitics-61xng1"
  }
]