[
  {
    "id": "dmtx172",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 226,
    "downs": 0,
    "score": 226,
    "created": 1505109613.0,
    "date_created": "2017-09-10",
    "time_created": "18:00:13",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtp1jt",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "When people want to oppose someones views on the grounds of it being \"unchristian\", they often just pick and choose things from the bible which support what they're saying, regardless of whether or not there are other things which contradict the point they're making. Plenty of things in the bible which advocate violence if it is felt to be just. ",
    "controversiality": 0,
    "ups": 115,
    "downs": 0,
    "score": 115,
    "created": 1505100671.0,
    "date_created": "2017-09-10",
    "time_created": "15:31:11",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtvqns",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "To everyone trying to bring up the suggestion that Jesus would be against the idea of paying taxes to help the poor.\n\nMatthew 22:15-22:\n>Then the Pharisees went out and laid plans to trap him in his words. They sent their disciples to him along with the Herodians. \"Teacher,\" they said, \"we know you are a man of integrity and that you teach the way of God in accordance with the truth. You aren't swayed by men, because you pay no attention to who they are. Tell us then, what is your opinion? Is it right to pay taxes to Caesar or not?\"\n\n> But Jesus, knowing their evil intent, said, \"You hypocrites, why are you trying to trap me? Show me the coin used for paying the tax.\" They brought him a denarius, and he asked them, \"Whose portrait is this? And whose inscription?\"\n\n> \"Caesar's,\" they replied.\n\n> Then he said to them, \"Give to Caesar what is Caesar's, and to God what is God's.\"\n\n>When they heard this, they were amazed. So they left him and went away.\n\nRomans 13:1:\n\n> \"Everyone must submit himself to the governing authorities, for there is no authority except that which God has established. The authorities that exist have been established by God.\"\n\nRomans 13:5-7:\n\n> Therefore, it is necessary to submit to the authorities, not only because of possible punishment but also because of conscience. This is also why you pay taxes, for the authorities are God's servants, who give their full time to governing. Give everyone what you owe him: If you owe taxes, pay taxes; if revenue, then revenue; if respect, then respect; if honor, then honor.\n\n",
    "controversiality": 0,
    "ups": 126,
    "downs": 0,
    "score": 126,
    "created": 1505108055.0,
    "date_created": "2017-09-10",
    "time_created": "17:34:15",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmujez8",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "As far as I am concerned, whatever the other intellectual qualities of a person, if he or she looks to a book of instructions for iron-age societies or the proclamations from the Vatican in order to determine socially and economically desirable policies, then he or she is too stupid to be elected.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1505144872.0,
    "date_created": "2017-09-11",
    "time_created": "03:47:52",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtuc80",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The point of the comment is that JRM is a pick and mix Christian, and the comment is absolutely right. This idea that Christianity ialigns to conservatism except for when it aligns with libertarianism is a load of bunk and if you think that's the case then you clearly haven't read the new testament.\n\nThe people shrieking here about how Jesus wasn't a socialist as a rebuttal to the mostly atheist social democrats who hang around here and recognise JRM's disingenuousness have completely missed the point. Talk about straw man arguments.",
    "controversiality": 0,
    "ups": 56,
    "downs": 0,
    "score": 56,
    "created": 1505106438.0,
    "date_created": "2017-09-10",
    "time_created": "17:07:18",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuocgc",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think this guy has his wires crossed, he's thinking of the Jesus from the Bible, how ever modern conservatives worship a different Jesus, Supply Side Jesus:\n\nhttps://imgur.com/gallery/bCqRp",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1505159034.0,
    "date_created": "2017-09-11",
    "time_created": "07:43:54",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmv5nqq",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "ITT - Christians should behave how atheists say they should behave. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1505181377.0,
    "date_created": "2017-09-11",
    "time_created": "13:56:17",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtpd8p",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Surely according to Christianity (not claiming to be an expert) giving to the poor etc would only be of spiritual benefit if it was an individual act and done of your own free will rather than organised and enforced by the state.",
    "controversiality": 0,
    "ups": 100,
    "downs": 0,
    "score": 100,
    "created": 1505101028.0,
    "date_created": "2017-09-10",
    "time_created": "15:37:08",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmushrw",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Come on, Jesus was all about selling weapons to human rights abusers, cutting red tape and making it easier for those with wealth to increase it!\n\nThat was his whole bag, wasn't it?",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1505166148.0,
    "date_created": "2017-09-11",
    "time_created": "09:42:28",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuie6q",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Rees-Mogg: All life is sacrosant\nEveryone: But don't you repeatedly call to cut the overseas aid budget?\nRM: Except that life. That life can go to hell.",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1505142104.0,
    "date_created": "2017-09-11",
    "time_created": "03:01:44",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu4z2o",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'm gonna paste something I posted on FB a wgile back regarding socialism. I know this post isn't about socialism per se, but it follows the same vein of using Jesus to justify economic practices:\n\n\"Well, y'know, if Jesus were around today He would be all about socialism.\"\n\nNo. No He wouldn't. And let me tell you why.\n\n\"Each one must give as he has decided in his heart, not reluctantly or under compulsion, for God loves a cheerful giver. \" (II Corinthians 9:7)\n\nIt's pretty straightforward. You can't force others to be altruistic. Yes, charity is good and God does want us to give to the needy. But only by our own will. Not the government's. Because if our hands are being forced then it's not really us that are being charitable, is it?\n\nAnd on a broader note, I don't think Jesus really cared about government at all. I mean that's the impression I got from the whole \"Render unto Caesar\" thing (Mark 12:17). And why would He anyway? We know from I Samuel 8 that God was straight-up anti-government. When Israel demanded their own king, Samuel, speaking for God, said, \"Look, you really don't want that. If you have a king, all he's gonna do is take your stuff, take your land, and enslave you.\" But Israel was like, \"No yea we're okay with that just give us a king.\" And then Samuel did that thing where you raise your eyebrows and sigh and then say \"All right,\" in a high-pitched voice. And so Israel got a king. AND YOU'LL NEVER GUESS WHAT HAPPENED.\n\nThe point is, God used Israel as an example to show us that we don't need to self-govern, because God is our king. His rule and His law is all the guidance we need.\n\nSo no, don't tell me Jesus would have been a socialist, or a conservative, or a protectionist, or a globalist, or any other political moniker. Jesus was never political in any form. He was just good, in every sense.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1505119915.0,
    "date_created": "2017-09-10",
    "time_created": "20:51:55",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtsmi1",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Just to play Devils Advocate on this one:  \n\nWe could get into the semantics of Christianity/Catholic teachings for days on end with contradictions and interpretations e.t.c.  \n\nNow I'm not defending Moggs views, or his inconsistency with his bible teachings, but in the now famous interview he stated that his opinion on Gay Marriage & Abortion are formed on the basis of the catholic teaching. He did not say that his level of compassion for the poor was formed on the basis of the catholic teaching.  \n\nHe also (very poorly and borderline unsuccessfully) attempted to comunicate that these were his personal views, and that he tries to separate these from his politics.  \n\nPiers Morgan sat opposite him trying to use the argument that he himself is a Catholic, who does not agree with the catholic churches view on gay marriage. Here we have an example of a man following a faith, but dismissing parts of it, or perhaps even cherry picking the few parts he agrees with!\n\nOne can't allow Piers Morgan the argument that he dismisses some parts of the catholic church, whilst remaining catholic, and not extend the same courtesy to Mogg.\n\nMy personal opinion is I think it's a pretty shit set of things he's cherry picking/dismissing, I don't support it at all in the slightest. They are vile opinions not fit for Britain, or anywhere in the modern world.\n\nTL;DR: Mogg clearly selects choice parts of the bible to practice, and others to ignore, just like I daresay the majority of religious people out there. But at no point does he deny this, so far he only says he gets his opinions on 2 subjects from catholic teachings, not 100% of them.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1505104537.0,
    "date_created": "2017-09-10",
    "time_created": "16:35:37",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtvdbs",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Politics is full of un-christians. May, Blair, Trump and many more all profit from their own personal view of WWJD.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1505107617.0,
    "date_created": "2017-09-10",
    "time_created": "17:26:57",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu6ojn",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "From an American perspective, I think you're all missing the real point.  That point is: what are fizzy snakes, they sound awesome.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1505122197.0,
    "date_created": "2017-09-10",
    "time_created": "21:29:57",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmukhx5",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Always seems to be the case for prominent and/or powerful figures who claim to be religious. Depressing but not a surprising. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505148162.0,
    "date_created": "2017-09-11",
    "time_created": "04:42:42",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmukqev",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I am not a Christian myself, but both of these points are addressed in Christian theology.\n\nMogg's position on all these issues is consistent with well-established (even arguably main stream) interpretations of Christian and Catholic theology and doctrine \n\n(of course not all Christians and Catholic agree with these interpretations)\n\n\nMILITARY INTERVENTIONS:\n\nhttps://en.wikipedia.org/wiki/Just_war_theory#Saint_Augustine\n\n> [Saint] Augustine of Hippo claimed that, while individuals should not resort immediately to violence, God has given the sword to government for good reason (based upon Romans 13:4)\n\n> Nonetheless, he asserted, peacefulness in the face of a grave wrong that could only be stopped by violence would be a sin. Defense of one's self or others could be a necessity, especially when authorized by a legitimate authority:\n\nhttps://en.wikipedia.org/wiki/Just_war_theory#Saint_Thomas_Aquinas\n\n> Nine hundred years later, [Saint] Thomas Aquinas (1225-1274) laid out the conditions under which a war could be justified (Combining the theological principles of faith with the philosophical principles of reason, he ranked among the most influential thinkers of medieval Scholasticism):\n\n\nAnd the Catholic Church specifically has doctrine on when war is justifiable.  https://en.wikipedia.org/wiki/Just_war_theory#Doctrine\n\n> The just war doctrine of the Catholic Church—sometimes mistaken as the \"just war theory\"[23][24]—found in the 1992 Catechism of the Catholic Church, in paragraph 2309, lists four strict conditions for \"legitimate defense by military force\"\n\n\nSOCIALISM & WEALTH REDISTRIBUTION\n\nLikewise, the Catholic church has  (at times) taken positions specifically opposed to Socialism\n\nhttps://en.wikipedia.org/wiki/Christian_views_on_poverty_and_wealth#Catholic_social_teaching\n\n> Catholic social teaching is a body of doctrine developed by the Catholic Church on matters of poverty and wealth, economics, social organization and the role of the state. Its foundations are widely considered to have been laid by Pope Leo XIII's 1891 encyclical letter Rerum novarum, which advocated economic distributism and **condemned** **socialism**.\n\n\n\n",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1505148887.0,
    "date_created": "2017-09-11",
    "time_created": "04:54:47",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtsqm0",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "https://i.imgur.com/r75eIHN.jpg",
    "controversiality": 1,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1505104666.0,
    "date_created": "2017-09-10",
    "time_created": "16:37:46",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtru17",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "This is a pretty weak argument, the Catholic Church's position is very clear on abortion and gay marriage (note: he regards marriage as a religious institution and not a civic one). The Catholic Church itself has supported war and engaged in war/military conquest so it's not like that's an argument either. He could also regard welfare as something which is not the responsibility of the state and taxpayer but charities and religious organisations.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1505103641.0,
    "date_created": "2017-09-10",
    "time_created": "16:20:41",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu9uuz",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It's almost as if so much attention is being diverted to Moggs to distract us, from, you know, actual atrocities occuring at the moment.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505126453.0,
    "date_created": "2017-09-10",
    "time_created": "22:40:53",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuohqy",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "While a good point, military intervention is not irreconcilable with Christianity and \"peacemakers\"",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505159344.0,
    "date_created": "2017-09-11",
    "time_created": "07:49:04",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmup7p2",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Blessed are the peacemakers, who nobly watched the Kurds get slaughtered",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505160784.0,
    "date_created": "2017-09-11",
    "time_created": "08:13:04",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuupob",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You ain't no christian bruv",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505169094.0,
    "date_created": "2017-09-11",
    "time_created": "10:31:34",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtrcay",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I hate when people confuse welfare for charity...",
    "controversiality": 1,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1505103100.0,
    "date_created": "2017-09-10",
    "time_created": "16:11:40",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtwnot",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "http://i.imgur.com/xGwXigp.jpg",
    "controversiality": 1,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1505109152.0,
    "date_created": "2017-09-10",
    "time_created": "17:52:32",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmukcp8",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "i strongly think Mogg is closeted. Even when he appeared on the scene on tv, i was like 'this man is gay and can't reconcile himself'",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1505147721.0,
    "date_created": "2017-09-11",
    "time_created": "04:35:21",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtt2bi",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "How is supporting military intervention not in-line with being a 'peacemaker'?\n\nSometimes to make peace you need to use force. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505105017.0,
    "date_created": "2017-09-10",
    "time_created": "16:43:37",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu9lfs",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "This will probs be buried but what the hell.\n\nhttp://www.spiked-online.com/newsite/article/so-should-we-ban-catholics-from-public-life/20301#.WbFAHdN95cA\n\n> I’m wondering if the stinging critics of Rees-Mogg even got to the end of his Good Morning Britain interview. Because if they had they would have heard him make a very important point, a killer point in fact. He said he holds traditional Catholic beliefs on abortion but recognises those beliefs will never be socially acted upon, because the ‘democratic majority’ thinks differently. There you have it. No need for controversy. Because he isn’t seeking to impose his views on us or to change the laws of the country; he’s just going to carry on believing them. This is what it means to live in a tolerant country: people can believe anything they want, but they cannot force anyone else to believe those things. What’s the problem here? Unless we’re saying we have a problem with the very fact that there are people who have certain thoughts in their minds. If we have a problem with that, then Britain is in very serious trouble.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505126093.0,
    "date_created": "2017-09-10",
    "time_created": "22:34:53",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtqqfm",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "A fair point. ",
    "controversiality": 1,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1505102470.0,
    "date_created": "2017-09-10",
    "time_created": "16:01:10",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmty9cm",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505111102.0,
    "date_created": "2017-09-10",
    "time_created": "18:25:02",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtylqh",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yay, more /r/all bait.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505111506.0,
    "date_created": "2017-09-10",
    "time_created": "18:31:46",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtsc1n",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It's been 2000 years so the responses to this kind of argument have become quite practised.\n\nI will add that Christianity is quite flexible, it has been used to justify many horrific acts, and many good ones too. It's really down to interpretation, I'm pretty sure that has been recognised as a large part of its success.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505104199.0,
    "date_created": "2017-09-10",
    "time_created": "16:29:59",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmts358",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Wouldn't most of the military intervention votes to have been to prevent civilian casualties and instability? \n\nI think using an army to stop bad people killing civilians can be argued to be a good thing. Help the poor and weak etc.\n\nWhat an awful attempt at point scoring.",
    "controversiality": 1,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505103929.0,
    "date_created": "2017-09-10",
    "time_created": "16:25:29",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtyxn0",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505111912.0,
    "date_created": "2017-09-10",
    "time_created": "18:38:32",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu2txh",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "While I agree with the principle, don't most organised religions make it clear that they are following *their* specific interpretation of whatever literature is applicable? Picking and choosing the bits that support the way they want to live (and think other people should live), while ignoring the bits that don't?",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505116985.0,
    "date_created": "2017-09-10",
    "time_created": "20:03:05",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmujm29",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The media would never give the same criticism to a Muslim.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505145447.0,
    "date_created": "2017-09-11",
    "time_created": "03:57:27",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu0gds",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That was beautifully said. I like the fizzy snakes, though. But I'm not a Christian, so I can choose what sweets I like.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505113824.0,
    "date_created": "2017-09-10",
    "time_created": "19:10:24",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtu9dv",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Compassion for the poor through voting to give the money of other people to another set of people. ",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505106345.0,
    "date_created": "2017-09-10",
    "time_created": "17:05:45",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtv0cy",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Does Christianity advocate socialism over capitalism, as a general rule? I'm sure I could pick out quotes from the Bible that endorses free enterprise, property rights, a military, the sanctity of the nuclear family, etc \n\nI know Catholicism tends to take more of a dim view on wealth and wealth creation, tends to view poverty as a virtue, emphasises good works like charity, and the capitalist system we have now is largely drawn from dissentient Protestant groups like the Quakers which were quite influential 400 years ago, but I'm not sure as i'm not well versed in the Bible.",
    "controversiality": 1,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505107206.0,
    "date_created": "2017-09-10",
    "time_created": "17:20:06",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtr7bs",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Jesus told you to feed the poor, not take money from others to feed the poor ",
    "controversiality": 1,
    "ups": -2,
    "downs": 0,
    "score": -2,
    "created": 1505102958.0,
    "date_created": "2017-09-10",
    "time_created": "16:09:18",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu20ol",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "What are fizzy snakes? they sound delicious.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505115844.0,
    "date_created": "2017-09-10",
    "time_created": "19:44:04",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuidk0",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "IMO, the issue is, is that the anti-gay marriage discourse in the West is very poorly shaped. It would seem, that religious arguments are about the only available ones. \n\nA possible answer is abandoning rationalism altogether, although it seems very deeply ingrained, especially in English-speaking cultures. There is no rational reason as to why the Big Ben shouldn't be painted pink, and \"I think it's going to look like shit\" is a sufficient explanation as to why someone may not be fond of the idea.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505142058.0,
    "date_created": "2017-09-11",
    "time_created": "03:00:58",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmurocg",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Great. Now I want some fizzy snakes. Stupid Rees-Mogg.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505164954.0,
    "date_created": "2017-09-11",
    "time_created": "09:22:34",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmv6kvb",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Apparently the Christian response to this is; they believe in helping the poor (in their terms), but oops, they also believe you shouldn't steal, and taking money from people (taxes) to help the poor, is unfortunately stealing. Aw jeez.\n",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505182410.0,
    "date_created": "2017-09-11",
    "time_created": "14:13:30",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmvqqlz",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Bloody hell, this has taken off.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505206383.0,
    "date_created": "2017-09-11",
    "time_created": "20:53:03",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmvt16b",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It's just yer typical right-wing \"christian\" hypocrisy.  \n\nThey love to preach the parts of the bible that aim to control people but completely ignore the parts that preach equality, decency, empathy and charity.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505209255.0,
    "date_created": "2017-09-11",
    "time_created": "21:40:55",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmud2qh",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Jesus never said to give to the state so that the state could take care of the poor.\n\nJesus called for people to directly help the poor, not indirectly by threat of force.\n\nPeople always trot this tired shite out, but it's complete nonsense.",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505131186.0,
    "date_created": "2017-09-10",
    "time_created": "23:59:46",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtwytg",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Why is this idiot basing political views on religion anyway? When will we get over this?",
    "controversiality": 1,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1505109530.0,
    "date_created": "2017-09-10",
    "time_created": "17:58:50",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu17ly",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Personally, I feel Jacob Rees-Mogg insulted Christian communities at large by justifying his bigotism with his faith, many Christians and even Roman Catholics don't use their faith as a crutch to discriminate. JR-M saying that he was a bigot, but it's ok because someone told to be, is insulting the people that take the idea of their faith into the world, not the letter of it. ",
    "controversiality": 1,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505114804.0,
    "date_created": "2017-09-10",
    "time_created": "19:26:44",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu4csx",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Welfare =\\= Charity, individual social giving is not socialism, Jesus hates commies.",
    "controversiality": 1,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505119096.0,
    "date_created": "2017-09-10",
    "time_created": "20:38:16",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtt9ku",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "On military intervention, stopping ISIS is a reasonably Christian thing to do, given ISIS's track record with Yazidis and Kurds? Jesus wasn't some hippy pacifist, look up the cleansing of the temple.\n\nAlso, the eye of a needle thing is generally interpreted as meaning that rich people tend to have difficulty letting go of their attachment to their possessions to follow Christ, it wasn't suggesting that by virtue of being rich you are somehow a bad person.\n\nSomeone already posted the help thy neighbour meme so I don't need to do that.",
    "controversiality": 1,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505105232.0,
    "date_created": "2017-09-10",
    "time_created": "16:47:12",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmumxud",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'd like to see Mogg challenged on these points, I'm sure he'll have answers. I love how people on the left are rattled by his popularity. The more they hate him the more we'll love him.",
    "controversiality": 1,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1505155592.0,
    "date_created": "2017-09-11",
    "time_created": "06:46:32",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtr50f",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "*Yawn* Jesus talked about redistributing your own wealth, not other people's through tax and welfare. Support redistributive policies if you believe they're right but don't pretend Jesus came with an explicit political agenda.",
    "controversiality": 1,
    "ups": -5,
    "downs": 0,
    "score": -5,
    "created": 1505102888.0,
    "date_created": "2017-09-10",
    "time_created": "16:08:08",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmujx9z",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Mogg - Tory, christian, white, rich. Views on abortion/gay marriage = bad.\n \nAny Muslims figure - \"Their views have to be respected as it is their culture\".\n\nBTW I find both abhorrent. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505146394.0,
    "date_created": "2017-09-11",
    "time_created": "04:13:14",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtthdr",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "For the last time, welfare is not christian doctrine.\n\nChristianity teaches to give your money to the poor, not to take money from other people by force and give that money to the poor.",
    "controversiality": 1,
    "ups": -5,
    "downs": 0,
    "score": -5,
    "created": 1505105474.0,
    "date_created": "2017-09-10",
    "time_created": "16:51:14",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmueljk",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Live and let live. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505133792.0,
    "date_created": "2017-09-11",
    "time_created": "00:43:12",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuncw6",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No clearer example of an oxymoron than the phrase \"Christian Conservative\"",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505156691.0,
    "date_created": "2017-09-11",
    "time_created": "07:04:51",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuobu4",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "If he were Christian he wouldn't be involved in politics in the first place.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505158996.0,
    "date_created": "2017-09-11",
    "time_created": "07:43:16",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtx77l",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Mogg is an outdated ass-hat",
    "controversiality": 1,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1505109823.0,
    "date_created": "2017-09-10",
    "time_created": "18:03:43",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu1j5x",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Jesus's position best aligns with today's Marxist revolutionaries. Seize the means of Roman abduction. ",
    "controversiality": 1,
    "ups": -1,
    "downs": 0,
    "score": -1,
    "created": 1505115211.0,
    "date_created": "2017-09-10",
    "time_created": "19:33:31",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmub37m",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Educate yourself: https://mises.org/library/christianitys-free-market-tradition\n\nAlso, \"The Church and The Market\" by Dr. Tom Woods is a great read. \n\nGovernment welfare is the antithesis of charity. Charity is voluntary, deliberate, and generally efficient. Government welfare is based on forced redistribution through violence or the threat of violence, otherwise known as extortion. One is moral, the other is not. ",
    "controversiality": 1,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1505128164.0,
    "date_created": "2017-09-10",
    "time_created": "23:09:24",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtruo8",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'm sure Jesus would have rather you feed the poor with your own wealth as opposed to taking money from others and feeding the poor with that.",
    "controversiality": 1,
    "ups": -7,
    "downs": 0,
    "score": -7,
    "created": 1505103661.0,
    "date_created": "2017-09-10",
    "time_created": "16:21:01",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtupk9",
    "parent_id": "t3_6za9of",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Jesus said \"help the poor\" he never said \"build a welfare state\"",
    "controversiality": 1,
    "ups": -2,
    "downs": 0,
    "score": -2,
    "created": 1505106864.0,
    "date_created": "2017-09-10",
    "time_created": "17:14:24",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtxvp2",
    "parent_id": "t1_dmtx172",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> What the bible teaches and what the church does are two separate things.\n\nDo you not understand Catholicism? The Church is central. The Church is what compiled the bible ~350 years after Jesus died. The bishops are believed to be the direct successors of the apostles. The Church is considered the presence of God on Earth and is responsible for revealing its' teachings, the Bible is a tool in this, one that does contain infallible teachings of God, but it came *from* the Church, and not the other way around. So really, what the Church does is ultimately right, if you believe in Catholicism, that is.",
    "controversiality": 0,
    "ups": 128,
    "downs": 0,
    "score": 128,
    "created": 1505110637.0,
    "date_created": "2017-09-10",
    "time_created": "18:17:17",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmujosi",
    "parent_id": "t1_dmtx172",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "My aunt went to Your Minister to pray for her son who died recently and was refused entry unless she paid £10. That turned my stomach, you literally can't pray in that house of god unless you cough up the wonga. I'm glad to be an atheist.",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1505145680.0,
    "date_created": "2017-09-11",
    "time_created": "04:01:20",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuo6g2",
    "parent_id": "t1_dmtx172",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> In the bible it states \"it's easier to get a camel through the eye of a needle than a rich man to heaven\". The Vatican however is one of the richest organisations in the World. Money that could be spent helping the poor.\n\nVatican is a corrupt organization which forfeited teachings of the Christ long time ago.\n\nHowever, that quote is mistranslated and misunderstood. The literal English meaning says it is impossible for rich men to go to heaven. The original meaning was that earthly possessions make it harder for a person to go to heaven, as they are bound to their wealth. It is an important distinction, as the original quote does not bar rich people from going to heaven.\n\nCentralization of Christianity, also sometimes apparent in Protestant and obviously Orthodox faiths, was deeply unchristian and started the detour from true Christian values.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1505158669.0,
    "date_created": "2017-09-11",
    "time_created": "07:37:49",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmudtd6",
    "parent_id": "t1_dmtx172",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Religion is big business.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1505132395.0,
    "date_created": "2017-09-11",
    "time_created": "00:19:55",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmup4tz",
    "parent_id": "t1_dmtx172",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Ah the Catholic Church. An institution which essentially birthed modern banking and globalisation.\n\nTo play Devils Advocate: even though the church spends a shit load of money on its buildings of grandeur (remember that this was a point of theological contention during The Reformation), couldn't it be argued that Catholic Church is still a great force for good: sheltering the homeless, feeding the poor, stepping in as a force for good in the community, donating money to causes and encouraging its members to give and donate?\n\nYou know.....net good and all that.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505160634.0,
    "date_created": "2017-09-11",
    "time_created": "08:10:34",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmv1k9e",
    "parent_id": "t1_dmtx172",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That's what Luther said. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505176913.0,
    "date_created": "2017-09-11",
    "time_created": "12:41:53",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmui3ok",
    "parent_id": "t1_dmtx172",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Tough the Vatican does give out a lot of money to the poor every year, just not all of it.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1505141344.0,
    "date_created": "2017-09-11",
    "time_created": "02:49:04",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu5qv4",
    "parent_id": "t1_dmtx172",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Well done, you are a real christian. So many of them today just straight up ignore the good parts of the bible.",
    "controversiality": 1,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1505120945.0,
    "date_created": "2017-09-10",
    "time_created": "21:09:05",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmulkht",
    "parent_id": "t1_dmtx172",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 1,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1505151539.0,
    "date_created": "2017-09-11",
    "time_created": "05:38:59",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuoix4",
    "parent_id": "t1_dmtx172",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> I do not threaten others who believe differently and state they are going to end up in hell.\n\nHmm, I'm curious, your over all message seems to be Christians need to follow Jesus teachings more, but Jesus definitely did threaten people will hell if they didn't believe in him, and it's actually an original teaching to him as hell isn't in the old testament at all, it started with Jesus.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505159413.0,
    "date_created": "2017-09-11",
    "time_created": "07:50:13",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmussab",
    "parent_id": "t1_dmtx172",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'm not a Catholic. But the land, churches and art that make up their wealth are all material. Its not cash.\n\nYou could argue they might sell it all off to rich guys, pay the bills for a year and forego donations for a few years. But then that money will be spent and theyll be asking for donations again.  \n   I'd rather the church keep it. At least it's on display, and it was gifted to them, by devotees, that is the wish of those who owned it. So let them keep it.\n\nI know they do own land all over the world, I'm Irish,  they own plots of land everywhere here. They let the state build hospitals or schools etc. On it, then they call saint Marks school, or John the Baptist hospital. \n  \nThis is the land they should be selling",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505166556.0,
    "date_created": "2017-09-11",
    "time_created": "09:49:16",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuuc2x",
    "parent_id": "t1_dmtx172",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The anointing of Christ at Bethany seems to indicate that there's nothing wrong with spending money to glorify God and Christ.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505168619.0,
    "date_created": "2017-09-11",
    "time_created": "10:23:39",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmvbg3u",
    "parent_id": "t1_dmtx172",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[THESES INTENSIFY]",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505187844.0,
    "date_created": "2017-09-11",
    "time_created": "15:44:04",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmukjxb",
    "parent_id": "t1_dmtx172",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Actually I'm not sure it's the hypocrisy of the church that is turning people off religion. I think it's more to do with better education especially in the STEM fields. \n\nIf you look at overall world belief in a deity of some form it's about 85-90%.... when you take people who have achieved a graduate degree it drops to around 60%... if that degree is in the stem field it drops to around 30%. Practicing scientists with a PhD it drops to around 7%. \n\nMost of the \"proof\" of the existence of a deity is found at the limits of our knowledge of the physical universe and as the younger generations who are being educated with a greater perspective of the universe it is likely that the number of people who believe in a deity will decrease.\n\nJust to be clear, because I know some people might take offence to what I just wrote, I am not saying that by believing in a god it means that you are uneducated, just that you were educated at a time where we as the human race knew less about our physical universe than we do today. Newton used god to balance the forces of our solar system when doing his laws of motion. And this is a guy who invented calculus pretty much on a dare. I'm also not saying there is anything wrong with a belief in a god of some form, I know some people benefit from the comfort of their spirituality, i was just trying to show why there is a decline in the number of people relying on a deity.",
    "controversiality": 1,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505148335.0,
    "date_created": "2017-09-11",
    "time_created": "04:45:35",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtqvj4",
    "parent_id": "t1_dmtp1jt",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I do genuinely wonder how people think Jesus would react to the concentration camps, or the Rwandan genocide. At the risk of being presumptious, I don't think it would have been to turn the other lung.\n\nI'm not entirely sure what Jesus' advice to the people of Benghazi would be with a dictator stating his intent to go door to door massacring them, but I don't think his advice to people who could help would be to leave them to die.",
    "controversiality": 0,
    "ups": 64,
    "downs": 0,
    "score": 64,
    "created": 1505102611.0,
    "date_created": "2017-09-10",
    "time_created": "16:03:31",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmukoes",
    "parent_id": "t1_dmtp1jt",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "He lost me at \"jelly snakes\" to be honest.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505148716.0,
    "date_created": "2017-09-11",
    "time_created": "04:51:56",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuklto",
    "parent_id": "t1_dmtp1jt",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "My parents are Christians and hold, in my opinion, mostly good views. There are a couple of things that they are iffy on, but they do exactly as you said; they'll follow some parts of the Bible literally and take other parts figuratively.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505148494.0,
    "date_created": "2017-09-11",
    "time_created": "04:48:14",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtzdlp",
    "parent_id": "t1_dmtvqns",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "How do any of those quotes advocate for anything other than paying taxes to the people who govern you? The taxes paid to Caesar and Rome could have been spent on more equipment for legions to pacify provinces in  rebellion or for more conquest for all we know. Is Mogg not paying his taxes? If not I don't see how it is relevant.",
    "controversiality": 0,
    "ups": 85,
    "downs": 0,
    "score": 85,
    "created": 1505112466.0,
    "date_created": "2017-09-10",
    "time_created": "18:47:46",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmty4f0",
    "parent_id": "t1_dmtvqns",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I didn't understand the first one",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1505110938.0,
    "date_created": "2017-09-10",
    "time_created": "18:22:18",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu22pg",
    "parent_id": "t1_dmtvqns",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The quotes from Romans point more to government legitimatcy coming from divine right, as many monarchs have claimed throughout history, than to the legitimacy of redistribution through taxes. It's just the antithesis of democratic rule. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1505115923.0,
    "date_created": "2017-09-10",
    "time_created": "19:45:23",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmunc7d",
    "parent_id": "t1_dmtvqns",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">  for the authorities are God's servants, \n\nRapists, child molesters, war mongers - I mean I am taking into account the whole world here.\n\n> The authorities that exist have been established by God. \n\nThat must suck for South Africans who's authorities are more corrupt then my last save file in Fable. \n\n> Give everyone what you owe him: If you owe taxes, pay taxes; if revenue, then revenue; if respect, then respect; if honor, then honor.\n\nYeaaa but if the guy in government says I owe him 3 times the amount I would normally pay with a smile on his face, because \"Muh national defenses\" or whatever but refuses to tax corporations who are literally the most anti-christian thing ever I think we all can agree your made up fellow in the sky only has so long left before a disaster happens big enough to shake everyone's faith - hopefully. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505156641.0,
    "date_created": "2017-09-11",
    "time_created": "07:04:01",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmv2jhf",
    "parent_id": "t1_dmtvqns",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The Bible doesn't say whether those taxes should be spent on a laissez-fare capitalist society or a welfare socialism society though",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505177963.0,
    "date_created": "2017-09-11",
    "time_created": "12:59:23",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmv6xa4",
    "parent_id": "t1_dmtvqns",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Wow. It's almost as if religion is a tool of social control aimed at deflecting criticism away from the authorities who helped write the bible....",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505182802.0,
    "date_created": "2017-09-11",
    "time_created": "14:20:02",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmulqvh",
    "parent_id": "t1_dmujez8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "They believe in a man in the sky that controls everything, for which there is exactly zero evidence beyond these books and word of mouth 2000 years old. It is a delusion, a medical condition and one that I hope one day everyone starts to recognise deserves our treatment. We can cure the disease that is religion but we have to work out how.",
    "controversiality": 1,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1505152096.0,
    "date_created": "2017-09-11",
    "time_created": "05:48:16",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmurt9x",
    "parent_id": "t1_dmujez8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Democracy is from the bronze age of course, so presumably you're also in favour of eliminating that?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505165156.0,
    "date_created": "2017-09-11",
    "time_created": "09:25:56",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmw3mb9",
    "parent_id": "t1_dmujez8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You can be a Christian and show good judgement, and you can be an atheist who says that Hamas are your friends and Fidel Castro was a champion of social justice. I'll take an average western Christian politician over [an atheist that thinks Christians shouldn't be able to hold public office](https://www.theatlantic.com/politics/archive/2017/06/bernie-sanders-chris-van-hollen-russell-vought/529614/).",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505224899.0,
    "date_created": "2017-09-12",
    "time_created": "02:01:39",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu2jpt",
    "parent_id": "t1_dmtuc80",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I can see how you would think that JRM is a 'pick and mix Christian', however I believe this is because 'Christian' is such a broad term. JMR has only claimed to follow the teachings of the Catholic Church, which has a clear defined set of rules. So the argument that JRM is 'picking and mixing' might be flawed - your issue may be with the Catholic Church, as oppose to the politician in question.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1505116585.0,
    "date_created": "2017-09-10",
    "time_created": "19:56:25",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtxcdi",
    "parent_id": "t1_dmtuc80",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "JRM is a Catholic, they don't subscribe to *sola scriptura* -- the Bible is far from their ultimate authority. Which dogmatic Catholic teachings is JRM pick-and-choosing?",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1505110001.0,
    "date_created": "2017-09-10",
    "time_created": "18:06:41",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmvjx1j",
    "parent_id": "t1_dmtuc80",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "literally every christian is a pick and mix christian, you cannot live your life exactly as the bible says, and nobody expects you to, thats not how it works. its about being a better man",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505197696.0,
    "date_created": "2017-09-11",
    "time_created": "18:28:16",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmw3ngs",
    "parent_id": "t1_dmtuc80",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "All Christians are pick and mix and thank God for that. We couldn't have a police force if Christians followed the bible. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505224967.0,
    "date_created": "2017-09-12",
    "time_created": "02:02:47",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtpt8k",
    "parent_id": "t1_dmtpd8p",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I imagine it would be using the power you have to help other people, so if you're in a position of influence you'd be expected to use that influence to help the needy",
    "controversiality": 0,
    "ups": 79,
    "downs": 0,
    "score": 79,
    "created": 1505101522.0,
    "date_created": "2017-09-10",
    "time_created": "15:45:22",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmttuk4",
    "parent_id": "t1_dmtpd8p",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Such a distinction is not so easy to make in a democracy. Your vote is an individual act but the votes in aggregate determine the state's actions.",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1505105880.0,
    "date_created": "2017-09-10",
    "time_created": "16:58:00",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtvpih",
    "parent_id": "t1_dmtpd8p",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Couple of points.\n\nFirstly, most Christians, if pushed, would say that no good deeds are really of any spiritual benefit. Salvation is offered freely on the basis of repentance only, not good works. *However*, good works are a demonstration that the repentance is serious. \n\nIn Mogg's case, I think that he needs to re-read [the parable of the sheep and the goats.](https://www.biblegateway.com/passage/?search=Matthew+25:31-46) Jesus says: “Truly I tell you, whatever you did for one of the least of these brothers and sisters of mine, you did for me.” and “Truly I tell you, whatever you did not do for one of the least of these, you did not do for me.” He makes no distinction between our responsibilities according to whether we are a private individual, acting on behalf of a government, or an MP who by and large supports the govenment of the day.\n\nI am afraid that it seems to me that Rees-Mogg, May, Duncan-Smith and co are following J K Galbraith's observation that [\"The modern conservative is engaged in one of man's oldest exercises in moral philosophy; that is, the search for a superior moral justification for selfishness.](https://www.brainyquote.com/quotes/quotes/j/johnkennet107301.html)\n\nWhatever, my own reading of the Bible seems to throw up much more about socio-economic morality than about sexual behaviour.",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1505108019.0,
    "date_created": "2017-09-10",
    "time_created": "17:33:39",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtsufx",
    "parent_id": "t1_dmtpd8p",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You're assuming that Christianity only cares about the spiritual benefit to the donor, rather than the help given to the needy.  The major theme of the Bible is the duty on everyone to help the needy, the stranger, the widows and orphans.\n\nNowhere does it add, \"but only if they deserve it.\"\n\nNot a Christian either",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1505104786.0,
    "date_created": "2017-09-10",
    "time_created": "16:39:46",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmttpqj",
    "parent_id": "t1_dmtpd8p",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Jesus spent his whole ministry giving to those who were in need. He spent his time with harlots and drunks.\n\nJesus Christ wasn't some libertarian. He went around talking about a new world order, saying that rich people would find it hard to enter it. Given how adept the Jews and Romans were at making people rich off the back of hard work it makes absolutely zero sense that he'd go around calling for a revolution to replace something with the exact same thing.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1505105737.0,
    "date_created": "2017-09-10",
    "time_created": "16:55:37",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmttfd8",
    "parent_id": "t1_dmtpd8p",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Interestingly, this very idea exists in Islam, where there is a mandatory form of alms-giving (from wikipedia): \n \"As one of the Five Pillars of Islam, zakat is a religious obligation for all Muslims who meet the necessary criteria of wealth. It is not a charitable contribution, and is considered to be a tax\". Interesting to what extent something mandatory can be considered real charity.\n  In the end though, does Mogg regularly give to charity himself? If not, the point this article is making kind of still stands, since he is still picking and choosing between which scripture he believes applies.\n\n Also, on an unrelated note, I am learning Latin and am struggling to translate your flair, what does it say?\n  \n\n",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1505105413.0,
    "date_created": "2017-09-10",
    "time_created": "16:50:13",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtsjom",
    "parent_id": "t1_dmtpd8p",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Libertarian theology",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1505104447.0,
    "date_created": "2017-09-10",
    "time_created": "16:34:07",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtvwk7",
    "parent_id": "t1_dmtpd8p",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Why is organised charity no longer charity? Why are we assuming that Jesus made the same distinction between charity and welfare that we make purely because our language and politics defines them so? \n\nSurely the point of those stories about Jesus were that he wanted to cure these people of their sickness and poverty and saw a world where they were ignored and relied solely on begging for charity. If a society is founded on christian principles, then organised, state-wide aid for these people surely makes sense.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1505108253.0,
    "date_created": "2017-09-10",
    "time_created": "17:37:33",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtwuko",
    "parent_id": "t1_dmtpd8p",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "This. he has spoken quite a lot about favouring individual charaty rather than the state, mainly because people are, most of the time, able to act quicker.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505109384.0,
    "date_created": "2017-09-10",
    "time_created": "17:56:24",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu1ozy",
    "parent_id": "t1_dmtpd8p",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "If people actually did that we wouldn't need taxes to pay for such things.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505115411.0,
    "date_created": "2017-09-10",
    "time_created": "19:36:51",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmudlua",
    "parent_id": "t1_dmtpd8p",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Stop and ask yourself: Is there anything in Christian scripture or prominent theology that would support that assertion?\n\nOutside of whackadoodle American \"Cash Money Supply Side Jesus\" far right fundamentalist BS, I can't think of anything that would support that assertion.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505132047.0,
    "date_created": "2017-09-11",
    "time_created": "00:14:07",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu6gz1",
    "parent_id": "t1_dmtpd8p",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I don't know how you'd come to that conclusion. Could you explain a little bit? \n\nI would have thought creating a system of helping people is the most efficient and fair way to help people. An anachronistic approach is likely to mean that not all those that need help will get help.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505121914.0,
    "date_created": "2017-09-10",
    "time_created": "21:25:14",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmujpjn",
    "parent_id": "t1_dmtpd8p",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "This is exactly the argument JRM himself uses, my counter to that would be that he expects this particular religious doctrine to be applied by the individual, not through state laws, yet he advocates (as evidenced by his voting record) that the adherence to other religious doctrines such as not allowing homosexual marriage and abortion *is* a matter for state laws.\n\nIt seems a bit of a double standard. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505145742.0,
    "date_created": "2017-09-11",
    "time_created": "04:02:22",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtubag",
    "parent_id": "t1_dmtpd8p",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "nope charity is a good in and of itself irrespective of motive",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1505106408.0,
    "date_created": "2017-09-10",
    "time_created": "17:06:48",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtr211",
    "parent_id": "t1_dmtpd8p",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Surely according to Christianity (not claiming to be an expert) giving to the poor etc would only be of spiritual benefit if it was an individual act and done of your own free will rather than organised and enforced by the state.\n\nThat was my first thought. \n\nDoing \"good\" through the state is still doing it by force. If you raise taxes to pay for X good you're still taking away income from somebody and if they resist you throw them in prison. I don't think that's an ethical way of doing things. \n\nOn the other hand, there is a strong \"christian socialist\" thing who think that it is ok to compel people at the threat of prison to relinquish a portion of their income for a so-called \"common good\". \n\n\n",
    "controversiality": 1,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1505102801.0,
    "date_created": "2017-09-10",
    "time_created": "16:06:41",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuh60b",
    "parent_id": "t1_dmtpd8p",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "So how much of his own wealth has Moggy given away? ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505139105.0,
    "date_created": "2017-09-11",
    "time_created": "02:11:45",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuo8xs",
    "parent_id": "t1_dmtpd8p",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Would you not get the spiritual benefit in that case for voting to give the money?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505158820.0,
    "date_created": "2017-09-11",
    "time_created": "07:40:20",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtuuol",
    "parent_id": "t1_dmtpd8p",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Of course, that would mean that socialist governments actually make everyone more likely to be damned to hell for all eternity. This is some US Republican grade social politics right here. ",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505107023.0,
    "date_created": "2017-09-10",
    "time_created": "17:17:03",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmule3r",
    "parent_id": "t1_dmuie6q",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "To be fair to him, his reasons for cutting the aid budget are actually quite sound. He says charity should be left to the private sector as that means people actually have a choice over where that money goes, instead of the govt just choosing which country they want to send it to. It also stops the obvious political motivations behind govt aid where it can be used as part of an arms or oil deal. \n\n\nHis alternative is free trade deals with developing countries that will actually sustain their economies and not create an over dependence on aid.\n\n\nIt's also important to note that he said the emergency aid budget should not be cut, so spending after natural disasters and other shocks will continue.\n\n\nRees-Mogg has a lot of shitty views, but I don't think this is one of them.",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1505150977.0,
    "date_created": "2017-09-11",
    "time_created": "05:29:37",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmujo1l",
    "parent_id": "t1_dmuie6q",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Personal responsibility.\n\nI'm a person, and you're all responsible for paying my Nanny's wages for me.",
    "controversiality": 1,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505145615.0,
    "date_created": "2017-09-11",
    "time_created": "04:00:15",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmv2n6c",
    "parent_id": "t1_dmuie6q",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Some of the overseas aid goes to propping up tinpot dictatorships and selling materiel",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505178075.0,
    "date_created": "2017-09-11",
    "time_created": "13:01:15",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmultaw",
    "parent_id": "t1_dmu4z2o",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> It's pretty straightforward. You can't force others to be altruistic. Yes, charity is good and God does want us to give to the needy. But only by our own will. Not the government's. Because if our hands are being forced then it's not really us that are being charitable, is it?\n\nThis is not consistent with mandatory charity being required in the Old Testament. There is both voluntary support for the unfortunate and mandatory systems and laws to protect and support the unfortunate advocated.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505152295.0,
    "date_created": "2017-09-11",
    "time_created": "05:51:35",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmw3v9s",
    "parent_id": "t1_dmu4z2o",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Jesus was never political in any form. He was just good, in every sense.\n\nA man who opposes the right to self defense cannot be good. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505225454.0,
    "date_created": "2017-09-12",
    "time_created": "02:10:54",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtu34f",
    "parent_id": "t1_dmtsmi1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It's not for any of us to judge if Mogg is a catholic, hes just a bit of a dick to justify taking things from other people away due to the teachings of the catholic church but suddenly rejecting said teachings when its costly to him.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1505106142.0,
    "date_created": "2017-09-10",
    "time_created": "17:02:22",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtxt8g",
    "parent_id": "t1_dmtsmi1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Mogg clearly selects choice parts of the bible to practice, and others to ignore, just like I daresay the majority of religious people out there.\n\nOh, I think that you are being unduly generous there, I think that it applies to 100% of us. I try not to be like that, but I fail. I think that it was Eugene Peterson, of The Message Bible translation, who said something like you've got to read the whole Bible to understand any part of it. Yes, it was:\n\nhttps://www.premierchristianity.com/Past-Issues/2017/July-2017/Eugene-Peterson-The-man-behind-The-Message-on-Psalms-Bono-megachurches-and-his-final-book",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505110555.0,
    "date_created": "2017-09-10",
    "time_created": "18:15:55",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuh1c0",
    "parent_id": "t1_dmtsmi1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">One can't allow Piers Morgan the argument that he dismisses some parts of the catholic church, whilst remaining catholic, and not extend the same courtesy to Mogg.\n\nYes we can. This /r/ukpolitics. We can do whatever the fuck we want: dismiss any argument we see fit, jump any mental hurdle we encounter, erect any number of strawmen to suit or circle jerk. Get the fuck out of here with your logic. Sheeeit. *Smacks lips together and rolls eyes*\n",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505138806.0,
    "date_created": "2017-09-11",
    "time_created": "02:06:46",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuf1ds",
    "parent_id": "t1_dmtvdbs",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "i wouldn't say Trump is in that group. despite his pretences on the campaign, i think it is pretty well established that he has no religion.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1505134613.0,
    "date_created": "2017-09-11",
    "time_created": "00:56:53",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmvik9w",
    "parent_id": "t1_dmu6ojn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "They are. You should get some.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505196000.0,
    "date_created": "2017-09-11",
    "time_created": "18:00:00",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuk1jk",
    "parent_id": "t1_dmtsqm0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "http://www.beliefnet.com/news/2003/09/the-gospel-of-supply-side-jesus.aspx",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505146767.0,
    "date_created": "2017-09-11",
    "time_created": "04:19:27",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtusuz",
    "parent_id": "t1_dmtsqm0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think that only applies in a tyrannical state such as imperial Rome, In a modern democracy the state and its deeds are inseparable from the demos that constitutes it, and so virtuous actions taken by the state as a collective of voting citizens could easily be argued to be virtuous actions taken by every citizen as individuals.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1505106966.0,
    "date_created": "2017-09-10",
    "time_created": "17:16:06",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtvzdm",
    "parent_id": "t1_dmtsqm0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Hmmm, I wonder what the bible says about paying taxes...\n\nMatthew 22:15-22",
    "controversiality": 1,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505108347.0,
    "date_created": "2017-09-10",
    "time_created": "17:39:07",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtsw6v",
    "parent_id": "t1_dmtsqm0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Was about to link that same image.",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505104836.0,
    "date_created": "2017-09-10",
    "time_created": "16:40:36",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtu0ov",
    "parent_id": "t1_dmtru17",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "This current pope has been deeply critical of capitalism, something which whether you agree with or not is seemingly the message of the catholic church. Mogg is happy to support the church when it means taking the rights of others away, but if it is costly to him he is suddenly much less devout.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1505106068.0,
    "date_created": "2017-09-10",
    "time_created": "17:01:08",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuofz7",
    "parent_id": "t1_dmtru17",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">he regards marriage as a religious institution and not a civic one\n\nThat's handy. Shame that position has no basis in reality.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505159244.0,
    "date_created": "2017-09-11",
    "time_created": "07:47:24",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmukhz3",
    "parent_id": "t1_dmu9uuz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Is the Burmese government bribing the British press ? ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505148168.0,
    "date_created": "2017-09-11",
    "time_created": "04:42:48",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtvwbg",
    "parent_id": "t1_dmtrcay",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "What is your distinction? ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1505108246.0,
    "date_created": "2017-09-10",
    "time_created": "17:37:26",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtuaiy",
    "parent_id": "t1_dmtrcay",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That sounds like a properly insidious thing to say.\n\nI'm sure you didn't mean it so!",
    "controversiality": 1,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1505106381.0,
    "date_created": "2017-09-10",
    "time_created": "17:06:21",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu96uz",
    "parent_id": "t1_dmtwnot",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[removed]",
    "controversiality": 1,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1505125538.0,
    "date_created": "2017-09-10",
    "time_created": "22:25:38",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmvht34",
    "parent_id": "t1_dmukcp8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I can think of six counter arguments.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505195078.0,
    "date_created": "2017-09-11",
    "time_created": "17:44:38",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtueer",
    "parent_id": "t1_dmtt2bi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Presumably the argument against this is based upon decades of British military interventions backfiring spectacularly for both Britain and the nations helped/invaded?",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1505106510.0,
    "date_created": "2017-09-10",
    "time_created": "17:08:30",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuif6r",
    "parent_id": "t1_dmu9lfs",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> He said he holds traditional Catholic beliefs on abortion but recognises those beliefs will never be socially acted upon, because the ‘democratic majority’ thinks differently.\n\nhttps://inews.co.uk/essentials/news/lets-take-look-jacob-rees-moggs-voting-record/\n\nQuit telling lies. He votes in accordance with the things he said, and if the DUP were to, for example, attempt to bring a law getting UK abortion laws in line with those of northern ireland [which practically ban abortion as a woman's choice](https://www.mariestopes.org.uk/overseas-clients-abortion/irish/abortion-and-law/abortion-law-northern-ireland), he would vote to restrict abortion. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1505142174.0,
    "date_created": "2017-09-11",
    "time_created": "03:02:54",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtrjwk",
    "parent_id": "t1_dmtqqfm",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "A shallow point - I think would be fairer. ",
    "controversiality": 1,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1505103326.0,
    "date_created": "2017-09-10",
    "time_created": "16:15:26",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmujo73",
    "parent_id": "t1_dmty9cm",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Verse quote?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505145628.0,
    "date_created": "2017-09-11",
    "time_created": "04:00:28",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtyen4",
    "parent_id": "t1_dmts358",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "When ironically they've probably caused civilian casualties and instability ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1505111280.0,
    "date_created": "2017-09-10",
    "time_created": "18:28:00",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtyg0j",
    "parent_id": "t1_dmts358",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "that's was neither the intent nor the result of the 'intervention' in question",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1505111321.0,
    "date_created": "2017-09-10",
    "time_created": "18:28:41",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmulc69",
    "parent_id": "t1_dmujm29",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "👆 the questions that matter",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505150810.0,
    "date_created": "2017-09-11",
    "time_created": "05:26:50",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmup5t8",
    "parent_id": "t1_dmujm29",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "A Conservative Muslim would never even reach that position.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505160686.0,
    "date_created": "2017-09-11",
    "time_created": "08:11:26",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmusk2i",
    "parent_id": "t1_dmujm29",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "A regular Joe wouldn't get the same level criticism either.  I get what you mean, but the reason Mogg gets it so hard is because he is in a position of power and his beliefs and decisions actively affect policy.  If there were high profile Muslim politicians with the same kind of individualistic ideologies, I'd like to think we would criticise them as well.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505166236.0,
    "date_created": "2017-09-11",
    "time_created": "09:43:56",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtvqch",
    "parent_id": "t1_dmtv0cy",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It depends, I think. There is a lot in it that was based in the need for survival when The Bible was first written but, equally, it also has some quite important parts that show a distinct dislike of what we would call capitalism. Examples range from the destruction of Sodom, the various corrupted kings and aristocrats, the myth of the Wandering Jew, and, of course, Jesus chasing the merchants from the Synagogue. \n\nI would also argue that the Quaker vision of capitalism has been lost somewhat. They were philanthropic, built model towns, that kind of thing. Nowadays it is really all about maximising the profits of oneself. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1505108046.0,
    "date_created": "2017-09-10",
    "time_created": "17:34:06",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtw9e6",
    "parent_id": "t1_dmtv0cy",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Capitalism has existed since the 1830s. \n\nThe \"modern bible\" is from 325. It doesn't advocate at all Capitalism or Socialism. Most of it's laws relate to late slave societies or early feudalism.\n\nIn terms of Jesus, I think it's quite blatant he advocates more for a just communal society, but at best it would be \"proto-socialism\" like Mazdaki branch of Zoroastrianism, not actual \"Socialism\" developed in the 19th century.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1505108678.0,
    "date_created": "2017-09-10",
    "time_created": "17:44:38",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu1zja",
    "parent_id": "t1_dmtv0cy",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Jesus himself lived in a commune with mutual property and welfare based in need. \n\nAnyone suggesting he would advocated for wealth hoarding and widely disparate capitalism is just creating a loophole to make themselves feel better. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505115800.0,
    "date_created": "2017-09-10",
    "time_created": "19:43:20",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmul922",
    "parent_id": "t1_dmtv0cy",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Jesus of Nazareth of was born at a time when Palestine was occupied by the Romans. The people of the time were obsessed with what scholars call a *Messianic Hope*, which is to say that they believed that the long-promised Messiah was about to be born and save them all.\n\nWas Jesus the Son of God? That's your own question to answer, but assuming it's a 'No', in this cauldron of social unrest, Jesus went around preaching the advent of the Kingdom of God, and was preaching what the laws of such a society would look like. As others have said, would he really have been calling for revolution by demanding to replace it all with the exact same thing?\n\nHe spent so much of his time with tax collectors (publicans) he got a name for himself, and even assigned one of them (St Matthew) to be one of his right-hand men and a leader in his new kingdom. He clearly wasn't against the idea of a social contract. On the contrary, everything he said was about strengthening your neighbour and building (basically) an egalitarian utopia. When a rich man asked if he could be a part of the movement, Jesus told him to give away all he owned. He gave that charge to everyone, but the specific question was, 'what's holding me back?' and the answer was 'your wealth.'\n\nDid he favour socialism or capitalism? If we have to ascribe his teachings to a political system we understand, it would without a doubt be socialism. He routinely called for society to be reinforced, and wasn't opposed in the slightest to pooling together a community's resources to achieve equality.\n\nOf course, you can always read the Gospel of Supply Side Jesus and ask yourself how Christian capitalism feels when Jesus is spouting off about job creation.\n\nYou should also look up the history of usury, and how the Christian religions abandoned it in the middle ages. But eh ancient Jews and early Christians looked at interest on money lending as sinful.\n\nHaving said all of that, what we have of the Bible has come to us through ancient texts which are probably a little off after 2000 years of translations and revisions.\n",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505150535.0,
    "date_created": "2017-09-11",
    "time_created": "05:22:15",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtt2u1",
    "parent_id": "t1_dmtr7bs",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Jesus literally told the disciples to pay taxes to the Romans.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1505105032.0,
    "date_created": "2017-09-10",
    "time_created": "16:43:52",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmttbyb",
    "parent_id": "t1_dmtr7bs",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "He also said something like, 'its easier for a camel to pass through the eye if a needle than for a rich man to enter the kingdom of God'.\n\nThe Mogg family wealth is in excess of £100 million.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1505105306.0,
    "date_created": "2017-09-10",
    "time_created": "16:48:26",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtsxm7",
    "parent_id": "t1_dmtr7bs",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Where did Jesus preach against taxes or society? ",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1505104878.0,
    "date_created": "2017-09-10",
    "time_created": "16:41:18",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmttzku",
    "parent_id": "t1_dmtr7bs",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "If the rich fed the poor to the best of their ability then there wouldn't be attempts to tax everyone collectively to feed the poor.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1505106035.0,
    "date_created": "2017-09-10",
    "time_created": "17:00:35",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtwcwd",
    "parent_id": "t1_dmtr7bs",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "From another post in this thread:\n\nMatthew 22:15-22:\n\n>Then the Pharisees went out and laid plans to trap him in his words. They sent their disciples to him along with the Herodians. \"Teacher,\" they said, \"we know you are a man of integrity and that you teach the way of God in accordance with the truth. You aren't swayed by men, because you pay no attention to who they are. Tell us then, what is your opinion? Is it right to pay taxes to Caesar or not?\"\nBut Jesus, knowing their evil intent, said, \"You hypocrites, why are you trying to trap me? Show me the coin used for paying the tax.\" They brought him a denarius, and he asked them, \"Whose portrait is this? And whose inscription?\"\n\"Caesar's,\" they replied.\nThen he said to them, \"Give to Caesar what is Caesar's, and to God what is God's.\"\nWhen they heard this, they were amazed. So they left him and went away.\n\nRomans 13:1:\n\n>\"Everyone must submit himself to the governing authorities, for there is no authority except that which God has established. The authorities that exist have been established by God.\"\n\nRomans 13:5-7:\n\n>Therefore, it is necessary to submit to the authorities, not only because of possible punishment but also because of conscience. This is also why you pay taxes, for the authorities are God's servants, who give their full time to governing. Give everyone what you owe him: If you owe taxes, pay taxes; if revenue, then revenue; if respect, then respect; if honor, then honor.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505108794.0,
    "date_created": "2017-09-10",
    "time_created": "17:46:34",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtvsi7",
    "parent_id": "t1_dmtr7bs",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Matthew 22:15-22:\n\n> Then the Pharisees went out and laid plans to trap him in his words. They sent their disciples to him along with the Herodians. \"Teacher,\" they said, \"we know you are a man of integrity and that you teach the way of God in accordance with the truth. You aren't swayed by men, because you pay no attention to who they are. Tell us then, what is your opinion? Is it right to pay taxes to Caesar or not?\"\n\n> But Jesus, knowing their evil intent, said, \"You hypocrites, why are you trying to trap me? Show me the coin used for paying the tax.\" They brought him a denarius, and he asked them, \"Whose portrait is this? And whose inscription?\"\n\n> \"Caesar's,\" they replied.\n\n> Then he said to them, \"Give to Caesar what is Caesar's, and to God what is God's.\"\n\n> When they heard this, they were amazed. So they left him and went away.",
    "controversiality": 1,
    "ups": -1,
    "downs": 0,
    "score": -1,
    "created": 1505108116.0,
    "date_created": "2017-09-10",
    "time_created": "17:35:16",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmujmhz",
    "parent_id": "t1_dmud2qh",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You are talking complete shit. Jesus knew the old testament law, and would have know the mandatory legal compulsion of charity for the support of the poor in Levitical law (23:22):\n\n*“When you harvest the crops of your land, do not harvest the grain along the edges of your fields, and do not pick up what the harvesters drop. Leave it for the poor and the foreigners living among you. I am the LORD your God.”*\n\nMore in Deuteronomy 10:17-19:\n\n*\"For the LORD your God is the God of gods and Lord of lords. He is the great God, the mighty and awesome God, who shows no partiality and cannot be bribed. He ensures that orphans and widows receive justice. He shows love to the foreigners living among you and gives them food and clothing. So you, too, must show love to foreigners, for you yourselves were once foreigners in the land of Egypt.\"*\n\n",
    "controversiality": 1,
    "ups": -1,
    "downs": 0,
    "score": -1,
    "created": 1505145484.0,
    "date_created": "2017-09-11",
    "time_created": "03:58:04",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtz2io",
    "parent_id": "t1_dmtwytg",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1505112078.0,
    "date_created": "2017-09-10",
    "time_created": "18:41:18",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmue4qv",
    "parent_id": "t1_dmu17ly",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "What has he said that is bigoted?",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1505132942.0,
    "date_created": "2017-09-11",
    "time_created": "00:29:02",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmvgowr",
    "parent_id": "t1_dmu17ly",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "People really need to re read the definition of bigot. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505193760.0,
    "date_created": "2017-09-11",
    "time_created": "17:22:40",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtruk5",
    "parent_id": "t1_dmtr50f",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "So why hasn't he redistributed his own wealth? Imo the OP point stands.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1505103657.0,
    "date_created": "2017-09-10",
    "time_created": "16:20:57",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtu5ew",
    "parent_id": "t1_dmtr50f",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Cutting welfare and leaving people to the lottery of charity would be considered unethical and unchristian to a great many people, namely Archbishop Justin Welby, who has repeatedly talked about the redistribution of wealth. \n\n\"Yes of course it is [if paying taxes was a moral issue]- because tax is part of solidarity, tax is part of saying I belong to this place, I benefit from the fact that we have the police, a health service and a welfare system, we have external security - tax says I'm part of that and therefore I contribute to it.\"\n\n\"I think a system that we ensure spreads the goods of wealth more evenly across society is a good system. \"Something that leaves people behind is a very serious problem.\" Asked whether he supported bigger taxes on wealthy people, he responded: \"Inevitably it will mean some people will have to pay more.\"\" \n\nhttps://www.premier.org.uk/News/UK/Archbishop-Welby-Rich-should-pay-more-tax\n\nhttp://www.bbc.co.uk/news/business-31129466",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1505106214.0,
    "date_created": "2017-09-10",
    "time_created": "17:03:34",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtuud8",
    "parent_id": "t1_dmtr50f",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Mogg is a Catholic. Catholic theories of Social Justice talk about Subsidiarity and Solidarity. Subsidiarity means that things should be dealt with at the most appropriate level or scale (emphasizing communities at the right level for the problem), and Solidarity means that we do not just look out for our own group and ignore the wider world, to be a little simplistic.\n\nWhich is to say, Catholicism would absolutely say that problems on a societal level should be dealt with on a societal level, which under the current system involves taxing people to redistribute the wealth. If you'd rather move to a less capitalist system, there might be other ways to ensure people have what they need, but under the current system taxes is how you get it done.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1505107013.0,
    "date_created": "2017-09-10",
    "time_created": "17:16:53",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtwmj5",
    "parent_id": "t1_dmtr50f",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Jesus told people to pay taxes.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505109115.0,
    "date_created": "2017-09-10",
    "time_created": "17:51:55",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmulbor",
    "parent_id": "t1_dmujx9z",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yup.\n\nEquality and freedom is being free to call a cunt a cunt and a stupid belief a stupid belief regardless of race colour religion or creed.\n\nMog is a first class twat who is no different from Muslim, Jewish, spaghetti monster or other Christian twats who claim that two thousand year old tales are a good ethical and moral guides to today.\n",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505150767.0,
    "date_created": "2017-09-11",
    "time_created": "05:26:07",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmun9my",
    "parent_id": "t1_dmujx9z",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I don't remember Sadiq Khan opposing gay marriage and abortion. \n\nYet, as he is a Muslim you look on him with abhorrence. What does it say about you that you are not prepared to regard someone as an individual simply because he forms part of the Muslim community?\n\n",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505156458.0,
    "date_created": "2017-09-11",
    "time_created": "07:00:58",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtw0kk",
    "parent_id": "t1_dmtthdr",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "What do you make of Jesus running the merchants out of the Synagogue? \n\nI get the point that Christianity does teach that personal charity is a good thing (That one ought not to hold on to one's mortal riches and, instead, should turn to the riches that await in the Kingdom of Heaven) but then it is also meant to be taken as a doctrine by a large group of people - that *everyone has to be personally charitable to reap the rewards of Heaven*. \n\nThen there is the argument that the benefits system is an act of personal charity which one does through the auspices of the State -through taxation, i.e.: it is a given, because you are living here, that you accept those terms and conditions. ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1505108386.0,
    "date_created": "2017-09-10",
    "time_created": "17:39:46",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtyuyu",
    "parent_id": "t1_dmtthdr",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Give to Caesar what is Caeser's.\n\nJesus was pro taxes.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1505111821.0,
    "date_created": "2017-09-10",
    "time_created": "18:37:01",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmup8y5",
    "parent_id": "t1_dmuncw6",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "There's no Oxymoron there lmao educate yourself\n\n",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505160852.0,
    "date_created": "2017-09-11",
    "time_created": "08:14:12",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuh1xe",
    "parent_id": "t1_dmu1j5x",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Seize the means of crucifixion",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1505138846.0,
    "date_created": "2017-09-11",
    "time_created": "02:07:26",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtsyk2",
    "parent_id": "t1_dmtruo8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Why? What makes you say that? ",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1505104907.0,
    "date_created": "2017-09-10",
    "time_created": "16:41:47",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtwkr1",
    "parent_id": "t1_dmtruo8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Jesus told people to pay taxes to the Romans, actually.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1505109052.0,
    "date_created": "2017-09-10",
    "time_created": "17:50:52",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtwxuw",
    "parent_id": "t1_dmtupk9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "He said to pay taxes though. Guess how the welfare state is funded?",
    "controversiality": 1,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1505109497.0,
    "date_created": "2017-09-10",
    "time_created": "17:58:17",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu7j99",
    "parent_id": "t1_dmtxvp2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yep, this is pretty spot on. As someone who has studied the role and authority of the church in relation to a catholic point of view. The bible is the 'first' authority but the church is almost if not is as important when it comes to living a holy life.",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1505123319.0,
    "date_created": "2017-09-10",
    "time_created": "21:48:39",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuoy47",
    "parent_id": "t1_dmtxvp2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Pretty good summation, really.\n\nAlso good reason not to be Catholic in my eyes, the whole tradition/ magisterium bollocks.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505160268.0,
    "date_created": "2017-09-11",
    "time_created": "08:04:28",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmurqa6",
    "parent_id": "t1_dmtxvp2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">  its' \n\nWell, that's interesting.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505165032.0,
    "date_created": "2017-09-11",
    "time_created": "09:23:52",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmukk55",
    "parent_id": "t1_dmujosi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "York Minster?",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1505148352.0,
    "date_created": "2017-09-11",
    "time_created": "04:45:52",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuy71j",
    "parent_id": "t1_dmuo6g2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Gonna need a source on that claim. The camel analogy seems pretty clear to me, although it may be that something was lost in translation.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505173217.0,
    "date_created": "2017-09-11",
    "time_created": "11:40:17",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuldgl",
    "parent_id": "t1_dmudtd6",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Tax free as well",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505150921.0,
    "date_created": "2017-09-11",
    "time_created": "05:28:41",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmutoq9",
    "parent_id": "t1_dmup4tz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Not globalisation!!",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505167781.0,
    "date_created": "2017-09-11",
    "time_created": "10:09:41",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuvhv4",
    "parent_id": "t1_dmup4tz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> the church spends a shit load of money on its buildings of grandeur\n\nBlessed are the bricklayers and allied trades.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505170069.0,
    "date_created": "2017-09-11",
    "time_created": "10:47:49",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuyf47",
    "parent_id": "t1_dmup4tz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">essentially birthed modern banking and globalisation.\n\nBy 'essentially' how you mean? I'm genuinely interested to hear if you have more to elaborate on but I have modern banking as coming from the Medicis families with double account book-keeping and various Jews exempted from usury laws. And the globalisation I'd be interested to hear too if there's anything long-form on one or both assertions. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505173470.0,
    "date_created": "2017-09-11",
    "time_created": "11:44:30",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmv4tdw",
    "parent_id": "t1_dmup4tz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Thought the pomp was to awe the peasants into belief in God, the saving them from eternal damnation and making the whole thing worth it.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505180453.0,
    "date_created": "2017-09-11",
    "time_created": "13:40:53",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuibkk",
    "parent_id": "t1_dmu5qv4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Who are you to judge “the good parts of the Bible” when it is God’s word?",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1505141917.0,
    "date_created": "2017-09-11",
    "time_created": "02:58:37",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuur26",
    "parent_id": "t1_dmulkht",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> The Holy Roman Empire was just a continuation of the Roman Empire with a different brand name.\n\nwut",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505169142.0,
    "date_created": "2017-09-11",
    "time_created": "10:32:22",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuwi33",
    "parent_id": "t1_dmulkht",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The holy Roman empire is distinct from the Vatican and the old Roman empire.\n\nIt was a collection of German regions , grouped more or less loosely under a common emporer.  ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505171293.0,
    "date_created": "2017-09-11",
    "time_created": "11:08:13",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmunavh",
    "parent_id": "t1_dmukjxb",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The problem is, I think, that you're implying here that because the more educated one is in STEM, the more likely one is to be an atheist, that being more educated in STEM makes one less likely to be religious. The other possibility of course is simply that atheists are more likely than theists to pursue a STEM education/career, which could suggest a far more mundane commentary about people with particular beliefs tending to focus on particular careers. Hence why, for instance, the majority of medical practitioners believe in a deity. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505156547.0,
    "date_created": "2017-09-11",
    "time_created": "07:02:27",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuodoc",
    "parent_id": "t1_dmukjxb",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "you make a good point.\n\ni wonder where deists and simulation theorists fit in to those figures.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505159108.0,
    "date_created": "2017-09-11",
    "time_created": "07:45:08",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtt14o",
    "parent_id": "t1_dmtqvj4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It made me think of the Plagues of Egypt, the last being the death of the firstborn son. That was for less than concentration camps.",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1505104983.0,
    "date_created": "2017-09-10",
    "time_created": "16:43:03",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmttv1f",
    "parent_id": "t1_dmtqvj4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I asked myself what would Jesus do. Then I shouted at a fig tree.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1505105896.0,
    "date_created": "2017-09-10",
    "time_created": "16:58:16",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtslgp",
    "parent_id": "t1_dmtqvj4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Some people are just really disingenuous about Jesus, I'd attribute it to this new \"nice Christianity\". Jesus did plenty of \"not nice\" things and the church (in general, most sects, not just CoE) does their best to try and make him seem like this happy clappy hippie.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1505104504.0,
    "date_created": "2017-09-10",
    "time_created": "16:35:04",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtx4zt",
    "parent_id": "t1_dmtqvj4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> I do genuinely wonder how people think Jesus would react to the concentration camps, or the Rwandan genocide. At the risk of being presumptious, I don't think it would have been to turn the other lung.\n\nGiven quite a lot in the gospels about just that, what do *you* think his reaction would have been?\n\nRemember, he lived in a country under the control, even if partly though a puppet king, of the Romans, who were not exactly benign, and not that long afterwards pretty much razed Jerusalem. \n(See Luke 13, 1: \"Now there were some present at that time who told Jesus about the Galileans whose blood Pilate had mixed with their sacrifices.\")\n\nQuite a lot of the Jews of the time thought that the Messiah was going to lead them in kicking out the Romans, and got fed up with Jesus when it became clear that he was not going to do that.\n\nI really don't know how Jesus would react to our current examples of man's \"inhumanity\" to man, but I am pretty sure that it would not be a military response. I would suspect it would be more like either the woman they wanted to stone, \"Let he who is without sin cast the first stone\" or when they took Him from the synagogue in Nazareth to a cliff, intending to throw him off because he had dared to tell them som uncomfortable truths, \"But he walked right through the crowd and went on his way.\"",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1505109745.0,
    "date_created": "2017-09-10",
    "time_created": "18:02:25",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmunkvn",
    "parent_id": "t1_dmtqvj4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Actually it would have been \"turn the other cheek\" whether you like it or not. Just as terrible things as that were happening in Jesus's time and he never said to use violence to fight against them. The Romans became successful mostly through genocide and the old testament is full of such acts a well so it's not like Jesus didn't know about those things happening.\n",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505157259.0,
    "date_created": "2017-09-11",
    "time_created": "07:14:19",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmujdr2",
    "parent_id": "t1_dmtqvj4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "*presumptuous\n\nFYI",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505144766.0,
    "date_created": "2017-09-11",
    "time_created": "03:46:06",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuofxh",
    "parent_id": "t1_dmtqvj4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "likely his advice to the people in danger would be leave if you can and stay strong and support each other if you cant. everyone else would be commanded to go help them escape.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505159242.0,
    "date_created": "2017-09-11",
    "time_created": "07:47:22",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu218g",
    "parent_id": "t1_dmtzdlp",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The worst thing is that all 3 take contradictory standpoints to each other. \n\nIn the first quote, Jesus gets around being for or against paying taxes to Caesar by stating that they are Caesar's coins, and therefore taxation (a necessary functional of government) is not controlled by or related to God, but the second quote states: \"The authorities that exist have been established by God\" and third quote called the authorities to which one pays taxes \"God's servants who give their full time to governing\". \n\nIn essence the first quote is assigning the system of paying taxes to humanity, separating it from God. The second implies a direct role by God in establishing said authorities, therefore implying you are paying taxes to a divine institution. The third quote subverts both other quotes by kind of saying you should pay taxes for your own conscience, but also saying that you \"owe\" taxes to governors who are faithful and pure servants.\n\nIf anything, the third quote ironically paints why we *shouldn't* justify tax increases for the supposed need to help the poor. Because the bottom line is, we pay taxes for a welfare system *right now* that is innefficient and fails to get people off the street, whilst most of the money goes towards employing the innefficient bureaucracy behind it. Not everyone at every level of our current, broken system is \"God's servant\".",
    "controversiality": 1,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1505115866.0,
    "date_created": "2017-09-10",
    "time_created": "19:44:26",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtz04t",
    "parent_id": "t1_dmty4f0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It doesnt actually have anything to do with taxes (really) and (imo) is a poor choice by OP in trying to prove his point, made worse by the fact that he seems intent on repeating it over and over again.\n\nUltimately that passage is describing the difference between the work of man and the work of God and how, you should pay your way in life to the rightful person. Money is the work of man and our souls are the work of God, we owe money to our earthly rulers and our souls and lives to our Heavenly Father. If you would like to know more about how God feels about the works of man, then please check out Isaiah 40.  \n\n*Feel free to disagree on my interpretation of that passage but that is how I understand it. \n\n",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1505111996.0,
    "date_created": "2017-09-10",
    "time_created": "18:39:56",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtzvo2",
    "parent_id": "t1_dmty4f0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Jesus is essentially staying neutral on the point of whether taxes are good/just. He suggests the regular everyman pays his taxes and serves God however he can.\n\nThe problem with trying to apply Jesus' teaching to politicians is that he pretty much stayed neutral on the role of the state whenever it came up. Besides, the role of Rome in Israel in Jesus' time isn't really comparable to modern governments.\n\nSome people on the right take this to mean Jesus was an individualist. Others on the left think Jesus' teaching about how individuals should act should be applied to the government. ",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1505113113.0,
    "date_created": "2017-09-10",
    "time_created": "18:58:33",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmv2kyr",
    "parent_id": "t1_dmty4f0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Matters of the state belong to the state, matters of religion belong to religion. It's the separation of church and state.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505178008.0,
    "date_created": "2017-09-11",
    "time_created": "13:00:08",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmv7v05",
    "parent_id": "t1_dmv2jhf",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Probably because such constructs didn't exist back then. And it's for this reason all the arguments suggesting \"well Jesus didn't mean create a welfare state, he meant you should help others yourself\" are rather disingenuous as the option to create a welfare state literally wasn't an option in his time. At best we literally cannot quantify what his stance on what governments should do as there is literally no parallel to what we have now in the Roman empire (though personally I think if there were a reasonable route that assured a decent minimum standard of living for everyone then he would actively encourage people to take it).",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505183860.0,
    "date_created": "2017-09-11",
    "time_created": "14:37:40",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmv86v4",
    "parent_id": "t1_dmv6xa4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I mean i happen to agree that (as noble as Jesus' intentions may have been) organised religion as a whole got corrupted in its early roots by authorities as a method of maintaining control of the populace.\n\nHowever, the discussion in this thread is about how IF a man describes himself as a devout Christian (and uses it to justify some socially conservative views), then he ought to be following the tenets of his religion.\n\nThe fact that organised religion is corrupted doesn't factor in.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505184234.0,
    "date_created": "2017-09-11",
    "time_created": "14:43:54",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmumrxw",
    "parent_id": "t1_dmulqvh",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You might need to go to hospital for that edge ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1505155151.0,
    "date_created": "2017-09-11",
    "time_created": "06:39:11",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmvjtht",
    "parent_id": "t1_dmulqvh",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "fucking hell dude",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505197572.0,
    "date_created": "2017-09-11",
    "time_created": "18:26:12",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuox0g",
    "parent_id": "t1_dmulqvh",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> man in the sky\n\nmore like multidimensional being in a higher plae of existence.\n\n>that controls everything\n\nmore like \"that started everything going millions of years ago and has largely just sat back and watched but occasionally sent a fe instructions along the way.\n\n>for which there is exactly zero evidence beyond these books and word of mouth 2000 years old.\n\ntrue\n\n> It is a delusion, a medical condition and one that I hope one day everyone starts to recognise deserves our treatment\n\ncoming off a bit strong there, tarring everyone with the same brush. yes there are some christians who litterally believe that god is talking to them, and yes they do gather some followers, but largely christians are far less extreme than this. they simply think that their holy book is a good life guide and choose to live by it. \n\n>We can cure the disease that is religion but we have to work out how.\n\nswap religion with judeism or homosexuality and youll see why i disagree with this statement",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505160207.0,
    "date_created": "2017-09-11",
    "time_created": "08:03:27",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmv004k",
    "parent_id": "t1_dmurt9x",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The democracy we now practice certainly does not date from the bronze age. Check your sources.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505175218.0,
    "date_created": "2017-09-11",
    "time_created": "12:13:38",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmw48pg",
    "parent_id": "t1_dmw3mb9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I saw nothing in that article that suggests Sanders advanced a view that Christians shouldn't hold office.\n\nThis is difficult, because a lot of people who identify as Christians have nothing more than a vague belief in something which allows them to deal with their fear of death.\n\nBut committed Chistians definitely *cannot be trusted* to show good judgment, because you never know when they are going to say 'No, this conflicts with my Holy Book or Received Wisom and so Imma vote against it - regardless of how many changes there have been in science and society since then.'",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505226288.0,
    "date_created": "2017-09-12",
    "time_created": "02:24:48",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmufbi2",
    "parent_id": "t1_dmu2jpt",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "RC Church is a long-time and vocal supporter of trade unionism. Rees-Mogg is aggressively anti trade unionism.\n\njust one of the top of my head.",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1505135148.0,
    "date_created": "2017-09-11",
    "time_created": "01:05:48",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmufx4k",
    "parent_id": "t1_dmu2jpt",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Ok. If his beliefs are so important why isn't he lobbying the government to stop the sale of arms to the Saudis?",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1505136385.0,
    "date_created": "2017-09-11",
    "time_created": "01:26:25",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmub1zd",
    "parent_id": "t1_dmu2jpt",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "He's an arms-dealing piece of shit. Where's that teaching in the NT?",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1505128117.0,
    "date_created": "2017-09-10",
    "time_created": "23:08:37",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu2jhd",
    "parent_id": "t1_dmtxcdi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Well the pope is pretty keen on environmental protection. What's JRMs line on that?",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1505116576.0,
    "date_created": "2017-09-10",
    "time_created": "19:56:16",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtw6lv",
    "parent_id": "t1_dmtpt8k",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Jesus was all about paying taxes to the occupying power though",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1505108585.0,
    "date_created": "2017-09-10",
    "time_created": "17:43:05",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmttjv1",
    "parent_id": "t1_dmtpt8k",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Helping people != forcing others to help people.",
    "controversiality": 1,
    "ups": -7,
    "downs": 0,
    "score": -7,
    "created": 1505105554.0,
    "date_created": "2017-09-10",
    "time_created": "16:52:34",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu327a",
    "parent_id": "t1_dmtvpih",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Firstly, most Christians, if pushed, would say that no good deeds are really of any spiritual benefit.\n\nYou are only talking about Protestants, probably because that is the majority of American Christians.  And since there are more Catholics than Protestants then the majority of Christians should believe in good works.  As a side note, it seems Jesus was fairly pro-good works by his actions and his words, a single line taken out of context (ie \"by grace alone\") shouldn't really overthrow all that stuff as Protestants seem to believe, when there are about hundreds of other quotes telling people to be kind and charitable to the downtrodden.  I mean, does Jesus even say that line?  No, it's in Ephesians, Paul probably didn't even write it and Paul is already far removed from Jesus, it wasn't in the Gospels or anything, but in the Gospels there are continuous pleas to do good works (purportedly straight from Jesus' mouth).",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1505117313.0,
    "date_created": "2017-09-10",
    "time_created": "20:08:33",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtym8a",
    "parent_id": "t1_dmtvpih",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I thought Catholics were the exception in that they do believe in the power and necessity of doing good works?\n\nNot to mention the more general Christian sentiment of \"If I have faith to move mountains but have not love I am nothing\".",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1505111524.0,
    "date_created": "2017-09-10",
    "time_created": "18:32:04",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuon6r",
    "parent_id": "t1_dmtvpih",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Firstly, most Christians, if pushed, would say that no good deeds are really of any spiritual benefit. Salvation is offered freely on the basis of repentance only, not good works.\n\nNo, only some Protestants would say that, and most Christians are either Romans or Orthodox.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505159660.0,
    "date_created": "2017-09-11",
    "time_created": "07:54:20",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu18r0",
    "parent_id": "t1_dmtsufx",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "http://biblehub.com/matthew/5-44.htm",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505114843.0,
    "date_created": "2017-09-10",
    "time_created": "19:27:23",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmty9h8",
    "parent_id": "t1_dmttfd8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1505111106.0,
    "date_created": "2017-09-10",
    "time_created": "18:25:06",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtvjkp",
    "parent_id": "t1_dmttfd8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think it's referencing [this](http://www.telegraph.co.uk/news/worldnews/europe/eu/10874230/Jean-Claude-Juncker-profile-When-it-becomes-serious-you-have-to-lie.html)",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505107821.0,
    "date_created": "2017-09-10",
    "time_created": "17:30:21",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuljr7",
    "parent_id": "t1_dmtsjom",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No, Calvinism",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505151475.0,
    "date_created": "2017-09-11",
    "time_created": "05:37:55",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtx1e1",
    "parent_id": "t1_dmtvwk7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Jesus went around telling people to give to the poor. He didn't take over the Judean state and up taxes to create a welfare state.",
    "controversiality": 1,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505109620.0,
    "date_created": "2017-09-10",
    "time_created": "18:00:20",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmueqhu",
    "parent_id": "t1_dmudlua",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "If Christian religion were the truth would you expect to receive the final judgement based on how you acted in life or would you expect to be judged in a job lot along with your entire society using a principle of collective responsibility?  If you want credit for the welfare you have to be willing to personally accept the blame for the drone strikes as well.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505134045.0,
    "date_created": "2017-09-11",
    "time_created": "00:47:25",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuk0o6",
    "parent_id": "t1_dmudlua",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[Good ol' supply side Jesus] (http://www.beliefnet.com/news/2003/09/the-gospel-of-supply-side-jesus.aspx)",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505146689.0,
    "date_created": "2017-09-11",
    "time_created": "04:18:09",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtwpjk",
    "parent_id": "t1_dmtubag",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "How?",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505109214.0,
    "date_created": "2017-09-10",
    "time_created": "17:53:34",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmts1vc",
    "parent_id": "t1_dmtr211",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">> Surely according to Christianity (not claiming to be an expert) giving to the poor etc would only be of spiritual benefit if it was an individual act and done of your own free will rather than organised and enforced by the state.\n>\n>That was my first thought. \n>\n>Doing \"good\" through the state is still doing it by force. If you raise taxes to pay for X good you're still taking away income from somebody and if they resist you throw them in prison. I don't think that's an ethical way of doing things. \n>\n>On the other hand, there is a strong \"christian socialist\" thing who think that it is ok to compel people at the threat of prison to relinquish a portion of their income for a so-called \"common good\". \n>\n>\n\nJesus is a libertarian now? What happened to \"render unto Cesar the things that are Cesar's\"\n\n",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1505103891.0,
    "date_created": "2017-09-10",
    "time_created": "16:24:51",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu4g51",
    "parent_id": "t1_dmtr211",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Doing \"good\" through the state is still doing it by force. If you raise taxes to pay for X good you're still taking away income from somebody and if they resist you throw them in prison. I don't think that's an ethical way of doing things. \n\nAren't we talking about what Rees-Mogg should be doing? In which case he should surely be doing what is in his power as an MP to help the needy, i.e. vote for measures which help them.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505119218.0,
    "date_created": "2017-09-10",
    "time_created": "20:40:18",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuhfdq",
    "parent_id": "t1_dmtr211",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "its not by force. you can just fuck off to Somalia and live in a lawless, government free desert and make your riches there.\n\nbut if you live on the UK as an adult and choose to use the society go generate excess wealth, taxation is part of the agreement to be allowed to do that.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505139701.0,
    "date_created": "2017-09-11",
    "time_created": "02:21:41",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu0p35",
    "parent_id": "t1_dmtr211",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Depends. \"Doing good\" through a capitalist state largely means giving back a modicum of that which capitalism steals in the first place. Ignoring the immoral land rights (the Enclosure Acts etc) which bedrock the system, we're talking about an economic system which is in effect a giant debt ponzi which (as all money is inherently outpaced by debt, such that all profit must push debt upon others- hence 80 percent of the planet in poverty) systemically cannot even provide full employment (as workers earn in aggregate less than the cost of the goods they produce etc). A capitalist state forcing you to give stuff to others is (theoretically, most of this tax goes to horrible things) is a means of redressing larger forms of \"theft\". ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505114129.0,
    "date_created": "2017-09-10",
    "time_created": "19:15:29",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu2dti",
    "parent_id": "t1_dmtr211",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yeah I feel like Jesus \"give to ceaser what is ceasers\" might strongly disagree with you there.  The most important tenants in the new testament are humility and compassion.  The rest if Christan behaviour is supposed to stem from those two tenants.\n\nThat said I have not met a super humble and compassionate Christan..... Ever.  So. Who gives a fuck.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505116353.0,
    "date_created": "2017-09-10",
    "time_created": "19:52:33",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmulnpy",
    "parent_id": "t1_dmule3r",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "One of the reasons such aid budgets were setup is because private individuals don't provide sufficient funding nor is it the type of funding that is necessary to build their economies. People don't donate in building dams, power stations and businesses, instead they donate when people are starving or have no water.\n\nThe international aid budgets were set up to ensure that in the future these countries could and would stand on their own, could deal with their own disasters and to slowly but surely make the entire world developed not developing or third world. His view on this is simply not grounded in the reality of how people in the UK donate and would end up breaking treaties we have made with other countries on how we will help the developing nations for a better future of the world.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1505151828.0,
    "date_created": "2017-09-11",
    "time_created": "05:43:48",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmv80q8",
    "parent_id": "t1_dmule3r",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "If by sound you mean he's capable of making them appear logical while not actually standing up to any evidence, then yes. They're totally sound. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505184041.0,
    "date_created": "2017-09-11",
    "time_created": "14:40:41",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmunvur",
    "parent_id": "t1_dmujo1l",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Mr Ress Moggs is one of the [lowest claiming MP's by a long way](http://www.mpsexpenses.info/#!/all), he got his job in the commons by election he is paid a wage for that job.\n\nWould you rather he worked more on the side as a Capital Manager to cover Nanny's wage, or would you prefer a full time professional politician?\n\nIt is not your business what he dose with his wage, no more that anyone else's employer can dictate such",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1505158004.0,
    "date_created": "2017-09-11",
    "time_created": "07:26:44",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuqq2a",
    "parent_id": "t1_dmultaw",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'm talking about Jesus, not the OT. When the two seem to contradict, Jesus always takes precedence. It's called Christianity, not OldTestamentianity.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505163454.0,
    "date_created": "2017-09-11",
    "time_created": "08:57:34",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmwgg2q",
    "parent_id": "t1_dmw3v9s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "What makes you think He opposed that right? I mean even His disciples carried swords.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505253427.0,
    "date_created": "2017-09-12",
    "time_created": "09:57:07",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmus8gk",
    "parent_id": "t1_dmuf1ds",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Doesn't stop him pandering to the religious right in the US",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505165781.0,
    "date_created": "2017-09-11",
    "time_created": "09:36:21",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuxicb",
    "parent_id": "t1_dmtusuz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> imperial Rome\n\n>  tyrannical state\n\nquomodo audes vos",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505172452.0,
    "date_created": "2017-09-11",
    "time_created": "11:27:32",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtw4x0",
    "parent_id": "t1_dmtvzdm",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Does the Bible say anything about setting taxes?",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1505108530.0,
    "date_created": "2017-09-10",
    "time_created": "17:42:10",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtuigz",
    "parent_id": "t1_dmtsw6v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I wonder what charities you both give money to.",
    "controversiality": 1,
    "ups": -3,
    "downs": 0,
    "score": -3,
    "created": 1505106639.0,
    "date_created": "2017-09-10",
    "time_created": "17:10:39",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtwhim",
    "parent_id": "t1_dmtu0ov",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">This current pope has been deeply critical of capitalism\n\nNot only the current pope, La Civilta Cattolica (Vatican newsletter) has taken a very left wing turn of late and it's utterly hilarious reading the butthurt comment sections with all the Americans and Right wingers losing their shit.\n\nIt's legit like:\n\"AKSUALLY JESUS LOVES CAPITALISM AND TOLD POOR PEOPLE TO BOOTSTRAP, FUCKING COMMIES HAVE OVERTAKEN THE CHURCH!\"",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1505108947.0,
    "date_created": "2017-09-10",
    "time_created": "17:49:07",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtxk6v",
    "parent_id": "t1_dmtu0ov",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "There is a difference between the personal views of the Pope, and defined doctrine agreed by the authority of the Church to be God's teaching. No Pope has made an infallible statement *ex cathedra* for decades.\n\nYour comment suggests a shallow understanding of how Catholicism operates.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1505110264.0,
    "date_created": "2017-09-10",
    "time_created": "18:11:04",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtz8hc",
    "parent_id": "t1_dmtu0ov",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "lol. PR departments wet dream here.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505112287.0,
    "date_created": "2017-09-10",
    "time_created": "18:44:47",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmud9oj",
    "parent_id": "t1_dmtu0ov",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "And John Paul II was not a Marxist, so has Mogg become less Catholic in the last 10 years without changing his views?",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505131486.0,
    "date_created": "2017-09-11",
    "time_created": "00:04:46",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuft9v",
    "parent_id": "t1_dmtu0ov",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> This current pope has been deeply critical of capitalism\n\nthis isn't new either. Leo XIII stepped the church off in this direction in the 19th century.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505136157.0,
    "date_created": "2017-09-11",
    "time_created": "01:22:37",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuxoxv",
    "parent_id": "t1_dmtu0ov",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "There's a difference between following the teachings of the catholic church and blindly changing your opinions to fit whatever the pope of the month says.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505172656.0,
    "date_created": "2017-09-11",
    "time_created": "11:30:56",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmvfmdv",
    "parent_id": "t1_dmuofz7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "what is the civic advatage too marriage\n\n(the religious one is your allowed to pork if your wondering)",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505192503.0,
    "date_created": "2017-09-11",
    "time_created": "17:01:43",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtwzx7",
    "parent_id": "t1_dmtvwbg",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "There's the objective distinction in that one is giving away your own property and one is redistributing the property of others. But there is also a distinction of principle. The fact that welfare requires no self-sacrifice. Welfare is not there for altruistic.\n\nChristianity is traditionally pretty big on altruism.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1505109570.0,
    "date_created": "2017-09-10",
    "time_created": "17:59:30",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmvhrt2",
    "parent_id": "t1_dmtvwbg",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "There's a moral one in that one involves a third party and a gun and the other doesn't\n\nThere may also be a Christian one made by Paul in II Corinthians 9\n\nII Corinthians 9:7 Each of you should give what you have decided in your heart to give, not reluctantly or under compulsion, for God loves a cheerful giver\n\nnote: Paul was writing in the roman empire at a time when the patron model produced private charity on a level and scale unimaginable today, and these chapters have a context they cannot be understood with out",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505195033.0,
    "date_created": "2017-09-11",
    "time_created": "17:43:53",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtxbuh",
    "parent_id": "t1_dmtuaiy",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It's insidious to be annoyed by false equivocation? Do you often find clarity insidious?",
    "controversiality": 1,
    "ups": -1,
    "downs": 0,
    "score": -1,
    "created": 1505109984.0,
    "date_created": "2017-09-10",
    "time_created": "18:06:24",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtyim9",
    "parent_id": "t1_dmtueer",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The vast majoirty of our interventions in the past few decades have been positive. Generally speaking I think the pro-interventionists have a much greater track record on these things in the past 20 years or so than the anti-war movement. If we had listened to them then Saddam would be the owner and occupier of Kuwait, Milošević would still be in power, Bosnia would have became part of Serbia, Kosovo would have been ethnically cleansed and annexed, the good actions taken in Sierra Leone and Liberia by us wouldn't have happened.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505111404.0,
    "date_created": "2017-09-10",
    "time_created": "18:30:04",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtxjgn",
    "parent_id": "t1_dmtueer",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "\n\n>decades of British military interventions backfiring spectacularly\n \nThis is a bit much, we've failed in some places and succeed in others. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505110239.0,
    "date_created": "2017-09-10",
    "time_created": "18:10:39",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmutlhu",
    "parent_id": "t1_dmuif6r",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "With his single vote, in a democratic country, as he has every right to do.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505167661.0,
    "date_created": "2017-09-11",
    "time_created": "10:07:41",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtrop8",
    "parent_id": "t1_dmtrjwk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Swings and roundabouts",
    "controversiality": 1,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1505103473.0,
    "date_created": "2017-09-10",
    "time_created": "16:17:53",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtz6z8",
    "parent_id": "t1_dmtyen4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yeah, placating dictators usually does wonders. Just look at NK!",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505112235.0,
    "date_created": "2017-09-10",
    "time_created": "18:43:55",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmty6yo",
    "parent_id": "t1_dmtvqch",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Sadly yes. It's the spirit of the age: 'create wealth, forgetting all but self'. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505111024.0,
    "date_created": "2017-09-10",
    "time_created": "18:23:44",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmulbds",
    "parent_id": "t1_dmtt2u1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "But he didn't tell the Romans to raise more taxes",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505150739.0,
    "date_created": "2017-09-11",
    "time_created": "05:25:39",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtun0v",
    "parent_id": "t1_dmttbyb",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> its easier for a camel to pass through the eye if a needle than for a rich man to enter the kingdom of God\n\nThis was said to a young rich man who essentially expected to bribe his way into heaven. It doesn't literally mean, 'If you're rich, you can't go to heaven.' That contradicts the general theme of the Bible that people are saved by grace. \n\n",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1505106784.0,
    "date_created": "2017-09-10",
    "time_created": "17:13:04",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtwv94",
    "parent_id": "t1_dmtsxm7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "He preached for charity. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1505109407.0,
    "date_created": "2017-09-10",
    "time_created": "17:56:47",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmucqg6",
    "parent_id": "t1_dmttzku",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "So now that food banks exist we can cut the state welfare bill?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505130634.0,
    "date_created": "2017-09-10",
    "time_created": "23:50:34",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmubzdb",
    "parent_id": "t1_dmtwcwd",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Does Jacob Rees Mogg evade taxes, or support tax evasion? ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505129461.0,
    "date_created": "2017-09-10",
    "time_created": "23:31:01",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmulvb9",
    "parent_id": "t1_dmtz2io",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I would say his own greed is his moral outlook and just uses the bible to justify it.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505152466.0,
    "date_created": "2017-09-11",
    "time_created": "05:54:26",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmvv9qg",
    "parent_id": "t1_dmvgowr",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Bigot\n\n> *noun*\n\n> a person who is obstinately or intolerantly devoted to his or her own opinions and prejudices; especially : one who regards or treats the members of a group (such as a racial or ethnic group) with hatred and intolerance.\n\n\n[Webster](https://www.merriam-webster.com/dictionary/bigot)\n\n\n\nRees Mogg doesn't think people that are different than him should be allowed to marry, thats a few steps past intolerant...",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505212069.0,
    "date_created": "2017-09-11",
    "time_created": "22:27:49",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmttc9h",
    "parent_id": "t1_dmtruk5",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You know nothing about his personal commitments to charity, that should be private to the individual.  Unless you mean he should give away all his worldly belongings and live on the streets.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505105315.0,
    "date_created": "2017-09-10",
    "time_created": "16:48:35",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtshm3",
    "parent_id": "t1_dmtruk5",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "How much do you think he should give away, and why?",
    "controversiality": 1,
    "ups": -1,
    "downs": 0,
    "score": -1,
    "created": 1505104380.0,
    "date_created": "2017-09-10",
    "time_created": "16:33:00",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtupf6",
    "parent_id": "t1_dmtu5ew",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Fine, that's his view, doesn't undermine my point.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505106859.0,
    "date_created": "2017-09-10",
    "time_created": "17:14:19",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtvcf3",
    "parent_id": "t1_dmtu5ew",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505107588.0,
    "date_created": "2017-09-10",
    "time_created": "17:26:28",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmty9b4",
    "parent_id": "t1_dmtwmj5",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "When they were owed, yes. Nothing to do with tax policy.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505111100.0,
    "date_created": "2017-09-10",
    "time_created": "18:25:00",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtwer9",
    "parent_id": "t1_dmtw0kk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> What do you make of Jesus running the merchants out of the Synagogue?\n\nThe Synagogue was a place of worship, unfit according to Jesus for commercial activity. What is the relevance of the episode?\n\n> that everyone has to be personally charitable to reap the rewards of Heaven.\n\n...out of their own choice. Christianity, and catholicism in particular, teach free will. You will be rewarded if you do good, but you are not forced to.  \nChristian doctrine in no way supports taking money away from others by force to give it to the poor.\n\n> Then there is the argument that the benefits system is an act of personal charity\n\nHow can you claim that, when the transfer of money is forced and you are punished by the state if you don't contribute? That is no charity, it's extortion.\n\n> because you are living here, that you accept those terms and conditions.\n\nThat only applies if you live on government property. If you live on your own property you can't morally speaking be forced to give up your property.",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505108854.0,
    "date_created": "2017-09-10",
    "time_created": "17:47:34",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmujew0",
    "parent_id": "t1_dmtyuyu",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The Romans were an occupying force, and around that time that occupation had already lead to tax riots that the Romans crushed in blood.\n\n\"Give to Caesar what is Caeser's\" doesn't mean \"taxes are rightfully Caesar's, you should recognise his authority and pay them\". It means, essentially, \"Getting slaughtered by the Romans is a bad idea\".",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505144864.0,
    "date_created": "2017-09-11",
    "time_created": "03:47:44",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmutz2y",
    "parent_id": "t1_dmup8y5",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> lmao educate yourself\n\nOh, the delicious irony.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505168154.0,
    "date_created": "2017-09-11",
    "time_created": "10:15:54",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtx0ki",
    "parent_id": "t1_dmtwxuw",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "By that logic Jesus was pro-holocaust seeing as that too was funded by taxes.\n\nCome to think of it, all the \"synagogue of Satan\" stuff...",
    "controversiality": 1,
    "ups": -1,
    "downs": 0,
    "score": -1,
    "created": 1505109592.0,
    "date_created": "2017-09-10",
    "time_created": "17:59:52",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmufwrn",
    "parent_id": "t1_dmu7j99",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">the church is almost if not is as important when it comes to living a holy life.\n\nTriggered lutherans incoming.",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1505136362.0,
    "date_created": "2017-09-11",
    "time_created": "01:26:02",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmulit6",
    "parent_id": "t1_dmukk55",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Either that, or u/brunosa87 owns a minister that we don't know about. If so, I dread to think what \"refused entry\" means...\n",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1505151392.0,
    "date_created": "2017-09-11",
    "time_created": "05:36:32",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmunr3i",
    "parent_id": "t1_dmukk55",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I presume he means a Catholic minister, because u/brunosa87 is Catholic and therefore the minister is \"his?\" Weird way to word it at the least.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505157679.0,
    "date_created": "2017-09-11",
    "time_created": "07:21:19",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmvkog1",
    "parent_id": "t1_dmuy71j",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "My understanding of it is that each person is supposed to do as much \"good\" as they're able to do. A poor man might only be able to spare a few slices of bread for his hungry neighbour, but if that's all he can do, and he does it, then he'll be in the heavenly good books. \n\nA rich man can't just share a bit of bread and expect the same results. He's capable of doing far more, and if he wants to get in to heaven he better get on and do it.\n\nYou could say that he should spend every penny he has to spare on good works; in which case he won't really be a rich man at the end of it. If he's still filthy rich at the end of his life, it's most likely an indication that he could have done more.\n\nBut I'm not even a Christian, and you can be sure that there are as many different interpretations of these things as there are denominations. Such is religion.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505198676.0,
    "date_created": "2017-09-11",
    "time_created": "18:44:36",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuisrx",
    "parent_id": "t1_dmuibkk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "So the part about not eating shrimp and wearing blended fabrics was just rubbish?",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1505143144.0,
    "date_created": "2017-09-11",
    "time_created": "03:19:04",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmve6q8",
    "parent_id": "t1_dmuibkk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">Who are you to judge “the good parts of the Bible” when it is God’s word?\n\nAnd why should I objectively believe God's morality? He put a plague on an entire country because the Pharaoh wouldn't do what he wanted, ruined a mans life on a dare, sent bears to murder a groups of teenagers who mocked an old, bald man, killed a man because he wouldn't fuck the widower of his own brother, whom God ALSO killed.\n\nGod is a vengeful little baby playing Sims, and throwing temper tantrums when things don't go his way. Anyone who gets their morality solely from his is not somebody I want to follow.\n\nEdit: I also forgot the part where he says slavery is okay, never to touch a woman on her period, and that you can't get into heaven if you lost your testicles",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505190895.0,
    "date_created": "2017-09-11",
    "time_created": "16:34:55",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuk9bo",
    "parent_id": "t1_dmuibkk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Technically only the 10 commandments are literally Gods words. The rest is all metaphor, interpretation and sermon. Last I checked this is standard operating procedure for the majority of Christians; IIRC there are some American denominations who believe the whole book is literal. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1505147432.0,
    "date_created": "2017-09-11",
    "time_created": "04:30:32",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmulkb4",
    "parent_id": "t1_dmuibkk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Well, I had a lizard fall into a jar the other day, so I smashed it (the jar, not the lizard). I think I should get some karma points for that alone, it was a bloody good jar.\n",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505151521.0,
    "date_created": "2017-09-11",
    "time_created": "05:38:41",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuo9e9",
    "parent_id": "t1_dmuibkk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "For instance, the ones that get translated well. So not the one quoted here, and certainly not the quote about Peter being the rock to build Church on.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505158848.0,
    "date_created": "2017-09-11",
    "time_created": "07:40:48",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuw66b",
    "parent_id": "t1_dmuibkk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505170887.0,
    "date_created": "2017-09-11",
    "time_created": "11:01:27",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmupel5",
    "parent_id": "t1_dmunavh",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The information on its own could suggest either, yes.... but when you combine that with the fact that levels of religious belief are declining with every new generation along with the increase in levels of compulsory STEM lessons in schools around the world, I think it shows that it is the education that is having the effect on declining religiousness rather than people pursuing STEM because they have no religious beliefs.\n\nYou also see times where religion tried to quash mathematicians and scientists because they thought it would lead to people contesting the basis of their religion. I think it was Al-Ghazali who basically wrote how to be a \"good Muslim\" and contained within that was something about the manipulation of numbers being a sin (something to that effect, anyone more up to speed with the Muslim faith, please feel free to correct me).... before that point Arab muslims were at the forefront of maths and physics advancement, but since then very few muslims have made significant contributions to the world of maths and physics... you'll also notice that the Muslim population has exploded over the last 200 years compared to world population growth. Could that be because people born into Muslim families are less likely to become religiously unaffiliated if they were not taught STEM subjects? I have no idea.\n\nI mean it could all be a coincidence, and to be honest I'm not sure there is a steadfast way to prove it's not. It's just my point of view based on the social and educational changes we are seeing.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505161146.0,
    "date_created": "2017-09-11",
    "time_created": "08:19:06",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmupm3h",
    "parent_id": "t1_dmuodoc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I can't say I've seen data on that to be honest... I'm guessing it wouldn't be a huge chunk of data as they are fairly niche ends of the theological/philosophical spectrum, so i'm not sure how reliable they would be.\n\n",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505161537.0,
    "date_created": "2017-09-11",
    "time_created": "08:25:37",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtxi02",
    "parent_id": "t1_dmtt14o",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That was Old Testament though. OT God was metal af. OT God conjured she-bears to kill some kids because they mocked a prophet's baldness.  \n\n  Jesus himself really was a bit of a hippy. He made a fig tree wither, and caused a bit of a ruckus with the money lenders. That's about the sum total of his nowtiness I think.  \n\n edit. sum not some. ",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1505110190.0,
    "date_created": "2017-09-10",
    "time_created": "18:09:50",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmttsoc",
    "parent_id": "t1_dmtslgp",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Got a list?",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1505105826.0,
    "date_created": "2017-09-10",
    "time_created": "16:57:06",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuhwwt",
    "parent_id": "t1_dmu218g",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Your last point is wrong. There's been a big increase in homelessness since the large welfare cuts.",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1505140878.0,
    "date_created": "2017-09-11",
    "time_created": "02:41:18",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuivup",
    "parent_id": "t1_dmu218g",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yeh, because the last 2 were probably 'translated' or 'reinterpreted' to say 'pay your taxes' by whichever King or government issued that version.   \nThat's the true catholic contradiction here.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1505143370.0,
    "date_created": "2017-09-11",
    "time_created": "03:22:50",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu1zn9",
    "parent_id": "t1_dmtz04t",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It's also interpreted as being a literal command to pay taxes to the authorities (Wikipedia has a good list of common interpretations). Which would then mean that a Christian could not object to using tax money to help the poor, because Jesus did not object to taking taxes by force, and Jesus definitely did not object to giving alms to the poor.\n\nIn fact, given that Jesus positively encouraged charity, it seems reasonable that a person who is in the position to decide what tax money is spent on should decide to use it to alleviate the suffering of the poor, which is the point which was originally being made.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1505115804.0,
    "date_created": "2017-09-10",
    "time_created": "19:43:24",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmulphp",
    "parent_id": "t1_dmtz04t",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Also worth remembering that we was answering a question from the pharisees that was clearly an attempt to trick him and his answer effectively amounted to a refusal to answer their question. Otherwise yes I agree.\n\nAnother layer that can be correctly read in IMO is that he's leaving it up to the believer (in community and guided by the Spirit) to make a decision as to whether a rule imposed by a government is in contradiction of the higher law of God.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505151981.0,
    "date_created": "2017-09-11",
    "time_created": "05:46:21",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuersk",
    "parent_id": "t1_dmtzvo2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "this was how i was taught it in RS at school. the Jews were hoping for their messiah to come as a conquering hero and drive out the Romans, and opposing the tax collectors was seen as representative of opposing the empire. Jesus is basically saying, no that's not what i'm here for.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1505134113.0,
    "date_created": "2017-09-11",
    "time_created": "00:48:33",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmux1k8",
    "parent_id": "t1_dmufx4k",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Because the Saudi arms situation isn't anywhere near as black and white as you want it to be.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505171923.0,
    "date_created": "2017-09-11",
    "time_created": "11:18:43",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu31vb",
    "parent_id": "t1_dmu2jhd",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The Pope has made no dogmatic pronouncement on such issues. Most of the time the Pope is not speaking as a leader, but as someone opinionated, albeit very informed on Catholic teaching.",
    "controversiality": 1,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1505117301.0,
    "date_created": "2017-09-10",
    "time_created": "20:08:21",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmw3qh5",
    "parent_id": "t1_dmu2jhd",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The pope also says that Christianity requires the renunciation of all violence (ergo get rid of your police force), and that forgiveness is necessary in all circumstances including domestic abuse (ergo free everyone from prisons). We should praise any Catholic that is willing to ignore the pope's evil views. Yeah it would be better if they were not Catholic at all, but it will take centuries for Catholicism to die out and we must compromise in the mean time.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505225147.0,
    "date_created": "2017-09-12",
    "time_created": "02:05:47",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuh9cx",
    "parent_id": "t1_dmtw6lv",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I dunno, he met with a tax collector from Rome, Zacchaeus offered to give half his wealth to the poor and pay back people he had scammed and Jesus saw this as salvation. He never said he had to 2psy EVERYONE back or quit his job.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505139317.0,
    "date_created": "2017-09-11",
    "time_created": "02:15:17",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtuc96",
    "parent_id": "t1_dmttjv1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Most of the founding figures of the Labour party would disagree. Christian Socialism was quite influential in politics around the end of the 19th/turn of the 20th century. ",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1505106439.0,
    "date_created": "2017-09-10",
    "time_created": "17:07:19",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmttw2g",
    "parent_id": "t1_dmttjv1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "So long as the ultimate end is that people are helped then I'd say that's incorrect. \"Forcing\" others to help people (say, through tax contributions to the welfare state) is just a more indirect means.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1505105927.0,
    "date_created": "2017-09-10",
    "time_created": "16:58:47",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtxa61",
    "parent_id": "t1_dmttjv1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You seem to be confusing a desire to redistribute the already imposed taxes, from military focus towards a focus on social benefits (the opposite of what Moggy has a history of doing), with the idea of imposing *more* taxes.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1505109927.0,
    "date_created": "2017-09-10",
    "time_created": "18:05:27",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtxxxf",
    "parent_id": "t1_dmttjv1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "This argument only makes sense if you disagree with democracy.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505110713.0,
    "date_created": "2017-09-10",
    "time_created": "18:18:33",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu6a45",
    "parent_id": "t1_dmu327a",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> You are only talking about Protestants, probably because that is the majority of American Christians. And since there are more Catholics than Protestants then the majority of Christians should believe in good works.\n\nBut if we're talking about the UK here, then Catholicism isn't overly relevant (they make up about 20% of UK Christians). Well, Catholicism is relevant in this case because Rees-Mogg is, but isn't so interesting when talking generally about the UK.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505121663.0,
    "date_created": "2017-09-10",
    "time_created": "21:21:03",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuiqbj",
    "parent_id": "t1_dmu327a",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "What different Protestants believe will vary from person to person, but the official teaching the major Protestant denominations would be that good works are very important. They do not save those who perform them, but they are evidence of genuine faith and are a necessary means of loving others.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505142965.0,
    "date_created": "2017-09-11",
    "time_created": "03:16:05",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtzqr4",
    "parent_id": "t1_dmtym8a",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'm not sure, my Catholic theology is even shakier than my general theology. When I see the different arguments written down, I struggle to see either \"side\" as more than somewhat different perspectives on the same thing. C S Lewis wrote about how language always limits and constrains us, whether in theology or in particle physics.\n\nIn practice, I know Catholics and Protestants who behave as if they believe a very works-based system, but I know others who very much seem to downplay the importance of good works. Although fictional, Chesterton's Father Brown never seemed to get too hung up on such things, and he was based on various priests of GKC's aquaintance.\n\nDoesn't help that I have my doubts over certain aspects of Calvinist predestination, too, but lets not go *there* now!\n\nEdit: Having re-read my first sentence above, I don't think I worded it quite right. Good works *are* important for our spiritual growth, a process that will not be complete in this life. And that, perhaps, is what some of the Catholic teaching on the subject seems to me to be saying. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505112937.0,
    "date_created": "2017-09-10",
    "time_created": "18:55:37",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu0fv2",
    "parent_id": "t1_dmty9h8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Ah okay, that I can read (although I think it should be gravis, rather than grave?), I was worried I was getting rusty, because I haven't really done any reading for a few weeks. Thanks very much.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505113806.0,
    "date_created": "2017-09-10",
    "time_created": "19:10:06",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmunjkh",
    "parent_id": "t1_dmty9h8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "\"Romanes eunt domus?\"\n\n\"People called Romanes they go the house?\"\n\n\"If it's not done by sunrise, I'll cut your balls off\"",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505157168.0,
    "date_created": "2017-09-11",
    "time_created": "07:12:48",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtw6n2",
    "parent_id": "t1_dmtvjkp",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Ah okay, I can can make sense of the first clause but not the second. Thanks anyway.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505108586.0,
    "date_created": "2017-09-10",
    "time_created": "17:43:06",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtynka",
    "parent_id": "t1_dmtx1e1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You're right, he only founded a religion based on principles of kindness and giving that spread to billions of people. He really wasnt ambitious about the whole thing. \n\n/s ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1505111567.0,
    "date_created": "2017-09-10",
    "time_created": "18:32:47",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu2or7",
    "parent_id": "t1_dmtwpjk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "We are talking about christian teaching ",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505116782.0,
    "date_created": "2017-09-10",
    "time_created": "19:59:42",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmttcxi",
    "parent_id": "t1_dmts1vc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[The Gospel of Supply Side Jesus](https://imgur.com/gallery/bCqRp)",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1505105336.0,
    "date_created": "2017-09-10",
    "time_created": "16:48:56",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtt1cx",
    "parent_id": "t1_dmts1vc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That just means obey the state, it doesn't mean the state is right. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1505104990.0,
    "date_created": "2017-09-10",
    "time_created": "16:43:10",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmud3h7",
    "parent_id": "t1_dmu4g51",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "What measures would they be? ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505131218.0,
    "date_created": "2017-09-11",
    "time_created": "00:00:18",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuk9le",
    "parent_id": "t1_dmuhfdq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It is by force you moron. What happens if you don't pay your income tax ? ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505147457.0,
    "date_created": "2017-09-11",
    "time_created": "04:30:57",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu1y8o",
    "parent_id": "t1_dmu0p35",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Unfortunately no system has been imagined which beats capitalism in terms of human welfare. \n\nEverybody can see the faults in the system but nobody can present a viable alternative. I'll prefer sticking to the status quo than abolishing what we have and wishing the next thing is better. \n\n",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505115751.0,
    "date_created": "2017-09-10",
    "time_created": "19:42:31",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu4ywk",
    "parent_id": "t1_dmu2dti",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I have! They do exist, though the few I've encountered tend to be actively involved in charity work and general 'good deeds' rather than church or political associations and pursuits.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505119909.0,
    "date_created": "2017-09-10",
    "time_created": "20:51:49",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmum6fk",
    "parent_id": "t1_dmulnpy",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> People don't donate in building dams, power stations and businesses\n\nPlease correct me if I'm wrong, but don't these all count as forms of private investment, not govt aid? For example, there's heavy investment from Chinese firms in East Africa where they build infrastructure (although creates new issues as they tend to send Chinese workers over instead of employing the locals). \n\nBut you make a good point, I don't think the private sector alone is capable of providing sufficient funding - but it could become the role of the govt to try and change this. Perhaps the best government led solution would be to lower the external tariffs that prevent businesses in developing countries from competing (one good thing might come out of Brexit) and calm down on the 'buy British' rhetoric that harms the developing world as well as our own consumers.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1505153424.0,
    "date_created": "2017-09-11",
    "time_created": "06:10:24",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmupuw0",
    "parent_id": "t1_dmunvur",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Hear hear. Well said on all points.\n\nRees-Mogg is entitled to claim travel expenses between Somerset and London but chooses not to do so. He's entitled to claim for a second home in London but he chooses not to do so. He's entitled to lots of other expenses but seemingly only claims for the general office costs.\n\nI have issues with some things the man says but I have no issue with his policy on his own expenses. I don't see how anyone could. I also don't see how anyone could complain that he uses his wages to pay for a nanny - they're *his* wages. He is required to justify how he spends his money as much as I am.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1505161973.0,
    "date_created": "2017-09-11",
    "time_created": "08:32:53",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuru0h",
    "parent_id": "t1_dmuqq2a",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">I'm talking about Jesus\n\n*I tell you the truth, until heaven and earth disappear, not even the smallest detail of God’s law will disappear until its purpose is achieved.*\n\n~Jesus\n\nI'm fairly sure that God is absolutely fine with mandating provision for the poor, given that the law does exactly that, and Jesus endorses the giving of tithes even whilst noting they do not alone suffice. Given that the new testament deals mostly with personal morality rather than running a society I don't see the contradiction.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505165186.0,
    "date_created": "2017-09-11",
    "time_created": "09:26:26",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmy2o4b",
    "parent_id": "t1_dmwgg2q",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "\"Do not resist an evil person\". ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505337498.0,
    "date_created": "2017-09-13",
    "time_created": "09:18:18",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtwd42",
    "parent_id": "t1_dmtw4x0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Actually, the bible has a whole thing about government.\n\nBasically it boils down to \"do as you are fucking told\"\n\nSo, as a backbencher, JRM should submit to his masters and do *their* bidding, not his own. And by *their*, I mean those put there by God, so he should be doing what either the Pope says, or what the Queen says.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1505108801.0,
    "date_created": "2017-09-10",
    "time_created": "17:46:41",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtun4a",
    "parent_id": "t1_dmtuigz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Matthew 6:2  \n\n>So when you give to the poor, do not sound a trumpet before you, as the hypocrites do in the synagogues and in the streets, so that they may be honored by men Truly I say to you, they have their reward in full.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1505106787.0,
    "date_created": "2017-09-10",
    "time_created": "17:13:07",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtwlrv",
    "parent_id": "t1_dmtwhim",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Don't even get me started on how evil and un-catholic the church is for saying that climate change is a thing. /s",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1505109088.0,
    "date_created": "2017-09-10",
    "time_created": "17:51:28",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmv03mn",
    "parent_id": "t1_dmuxoxv",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Surely the Pope has a better understanding of the teachings of the catholic church than any of us? Why wouldn't we believe him?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505175326.0,
    "date_created": "2017-09-11",
    "time_created": "12:15:26",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmvg6ck",
    "parent_id": "t1_dmvfmdv",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Is that a serious question?\n\nhttps://www.citizensadvice.org.uk/family/living-together-marriage-and-civil-partnership/living-together-and-marriage-legal-differences/",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505193159.0,
    "date_created": "2017-09-11",
    "time_created": "17:12:39",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtygcc",
    "parent_id": "t1_dmtwzx7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Shallow and pedantic ",
    "controversiality": 1,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1505111331.0,
    "date_created": "2017-09-10",
    "time_created": "18:28:51",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmvd3x4",
    "parent_id": "t1_dmtwzx7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The central moral difference between government welfare and private charity is that the former grows out of the axiom that people have a fundamental right to food and shelter, while the latter rests upon the personal whim of those who have the luxury of deciding the fate of those below them. I don't know about the other people commenting here, but I certainly don't find the idea of leaving people to the mercy of other people's charity altruistic.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505189691.0,
    "date_created": "2017-09-11",
    "time_created": "16:14:51",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmv10ar",
    "parent_id": "t1_dmutlhu",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "this argument isn't about what he's allowed to do, it's that your statement is a straight up lie. \n\nalso, it's despicable that he opposes the freedoms that people should have. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505176311.0,
    "date_created": "2017-09-11",
    "time_created": "12:31:51",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmty92g",
    "parent_id": "t1_dmty6yo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No social good except for the nebulous idea of success. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505111092.0,
    "date_created": "2017-09-10",
    "time_created": "18:24:52",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtveff",
    "parent_id": "t1_dmtun0v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> a rich young man asks Jesus what actions bring eternal life. First Jesus advises the man to obey the commandments. When the man responds that he already observes them, and asks what else he can do, Jesus adds:\n\n>If you want to be perfect, go, sell your possessions and give to the poor, and you will have treasure in heaven. Then come, follow me.\n\nThis is from Wikipedia but its the simplest modern explanation I could find, I don't think he is trying to bribe anybody at all.  ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1505107652.0,
    "date_created": "2017-09-10",
    "time_created": "17:27:32",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu4at1",
    "parent_id": "t1_dmtun0v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> That contradicts the general theme of the Bible that people are saved by grace.\n\nOnly Protestants believe that this is the general theme of the bible.  This is despite Jesus continuously telling people to help others.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505119018.0,
    "date_created": "2017-09-10",
    "time_created": "20:36:58",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtzesy",
    "parent_id": "t1_dmtwv94",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "They're not mutually exclusive.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1505112510.0,
    "date_created": "2017-09-10",
    "time_created": "18:48:30",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmud1mq",
    "parent_id": "t1_dmucqg6",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "There are still hungry people out there who do not have access to a food bank.\n\nFood banks are marvelous in an emergency, but the best way to make sure the poor are fed is through benefits. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505131138.0,
    "date_created": "2017-09-10",
    "time_created": "23:58:58",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmufw5p",
    "parent_id": "t1_dmucqg6",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'm sure many Tory voters would be happy with that.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505136325.0,
    "date_created": "2017-09-11",
    "time_created": "01:25:25",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmueo0p",
    "parent_id": "t1_dmubzdb",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I don't know, I'm not JRM.\n\nI don't see how that's relevant. You suggested that Jesus was against taxes. He was not. He encouraged people to pay taxes.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505133919.0,
    "date_created": "2017-09-11",
    "time_created": "00:45:19",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmvgqjf",
    "parent_id": "t1_dmulvb9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Because being anti abortion and gay marriage in 2017 is *such a greedy policy*",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505193812.0,
    "date_created": "2017-09-11",
    "time_created": "17:23:32",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtuioe",
    "parent_id": "t1_dmttc9h",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I enjoy the two options of \n\n> be worth tens to hundreds of millions of pounds\n\n> live on the streets\n\nI wonder if there could be any intermediate situations for the devoutly religious?",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1505106647.0,
    "date_created": "2017-09-10",
    "time_created": "17:10:47",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtswm4",
    "parent_id": "t1_dmtshm3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "A good question. I think anyone who has more money than they need has a moral (note, this is just my opinion) obligation to help people less fortunate. I hugely respect wealthy philanthropists and despise people who accumulate wealth for the sake of wealth; accumulating vast sums that they then sequester in off-shore accounts.\n\n\nSo without knowing what his net worth is, it's really hard to blurt out an arbitrary figure for what I think he should give away; but hopefully I explained the why.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1505104849.0,
    "date_created": "2017-09-10",
    "time_created": "16:40:49",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtsuwh",
    "parent_id": "t1_dmtshm3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "According to his religion most of it.   Why hasn't he done so if he's a committed Christian?",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1505104800.0,
    "date_created": "2017-09-10",
    "time_created": "16:40:00",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtu920",
    "parent_id": "t1_dmtshm3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "all of it because god said so",
    "controversiality": 1,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505106334.0,
    "date_created": "2017-09-10",
    "time_created": "17:05:34",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtwsjx",
    "parent_id": "t1_dmtvcf3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Pope Francis is similarly vocal, and supports taxation to help the poor.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505109313.0,
    "date_created": "2017-09-10",
    "time_created": "17:55:13",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtynzk",
    "parent_id": "t1_dmty9b4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Alright then, Jesus told people to pay taxes but didn't like it when poor people got it 👌",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505111582.0,
    "date_created": "2017-09-10",
    "time_created": "18:33:02",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtwyk9",
    "parent_id": "t1_dmtwer9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> The Synagogue was a place of worship, unfit according to Jesus for commercial activity\n\nNow, this is an acceptable reading. However, due to the nature of The Bible, there is symbolism at work here. It could easily be read to mean that a Christian has no time for material wealth, that money distracts from the Holy, the spiritual. Merchants in a synagogue - what will they be focussing on? Not the Torah - that is on the other end of the room. Not the Rabbi - the echoes of the jangling coins are much too loud in a building like that. They are focussed on profit, on money. It takes Christ Himself to run them from the building, from the religion. \n\n>You will be rewarded if you do good, but you are not forced to.\n\nWell, you are threatened with eternal damnation. Being boiled alive forever is quite the threat to a believer (Note: I am not into organised religion, though I mostly align with the Quakers more than others. I would not go as far as calling myself a Friend, however)\n\n>Christian doctrine in no way supports taking money away from others by force to give it to the poor\n\nWhether conversion can be seen as an act of force is up for debate, certainly. \"Faith, Hope, and Charity\" and all that. \n\n>That only applies if you live on government property\n\nI trust that you are aware of the concept of the nation state? Laws of the Land, how government actually works, ect.? Or are you suddenly into common land and that kind of thing? ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1505109521.0,
    "date_created": "2017-09-10",
    "time_created": "17:58:41",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmvjcp7",
    "parent_id": "t1_dmutz2y",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Feel free to explain it",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505196986.0,
    "date_created": "2017-09-11",
    "time_created": "18:16:26",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtx79h",
    "parent_id": "t1_dmtx0ki",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Obviously not, because the Holocaust would go against practically all of his teachings. Helping out the poor doesn't, he called for that all the time.\n\nYou can extrapolate whatever nonsense you want. The fact is, Jesus told people to pay taxes, and therefore he didn't class it as an act of theft or aggression, as your ilk keep touting.",
    "controversiality": 1,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1505109825.0,
    "date_created": "2017-09-10",
    "time_created": "18:03:45",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuk02l",
    "parent_id": "t1_dmufwrn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Tear it all down!",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1505146637.0,
    "date_created": "2017-09-11",
    "time_created": "04:17:17",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuoqw9",
    "parent_id": "t1_dmufwrn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It is basically why the Lutherans exist - to follow the Bible without having to care about following the Church.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505159867.0,
    "date_created": "2017-09-11",
    "time_created": "07:57:47",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuyabr",
    "parent_id": "t1_dmulit6",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'm genuinely in suspense as to what was meant myself. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505173320.0,
    "date_created": "2017-09-11",
    "time_created": "11:42:00",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmunw5h",
    "parent_id": "t1_dmunr3i",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'm pretty sure all churches are free to enter for residents so I'm curious who wanted to charge £10. I'm the last to defend any church but it sounds a bit like nonsense.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1505158022.0,
    "date_created": "2017-09-11",
    "time_created": "07:27:02",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuk5r3",
    "parent_id": "t1_dmuisrx",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I never do either of those things. I am the One True Christian.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1505147128.0,
    "date_created": "2017-09-11",
    "time_created": "04:25:28",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmulsbs",
    "parent_id": "t1_dmuisrx",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That was a edict for the Jews for the time. Reading the NT makes it clear that the laws in leviticus particularly those that concern clean and unclean foods and forms of dress are not applicable to the Gentile believer.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1505152215.0,
    "date_created": "2017-09-11",
    "time_created": "05:50:15",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmunw8a",
    "parent_id": "t1_dmuisrx",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "a large part of the book of leviticus is rules that the jews came up with themselves to apply to themselves in order to be a good jew, they extrapolated from the 10 commandments yes, but their own rules were not a part of their covenant with God.(i.e. follow my 10 commandments and i will ensure that you prosper, but if you fail me i will fail you)\n\nJesus represented a new covenant with God, one that was open to all the people of earth, not just the nation of israel. (i.e. repent fully and you will be forgiven, dont turn away from god and you will go to heaven.)\n\nsource: i used to be christian and my father was a pastor. i have an curiosity for theology. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505158026.0,
    "date_created": "2017-09-11",
    "time_created": "07:27:06",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmvee6z",
    "parent_id": "t1_dmve6q8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Oh yeah, I agree with you that it’s fucking bullshit. People who claim that you can pick and choose the good bits and it’s still a useful book or source of morality piss me off though, so I was being sarcastic :)",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505191124.0,
    "date_created": "2017-09-11",
    "time_created": "16:38:44",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmul85f",
    "parent_id": "t1_dmuk9bo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The word of God and God’s literal words are slightly different things. Many times in the Bible it is stated that the words as written are God’s words spoken through humans. The Catholic Church comprises the majority of Christians and this is a fundamental part of it as I understand it.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505150455.0,
    "date_created": "2017-09-11",
    "time_created": "05:20:55",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmult8g",
    "parent_id": "t1_dmuk9bo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I don't think many Christians would agree with this as Jesus is God and many of his words are directly quoted in the Gospels.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505152289.0,
    "date_created": "2017-09-11",
    "time_created": "05:51:29",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmum1h1",
    "parent_id": "t1_dmuk9bo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "that's an interesting point.  couldn't you also say that jesus' words were the literal word of god also?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505153002.0,
    "date_created": "2017-09-11",
    "time_created": "06:03:22",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmumfqc",
    "parent_id": "t1_dmulkb4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Did you grasp the lizard with your hands afterwards?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505154196.0,
    "date_created": "2017-09-11",
    "time_created": "06:23:16",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuprp8",
    "parent_id": "t1_dmuo9e9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I always base my morality on how well it can be translated from one language to another. The English version of Mein Kampf is excellent, really unambiguous.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505161817.0,
    "date_created": "2017-09-11",
    "time_created": "08:30:17",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuwi9z",
    "parent_id": "t1_dmuw66b",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "So the teachings in the Bible can only teach us things we already know, otherwise how do we decide which ones to ignore?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505171299.0,
    "date_created": "2017-09-11",
    "time_created": "11:08:19",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuqt1p",
    "parent_id": "t1_dmupel5",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Sure, sure. One always needs to be careful about confusing correlation and causation though. I think the trend to suggest that science and religion are at odds could well be a bigger factor than the growth of science by itself, for instance, and that we could well see a slow reversal begin as more thinkers start offering serious opposition to such assertions. It's all very interesting either way! :) ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505163588.0,
    "date_created": "2017-09-11",
    "time_created": "08:59:48",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmur6l9",
    "parent_id": "t1_dmupm3h",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "thats true i supose.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505164193.0,
    "date_created": "2017-09-11",
    "time_created": "09:09:53",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu2wdq",
    "parent_id": "t1_dmtxi02",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Just to clarify that misconception: the 'mocking his baldness' was done in such a way that, contextually, they were essentially threatening to assault and quite likely kill him.\n\nSo you have a group of young people, at least 40 of them, hurling direct threats at a 'messenger'.\n\n... probably could've been resolved non-violently, but... like you said, it's Old Testament.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1505117079.0,
    "date_created": "2017-09-10",
    "time_created": "20:04:39",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmulw4s",
    "parent_id": "t1_dmtxi02",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Are you saying that Jesus was not the messiah, just a very naughty boy?\n",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505152535.0,
    "date_created": "2017-09-11",
    "time_created": "05:55:35",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmv2fkw",
    "parent_id": "t1_dmtxi02",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> OT God\n\nOG for short",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505177850.0,
    "date_created": "2017-09-11",
    "time_created": "12:57:30",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmty1p3",
    "parent_id": "t1_dmttsoc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Matthew 10: 34-37 is a good one:\n\n> 34 “Do not suppose that I have come to bring peace to the earth. I did not come to bring peace, but a sword.\n\n> 35 For I have come to turn “a man against his father, daughter against her mother, a daughter-in-law against her mother-in-law\n\n> 36     a man’s enemies will be the members of his own household\n\n> 37 “Anyone who loves their father or mother more than me is not worthy of me; anyone who loves their son or daughter more than me is not worthy of me. ",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1505110839.0,
    "date_created": "2017-09-10",
    "time_created": "18:20:39",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtug9t",
    "parent_id": "t1_dmttsoc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Off the top of my head I can remember [John 2:15](http://biblehub.com/kjv/john/2.htm) specifically but I know there are quite a few more. If you want I'll spend a bit finding a few, but this does get the point across that Jesus wasn't a pacifist.",
    "controversiality": 1,
    "ups": -1,
    "downs": 0,
    "score": -1,
    "created": 1505106569.0,
    "date_created": "2017-09-10",
    "time_created": "17:09:29",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuksyu",
    "parent_id": "t1_dmuhwwt",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "And, in fact, inefficiency has gone up as DLA payments are now handled in such a stupid way.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1505149110.0,
    "date_created": "2017-09-11",
    "time_created": "04:58:30",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmulkj3",
    "parent_id": "t1_dmuivup",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The source material is available for all of these quotes and there are thousands of translations not controlled by either the church or the state. It's fair to say that for 99% of the bible we have a fair translation true to the source material. This can be verified by looking at the age and geographical distribution of ancient copies. The remaining 1% is always noted in the footnotes of a modern translation.\n\nAs to why it says that there are plenty of resources that expound on Romans 13 it is a difficult passage to interpret correctly because it's intimately tied to the socio-political-economic state of Rome at the time this collates a number of good resources if you're interested:  http://biblehub.com/commentaries/romans/13-1.htm\n\n\n",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505151541.0,
    "date_created": "2017-09-11",
    "time_created": "05:39:01",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu3a8u",
    "parent_id": "t1_dmu31vb",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "So the Pope has to officially declare something dogma for it to be church policy?\n\nI guess that makes sense alright.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1505117629.0,
    "date_created": "2017-09-10",
    "time_created": "20:13:49",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmujybw",
    "parent_id": "t1_dmu31vb",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It is so amazing to me that people can declare an 80 year old man the ultimate authority on the other world, yet pick and choose when he is speaking on its behalf.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1505146485.0,
    "date_created": "2017-09-11",
    "time_created": "04:14:45",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmukrq1",
    "parent_id": "t1_dmu31vb",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> The Pope has made no dogmatic pronouncement on such issues.\n\nHe doesn't need to. It's the first chapter of the book of Genesis God put man above the creations of the earth to have dominion over it, and the Bible is replete with examples of good resource management.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505149002.0,
    "date_created": "2017-09-11",
    "time_created": "04:56:42",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmw4dqc",
    "parent_id": "t1_dmw3qh5",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Some wise and thoughtful words from u/pacifismisevil.\n\nCan you physically *feel* idiocy coursing through you?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505226603.0,
    "date_created": "2017-09-12",
    "time_created": "02:30:03",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu2ur1",
    "parent_id": "t1_dmttw2g",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "If you believed that the government was \"forcing\" people to help others through taxation you wouldn't be putting it in quotation marks.\n\nThe reality is that we *absolutely* could vote in a libertarian parliament but the majority of people don't want that. Now you can argue that people don't want that because they are being unfairly influenced till your blue in the face but that doesn't change the nature of democracy. People don't want that. They want to pay taxes to receive the enormous benefits of doing so. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1505117017.0,
    "date_created": "2017-09-10",
    "time_created": "20:03:37",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtzibf",
    "parent_id": "t1_dmttw2g",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 1,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1505112637.0,
    "date_created": "2017-09-10",
    "time_created": "18:50:37",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmujiwu",
    "parent_id": "t1_dmtxxxf",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The fact that helping people is not the same as forcing others to help some people is unequivocally true regardless of democracy. But, if that can make you happier, I do disagree with mob rule.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505145191.0,
    "date_created": "2017-09-11",
    "time_created": "03:53:11",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu4s8v",
    "parent_id": "t1_dmtynka",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Also worth mentioning the repeated actions that mark him as a 'revolutionary' sort and a political firebrand.\n\nJesus advised people to engage in all sorts of actions that would constitute 'passive resistance' (turning the other cheek, carrying packs longer than required, giving the clothes off your back when sued) and be considered disruptive to the established systems and customs.\n\nNot to mention entering a temple and turning out those using it as a marketplace, by driving them out with whippings.\n\nJesus was not a \"peaceful\" figure, and his acts of kindness were alongside starkly political rebellion.\n",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505119658.0,
    "date_created": "2017-09-10",
    "time_created": "20:47:38",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu4bi7",
    "parent_id": "t1_dmu2or7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'm pretty sure you aren't ",
    "controversiality": 1,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505119045.0,
    "date_created": "2017-09-10",
    "time_created": "20:37:25",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmttn4r",
    "parent_id": "t1_dmtt1cx",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It does kind of take the force out of the equation though. Jesus told you to hand over your taxes, you should want to!",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1505105656.0,
    "date_created": "2017-09-10",
    "time_created": "16:54:16",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuolzr",
    "parent_id": "t1_dmud3h7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I feel like this is one of those silly questions where you're going to reply to anything I say with \"A-HA! That won't REALLY help poor people!\"\n\nIf you actually think Jacob Rees-Mogg has never voted against a bill which would really have helped the needy then you could just say that, and otherwise you probably know already exactly what measures I mean.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505159594.0,
    "date_created": "2017-09-11",
    "time_created": "07:53:14",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmul4dq",
    "parent_id": "t1_dmuk9le",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "nothing if yiu fuck off to somalia, as previously suggested.\n\nliving here, benefiting from this society, you agree to pay taxes. dont want to pay those taxes? you can leave. no ones stopping you. they wont even back date it for all the benefits you've received. \n\nbut i do find it interesting that you think taxation to pay for police, healthcare etc is unethical. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505150123.0,
    "date_created": "2017-09-11",
    "time_created": "05:15:23",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu5tam",
    "parent_id": "t1_dmu4ywk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yeah it would make sense that they would be hard to notice, I never doubted that they exist, just that I had never seen them.  Even when I was homeless and standing in line for free food, I hated getting it from Christan groups, bunch of people slapping themselves on the back while simultaneously talking down to everyone that they came out to help.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505121034.0,
    "date_created": "2017-09-10",
    "time_created": "21:10:34",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmup8db",
    "parent_id": "t1_dmum6fk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Having a target of spending 0.7% government income on foreign rather than domestic priorities doesn’t sound unreasonable to me. Maybe in a less connected world that wouldn’t be so important but we can have a profound affect on developing these places. \n\n12% of the funds gets spent on economic infrastructure since for private enterprise to get involved, they have to have some element of profit, something sorely lacking in Syria and Ethiopia right now!",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505160822.0,
    "date_created": "2017-09-11",
    "time_created": "08:13:42",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmwh3gd",
    "parent_id": "t1_dmuru0h",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You're paying attention to the wrong part of that passage. Instead of cherrypicking the first part, consider the last part: \"...until its purpose is achieved.\" What's that referring to?\n\n\"Therefore no one will be declared righteous in God's sight by the works of the law; rather, through the law we become conscious of our sin.\" - Romans 3:20\n\nThe \"purpose\" of the law is to open man's eyes to the realization that he is inadequate and needs a saviour. And Jesus was that saviour. When He died, He fulfilled that purpose, and it became \"achieved\" as the verse predicted. Now we are no longer bound by the letter of the law. That part about \"Until heaven and earth disappear\" isn't literal; It just means that's what would have to happen in order to stop Jesus from fulfilling His purpose.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505254238.0,
    "date_created": "2017-09-12",
    "time_created": "10:10:38",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmyawgt",
    "parent_id": "t1_dmy2o4b",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Please read [this](https://www.gotquestions.org/turn-other-cheek.html).",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505347082.0,
    "date_created": "2017-09-13",
    "time_created": "11:58:02",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtwb52",
    "parent_id": "t1_dmtun4a",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Saying which charity isn't boasting. It'd be boasting if you said how much",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505108738.0,
    "date_created": "2017-09-10",
    "time_created": "17:45:38",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtv1x8",
    "parent_id": "t1_dmtun4a",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I see, that answers the question. None.",
    "controversiality": 1,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1505107254.0,
    "date_created": "2017-09-10",
    "time_created": "17:20:54",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtyxiv",
    "parent_id": "t1_dmtun4a",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Matthew 10:09:17\n\n> So when one cannot answer the question, as to do so would reveal thine's hypocrisy, spout a quote from the Holy Book that paints thou as humble and godly, so that one can continue to live in blissful ignorance in the arms of the Lord.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505111908.0,
    "date_created": "2017-09-10",
    "time_created": "18:38:28",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmvk1cv",
    "parent_id": "t1_dmvg6ck",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Still wondering\n\nwell it seems to come down to \n\n* money and debt are in whomever's name there in, and it's a races to joint accounts\n\n* no taxes breaks remain but ether way your partners income will count against you for aid / student fiance etc.\n\n* if and when the relationship goes south the courts are more happy to get involved and theirs a few rights but there by one party against the other but many of these can be gained e.g. house (also lawyers I'm sure are all ways ready to get involved)\n\n* in some case you can get out of witnessing against your spouse\n\n* children are a bit wired but it seem the mother and her husband (at time of birth?) have full responsibility and that the father has some responsibility\n\nonly getting out of witnessing seems to me a clear advatage, there is no longer joint property, there is no-longer tax exemption. On children it says the court will get involved if its non obvious or a problem",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505197847.0,
    "date_created": "2017-09-11",
    "time_created": "18:30:47",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtyj5c",
    "parent_id": "t1_dmtygcc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Thanks Peter.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505111420.0,
    "date_created": "2017-09-10",
    "time_created": "18:30:20",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmv4435",
    "parent_id": "t1_dmv10ar",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> your statement\n\nNot my statement.\n\n> straight up lie.\n\nThe statement said that people won't vote for this though. I guess him saying \"never be socially acted upon\" was strong but the sentiment is correct, people in 21st century Britain aren't voting for abortion bans. His point isn't that he won't vote for abortion bans, but that the majority won't vote for it. Which is correct as far as I can see.\n\nAlso, should democracy not decide these issues, if the people of northern Ireland were to vote against abortion, and it were banned, is that not how it should work? You can have all the opinions about how banning abortion \"opposes the freedoms that people should have\", but should democracy not trump your opinions on the matter? I see many people claiming that allowing abortion is against peoples rights/freedoms, while also seeing how banning it is also against peoples rights; with very little conversation between both sides. I'm genuinely curious, I've seen a lot of anti-democracy seeming conversations recently and I want to know peoples opinions who appear disagree with me.\n\nAnd what power does the DUP have to do bring about a law in the UK banning abortion? I can't find info online indicating that they have the power to do so.\n\nEdited it a bunch, sorry, my writing is a bit messy atm.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505179682.0,
    "date_created": "2017-09-11",
    "time_created": "13:28:02",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuld4g",
    "parent_id": "t1_dmtveff",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "From sola scriptura to sola wikipedia",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505150893.0,
    "date_created": "2017-09-11",
    "time_created": "05:28:13",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuitvh",
    "parent_id": "t1_dmu4at1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Helping others isn't mutually exclusive with the idea of being saved by grace.\n\nAnd actually Catholics believe we are saved by grace as well. The disagreement is over the precise nature of grace.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505143226.0,
    "date_created": "2017-09-11",
    "time_created": "03:20:26",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuevs2",
    "parent_id": "t1_dmueo0p",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> You suggested that Jesus was against taxes\n\nPlease quote where I did that?",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505134322.0,
    "date_created": "2017-09-11",
    "time_created": "00:52:02",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuvenb",
    "parent_id": "t1_dmtuioe",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You are assuming that he doesn't already live a modest lifestyle.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505169960.0,
    "date_created": "2017-09-11",
    "time_created": "10:46:00",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtxm9p",
    "parent_id": "t1_dmtsuwh",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "He's a Catholic, where in the magisterium does it suggest giving up most of his personal wealth?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505110334.0,
    "date_created": "2017-09-10",
    "time_created": "18:12:14",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu0pyh",
    "parent_id": "t1_dmtynzk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Haha, nope. Read again and absorb slowly. I know it's late.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505114161.0,
    "date_created": "2017-09-10",
    "time_created": "19:16:01",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtx985",
    "parent_id": "t1_dmtx79h",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You're the one extrapolating. I just took the logic you used and put it in an example which would hopefully make you realise how silly it was.",
    "controversiality": 1,
    "ups": -1,
    "downs": 0,
    "score": -1,
    "created": 1505109895.0,
    "date_created": "2017-09-10",
    "time_created": "18:04:55",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmurwhs",
    "parent_id": "t1_dmuk02l",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[relevant](http://i.imgur.com/X1UhC8I.jpg)",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505165287.0,
    "date_created": "2017-09-11",
    "time_created": "09:28:07",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuvdp5",
    "parent_id": "t1_dmuoqw9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "(that was me trying to make a joke about that lol but thanks for heads up)",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505169926.0,
    "date_created": "2017-09-11",
    "time_created": "10:45:26",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmw9u4t",
    "parent_id": "t1_dmuoqw9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Just a shame Luther got his version of the bible wrong. I mean it was a legitimate attempt to track down the correct sources, but it turns out that several of the books he threw out (the duterocanonicals or apocrypha - depending on denomination) existed earlier than people though - although this only came put in the Counterreformation. Included in these books are the ones that give the importance of Mary, which is why most of the Protestant churches don't get the Catholic appreciation for Mary.\n\n",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505241832.0,
    "date_created": "2017-09-12",
    "time_created": "06:43:52",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuoem9",
    "parent_id": "t1_dmunw5h",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "If it is York Minister, then they do charge tourists to enter. I think you can get into the services for free, but maybe not just to pray.\n\nE: Residents of York can get in for free with  a York Card apparently",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1505159164.0,
    "date_created": "2017-09-11",
    "time_created": "07:46:04",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmv83y9",
    "parent_id": "t1_dmunw5h",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[Westminster Abbey](http://www.westminster-abbey.org/visit-us/entry-charges) costs £20 to get in if you buy tickets online or £22 if you turn up on the day.\n\n£45 for a family of 4.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505184140.0,
    "date_created": "2017-09-11",
    "time_created": "14:42:20",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmumjxh",
    "parent_id": "t1_dmuk5r3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The Christest Christian! wub-a-lub-a-dub-dub",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505154534.0,
    "date_created": "2017-09-11",
    "time_created": "06:28:54",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmum6bo",
    "parent_id": "t1_dmulsbs",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Reading the NT makes it clear that the laws in leviticus particularly those that concern clean and unclean foods and forms of dress are not applicable to the Gentile believer.\n\nReading some parts of the NT makes it clear. But reading other parts (like the Sermon on the Mount) makes it clear that those laws are still in effect.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1505153415.0,
    "date_created": "2017-09-11",
    "time_created": "06:10:15",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuoob5",
    "parent_id": "t1_dmunw8a",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[Billy Ray](https://youtu.be/DjydOI4MEIw), is that you?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505159725.0,
    "date_created": "2017-09-11",
    "time_created": "07:55:25",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmvi7ml",
    "parent_id": "t1_dmvee6z",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I wasn't making a point about using the bible as a source of morality, just that some parts of the bible can be used in tandem with morality that we can form ourselves, but many christians seem to ignore those parts. Like Mogg",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505195568.0,
    "date_created": "2017-09-11",
    "time_created": "17:52:48",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmum1fe",
    "parent_id": "t1_dmult8g",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "He only makes up half the bible and uses a lot of metaphors aswell",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505152998.0,
    "date_created": "2017-09-11",
    "time_created": "06:03:18",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuobxq",
    "parent_id": "t1_dmum1h1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "yup. them and the 10 commandments. everything else is annecdotes and style guides.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505159002.0,
    "date_created": "2017-09-11",
    "time_created": "07:43:22",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmunjp0",
    "parent_id": "t1_dmumfqc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No, bloomin' Nora - should I have done? I knew the NIV was a terrible translation!\n",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505157177.0,
    "date_created": "2017-09-11",
    "time_created": "07:12:57",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmure2p",
    "parent_id": "t1_dmuqt1p",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">Sure, sure. One always needs to be careful about confusing correlation and causation though.\n\n[Absolutely!](http://www.tylervigen.com/spurious-correlations)\n\n>  I think the trend to suggest that science and religion are at odds could well be a bigger factor than the growth of science by itself, for instance, and that we could well see a slow reversal begin as more thinkers start offering serious opposition to such assertions.\n\nI think the issue these thinkers would have is that a generation well versed in the scientific principles would want some evidence of sorts before committing to a religion.... now that's not to say that a non-deity based form of spirituality would be off the table (meditation among the non-religious has seen a steady increase in recent years), i just think that as time goes on it will be increasingly more difficult to prove (or even Implicate) the existence of a god to people who are trained, through the teaching of the scientific principles, not to accept the limits of their knowledge as a proof of god (or anything else for that matter)\n\n> It's all very interesting either way! :)\n\nAgreed! ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505164518.0,
    "date_created": "2017-09-11",
    "time_created": "09:15:18",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu4950",
    "parent_id": "t1_dmu2wdq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The text just says they mocked him. There's no mention of any threat, which surely would be an important thing to make clear. In fact it says '[Elisha] turned back, and cursed them', which suggests that he was already on his way, turned round, and cursed them in spite. Also the word used for 'young people' covers young children to about 20yo max. The King James Bible renders it 'little children'. Contextually it reads more like God had a gang of gobby teenagers mauled. ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1505118956.0,
    "date_created": "2017-09-10",
    "time_created": "20:35:56",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu3jtx",
    "parent_id": "t1_dmty1p3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Do not suppose that I have come to bring peace to the earth. I did not come to bring peace, but a sword.\n\nBut did he actually kill anyone or anything?  I always took that to mean that he came to shake things up, not to keep everything the same as before.  That passage always seems to be used to justify war and the right to bear arms and other things that don't seem very Jesus-y.  It just means he is against the status quo, he wants change, ie some amount of turmoil will result.\n\n>For I have come to turn “a man against his father, daughter against her mother, a daughter-in-law against her mother-in-law\n \n>a man’s enemies will be the members of his own household\n\n>“Anyone who loves their father or mother more than me is not worthy of me; anyone who loves their son or daughter more than me is not worthy of me. \n\nAgain, he surely means he wants those who don't follow god to start following him.  If your dad is some polytheist, he wants the daughter to become a monotheist and follow Jesus/ god.  None of those quotes mean he wanted families to slaughter each other or anything.\n\nDisclaimer: I'm an atheist, it's just obvious that he meant he wants people to put god first or to start believing in god no matter what the family believes instead.  Hardly an evil stance from someone who believes in god.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1505117997.0,
    "date_created": "2017-09-10",
    "time_created": "20:19:57",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuomi1",
    "parent_id": "t1_dmty1p3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "sounds like a knowing nod to the crusades, the reformation era wars, and the various other religion based conflicts.\n\n\"people will hate my believers, and my believers will hate them too, humans are stupid and violent so its gonna end in bloodshed\"",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505159623.0,
    "date_created": "2017-09-11",
    "time_created": "07:53:43",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtv624",
    "parent_id": "t1_dmtug9t",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Flipping a table because a bunch of people decided to turn a temple into a den of capitalism is hardly up there with violently slaughtering people...",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1505107387.0,
    "date_created": "2017-09-10",
    "time_created": "17:23:07",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtv6i4",
    "parent_id": "t1_dmtug9t",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I don't think he was a pacifist but cleansing the of the temple was about spiritual/theocratic imperarive. Jesus also spent time telling people to turn the other cheek and commanded people to be peacemakers.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1505107401.0,
    "date_created": "2017-09-10",
    "time_created": "17:23:21",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtxc8w",
    "parent_id": "t1_dmtug9t",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Ah yes, Gentle Jesus, Meek and Mild!\n\nThere is always \"You brood of vipers!\" and \"Whitewashed tombs, but filled with the stench of decay\" aimed at the religious leaders, or \"Get behind me, Satan!\" at one of His best friends.\n\nMeek and Mild? Yeah, sure.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505109997.0,
    "date_created": "2017-09-10",
    "time_created": "18:06:37",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuf32y",
    "parent_id": "t1_dmu3a8u",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "dogma and policy aren't the same thing",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1505134701.0,
    "date_created": "2017-09-11",
    "time_created": "00:58:21",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmv2u11",
    "parent_id": "t1_dmu3a8u",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Otherwise Catholic dogma would be full of swear words from when Popes stub their toes",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505178286.0,
    "date_created": "2017-09-11",
    "time_created": "13:04:46",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmukn98",
    "parent_id": "t1_dmujybw",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "There is no pick-and-choosing. Infallible statements are quite clear.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1505148616.0,
    "date_created": "2017-09-11",
    "time_created": "04:50:16",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmy2tu6",
    "parent_id": "t1_dmw4dqc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Thanks for your wonderful rebuttal.\n\nIf your family were being murdered, would you use violence to save them? If so, you should agree with me that pacifism is evil. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505337718.0,
    "date_created": "2017-09-13",
    "time_created": "09:21:58",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu4zfe",
    "parent_id": "t1_dmu2ur1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I used the quotation marks because the guy I was replying to was implying that welfare and taxation was a form of state coercion, I don't agree though, you're right. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1505119928.0,
    "date_created": "2017-09-10",
    "time_created": "20:52:08",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtzud2",
    "parent_id": "t1_dmtzibf",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Good point ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505113066.0,
    "date_created": "2017-09-10",
    "time_created": "18:57:46",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmungdx",
    "parent_id": "t1_dmujiwu",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You oppose all coercive hierarchies or only the state?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505156943.0,
    "date_created": "2017-09-11",
    "time_created": "07:09:03",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuljxn",
    "parent_id": "t1_dmu4bi7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think you over estimate your ability to reason",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505151490.0,
    "date_created": "2017-09-11",
    "time_created": "05:38:10",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu4w09",
    "parent_id": "t1_dmttn4r",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No no, you don't understand, *Jesus* is using the threat of not being allowed to enter Heaven (which is His Most Private Property) to *compel* others to do what *Jesus* believes is morally right. \n\nIt's clearly an act of aggression that delegitimises the so-called \"Prince of Peace\".\n\n^^/s",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505119802.0,
    "date_created": "2017-09-10",
    "time_created": "20:50:02",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuom3n",
    "parent_id": "t1_dmuolzr",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Can't say I disagree.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505159601.0,
    "date_created": "2017-09-11",
    "time_created": "07:53:21",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmumoer",
    "parent_id": "t1_dmul4dq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You can't even admit it can you. All those things are based on violence. If you don't pay taxes you are thrown into jail. \n\nI think it's the least worst system we have and I support it but the foundation appears to be unethical to me. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505154877.0,
    "date_created": "2017-09-11",
    "time_created": "06:34:37",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu7lkc",
    "parent_id": "t1_dmu5tam",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Mm. I know the type of person you mean. Self-congratulatory, and helping out of a sense of.. patronising superiority. It's not a terribly kind and compassionate attitude.\n\nThough it does raise the question of whether motivations and the like make a significant difference to an otherwise-rightful action.\n\nI mean, I'd rather people were doing 'the right thing' for 'the right reasons', but... if doing the right thing is done for other reasons, I'll probably still take it.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505123401.0,
    "date_created": "2017-09-10",
    "time_created": "21:50:01",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmwkocl",
    "parent_id": "t1_dmwh3gd",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The old testament and new testament do not contradict on this point. There is communal contribution to group welfare in the Epistles and Acts, as part of the small microcosm of society the early church forms. There is mandatory contribution to welfare for the poor in the old testament law. Jesus encourages the giving to the poor.\n\nI'm not really sure how someone could have the gall to claim cherrypicking of scripture when discussing the idea of support for the poor including in the correct behaviour of rulers. \n\nTo claim \"oh it's just in the old testament\" is nonsense because the new testament doesn't have much regarding the actions of those in authority. The principles of good judgement, mercy and concern for the poor still apply, even to latter-day pharisees like Rees-Mogg.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505258286.0,
    "date_created": "2017-09-12",
    "time_created": "11:18:06",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtx1id",
    "parent_id": "t1_dmtwb52",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Well, when asked a question about it, answering that question is hardly sounding a trumpet before you.",
    "controversiality": 1,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505109625.0,
    "date_created": "2017-09-10",
    "time_created": "18:00:25",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmv533t",
    "parent_id": "t1_dmv4435",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">  but should democracy not trump your opinions on the matter?\n\nNo. Democracy should give people freedom, not take it away. Human rights are above democracy. You can use democracy to do whatever the fuck you want, that doesn't make it all right. \"Hurr the people voted to hang gay people, it's democracy in action\". \n\n> I see many people claiming that allowing abortion is against peoples rights/freedom\n\nThose people are religious psychopaths, and democracy & theocracy are not the same thing. \n\n>And what power does the DUP have to do bring about a law in the UK banning abortion? \n\nThey can demand the vote for it from the tories as part of their \"prop up the right wing\" tradeoffs. I imagine quite a lot of conservative MPs , like Sir Bufton Tufton over here will be rubbing their hands with glee with the concept of treating women like second class citizens with no control over their medical and reproductive choices.\n\n>The statement said that people won't vote for this though. I guess him saying \"never be socially acted upon\" was strong but the sentiment is correct, people in 21st century Britain aren't voting for abortion bans. His point isn't that he won't vote for abortion bans, but that the majority won't vote for it. Which is correct as far as I can see.\n\nThese days we've said that sort of BS about a lot of things, from Brexit to repealing the human rights charter. There are no depths of vileness the current western world won't sink to, and I genuinely will not be surprised if we get an abortion ban in any country in the west right now. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505180747.0,
    "date_created": "2017-09-11",
    "time_created": "13:45:47",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmulsez",
    "parent_id": "t1_dmuld4g",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "TBF with Wikipedia at least we know who wrote it ;)",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505152221.0,
    "date_created": "2017-09-11",
    "time_created": "05:50:21",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuh7xq",
    "parent_id": "t1_dmuevs2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">Jesus told you to feed the poor, **not take money from others** to feed the poor\n\nYou suggested that Jesus thought tax is theft, the above bible quotes go against that",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505139228.0,
    "date_created": "2017-09-11",
    "time_created": "02:13:48",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtxe98",
    "parent_id": "t1_dmtx985",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No.\n\nJesus said to pay taxes.\n\nJesus said to spread wealth so that the poor can live comfortably.\n\nJesus was against violence.\n\nFrom that, you can reasonably say that Jesus would like a welfare system that helps out the poor.\n\nYou cannot reasonably say that Jesus would like the state to ethnically cleanse Jesus's own race.\n\nAh, downvotes. How mature of you.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1505110063.0,
    "date_created": "2017-09-10",
    "time_created": "18:07:43",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmursgz",
    "parent_id": "t1_dmuoem9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I've got a Yorkie, will that do?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505165124.0,
    "date_created": "2017-09-11",
    "time_created": "09:25:24",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmvbedh",
    "parent_id": "t1_dmv83y9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "According to that link there is no charge to visit Westminster Abbey for prayer or worship",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505187790.0,
    "date_created": "2017-09-11",
    "time_created": "15:43:10",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmumki2",
    "parent_id": "t1_dmumjxh",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Pretty sure Jesus himself was less of a true Christian than me",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505154577.0,
    "date_created": "2017-09-11",
    "time_created": "06:29:37",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuminf",
    "parent_id": "t1_dmum6bo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "When Jesus says in Matt 5 (paraphrasing) he's not here to remove any part of the law. That can hold true as those components of the Law are explicitly not applicable to the gentile/alien but rather are for the Jewish people. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505154428.0,
    "date_created": "2017-09-11",
    "time_created": "06:27:08",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmup230",
    "parent_id": "t1_dmuoob5",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "sadly no. but i do like that song. \n",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505160482.0,
    "date_created": "2017-09-11",
    "time_created": "08:08:02",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmvio9p",
    "parent_id": "t1_dmvi7ml",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Makes the bible seem really pointless to me.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505196136.0,
    "date_created": "2017-09-11",
    "time_created": "18:02:16",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmumecz",
    "parent_id": "t1_dmum1fe",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "but as far as us Christians are concerned the commands of Jesus supersede the law given in the OT ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505154080.0,
    "date_created": "2017-09-11",
    "time_created": "06:21:20",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmumh8f",
    "parent_id": "t1_dmum1fe",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "he makes up a *lot* less than half the Bible ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505154315.0,
    "date_created": "2017-09-11",
    "time_created": "06:25:15",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmumt5k",
    "parent_id": "t1_dmum1fe",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Are you saying that half of the Bible was made up? ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505155243.0,
    "date_created": "2017-09-11",
    "time_created": "06:40:43",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuo82b",
    "parent_id": "t1_dmunjp0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Well it says you can grasp a lizard but it could be a euphemism",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505158766.0,
    "date_created": "2017-09-11",
    "time_created": "07:39:26",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu53jk",
    "parent_id": "t1_dmu4950",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "\"Furthermore, the statement “go up, you baldhead!” has cultural significance.  First of all, “go up” is probably a reference to Elisha’s predecessor, Elijah, ascending to heaven (2 Kings 2:11).  \n\nIn other words, they are stating they want Elisha gone; and since Elijah had gone on to the “next world,” the implication is they wanted Elisha dead.  \n\nAlso, the epithet ‘baldhead’ was one of “contempt in the East, applied to a person even with a bushy head of hair.” 1 Lepers had to shave their heads, so such a statement could easily have been a deliberate and malicious insult--something dangerous in a mob that can quickly get out of hand.\"\n\n&nbsp;\n\nThoughts on the above?",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1505120078.0,
    "date_created": "2017-09-10",
    "time_created": "20:54:38",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu6xm3",
    "parent_id": "t1_dmu4950",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "To teach kids lessons sometimes you've got to scare them a bit.\n\nDisclaimer: am not Christian and view the bible as a text to control people's behaviour, for both 'good' and 'ill'.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505122533.0,
    "date_created": "2017-09-10",
    "time_created": "21:35:33",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu4urh",
    "parent_id": "t1_dmu3jtx",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "This is why there are so many denominations. What's obvious to you is a nonsense interpretation to someone else. ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1505119754.0,
    "date_created": "2017-09-10",
    "time_created": "20:49:14",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtwn4e",
    "parent_id": "t1_dmtv624",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No but whipping them for it certainly isn't very \"nice\".",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505109134.0,
    "date_created": "2017-09-10",
    "time_created": "17:52:14",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmy3n78",
    "parent_id": "t1_dmy2tu6",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Or maybe pacifism is an ideal people aspire to rather than a rule they strictly follow?\n\n\"How can someone have an ideal while also being able to face reality?\" Because they can and they do.\n\nIf you think that's hypocrisy then you don't understand hypocrisy either.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505338808.0,
    "date_created": "2017-09-13",
    "time_created": "09:40:08",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuoedv",
    "parent_id": "t1_dmungdx",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I oppose the ones that are effectively coercive (i.e. force based); not the ones that are voluntary.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505159150.0,
    "date_created": "2017-09-11",
    "time_created": "07:45:50",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmult5m",
    "parent_id": "t1_dmuljxn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think you overestimate your ability to understand Christianity",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505152282.0,
    "date_created": "2017-09-11",
    "time_created": "05:51:22",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuvhx9",
    "parent_id": "t1_dmumoer",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "then everything is violence. how could anything not be based om violence?\n\nyou're catagorising it to such an extent you're making it redundant.  tax? violence. court trial after killing someone? violence. if these are all 'unethical violence ' how could anything not be unethical?\n\ni mean, keeping in mind capitalism is 100% about unethical exploitation of labour and those with the wealth to be taxed are doing the most exploitation.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505170071.0,
    "date_created": "2017-09-11",
    "time_created": "10:47:51",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmua2ou",
    "parent_id": "t1_dmu7lkc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Oh yeah that was a very common topic of discussion amongst us, and generally the conclusion we all came to.  But all of us preferred the totally dead on the inside long term service workers, no pretense.  \n\nAnd again, I'm not trying to talk shit because, I mean, they fed me when I was hungry, can't get too mad about that.  But everyone saw through the facade.  Plus they all want to pray for you and like, stop touching me.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505126751.0,
    "date_created": "2017-09-10",
    "time_created": "22:45:51",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmufo84",
    "parent_id": "t1_dmu7lkc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">[The Pharisee and Tax Collector\n9To some who trusted in their own righteousness and viewed others with contempt, He also told this parable: 10“Two men went up to the temple to pray. One was a Pharisee and the other a tax collector. 11The Pharisee stood by himself and prayed, ‘God, I thank You that I am not like the other men—swindlers, evildoers, adulterers—or even like this tax collector. 12I fast twice a week and pay tithes of all that I receive.’\n13But the tax collector stood at a distance, unwilling even to lift up his eyes to heaven. Instead, he beat his breast and said, ‘God, have mercy on me, a sinner!’ 14I tell you, this man, rather than the Pharisee, went home justified. For everyone who exalts himself will be humbled, but the one who humbles himself will be exalted.”](http://biblehub.com/bsb/luke/18.htm)",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505135865.0,
    "date_created": "2017-09-11",
    "time_created": "01:17:45",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmwmii0",
    "parent_id": "t1_dmwkocl",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You brought up the Old Testament, not me. We can discuss the other New Testament references you're making, but we have to get on the same page.\n\nNow, regarding the communal society described in Acts, the mandatory welfare in that case was a prerequisite for living in the commune. But no one was forced to live in the commune. It's like paying dues to a country club. No one is forcing you to be a member, but if you want to be one then you have to contribute. Furthermore, the difference between a charity and a commune is that in a commune, you're one of the people benefitting from the money you're putting into it. It's fair to ask that you contribute if you're going to reap from the spoils. But charity is a one-way transaction. So it's not fair to impose it on anybody.\n\nAnd yes, of course Jesus encourages charity. I'm not saying we shouldn't be charitable. But again, it has to be a personal decision, not one imposed by an external authority. It's like working. Working is good. But being forced to work is called slavery. And forced charity is economic slavery.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505260233.0,
    "date_created": "2017-09-12",
    "time_created": "11:50:33",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmv5oup",
    "parent_id": "t1_dmv533t",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "So your main point is that conservatives/right leaning people are \"religious psychopaths\" who rub there hands with glee at the idea of \"treating women like second class citizens\"?\n\nJonathan Haidt's [The Righteous Mind](https://www.amazon.co.uk/Righteous-Mind-Divided-Politics-Religion-ebook/dp/B0076O2VMI/ref=sr_1_1?ie=UTF8&qid=1505152291&sr=8-1&keywords=jonathan+haidt) is a good rebuttal of this idea. Personally I don't think that people to the other side of the spectrum are terrible people, but I guess liberals need something to cling onto to point towards the current political climate.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505181411.0,
    "date_created": "2017-09-11",
    "time_created": "13:56:51",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuhqc8",
    "parent_id": "t1_dmuh7xq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No, I was talking about welfare where he said it should be given willingly.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505140423.0,
    "date_created": "2017-09-11",
    "time_created": "02:33:43",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtxg1b",
    "parent_id": "t1_dmtxe98",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> From that, you can reasonably say that Jesus would like a welfare system that helps out the poor.\n\nAKA you can *extrapolate* it.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505110123.0,
    "date_created": "2017-09-10",
    "time_created": "18:08:43",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmus2po",
    "parent_id": "t1_dmursgz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Depends, is it raisin and biscuit?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505165542.0,
    "date_created": "2017-09-11",
    "time_created": "09:32:22",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmumnuq",
    "parent_id": "t1_dmumki2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Well he was Jewish.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1505154836.0,
    "date_created": "2017-09-11",
    "time_created": "06:33:56",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmumrxa",
    "parent_id": "t1_dmuminf",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "And if one were to convert to Judaism, would one have to follow the commandments? \n\nJewish Christians, like the author of Matthew, would simply say that the same goes for converts to his particular type of Judaism (what we call Christianity). If you convert, you'll have to followe the rules.\n\n\n\n\n",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505155150.0,
    "date_created": "2017-09-11",
    "time_created": "06:39:10",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmupm5g",
    "parent_id": "t1_dmup230",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You are the **Son** of a preacher?\n\nIf you're a girl, is your dad the preacher who got dancing outlawed until Kevin Bacon taught him that dancing is an act of celebration and rejoice.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505161540.0,
    "date_created": "2017-09-11",
    "time_created": "08:25:40",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmx2xgc",
    "parent_id": "t1_dmvio9p",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That'll be because it is fucking worthless.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505277270.0,
    "date_created": "2017-09-12",
    "time_created": "16:34:30",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmumlea",
    "parent_id": "t1_dmumecz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Doesn't he annul the previous stuff? New Testament always struck me as patch notes.\n\n\"Ok fuck, so here's the problems we have with the existing build, we're overhauling a lot of it, so here's the new settings you have to change on your rig\"",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505154645.0,
    "date_created": "2017-09-11",
    "time_created": "06:30:45",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmumpu1",
    "parent_id": "t1_dmumecz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yeah but he isnt always around to give his view on things (doesnt comtradict or support everythimg in OT), so its hard to see what is actually the word of god on some things",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505154986.0,
    "date_created": "2017-09-11",
    "time_created": "06:36:26",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmunfxb",
    "parent_id": "t1_dmumt5k",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Half the bible wasn't the word of god and should be read and analysed before coming to your own conclusions.\n\nIf your jewish the other half is made up",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505156909.0,
    "date_created": "2017-09-11",
    "time_created": "07:08:29",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmukvxu",
    "parent_id": "t1_dmu53jk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "If a kid tells you to drop dead it certainly has to be taken as a literal threat to your life and you should shoot him.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1505149368.0,
    "date_created": "2017-09-11",
    "time_created": "05:02:48",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu5uyt",
    "parent_id": "t1_dmu53jk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Still super tenuous to call it a mortal threat. It reads like jeering, and mocking what he claimed happened to Elijah. The way Elisha turns back towards the kids and then curses them detracts from the sense of imminent confrontation.\n ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1505121097.0,
    "date_created": "2017-09-10",
    "time_created": "21:11:37",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuoj9b",
    "parent_id": "t1_dmu53jk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "so something along the lines of  \"drop dead, you discusting diseased subhuman!\"",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505159432.0,
    "date_created": "2017-09-11",
    "time_created": "07:50:32",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmulntn",
    "parent_id": "t1_dmu4urh",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "People see what they want to see. Even Islam with it's perfect word of god still needs people to \"interpret\" what it means. \n\n\n\n",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1505151838.0,
    "date_created": "2017-09-11",
    "time_created": "05:43:58",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu2zfg",
    "parent_id": "t1_dmtwn4e",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "'Good Is Not Nice' is something to bear in mind with those things.\n\nAlso, his \"pacifist\" actions were far more rebellious in context than they may seem to a modern reader that isn't aware of it.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1505117201.0,
    "date_created": "2017-09-10",
    "time_created": "20:06:41",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmur758",
    "parent_id": "t1_dmuoedv",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "But you can just renounce your citizenship and live somewhere else can't you?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505164219.0,
    "date_created": "2017-09-11",
    "time_created": "09:10:19",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmulw7a",
    "parent_id": "t1_dmult5m",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Good one thank you for applying demonstrating my point.\n\nIf you are going to be a god botherer you should probably look this stuff up. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505152542.0,
    "date_created": "2017-09-11",
    "time_created": "05:55:42",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuvqh1",
    "parent_id": "t1_dmuvhx9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> then everything is violence. how could anything not be based om violence?\n\nExactly. \n\n>i mean, keeping in mind capitalism is 100% about unethical exploitation of labour and those with the wealth to be taxed are doing the most exploitation.\n\nIt's funny that you tell me to \"fuck off to Somalia\" (that tells me a lot about your character) because it's an area of the world where the state has broken down but if you subscribe to Marx; than the dream utopia is one where there is no state. Yet in that situation as if by magic, people co-operate and it's all fine. And you're telling me without a state it's all doom? \n\nIf you subscribe to Marxist theory that's pretty stupid. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505170365.0,
    "date_created": "2017-09-11",
    "time_created": "10:52:45",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmwo23x",
    "parent_id": "t1_dmwmii0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Of course I brought up the old testament, it's pretty vital to understand that if you're talking about Christ, he was a rabbi, after all, the Jewish law was the context in which he taught. \n\nWhat you seem to be arguing is why the consistent principles followed in scripture both in the law of God for Israel and the voluntary society of early Christians don't apply. Supply side Jesus or some heretical notion, perhaps.\n\nYou are incorrect in use of comparison to a country club, the community of the early church included people who could not financially contribute. \n\nYou are also saying that the law of God imposes economic slavery, as it certainly mandates charity, which is certainly a brave position. Is that truly what you mean to assert, that you consider the old testament law to be outright bad?\n\nThat would seem to require belief that God was either mistaken or lying to decieve the Jews into following a bad law...  ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505261888.0,
    "date_created": "2017-09-12",
    "time_created": "12:18:08",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmv5z34",
    "parent_id": "t1_dmv5oup",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> So your main point is that conservatives/right leaning people are \"religious psychopaths\" who rub there hands with glee at the idea of \"treating women like second class citizens\"?\n\nIf you look at the way they vote, than yes. That's exactly what they are. An abortion is a medical procedure, if you're opposing that you are interested in making a woman into a second class citizen. \n\nIf you're interested in taking away freedom from other people that does no harm to you, you are a psychopath. \n\n> Personally I don't think that people to the other side of the spectrum are terrible people, but I guess liberals need something to cling onto to point towards the current political climate.\n\nGet the fuck out of here. If you're taking away freedom from me or anyone else, you're a terrible person. There's no opinions about this. As an adult , my life is something that only I should control, provided I'm not harming other people. If you're spending your time and effort into restricting my freedom, you're a malicious entity. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505181729.0,
    "date_created": "2017-09-11",
    "time_created": "14:02:09",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmty4hu",
    "parent_id": "t1_dmtxg1b",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yes. A very, very plausible extrapolation at that. That doesn't make it equally plausible that Jesus called for the destruction of the Jews.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1505110940.0,
    "date_created": "2017-09-10",
    "time_created": "18:22:20",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmtyaxu",
    "parent_id": "t1_dmtxg1b",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "But that's obvious right? The concept of a modern welfare state did not exist then. Extrapolation is the name of the game when it comes to theology. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1505111158.0,
    "date_created": "2017-09-10",
    "time_created": "18:25:58",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuli8j",
    "parent_id": "t1_dmtxg1b",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That sounds more like interpolation than extrapolation to me.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505151342.0,
    "date_created": "2017-09-11",
    "time_created": "05:35:42",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmumpaf",
    "parent_id": "t1_dmumnuq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That’s no excuse",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505154943.0,
    "date_created": "2017-09-11",
    "time_created": "06:35:43",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuna5g",
    "parent_id": "t1_dmumrxa",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "There are different rules for Jewish believers i.e. those who are ethnically a member of the Jewish people to Gentiles i.e. non Jews. This is true in the NT where they are referred to as Gentile believers and the OT where they are called (depending on translation ) Aliens/strangers/sojourners.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505156497.0,
    "date_created": "2017-09-11",
    "time_created": "07:01:37",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmur61b",
    "parent_id": "t1_dmupm5g",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "nope. im deffinately male. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505164169.0,
    "date_created": "2017-09-11",
    "time_created": "09:09:29",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmx460v",
    "parent_id": "t1_dmx2xgc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Let’s not even use it in tandem with morality to give those Moggsters an excuse then",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505278517.0,
    "date_created": "2017-09-12",
    "time_created": "16:55:17",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmumyvk",
    "parent_id": "t1_dmumlea",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'll go for a high level overview but there is a lot more depth to it. A lot of the previous stuff can be broken into 4 categories (I'm probably forgetting a few more but it gives a good indication):\n\n1. Rules for the Jews as God's chosen people - to do with outside signs that would demonstrate membership of that group (circumcision, not eating certain foods, dressing a certain way, facial hair, no tattoos, etc. ). \n\n2. Animal sacrifices as an atonement for sins\n\n3. Commandments with punishments that demonstrate how serious God takes sin. (Stone the adulterer)\n\n4. Commandments with punishments that demonstrate how seriously his people should take being in his presence i.e. the need to be ceremonially clean. (not eating foods, no woman on their period, not touching certain things)\n\nSo after Jesus there are logical reasons why some of these things are no longer needed.\n\n1. With Jesus' death and resurrection Gentile (non-Jewish) people are able to commune with God, they are not a member of the Jewish people so are not required to conform to those outward signs.\n\n2. Jesus Death is the one perfect sacrifice meaning sin offerings are no longer required.\n\n3. As Jesus takes the punishment for sins upon himself the earthly punishment is no longer required as the debt has been paid by Jesus. \n\n4. believers are now viewed from God's perspective as being like Jesus i.e. no sin so no need to worry about being ceremonially clean.\n\nHope that helps, though it was probably more info than you wanted ;)",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505155668.0,
    "date_created": "2017-09-11",
    "time_created": "06:47:48",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuo823",
    "parent_id": "t1_dmumlea",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "pretty much, theres the old covenant between god and the jews (see moses on mount sainai)\n\nand theres the new covenant between jesus and all mankind provided they opt in (see the first 4 books of the new testament) \n\nthe rest of the old testament is the history of the jewish people, showing them repeatedly falling from grace and suffering as a result the coming back to god an prospering again. theres also a few prophesies about jesus and maybe the end of the world mixed in too.\n\nmost of the rest of the new testament is a handy advice guide courtesy of the deciples and paul. with the exception revelations after ch1v8 which is a slightly psychadelic depiction of johns vision of the end of the world.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505158766.0,
    "date_created": "2017-09-11",
    "time_created": "07:39:26",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmunex7",
    "parent_id": "t1_dmumpu1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "There are nuances and edge cases which come down to interpretation. Partially this is where the different denominations arise from. Though for most things careful study and the wisdom passed down through the church is enough to clarify the biblical position on most issues. See my [post above](https://www.reddit.com/r/ukpolitics/comments/6za9of/if_mogg_is_going_to_proclaim_hes_a_christian_he/dmumyvk/) for some of the reasoning \n\nThat said most of these are not central to the faith and is why largely the different denominations agree on the fundamentals.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1505156835.0,
    "date_created": "2017-09-11",
    "time_created": "07:07:15",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuq30h",
    "parent_id": "t1_dmukvxu",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think it's a little different when it's a group of at least 40 (it's listed that 42 of them were attacked, so that's the bare minimum group size).\n\nDoesn't really matter who a person is, they're generally not going to be able to take on a crowd alone.\n\nY'know, unless they're buddies with a divine being that responds with she-bears.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505162370.0,
    "date_created": "2017-09-11",
    "time_created": "08:39:30",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu7f9c",
    "parent_id": "t1_dmu5uyt",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "A crowd of 40 people expressing the sentiment \"Fuck off and die\" may not *necessarily* be an imminent threat, but certainly isn't *not* a threat.\n\n(I'm still of the opinion that an omnipotent being could've resolved it *without* murder-by-proxy with bears though.)",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1505123174.0,
    "date_created": "2017-09-10",
    "time_created": "21:46:14",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuv2n8",
    "parent_id": "t1_dmur758",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Why should people be forced to live somewhere else if they are on their own property? You have no right to chase them away.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505169547.0,
    "date_created": "2017-09-11",
    "time_created": "10:39:07",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmum4ht",
    "parent_id": "t1_dmulw7a",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You don't have a point mate. Christianity ain't utilitarianism.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505153261.0,
    "date_created": "2017-09-11",
    "time_created": "06:07:41",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuyos5",
    "parent_id": "t1_dmuvqh1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "when did this become about marxism\n\nand what does it tell youbabout my character? that when some egregious bellend begins a convo with insults, they get told to get fucked?\n\nseems reasonable.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505173766.0,
    "date_created": "2017-09-11",
    "time_created": "11:49:26",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmwozdn",
    "parent_id": "t1_dmwo23x",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> the community of the early church included people who could not financially contribute\n\nBut my point is that everyone was there voluntarily, and could have left if they decided that they didn't *want* to contribute. My country club comparison isn't perfect, I admit, but it's pretty close.\n\n> You are also saying that the law of God imposes economic slavery\n\nOnly in the Old Testament. I'm not afraid to proclaim that OT law was brutal. It was still righteous, because everything God does is righteous. But yes, it was brutal as well. Again, charity in the New Testament is voluntary. That's the whole point of my argument.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505262877.0,
    "date_created": "2017-09-12",
    "time_created": "12:34:37",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmunpwp",
    "parent_id": "t1_dmuna5g",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "What you are presenting was hotly debated in early Christianity. You are basically offering the anti-torah view. The other side would say that gentile converts would have to follow the commandments. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505157600.0,
    "date_created": "2017-09-11",
    "time_created": "07:20:00",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dn0lw4j",
    "parent_id": "t1_dmx460v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Fair enough. My only point was that there are plenty of chapters with fantastic verses within it, and we should look at is as any other book: take the good quotes and popularise them. I mean God and Jesus spend thousands of chapters telling humans to fucking love each other, and what do we do? Split into several sects of religion that hate each other and spend all day figuring out who ELSE they hate as well. It's just a completely fundamental misunderstanding of the bible, we focus on one verse that says not to lie with men, and ignore the HUNDREDS of lines about loving your fellow man.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505457082.0,
    "date_created": "2017-09-14",
    "time_created": "18:31:22",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuob3h",
    "parent_id": "t1_dmunex7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "those core fundamentals, to my understanding, being:\n\n1) jesus was the mesiah   \n2) jesus died and paid the proce for our sins  \n3) anyone who repents will be cleansed of their sins and can enter heaven.\n\n",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505158952.0,
    "date_created": "2017-09-11",
    "time_created": "07:42:32",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmu7qdt",
    "parent_id": "t1_dmu7f9c",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That's fair. The way it reads is as though he's passed them, and then curses them, though",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505123577.0,
    "date_created": "2017-09-10",
    "time_created": "21:52:57",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmuwl6w",
    "parent_id": "t1_dmuv2n8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "If you built your property in one country and want to move to another that's your own fault for poor planning. No one forced you to build there",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1505171397.0,
    "date_created": "2017-09-11",
    "time_created": "11:09:57",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmume5c",
    "parent_id": "t1_dmum4ht",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "i never said it was, are you just going to vaguely insinuate you have a point without ever actually stating one like normal?\n\nIf you have forgotten you were trying to prove that the motive of charity was more important than the act itself under Christianity, go.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505154063.0,
    "date_created": "2017-09-11",
    "time_created": "06:21:03",
    "submission_id": "ukpolitics-6za9of"
  },
  {
    "id": "dmwqftk",
    "parent_id": "t1_dmwozdn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The community of believers had rules, giving was not optional, as Ananias and Sapphira discovered. I do not think it is reasonable to compare to a club, given that other clubs exist and one can choose, but to be an early Christian was tied to being part of a church. There is little option in that.\n\n>I'm not afraid to proclaim that OT law was brutal\n\nSorry, just to be clear, what part of leaving surplus crops for the impoverished or providing food and clothing for foreigners is 'brutal'? \n\nAnd just because it happened to be in my evening  readings, What of Proverbs 14:31 is brutal?\n\n*He who oppresses the poor reproaches his Maker, But he who honors Him has mercy on the needy.*\n\nYou seem to be claiming to know better than God what is right regarding how rulers should act towards the poor. Like God is somehow behind the times on this.... Which is something that Mogg would surely oppose, given his orthodoxy elsewhere. You'd hope.\n",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1505264395.0,
    "date_created": "2017-09-12",
    "time_created": "12:59:55",
    "submission_id": "ukpolitics-6za9of"
  }
]