[
  {
    "id": "ddsthfm",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "\nAs a reminder, this subreddit [is for civil discussion.](https://www.reddit.com/r/politics/wiki/rulesandregs#wiki_please_be_civil)\n\n* Do not call other users trolls, morons, children, or anything else clever you may think of. [Personal attacks, whether explicit or implicit, are not permitted.](https://www.reddit.com/r/politics/wiki/rulesandregs#wiki_no_personal_attacks)\n\n* Do not accuse other users of being shills. If you believe that a user is a shill, the proper conduct is to report the user or send us a modmail.\n\n* In general, don't be a jerk. Don't bait people, don't use hate speech, etc. Attack ideas, not users.\n\n* Do not downvote comments because you disagree with them, and be willing to upvote quality comments whether you agree with the opinions held or not.\n\nIncivility will result in a **permanent ban** from the subreddit. If you see uncivil comments, please report them and do not reply with incivility of your own.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1487235935.0,
    "date_created": "2017-02-15",
    "time_created": "20:05:35",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt3cms",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "How will history view the Congressional Republicans who do nothing?",
    "controversiality": 0,
    "ups": 960,
    "downs": 0,
    "score": 960,
    "created": 1487249725.0,
    "date_created": "2017-02-15",
    "time_created": "23:55:25",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt81h7",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "* Declared the “court system” a threat to national security.\n\n* Insisted that his Supreme Court pick had no problem with attacks on the judiciary, in the face of blatant evidence to the contrary.\n\n* Trashed New START during a call with Putin — after putting the phone aside to ask his advisers what that (nuclear-arms treaty) was.\n\n* Publicly condemned a private company for dropping his daughter’s (increasingly unpopular) fashion line.\n\n* Suggested that publicly criticizing his military decisions is tantamount to aiding “the enemy.”\n\n* Got angry at his press secretary for being impersonated by a woman.\n\n* Used the executive branch’s immense authority over border control to inflict arbitrary cruelty on thousands of Muslim immigrants, create chaos at airports all across America, and sour diplomatic relations with the rest of the world.\n\n* Violated court orders against his travel ban.\n\n* Created a diplomatic crisis with Australia — and threatened to invade Mexico.\n\n* Allowed his press secretary to falsely claim that Iran had committed an act of war against the United States.\n\n* Retained the author of a reactionary screed that likened the 2016 election to Flight 93 as a national-security staffer.\n\n* Suggested that Frederick Douglass is still alive in speech on Black History Month.\n\n* Told a demonstrable lie about the size of the crowd at his inauguration — and predicted that the media would “pay a big price” for refusing to repeat it.\n\n* Told congressional leaders at a private meeting that he only lost the popular vote because undocumented immigrants cast millions of ballots against him.\n\n* Suggested America might once again have the opportunity to confiscate Iraq’s oil.\n\n* Allowed his company to leverage the cachet of his election into a massive expansion of its hotel empire.\n\n* Ordered the Department of Homeland Security to issue a weekly list of crimes (allegedly) committed by undocumented immigrants in sanctuary cities.\n\n* Prepared to radically reduce American funding to the United Nations.\n\n* Signed a bevy of executive orders that were drafted by the White House’s Breitbart wing — and no one else.\n\n* Declared that his election had restored American democracy, in an angry, authoritarian inaugural address.\n\n* Replaced the White House website’s page on climate change with a vow to drill for oil on federal lands.\n\n* Defamed a hero of the civil-rights movement in a series of racist tweets.\n\n* llowed his secretary of State nominee to pledge that America would block China’s access to its disputed islands in the South China Sea — a promise that, if kept, would almost certainly mean war.\n\n* Named his son-in-law a senior White House adviser, in defiance of norms (and, very likely, laws) against nepotism.\n\n* Called NATO obsolete.\n\n* Repeatedly denigrated America’s intelligence agencies, then leaked plans to downsize them.\n\n* Declared his openness to reviving a nuclear arms race.\n\n* Disparaged the sitting American president, while praising a hostile foreign autocrat.\n\n* Continued to use Twitter as a tool for souring diplomatic relations with the world’s second-greatest power.\n\n* Named a billionaire investor — with an enormous, personal financial interest in deregulating certain sectors of the economy — as his special adviser on regulatory reform.\n\n* Declared the American intelligence community to be inherently untrustworthy, after it produced information that he did not like.\n\n* Said he would continue skipping daily intelligence briefings when he becomes president because he’s smart enough to get by without them.\n\n* Said he doesn’t know why he should be bound by the One China Policy.\n\n* Invited his adult sons — who are slated to run the Trump Organization next year — to a policy meeting with the leading lights of Silicon Valley.\n\n* Picked a man who once tried to call for the abolition of the Energy Department — but couldn’t remember the department’s name — as secretary of Energy.\n\n* Named his bankruptcy lawyer — who thinks liberal Jews are “worse” than Nazi collaborators — as his pick for ambassador to Israel.\n\n* Provoked heightened diplomatic tensions with two nuclear-armed states.\n\n* Handed the Environmental Protection Agency to a climate denialist.\n\n* Handed the Labor Department to a serial violator of labor law. Although he quit like a loser today.\n\n* Requested security clearance for a conspiracy theorist who claims that the Clintons operate a Satanic child-sex ring out of a popular D.C. pizzeria.\n\n* Questioned the legitimacy of the election he just won.\n\n* Appointed Ben Carson secretary of Housing and Urban Development — despite the fact that Carson has no relevant experience and recently declared himself unqualified for any cabinet position.\n\n* Allowed his D.C. hotel to actively court the patronage of foreign diplomats.\n\n* Invited the manager of his blind trust onto a phone call with the president of Argentina.\n\n* Met with Indian business partners who have publicly declared their intention to capitalize on his status as president-elect.\n\n* Tried to coerce Britain into appointing a right-wing extremist as its ambassador to the United States.\n\n* Berated the media at a closed-door meeting for publishing unflattering photos of his double chin.\n\n* Admitted that his charity was guilty of self-dealing.\n\n* Derided protestors as paid professionals whose acts of free speech are fundamentally “unfair.”\n\n* Invited the manager of his “blind trust” to a meeting with the prime minister of Japan.\n\n* Assembled a team of racists to lead his White House.\n\n* Took credit for the fact that Ford will not be relocating a plant to Mexico (which they never had any intention of relocating to Mexico).\n\n* Declared America’s leading newspaper a “failing” institution.\n\n* Took calls from foreign leaders on unsecured phone lines, without consulting the State Department.\n\n* Referred to his White House transition as though it were the next season of The Apprentice.\n\nWow, what a month that was.",
    "controversiality": 0,
    "ups": 3871,
    "downs": 0,
    "score": 3871,
    "created": 1487259110.0,
    "date_created": "2017-02-16",
    "time_created": "02:31:50",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt43oi",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "It's noteworthy that, while making the case that Trump is unfit to serve, they didn't even mention Trump's fiasco in Yemen.  Let's go over that one again.\n\nThe Obama administration had been contemplating a raid in Yemen.  To gather intel?  To capture or kill an ISIS leader?  Who knows.  They never committed to executing the raid because they determined it was too dangerous.\n\nTrump becomes the (p)Resident and some knucklehead in his administration convinces him to go for it.  Aaaaaaaaaaaand it proved to be too dangerous.\n\n* A U.S. Navy Seal was killed during the raid.\n\n* 23 civilians were killed, including women and children.\n\n* U.S. servicemen were injured during the raid.\n\n* A 75 Million Dollar U.S. aircraft was destroyed.  In fact, it had to be destroyed by the U.S. military, meaning, we paid for the missile used to destroy our own $75 million aircraft.  *Awesome!?*  ...oh, hell no.\n\nShortly after the raid, a press conference was scheduled to show off a key piece of intel gathered during the raid.  A video.  It was quickly debunked as being at least 10 years old and already available on the goddamn mother fucking internet.\n\nFor me, the most amazing aspect of the raid in Yemen is that Trump didn't even go to the situation room to be briefed before approving the raid.  What was Trumple Thinskin so busy doing that he couldn't be thoroughly briefed in order to make the best possible decision?\n\n**...He was eating.**\n\nAnd here's a question nobody seems to have asked about the Yemen raid: Who actually WAS in the Situation Room for the Yemen raid?  Was it Skeletor himself, Steve Bannon?\n\nThere's a lot of talk about Trump being a Russian Puppet, but there's more than one hand up that clown's ass making his fish faced mouth move.  Trump is just as much Bannon's puppet, and lives have already been lost because of it.\n\nEdited to add another piece of fallout from the botched Yemen raid:  **Yemen has withdrawn permission for U.S. antiterror ground missions**, which could prove to be a costly consequence, making it harder for the U.S. to go after ISIS in Yemen.",
    "controversiality": 0,
    "ups": 6668,
    "downs": 0,
    "score": 6668,
    "created": 1487250955.0,
    "date_created": "2017-02-16",
    "time_created": "00:15:55",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt37f7",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "\"Unfit to serve\" is being polite.",
    "controversiality": 0,
    "ups": 439,
    "downs": 0,
    "score": 439,
    "created": 1487249491.0,
    "date_created": "2017-02-15",
    "time_created": "23:51:31",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsurtl",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "> The Michael Flynn fiasco was the entirely predictable product of the indiscipline, deceit, incompetence and moral indifference that characterize Donald Trump’s approach to leadership.\n\nThis style of leadership is pervasive throughout every strata of society. Trump is an asshole middle manager who thinks that demoralizing the staff will make them work harder.",
    "controversiality": 0,
    "ups": 2523,
    "downs": 0,
    "score": 2523,
    "created": 1487237683.0,
    "date_created": "2017-02-15",
    "time_created": "20:34:43",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt46k1",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": ">“Information is being illegally given to the failing @nytimes & @washingtonpost by the intelligence community (NSA and FBI?)\n\nYes, well this is one Trump conspiracy theory that is likely true. Trump is learning what happens when you piss off the intelligence community by calling them Nazis, especially when a Nazi is your chief strategist.",
    "controversiality": 0,
    "ups": 242,
    "downs": 0,
    "score": 242,
    "created": 1487251091.0,
    "date_created": "2017-02-16",
    "time_created": "00:18:11",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsxlhl",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "So, according to Trump supporters, the majority of the civilzed world's governments, the majority of our nations population and the population of the free world, along with the majority of free world's legitimate news organizations, and the majority of American intelligence agencies, are all **\"conspiring\" against innocent Trump and Putin.**... \n\nAnd we're crazy because we ***don't*** believe that...... \n\n",
    "controversiality": 0,
    "ups": 1354,
    "downs": 0,
    "score": 1354,
    "created": 1487241499.0,
    "date_created": "2017-02-15",
    "time_created": "21:38:19",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddstl5z",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": ">In this dark moment, we can celebrate the vitality of the institutions of a free society that are pushing back against a president offering the country a remarkable combination of authoritarian inclinations and ineptitude. The courts, civil servants, citizens — collectively and individually — and, yes, an unfettered media have all checked Trump and forced inconvenient facts into the sunlight.",
    "controversiality": 0,
    "ups": 5251,
    "downs": 0,
    "score": 5251,
    "created": 1487236079.0,
    "date_created": "2017-02-15",
    "time_created": "20:07:59",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt5t19",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "Watch. When he is removed from office, some people will be confused as to why that happened. Those are the people who didn't bother to follow what was going on.",
    "controversiality": 0,
    "ups": 45,
    "downs": 0,
    "score": 45,
    "created": 1487254073.0,
    "date_created": "2017-02-16",
    "time_created": "01:07:53",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsu07l",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "He looks like a complete fucking moron when he blatantly ignores questions regarding the communication with Russia. He's acting like a spoiled toddler who doesn't get his way.  He's a disgrace to the office, he's a disgrace to the nation, he's so bad he's made me root for a Christian Caliphate to be the god damn president.",
    "controversiality": 0,
    "ups": 4089,
    "downs": 0,
    "score": 4089,
    "created": 1487236643.0,
    "date_created": "2017-02-15",
    "time_created": "20:17:23",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsv4py",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "Something that'd be kind of grimly amusing if we weren't in such a dark place right now as a nation:\n\nI work at a public library, and we keep \"new\" non-fiction titles in the \"new\" section for five months (or longer, depending on how popular the title is), before putting said titles into the general circulating collection.\n\nOn our \"new\" non-fiction shelf right now there are six books, published before the election, that are essentially anti-Clinton screeds. (There are no anti-Trump screeds in the \"new\" section, in case you were wondering.) On the dustjackets they copywriters bray on about how \"dangerous\" Clinton would be as President. The one I'm looking at right now, \"Guilty as Sin,\" by Edward Klein, has a picture of a scowling HRC on the front cover and *a quote from Donald Trump on the fucking back cover, promoting the book.* \n\nThe dustjacket also claims to list the \"crimes\" and \"scandals\" that HRC was supposedly guilty of, but they're so fucking *tame* compared to what we're going through right now - and ironically, one of the supposed \"crimes\" HRC committed was \"mishandling of classified information.\" The author even freaks out about (direct quote) \"The shocking extent of the e-mail scandal - potential blackmail of the next president of the United States by foreign governments.\" \n\nAnother on the list: \"How the biggest scandal since Watergate is likely to affect the outcome of the presidential election.\" \n\nInside the book, Klein worries and frets over James Comey *not* going ahead with an investigation into HRC's \"mishandling of classified information\" in July of 2016, implying that Comey was an HRC/Obama stooge.\n\nI keep reading through this book wondering when I'll get to a part that actually describes in specifics and real detail what supposed \"crimes\" HRC committed that would make her unqualified to be president, and instead I just keep seeing stuff that *hints* at how shady Bill Clinton (he never refers to him as anything other than \"Bill\") is - and *Bill wasn't fucking running for President.* Klein never actually seems to get down to the nitty-gritty of what HRC was \"guilty as sin\" of, he just feints and hints and drops innuendos. He keeps calling her \"crooked\" but never says *why*. \n\nBut the whole case against HRC for President, and the case that Klein and Trump's supporters seemed to go on and on about -- mishandling classified info, clouding with the US's \"enemies,\" pay to play, lying (OH! The waterfall of words the right's writers have spilled about how much Bill and Hillary \"lie\" and not a fucking *syllable* about how much Trump lies!), \"crooked\"ness -- *holy fuck, turns out Trump is WAY more \"guilty as sin\" of these crimes than the subject of his fucking book.*\n\nHow much you wanna bet Klein writes a book that skewers Trump for the crimes he thinks Clinton committed? I would not wager a cent.\n\nAnyways, it's kind of head-shakingly odd to see all of these anti-Clinton books still on my library's shelves, gathering dust, all of them feverishly describing the hellish nightmare that would await us if we made the mistake of electing Clinton, compared to reading the headlines the last few weeks. Kind of makes one a bit sad.",
    "controversiality": 0,
    "ups": 1320,
    "downs": 0,
    "score": 1320,
    "created": 1487238163.0,
    "date_created": "2017-02-15",
    "time_created": "20:42:43",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsuomb",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "If you weren't convinced before, just watch his meeting with the Israel PM today... ",
    "controversiality": 0,
    "ups": 592,
    "downs": 0,
    "score": 592,
    "created": 1487237563.0,
    "date_created": "2017-02-15",
    "time_created": "20:32:43",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsvmz1",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "He's an embarrassment to this country.",
    "controversiality": 0,
    "ups": 723,
    "downs": 0,
    "score": 723,
    "created": 1487238842.0,
    "date_created": "2017-02-15",
    "time_created": "20:54:02",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt5tr4",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "Fuck yeah he's unfit to serve, and he isn't serving. He isn't serving anything or anybody. He thinks he is because he's too old and he's rattled with hair loss drugs and xanax.  When his impeachment is in full force he'll be on twitter complaining about the quality of the WH pumpkin pie and toilet paper.  He needs to die peacefully and away from it all; in prison, where he belongs.",
    "controversiality": 0,
    "ups": 37,
    "downs": 0,
    "score": 37,
    "created": 1487254113.0,
    "date_created": "2017-02-16",
    "time_created": "01:08:33",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsv0dv",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "I'm starting to believe this all ends with Trump in jail. ",
    "controversiality": 0,
    "ups": 928,
    "downs": 0,
    "score": 928,
    "created": 1487238004.0,
    "date_created": "2017-02-15",
    "time_created": "20:40:04",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsxp4j",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "Dear Lord, the Post isn't even remotely sugarcoating it or pulling punches any more. Holy fuck.",
    "controversiality": 0,
    "ups": 427,
    "downs": 0,
    "score": 427,
    "created": 1487241633.0,
    "date_created": "2017-02-15",
    "time_created": "21:40:33",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt5ivy",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "If on one hand you have: Trump watching TV an absolutely abnormal amount, not being in on intelligence briefings due to *trust problems with the president himself by his own government*, resigning of people immediately after he said implicitly that he had the utmost faith and trust in that individual, him being legitimately surprised that the courts could actually stop his desires........guys, that's something we all learned about in grade school; judicial branch and all that. \n\nand on the other you have: \"Make America Great Again\" as a slogan to a president who's apparently pretty miserable *being* the president, with a wife who's miserable being the first lady. \n\n*It would behoove many people to then question something very important; why would a president be miserable immediately after attaining the very job he tried so hard for?* \n\ncould it be that it isn't anything like he imagined it would be? \nFor fucks' sake, they *legit* thought it was ok to advertise and market family wares and businesses and Trump *literally* thought he could do whatever he wanted with executive actions. He has members of his cabinet and representatives of the administration quite simply telling people \"we are allowed to tell lies and have them be the truth because we said so\". in 2017....we have the internet and can literally check their garbage claims instantly? \n\nWhat is a reaaaaal good conclusion that you can come to terms with, when you have *all of those things existing at once; about the same person?*\n\nThey be unfit to be president son. Him not knowing how the judicial branch actually works is a giant red flag. How does a president not have complete working knowledge of how the mechanisms in place; *actually work to govern a people*?",
    "controversiality": 0,
    "ups": 60,
    "downs": 0,
    "score": 60,
    "created": 1487253517.0,
    "date_created": "2017-02-16",
    "time_created": "00:58:37",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2bi7",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "LOL, people on The_Cheeto are losing their minds and threatening civil war if Littlefinger is impeached for being an inept so-called President and/or a traitor. \"I will kill before I let Trump die in jail.\" You can't make this shit up. ",
    "controversiality": 0,
    "ups": 277,
    "downs": 0,
    "score": 277,
    "created": 1487248111.0,
    "date_created": "2017-02-15",
    "time_created": "23:28:31",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsui8k",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "His entire administration has been a shitshow utterly unbecoming of the Presidency.",
    "controversiality": 0,
    "ups": 576,
    "downs": 0,
    "score": 576,
    "created": 1487237323.0,
    "date_created": "2017-02-15",
    "time_created": "20:28:43",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt32zm",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "The Electoral College was supposed to be what prevented unfit candidates from entering office. We threw away democracy for a system that didn't even work!",
    "controversiality": 0,
    "ups": 175,
    "downs": 0,
    "score": 175,
    "created": 1487249295.0,
    "date_created": "2017-02-15",
    "time_created": "23:48:15",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtb5dq",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "For the sake of fate's irony, I just want to share Trump's tweet from 2014 \n\n> Are you allowed to impeach a president for gross incompetence?\n\nhttps://twitter.com/realdonaldtrump/status/474134260149157888",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1487268170.0,
    "date_created": "2017-02-16",
    "time_created": "05:02:50",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt0e2w",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "I admitted it awhile ago and I'll say it again. He conned us, guys. At least admit it.\n\n",
    "controversiality": 0,
    "ups": 364,
    "downs": 0,
    "score": 364,
    "created": 1487245269.0,
    "date_created": "2017-02-15",
    "time_created": "22:41:09",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2sew",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "And people keep yelling that Clinton is just as bad as Trump. I rather have four years of Clinton continuing Obama's legacy than a moron ruining it for everyone because he can't deal with SNL.",
    "controversiality": 0,
    "ups": 208,
    "downs": 0,
    "score": 208,
    "created": 1487248834.0,
    "date_created": "2017-02-15",
    "time_created": "23:40:34",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt35uk",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "I mean I don't know who the fuck thought having a 70 year old businessman in the WH w/ no experience whatsoever was a good idea... His inexperience combined with his temperament just seals the deal ",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1487249420.0,
    "date_created": "2017-02-15",
    "time_created": "23:50:20",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsyatm",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "Trump should have allowed tapes with racial slurs to be released to prevent his victory.  \n\nDo you think Hillary would have been able to have his people investigated like this?  His supporters would have called it banana republic dictatorship behavior.  \n\nHis win was the worst thing to happen to him and the family name.\n\n\n\n",
    "controversiality": 0,
    "ups": 122,
    "downs": 0,
    "score": 122,
    "created": 1487242420.0,
    "date_created": "2017-02-15",
    "time_created": "21:53:40",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt25u1",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "I am still in disbelief that this guy, no matter if he hacked or legitimately won, occupies one of the absolute most important and powerful jobs on the planet.  I can not wait to read about this in 25 years, if we make it that far.",
    "controversiality": 0,
    "ups": 55,
    "downs": 0,
    "score": 55,
    "created": 1487247869.0,
    "date_created": "2017-02-15",
    "time_created": "23:24:29",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddswvm4",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "lock him up...\"until we figure out what's going on\"...",
    "controversiality": 0,
    "ups": 150,
    "downs": 0,
    "score": 150,
    "created": 1487240522.0,
    "date_created": "2017-02-15",
    "time_created": "21:22:02",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt35ug",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "Yeah. A lot of us were trying to warn the entire country for a year. The dude is fucked up. He is actually a threat to America. Put another republican in, put 10 in, I don't give a shit. This isn't about loosing. This is about the fact that he is *actually* dangerous and NEEDS to be removed. \n\nGive me Pence (if he's not too tied up with all this crazy shut). Fuck, I'll happy sign up for Ted Cruz & ugh, he's the worrrst. Paul Ryan, blah, I wouldn't love that, but I'd be fine.  \n\nBut these people are actually mentally capable human beings. They understand what government is, for example. I had no idea that we decided to put the bar that low, but here we are. Even if I severely disagree with someone's ideologies (& the examples I used, especially with the first 2, MY GOD we don't agree on anything). But I wouldn't wake up every morning panicking. Some laws I wouldn't like would likely pass. But it would be okay. I wouldn't actually feel in danger. \n\nTrump honestly would consider nuking CA. I'm shocked he hasn't joked about it yet. He's fighting with all of our allies while being overwhelmingly disrespectful. He signs executive orders without fucking reading them. When he doesn't like an article about himself, he attacks the publication. He is a compulsive liar and a malignant narcissist. He is waging war against ALL media so now everyone is confused. He attacks random politicians, sometimes just for fun! He keeps calling Warren Pocahontas FFS. That's our PRESIDENT. \n\nThis has to end. And it had to end soon. \n\nThis is not red vs. blue. I never thought I'd be anything this bad. This has to be all of us for our country. And you guys won & you can keep the presidency & we won't fight that at all. But it's Trump. He's not right in the head and he's throwing dinner parties will have incredibly confidential phone calls in front of citizens while the guy that fucking carries around the nuclear codes takes pictures with fans. \n\nWTF YOU GUYS. Please. ",
    "controversiality": 0,
    "ups": 64,
    "downs": 0,
    "score": 64,
    "created": 1487249420.0,
    "date_created": "2017-02-15",
    "time_created": "23:50:20",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2lxv",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "We're at the point now where the outcome is known -- there's no way this man serves four years. What's left are the following questions:\n\n1. What side of history will congressional republicans end up on? Will they be patriots or opportunists?\n  \n2. What damage, economic and militarily, can our enemies inflict upon us in the interim?\n  \n3. What societal upheaval will occur in the middle of our country, against immigrants, minorities, and intellectuals, as a result of his presidency's downfall and death (not literal) throes? \n  \n4. Will this result in national unity or further division based upon resentment and identify politics? Will our nation be stinger as a result of this democratic stress test? \n  \n5. What controls and countermeasures will we install to prevent a demagogue, fascist, charlatan, or 'Manchurian' from ascending to the presidency?\n  \n6. What will the impacts be to the power of the executive? Will there be a pivot to a stronger parliamentarian legislature within or outside our current constitutional structure?\n  \n7. Will this get out of control? Will this get out of control and we'll all be lucky to live through it? /s\n  \n",
    "controversiality": 0,
    "ups": 125,
    "downs": 0,
    "score": 125,
    "created": 1487248559.0,
    "date_created": "2017-02-15",
    "time_created": "23:35:59",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsvtos",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "Foxacid is getting a lot better at article generation. The \"Sid the Science Kid\" one was a little rough around the edges, but this one is damn near human until the end.\n\nNo, liberals, Donald Trump IS fit to serve. ",
    "controversiality": 0,
    "ups": 332,
    "downs": 0,
    "score": 332,
    "created": 1487239100.0,
    "date_created": "2017-02-15",
    "time_created": "20:58:20",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2f9l",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "Admit defeat? In our moment of triumph? (/S)",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1487248277.0,
    "date_created": "2017-02-15",
    "time_created": "23:31:17",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt4y0a",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "Anyone who is only admitting it now, and couldn't figure it out years ago, is what Bannon calls a low-information-voter, at best.  If you voted for Trump, please ask yourself why.  And if you ever approach a voting booth in the future, before you close the curtain, ask yourself if you are truly qualified to pull the lever.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1487252436.0,
    "date_created": "2017-02-16",
    "time_created": "00:40:36",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt5k9r",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "Trump was never qualified for ANY elected office. Is this a surprise?",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1487253590.0,
    "date_created": "2017-02-16",
    "time_created": "00:59:50",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddstn7f",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "Not to mention his administration of fools",
    "controversiality": 0,
    "ups": 206,
    "downs": 0,
    "score": 206,
    "created": 1487236155.0,
    "date_created": "2017-02-15",
    "time_created": "20:09:15",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt69la",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "Some seriously fucking butthurt trump supporters here",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1487255017.0,
    "date_created": "2017-02-16",
    "time_created": "01:23:37",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt6doa",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "There's nothing to admit. It was well known and obvious that he was unfit to serve the moment he announced he was going to run for president, and yet people still voted for him!",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1487255257.0,
    "date_created": "2017-02-16",
    "time_created": "01:27:37",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt9d6u",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "So many people missing the point here. This isn't about 'leftists' or 'liberals'. It's gone way beyond that point. You don't have to occupy a particular part of the political spectrum to recognise that this guy is hopelessly out of his depth and completely unsuitable for the job. ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1487262684.0,
    "date_created": "2017-02-16",
    "time_created": "03:31:24",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddswcaf",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": ">Trump is unfit to serve\n\n...at McDonald's, let alone as President.",
    "controversiality": 0,
    "ups": 143,
    "downs": 0,
    "score": 143,
    "created": 1487239794.0,
    "date_created": "2017-02-15",
    "time_created": "21:09:54",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsxbwx",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "Admit it? ADMIT IT? I've known this since 1987!",
    "controversiality": 0,
    "ups": 72,
    "downs": 0,
    "score": 72,
    "created": 1487241137.0,
    "date_created": "2017-02-15",
    "time_created": "21:32:17",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt854s",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "There has never been a president so hated by the majority of the people he serves in such a short period of time after being sworn in. Congratulations. What an achievement. Time to start backing the other side trump supporters, we accept your apology... ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1487259373.0,
    "date_created": "2017-02-16",
    "time_created": "02:36:13",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt3ldj",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "Alright, so don't hate on me too much. I voted for Trump. I was ready for a change, sick of the PC, sick of just politics in general. But this has been a disaster. This man and his administration is an embarrassment to all of us. No matter what you believe in, you have to realize he is not a President, and he is not able to lead honestly. ",
    "controversiality": 0,
    "ups": 111,
    "downs": 0,
    "score": 111,
    "created": 1487250117.0,
    "date_created": "2017-02-16",
    "time_created": "00:01:57",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2i43",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "Water is wet. The sky is blue. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1487248399.0,
    "date_created": "2017-02-15",
    "time_created": "23:33:19",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt5s2j",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "His tweets regarding this topic are great. Seriously, check them out. Blame Hillary, blame Obama, blame the intelligence agencies, but whatever you do, never blame yourself.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1487254019.0,
    "date_created": "2017-02-16",
    "time_created": "01:06:59",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsy82k",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "Forget about the presidency, Trump is unfit to run a WoW guild.",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1487242321.0,
    "date_created": "2017-02-15",
    "time_created": "21:52:01",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt41ms",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "The problem with you \"Make America Great Again\" hypocrites is exactly that. You have no shame - you will make up or alter news stories while dismissing anything that is actual evidence against your ideas as \"Fake News.\" You dismiss any fact that would disprove your unsubstantiated opinions as wrong or fake.\n\nThere is a reason people with your political views are consistently uneducated, religious which is basically the same thing as being uneducated, and are incapable of addressing or considering facts. If you were not guilty of those things, your points of view couldn't exist. Its the Circle of Simple. \n\nYou are an embarrassment to this country - come back to reality and join us in our efforts to fix this awful mistake. We have a mentally ill, deficient president who the NSA won't even brief for fear of him tweeting classified information out. If you aren't smart enough to see how horrible a situation you have put us in, I have such pity for you. Ignorance is bliss, but I wouldn't take on your ignorance and be a Trumpian thoughtless redneck for all of the bliss in the world.\n\nLastly, Be better. Be Smarter. Understand better. Trump = Bad study hard, there is a 4 year long exam. ",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1487250862.0,
    "date_created": "2017-02-16",
    "time_created": "00:14:22",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsv44x",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 504,
    "downs": 0,
    "score": 504,
    "created": 1487238141.0,
    "date_created": "2017-02-15",
    "time_created": "20:42:21",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt5tt5",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "Admit it? I have been screaming it from the rooftops!",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1487254116.0,
    "date_created": "2017-02-16",
    "time_created": "01:08:36",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt9yth",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "Those innumerable people on Reddit who insisted that Trump was this really smart guy who was just *pretending* to be an ignorant incompetent bigoted unethical clown in order to win votes, after which he would turn out to be a liberal New Yorker: Where have they gone? It's *painfully* apparent that Trump is a moron and talks like a child because that's all he can do. Is an apology to the rest of the country too much to expect?",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1487264440.0,
    "date_created": "2017-02-16",
    "time_created": "04:00:40",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsxmck",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "I had a dream where obama held a press conference, and said \"Well donald you made me show my birth certificate, well i have your tax returns\"",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1487241531.0,
    "date_created": "2017-02-15",
    "time_created": "21:38:51",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsxxrc",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "Admit it: Hillary Clinton was a saint compared to this shit show.\n\nPS: Supreme Court",
    "controversiality": 0,
    "ups": 194,
    "downs": 0,
    "score": 194,
    "created": 1487241948.0,
    "date_created": "2017-02-15",
    "time_created": "21:45:48",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2s16",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "ok, I admit it. he's a total fuckin embarrassment. what a buffoon",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1487248819.0,
    "date_created": "2017-02-15",
    "time_created": "23:40:19",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt4src",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "Trump is unfit to serve me gatorade while I lay in bed hungover.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1487252167.0,
    "date_created": "2017-02-16",
    "time_created": "00:36:07",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtascg",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "Trumps exact words live on air.\n\n\"RUSSIA, IF YOU ARE LISTENING,  I HOPE YOU ARE ABLE TO FIND THE 30,000 CLINTON EMAILS THAT ARE MISSING\"\n\nYoutube clip of him saying it. https://youtu.be/gNa2B5zHfbQ?t=28 \n\n If this is what he said publicly what did the private comunications contain.  I think we will find out soon because US allies have been intercepting communications.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1487266996.0,
    "date_created": "2017-02-16",
    "time_created": "04:43:16",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtb0w3",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "Trump the only president that can make you miss W",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1487267766.0,
    "date_created": "2017-02-16",
    "time_created": "04:56:06",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt27e8",
    "parent_id": "t3_5ubnzs",
    "subreddit_name_prefixed": "r/politics",
    "body": "For all those saying \"Washington Post? Really?  FAKE NEWS!\"\n\nThe Washington Post happens to know a thing or two about investigative journalism and working with leaks from intelligence agencies...\n\nI'm not saying that combo has forced presidents to resign or anything, I'm just saying that combo has forced presidents to resign.",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1487247935.0,
    "date_created": "2017-02-15",
    "time_created": "23:25:35",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt84pq",
    "parent_id": "t1_ddt3cms",
    "subreddit_name_prefixed": "r/politics",
    "body": "Hopefully they'll be remembered more as the Congressional Republicans who killed the party.",
    "controversiality": 0,
    "ups": 633,
    "downs": 0,
    "score": 633,
    "created": 1487259344.0,
    "date_created": "2017-02-16",
    "time_created": "02:35:44",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtbwp3",
    "parent_id": "t1_ddt3cms",
    "subreddit_name_prefixed": "r/politics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 79,
    "downs": 0,
    "score": 79,
    "created": 1487270646.0,
    "date_created": "2017-02-16",
    "time_created": "05:44:06",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt9sq1",
    "parent_id": "t1_ddt3cms",
    "subreddit_name_prefixed": "r/politics",
    "body": "Not to mention those who actively block inquiries and side with President Trump.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1487263939.0,
    "date_created": "2017-02-16",
    "time_created": "03:52:19",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtbv2a",
    "parent_id": "t1_ddt3cms",
    "subreddit_name_prefixed": "r/politics",
    "body": "Not that unprecedented. Post-Reagan Republicans refuse to investigate their own. Oversight is for the other guy. \n\nNow, when Obama was in office...holy shit, there was a Congressional fishing expedition every week.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1487270497.0,
    "date_created": "2017-02-16",
    "time_created": "05:41:37",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddta1s9",
    "parent_id": "t1_ddt81h7",
    "subreddit_name_prefixed": "r/politics",
    "body": "I'm exhausted from reading this",
    "controversiality": 0,
    "ups": 595,
    "downs": 0,
    "score": 595,
    "created": 1487264688.0,
    "date_created": "2017-02-16",
    "time_created": "04:04:48",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt92dn",
    "parent_id": "t1_ddt81h7",
    "subreddit_name_prefixed": "r/politics",
    "body": "Well I'm not from the U.S but I find it amazing that many republicans, after all the shitstorm - still believe that this guy is worthy of being the leader. As Trump would say, \"Sad!\"",
    "controversiality": 0,
    "ups": 599,
    "downs": 0,
    "score": 599,
    "created": 1487261853.0,
    "date_created": "2017-02-16",
    "time_created": "03:17:33",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtamr9",
    "parent_id": "t1_ddt81h7",
    "subreddit_name_prefixed": "r/politics",
    "body": "As an Austrian, please add the following part to your list:\n- Nominated Patrick Park (is not confirmed yet) as US ambassador to Austria, because he loves \"The sound of music\" and has seen the movie more than 70 times.\n\nHe will be up for a rude awakening though, cause hardly anyone here in Austria have heard about this movie or have even seen it. (it´s funny how so many people from the US \"know\" Austria by this movie, but hardly any Austrian has even heard about or even this movie) But hey, it´s not like you need any diplomatic experience to become ambassador.",
    "controversiality": 0,
    "ups": 170,
    "downs": 0,
    "score": 170,
    "created": 1487266484.0,
    "date_created": "2017-02-16",
    "time_created": "04:34:44",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtats1",
    "parent_id": "t1_ddt81h7",
    "subreddit_name_prefixed": "r/politics",
    "body": "If you cite each of these entries, people here will spread it, myself included. Otherwise, the magas will just dismiss it.  \n\nI mean they're gonna dismiss it anyway, but we can at least point to proof, for what that's worth right now. ",
    "controversiality": 0,
    "ups": 205,
    "downs": 0,
    "score": 205,
    "created": 1487267125.0,
    "date_created": "2017-02-16",
    "time_created": "04:45:25",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt9fge",
    "parent_id": "t1_ddt81h7",
    "subreddit_name_prefixed": "r/politics",
    "body": "I'm showing this to every one that still supports Trump\n\nHoly shit",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1487262864.0,
    "date_created": "2017-02-16",
    "time_created": "03:34:24",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtaabe",
    "parent_id": "t1_ddt81h7",
    "subreddit_name_prefixed": "r/politics",
    "body": "you did not even mention he held a speech on the holocaust without mentioning jews.\n\nMy personal favorite is talking about how he was being treated unfair and how much god liked the biggest inauguration event ever in front of the CIAs Memorial wall.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1487265411.0,
    "date_created": "2017-02-16",
    "time_created": "04:16:51",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtaqwk",
    "parent_id": "t1_ddt81h7",
    "subreddit_name_prefixed": "r/politics",
    "body": "\"Just give him a chance\" they say. He had his chance, he blew it already... ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1487266861.0,
    "date_created": "2017-02-16",
    "time_created": "04:41:01",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtbo3x",
    "parent_id": "t1_ddt81h7",
    "subreddit_name_prefixed": "r/politics",
    "body": "Sorry in advance. But somebody needs to take this list, put it in a sticky someplace, and add to it. It will be a mile long within a year.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1487269862.0,
    "date_created": "2017-02-16",
    "time_created": "05:31:02",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtbetu",
    "parent_id": "t1_ddt81h7",
    "subreddit_name_prefixed": "r/politics",
    "body": "Source this list with links and it will spread around reddit quicker than you can imagine. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1487269020.0,
    "date_created": "2017-02-16",
    "time_created": "05:17:00",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtbypf",
    "parent_id": "t1_ddt81h7",
    "subreddit_name_prefixed": "r/politics",
    "body": "As amazing and horrifying as this list is, there are things missing from it, including (but not limited to): the call to Taiwan, the Holocaust speech that deliberately didn't mention the Jews, conducting sensitive state business with the Japanese Prime Minister at a public dining location at his Florida estate, bringing his own paid cheering section wherever he goes, speechifying about the magnitude of his own personal greatness in front of the CIA wall, the famous Bowling Green massacre, and Twitter tantrums about SNL.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1487270828.0,
    "date_created": "2017-02-16",
    "time_created": "05:47:08",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt6fgq",
    "parent_id": "t1_ddt43oi",
    "subreddit_name_prefixed": "r/politics",
    "body": "I'm surprised this went under the rug so quickly. The man literally OK'd a mission primarily on the idea that his predecessor wouldn't do it.\n\nIn what way is that logic admissible at a fucking middle school? Let alone president of the fucking USA",
    "controversiality": 0,
    "ups": 2007,
    "downs": 0,
    "score": 2007,
    "created": 1487255364.0,
    "date_created": "2017-02-16",
    "time_created": "01:29:24",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt77ai",
    "parent_id": "t1_ddt43oi",
    "subreddit_name_prefixed": "r/politics",
    "body": "As a Yemeni, these actions are we what we fear the most. This is what ISIS manifests propaganda from and brainwash our young into terrorists. It will take over 100 years for Yemen to ever be what it was when the Brits colonized it.\n\nPlease Mr.Trump stop giving ISIS leverage.\n\n> 23 civilians were killed, including women and children.\n\nThat is atleast 1 father or 1 son or 1 brother for each of these victims that now has a reason to be pushed to his limit and get recruited.\n\nUSA, get your shit together. You'll end up like us before you know it. Do not take this lightly. Fight. Do it smartly. Succeed.",
    "controversiality": 0,
    "ups": 1788,
    "downs": 0,
    "score": 1788,
    "created": 1487257084.0,
    "date_created": "2017-02-16",
    "time_created": "01:58:04",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt7kkz",
    "parent_id": "t1_ddt43oi",
    "subreddit_name_prefixed": "r/politics",
    "body": "This is a photo of the eight year old American girl Trump had killed in Yemen:\n\nhttp://media1.s-nbcnews.com/j/newscms/2017_05/1885196/170130-nora-anwar-al-awlaki-rhk-1815p_2fad892cf7e12631663586f25fe8602d.nbcnews-ux-2880-1000.jpg",
    "controversiality": 0,
    "ups": 206,
    "downs": 0,
    "score": 206,
    "created": 1487257962.0,
    "date_created": "2017-02-16",
    "time_created": "02:12:42",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt7rwb",
    "parent_id": "t1_ddt43oi",
    "subreddit_name_prefixed": "r/politics",
    "body": "Here is a source : https://www.nytimes.com/2017/02/01/world/middleeast/donald-trump-yemen-commando-raid-questions.html",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1487258450.0,
    "date_created": "2017-02-16",
    "time_created": "02:20:50",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt5wwc",
    "parent_id": "t1_ddt43oi",
    "subreddit_name_prefixed": "r/politics",
    "body": "It's like he watched that scene with Denethor in return of the king and was like yeah I'm gonna cosplay that",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1487254292.0,
    "date_created": "2017-02-16",
    "time_created": "01:11:32",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt62y6",
    "parent_id": "t1_ddt43oi",
    "subreddit_name_prefixed": "r/politics",
    "body": "Did you have to research extensively to find all the details or is there one/multiple sources where it is summarized in a similar manner? I find a lot of news outlets weren't explicit in their coverage.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1487254635.0,
    "date_created": "2017-02-16",
    "time_created": "01:17:15",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt7v49",
    "parent_id": "t1_ddt43oi",
    "subreddit_name_prefixed": "r/politics",
    "body": ">If you talk shit about the raid you basically are spitting on the grave of the Navy Seal who died\n- Sean Spicer\n\n*not an exact quote",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1487258673.0,
    "date_created": "2017-02-16",
    "time_created": "02:24:33",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt8hyn",
    "parent_id": "t1_ddt43oi",
    "subreddit_name_prefixed": "r/politics",
    "body": "Anyone with a brain should have realized he was unfit to serve prior to the election. So people who voted for him must fit into two categories - idiots, and those who knew he would fuck everything up but thought it would be amusing to watch.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1487260296.0,
    "date_created": "2017-02-16",
    "time_created": "02:51:36",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsxnpo",
    "parent_id": "t1_ddsurtl",
    "subreddit_name_prefixed": "r/politics",
    "body": "The beatings will continue until morale improves.",
    "controversiality": 0,
    "ups": 2181,
    "downs": 0,
    "score": 2181,
    "created": 1487241580.0,
    "date_created": "2017-02-15",
    "time_created": "21:39:40",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt3hs6",
    "parent_id": "t1_ddsurtl",
    "subreddit_name_prefixed": "r/politics",
    "body": "> who thinks that demoralizing the staff will make them work harder.\n\nHe figures that because it works in his personal and familial relationships that it will work in government.",
    "controversiality": 0,
    "ups": 129,
    "downs": 0,
    "score": 129,
    "created": 1487249955.0,
    "date_created": "2017-02-15",
    "time_created": "23:59:15",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt675s",
    "parent_id": "t1_ddsurtl",
    "subreddit_name_prefixed": "r/politics",
    "body": "That one 'remove two regulations for every new one!' idea has always reeked of shitty middle management to me.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1487254879.0,
    "date_created": "2017-02-16",
    "time_created": "01:21:19",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt99p8",
    "parent_id": "t1_ddt46k1",
    "subreddit_name_prefixed": "r/politics",
    "body": "Dat moment when you realize he was applauding these \"illegal\" leaks when it was about Clinton and even requesting Russia to do it.",
    "controversiality": 0,
    "ups": 103,
    "downs": 0,
    "score": 103,
    "created": 1487262417.0,
    "date_created": "2017-02-16",
    "time_created": "03:26:57",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddszcrb",
    "parent_id": "t1_ddsxlhl",
    "subreddit_name_prefixed": "r/politics",
    "body": "Keep in mind there is a *ton* of overlap between those people and the ones who believe there is this massive, global cartel of climate researchers conspiring against governments and citizens worldwide to funnel more money into their grants...but the 1-2% of scientists who dissent (who receive tons of money from the of-course-purely-objective petroleum industry) are the sole voices of truth out there.",
    "controversiality": 0,
    "ups": 545,
    "downs": 0,
    "score": 545,
    "created": 1487243829.0,
    "date_created": "2017-02-15",
    "time_created": "22:17:09",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt4k27",
    "parent_id": "t1_ddsxlhl",
    "subreddit_name_prefixed": "r/politics",
    "body": "The measures people are going to in order to defend Trump is beyond comprehension. \n\nI saw a comment on Facebook today that said \"Russian was a long time ally of the US until Obama came into office.\"",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1487251740.0,
    "date_created": "2017-02-16",
    "time_created": "00:29:00",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt6d01",
    "parent_id": "t1_ddsxlhl",
    "subreddit_name_prefixed": "r/politics",
    "body": "Top of r/t_d *Flynn resignation is 4D chess move by God-Emperor to reveal deep state*. \nFuckin lol. ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1487255217.0,
    "date_created": "2017-02-16",
    "time_created": "01:26:57",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt50eo",
    "parent_id": "t1_ddsxlhl",
    "subreddit_name_prefixed": "r/politics",
    "body": "This is a remark I saw on a facebook page today:\n\n>What is going on (after the people chose Trump) is a horrible situation for our country. Good heavens he's only been in office a month. These protestors funded by Soros, who I might add was thrown out of several European countries, is funding all of these protests. He, funded Obamas presidential campaign along with other communist leaders in Chicago. So, I wonder how anyone could support Obama with his horrific background supported by this evil man that turned on his own Jewish people. However, I wasn't protesting with a pussy hat on surrounded by a vagina! This really upsets me in all my 83 years I've never seen anything like it. I don't know how long he can fight the press, judges, teachers union and gays. They are the ones making the loudest noise and funded by Soros!\n\nSo basically the entire world has been paid off by Soros except for the 30% that support Trump, they are the only ones that know the truth. They truly believe the entire world is against Trump, because they are either bought off or are idiots.",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1487252555.0,
    "date_created": "2017-02-16",
    "time_created": "00:42:35",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt7eai",
    "parent_id": "t1_ddsxlhl",
    "subreddit_name_prefixed": "r/politics",
    "body": "These people get their news from Alex \"buy my water filters before the impending collapse of society\" Jones. When you're more concerned about the level of canned goods in your fallout shelter than you are your children's education/future then you've gone past the tipping point of being able to be reasoned with. ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1487257536.0,
    "date_created": "2017-02-16",
    "time_created": "02:05:36",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsuj5r",
    "parent_id": "t1_ddstl5z",
    "subreddit_name_prefixed": "r/politics",
    "body": "A stress test for our democracy? \n\nNot something i thought was needed. But it has brought a revitalisation to political activism. Thats nice",
    "controversiality": 0,
    "ups": 3945,
    "downs": 0,
    "score": 3945,
    "created": 1487237358.0,
    "date_created": "2017-02-15",
    "time_created": "20:29:18",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsuodn",
    "parent_id": "t1_ddstl5z",
    "subreddit_name_prefixed": "r/politics",
    "body": "And despite what some people will tell you, it's organic. The people, instead of going home to nurse their election fatigue, immediately took to the streets and made a stand. I love the energy I'm seeing right now and hope it will continue. ",
    "controversiality": 0,
    "ups": 480,
    "downs": 0,
    "score": 480,
    "created": 1487237553.0,
    "date_created": "2017-02-15",
    "time_created": "20:32:33",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt0jh3",
    "parent_id": "t1_ddstl5z",
    "subreddit_name_prefixed": "r/politics",
    "body": "There's nothing begrudging about this admission. \n\nTrump is an authoritarian demagogue. That alone makes him unfit.\n\nBy \"demagogue\" I mean that [he's attained power primarily by stoking the desires, prejudices and fears of a narrow, electorally-potent minority](https://www.reddit.com/r/politics/comments/5jl3nm/z/dbh1h0y) through the use of fabrications, emotionally-potent oversimplifications, scapegoating, and false promises, rather than through rational evidence-based argument. If the current allegations of collusion with the Kremlin play out, sprinkle some outright fraud on top.\n\nTrump personifies arrogant, self-righteous ineptitude. He rejects reason, deliberation, knowledge, expertise, and institutions in favor of his whims. He doesn't know what he doesn't know. The world is far more complex than he can effectively manage. Yet he's utterly convinced that he knows better and that he alone can fix it.         ",
    "controversiality": 0,
    "ups": 310,
    "downs": 0,
    "score": 310,
    "created": 1487245488.0,
    "date_created": "2017-02-15",
    "time_created": "22:44:48",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt35y7",
    "parent_id": "t1_ddstl5z",
    "subreddit_name_prefixed": "r/politics",
    "body": "For everyone who found November 9th to be a pretty dark day, you should take a quick peak at the Russian opposition parties' chances for the foreseeable future, or perhaps how lucky the Gambia just got to get out of their 22 years of executive issues. \n\nThen say a quick thanks to the founding fathers (and by extension a couple of awful English monarchs) for establishing a dissolution of unified power, seperate but equal branches of government, term limits, appeals, and every little check and balance that keeps any POTUS or other representative of this government from turning it into their own cult of personality.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1487249424.0,
    "date_created": "2017-02-15",
    "time_created": "23:50:24",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt8unj",
    "parent_id": "t1_ddt5t19",
    "subreddit_name_prefixed": "r/politics",
    "body": "Hmm, you wrote 'confused' but I am pretty sure you meant to write 'inconsolably angry and driven to extremism and acts of domestic terrorism and hate crimes'.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1487261249.0,
    "date_created": "2017-02-16",
    "time_created": "03:07:29",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtbqhn",
    "parent_id": "t1_ddt5t19",
    "subreddit_name_prefixed": "r/politics",
    "body": "Or they followed what was going on by watching Fox News and reading Breitbart.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1487270081.0,
    "date_created": "2017-02-16",
    "time_created": "05:34:41",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsyja4",
    "parent_id": "t1_ddsu07l",
    "subreddit_name_prefixed": "r/politics",
    "body": "When trump won & promptly assembled the most retrograde, unfit, inexperienced cabinet in the history of history... we should have known ",
    "controversiality": 0,
    "ups": 1283,
    "downs": 0,
    "score": 1283,
    "created": 1487242722.0,
    "date_created": "2017-02-15",
    "time_created": "21:58:42",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddszdpi",
    "parent_id": "t1_ddsu07l",
    "subreddit_name_prefixed": "r/politics",
    "body": "Pence is definitely the lesser evil.  He's fucking horrible, definitely, but he's better than Trump.",
    "controversiality": 0,
    "ups": 452,
    "downs": 0,
    "score": 452,
    "created": 1487243863.0,
    "date_created": "2017-02-15",
    "time_created": "22:17:43",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsyfxn",
    "parent_id": "t1_ddsu07l",
    "subreddit_name_prefixed": "r/politics",
    "body": "Well, I'm not *there* yet...",
    "controversiality": 0,
    "ups": 114,
    "downs": 0,
    "score": 114,
    "created": 1487242602.0,
    "date_created": "2017-02-15",
    "time_created": "21:56:42",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt1tdr",
    "parent_id": "t1_ddsv4py",
    "subreddit_name_prefixed": "r/politics",
    "body": "It's almost like they just projected all the ills of Trump and his cronies onto Clinton in an effort to distract from their misdeeds.",
    "controversiality": 0,
    "ups": 107,
    "downs": 0,
    "score": 107,
    "created": 1487247348.0,
    "date_created": "2017-02-15",
    "time_created": "23:15:48",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt28wf",
    "parent_id": "t1_ddsv4py",
    "subreddit_name_prefixed": "r/politics",
    "body": "Edward Klein is a junk author. He's written so many books on the Kennedys that just invent stories out of whole cloth. ",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1487247999.0,
    "date_created": "2017-02-15",
    "time_created": "23:26:39",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt0dmu",
    "parent_id": "t1_ddsuomb",
    "subreddit_name_prefixed": "r/politics",
    "body": "'I'd be happy with whatever solution that both sides are happy with'.\n\nNetanyahu: *irrepressible laughter* Wow, he really is actually this dumb.",
    "controversiality": 0,
    "ups": 583,
    "downs": 0,
    "score": 583,
    "created": 1487245251.0,
    "date_created": "2017-02-15",
    "time_created": "22:40:51",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsz4qd",
    "parent_id": "t1_ddsuomb",
    "subreddit_name_prefixed": "r/politics",
    "body": "Still taking about the fucking elections and he's holding a \"rally\" in Florida this weekend to feel better about himself. Fucking pathetic. ",
    "controversiality": 0,
    "ups": 342,
    "downs": 0,
    "score": 342,
    "created": 1487243522.0,
    "date_created": "2017-02-15",
    "time_created": "22:12:02",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsvo4i",
    "parent_id": "t1_ddsuomb",
    "subreddit_name_prefixed": "r/politics",
    "body": "\"Dur, dur, I'm for a one-state solution or a two-state solution, whatever they like best!\"\n\nWhat a fucking idiot. He has no idea what he's talking about.",
    "controversiality": 0,
    "ups": 724,
    "downs": 0,
    "score": 724,
    "created": 1487238885.0,
    "date_created": "2017-02-15",
    "time_created": "20:54:45",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsw3sm",
    "parent_id": "t1_ddsuomb",
    "subreddit_name_prefixed": "r/politics",
    "body": "I haven't seen yet, but I wouldn't watch it because Bibi is pretty much a master when comes to negotiation, power play and all things politics.  \n\nSeeing them together will be like seeing a snake circling an attention-loving puppy in the ring. ",
    "controversiality": 0,
    "ups": 116,
    "downs": 0,
    "score": 116,
    "created": 1487239475.0,
    "date_created": "2017-02-15",
    "time_created": "21:04:35",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddszahr",
    "parent_id": "t1_ddsuomb",
    "subreddit_name_prefixed": "r/politics",
    "body": "If you weren't convinced before I hope you have awaken out of your yearlong coma ",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1487243741.0,
    "date_created": "2017-02-15",
    "time_created": "22:15:41",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsyd01",
    "parent_id": "t1_ddsuomb",
    "subreddit_name_prefixed": "r/politics",
    "body": "The world is laughing. ",
    "controversiality": 0,
    "ups": 63,
    "downs": 0,
    "score": 63,
    "created": 1487242498.0,
    "date_created": "2017-02-15",
    "time_created": "21:54:58",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsuxdy",
    "parent_id": "t1_ddsuomb",
    "subreddit_name_prefixed": "r/politics",
    "body": "Bibi made Trump look like a kindergartner. Totally out of his league. ",
    "controversiality": 0,
    "ups": 88,
    "downs": 0,
    "score": 88,
    "created": 1487237893.0,
    "date_created": "2017-02-15",
    "time_created": "20:38:13",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt46bs",
    "parent_id": "t1_ddsuomb",
    "subreddit_name_prefixed": "r/politics",
    "body": "Mother fucker has refused to say antisemitism twice now.\n\nDidn't mention it on Holocaust Remembrance Day, did mention it when ask SPECIFICALLY about antisemitism by an Israeli journalist.\n\nAs a non-Jew, it infuriates me knowing a Jewish person who told me \"I find it weird you are more offended about this than I am\" when I know with 100% certainty, if Obama had chosen to not mention it, he'd lose his shit.",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1487251079.0,
    "date_created": "2017-02-16",
    "time_created": "00:17:59",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt4x1w",
    "parent_id": "t1_ddsuomb",
    "subreddit_name_prefixed": "r/politics",
    "body": "My favourite interaction of that night:\n\nTrump: And both side need to come to a compromise, you know that right?\n\nBibi: We'll talk...\n\nTrump: And we'd like a halt of the settlements for right now?\n\nBibi: .......\n\nFucking great negotiation skills Trump. I'm actually happy he brought up the settlements but man was it embarrassingly bad.\n",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1487252386.0,
    "date_created": "2017-02-16",
    "time_created": "00:39:46",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddswfqd",
    "parent_id": "t1_ddsvmz1",
    "subreddit_name_prefixed": "r/politics",
    "body": "The planet.",
    "controversiality": 0,
    "ups": 343,
    "downs": 0,
    "score": 343,
    "created": 1487239927.0,
    "date_created": "2017-02-15",
    "time_created": "21:12:07",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsvpmh",
    "parent_id": "t1_ddsv0dv",
    "subreddit_name_prefixed": "r/politics",
    "body": "I want to be there to jeer when he gets his perp walk.",
    "controversiality": 0,
    "ups": 453,
    "downs": 0,
    "score": 453,
    "created": 1487238943.0,
    "date_created": "2017-02-15",
    "time_created": "20:55:43",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsz42w",
    "parent_id": "t1_ddsv0dv",
    "subreddit_name_prefixed": "r/politics",
    "body": "I'm starting to believe this ends with Trump fleeing the country with the nuclear football... ",
    "controversiality": 0,
    "ups": 112,
    "downs": 0,
    "score": 112,
    "created": 1487243498.0,
    "date_created": "2017-02-15",
    "time_created": "22:11:38",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsyuu2",
    "parent_id": "t1_ddsxp4j",
    "subreddit_name_prefixed": "r/politics",
    "body": "Why should they or any other news source that isn't in trumps happy corner? Trump has treated them like shit, tried to turn the population against them, one of his chief staffers has called them fake news and the opposition party, and they refuse to answer any of their questions. So yeah, they aren't taking shit. They have to be blunt now",
    "controversiality": 0,
    "ups": 284,
    "downs": 0,
    "score": 284,
    "created": 1487243149.0,
    "date_created": "2017-02-15",
    "time_created": "22:05:49",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt21xo",
    "parent_id": "t1_ddsxp4j",
    "subreddit_name_prefixed": "r/politics",
    "body": "Esquire put an asterisk next to the word \"President\" recently. Everyone is starting to feel like the White House is now occupied illegally.  It is wonderful.  And sad.",
    "controversiality": 0,
    "ups": 96,
    "downs": 0,
    "score": 96,
    "created": 1487247705.0,
    "date_created": "2017-02-15",
    "time_created": "23:21:45",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt21i0",
    "parent_id": "t1_ddsxp4j",
    "subreddit_name_prefixed": "r/politics",
    "body": "It's an opinion piece. It's separate from the Post's news-gathering arm.",
    "controversiality": 0,
    "ups": 135,
    "downs": 0,
    "score": 135,
    "created": 1487247687.0,
    "date_created": "2017-02-15",
    "time_created": "23:21:27",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2crr",
    "parent_id": "t1_ddsxp4j",
    "subreddit_name_prefixed": "r/politics",
    "body": "It is an opinion piece. The same author wrote [\"What’s the method in Trump’s madness?\"](https://www.washingtonpost.com/opinions/whats-the-method-in-trumps-madness/2017/01/25/3fafae32-e33c-11e6-ba11-63c4b4fb5a63_story.html) a few weeks ago, which is perhaps softer than this one, but the point is that it is an opinion piece and that's how they're written.",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1487248167.0,
    "date_created": "2017-02-15",
    "time_created": "23:29:27",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2pk5",
    "parent_id": "t1_ddsxp4j",
    "subreddit_name_prefixed": "r/politics",
    "body": "keep in mind that this is an opinion piece and therefore is not subject to the same journalistic integrity as their factual articles.",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1487248712.0,
    "date_created": "2017-02-15",
    "time_created": "23:38:32",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt1iup",
    "parent_id": "t1_ddsxp4j",
    "subreddit_name_prefixed": "r/politics",
    "body": "I think it's time we stop with the whole political correctness and say things as they really are.",
    "controversiality": 0,
    "ups": 58,
    "downs": 0,
    "score": 58,
    "created": 1487246914.0,
    "date_created": "2017-02-15",
    "time_created": "23:08:34",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2yu1",
    "parent_id": "t1_ddsxp4j",
    "subreddit_name_prefixed": "r/politics",
    "body": "Half of the major newspapers' editorial boards categorically denounced Trump before the election took place. But voters didn't take any advice from the \"smarty pants over educated elitist\" voices of any American journalists on either side of the political divide. Trump voters actively chose this sad state of affairs and they should suffer for it. But they won't. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1487249115.0,
    "date_created": "2017-02-15",
    "time_created": "23:45:15",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt3eun",
    "parent_id": "t1_ddsxp4j",
    "subreddit_name_prefixed": "r/politics",
    "body": "This is in their opinion column.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1487249826.0,
    "date_created": "2017-02-15",
    "time_created": "23:57:06",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt3kd6",
    "parent_id": "t1_ddt2bi7",
    "subreddit_name_prefixed": "r/politics",
    "body": "They're going to rise up out of their parent's basements and march on Washington. ",
    "controversiality": 0,
    "ups": 83,
    "downs": 0,
    "score": 83,
    "created": 1487250070.0,
    "date_created": "2017-02-16",
    "time_created": "00:01:10",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt3cju",
    "parent_id": "t1_ddt2bi7",
    "subreddit_name_prefixed": "r/politics",
    "body": "Weird. Because according to them only the left is extremely violent. Surely they can't be wrong. ",
    "controversiality": 0,
    "ups": 200,
    "downs": 0,
    "score": 200,
    "created": 1487249721.0,
    "date_created": "2017-02-15",
    "time_created": "23:55:21",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt6niy",
    "parent_id": "t1_ddt2bi7",
    "subreddit_name_prefixed": "r/politics",
    "body": "> \"I will kill before I let Trump die in jail.\" \n\nReminds me of Ted Nugent.\n\n> If Barack Obama becomes the president in November, again, I will be either be dead or in jail by this time next year.\n\nI expect that lot will follow through about as much as he did.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1487255842.0,
    "date_created": "2017-02-16",
    "time_created": "01:37:22",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt4jez",
    "parent_id": "t1_ddt2bi7",
    "subreddit_name_prefixed": "r/politics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1487251709.0,
    "date_created": "2017-02-16",
    "time_created": "00:28:29",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt387x",
    "parent_id": "t1_ddt2bi7",
    "subreddit_name_prefixed": "r/politics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 57,
    "downs": 0,
    "score": 57,
    "created": 1487249527.0,
    "date_created": "2017-02-15",
    "time_created": "23:52:07",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt41h6",
    "parent_id": "t1_ddt2bi7",
    "subreddit_name_prefixed": "r/politics",
    "body": "It's  matter of time before they are shut down for inciting violence.  They are a reflection of Trump,  as he gets more agitated so do they",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1487250855.0,
    "date_created": "2017-02-16",
    "time_created": "00:14:15",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt5mdh",
    "parent_id": "t1_ddt2bi7",
    "subreddit_name_prefixed": "r/politics",
    "body": "But Littlefinger is competent.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1487253707.0,
    "date_created": "2017-02-16",
    "time_created": "01:01:47",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddswn87",
    "parent_id": "t1_ddsui8k",
    "subreddit_name_prefixed": "r/politics",
    "body": "I've tried not watching the news as much, but recently I've been falling back into it as the schadenfreude from watching the beginnings of the Trump administration's drain-circling has been enticing to say the least.",
    "controversiality": 0,
    "ups": 141,
    "downs": 0,
    "score": 141,
    "created": 1487240210.0,
    "date_created": "2017-02-15",
    "time_created": "21:16:50",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt6hak",
    "parent_id": "t1_ddt32zm",
    "subreddit_name_prefixed": "r/politics",
    "body": "The electoral college would have worked fine with two changes: Each state by law must award electoral votes proportional to electoral turnout in the state. The electors are allowed to use Ranked Choice Voting or equivalent. \n\nSo while Trump and Clinton would both get 262 votes each, the second choices of Johnson and Klein electors would choose the winner who likely would select Clinton (not for sure, but likely). Yeah, popular vote would feel better, but with EC proportional every voter in every state has a reason to vote because it puts contested EC votes in play which can turn elections in close races.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1487255473.0,
    "date_created": "2017-02-16",
    "time_created": "01:31:13",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt819a",
    "parent_id": "t1_ddt32zm",
    "subreddit_name_prefixed": "r/politics",
    "body": "http://imgur.com/a/AAbMo\n\nH. L. Mencken's last line of a column that appeared July 26, 1920, in the Baltimore Evening Sun.\n\n[Source](http://www.baltimoresun.com/news/opinion/oped/bs-ed-mencken-trump-20161119-story.html).",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1487259095.0,
    "date_created": "2017-02-16",
    "time_created": "02:31:35",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt605l",
    "parent_id": "t1_ddt32zm",
    "subreddit_name_prefixed": "r/politics",
    "body": "They were supposed to bring balance to democracy, not leave it in darkness!",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1487254477.0,
    "date_created": "2017-02-16",
    "time_created": "01:14:37",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt0m02",
    "parent_id": "t1_ddt0e2w",
    "subreddit_name_prefixed": "r/politics",
    "body": "Wait are you a real T_D that is admitting he conned his supporters? Holy shit. Respect if so. If not, carry on being delusional. ",
    "controversiality": 0,
    "ups": 183,
    "downs": 0,
    "score": 183,
    "created": 1487245592.0,
    "date_created": "2017-02-15",
    "time_created": "22:46:32",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2r3c",
    "parent_id": "t1_ddt0e2w",
    "subreddit_name_prefixed": "r/politics",
    "body": "i'm not really sure how it was a con.\n\nhe's doing pretty much exactly what he promised to, he's just doing it as incompetently as many of us expected him to.",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1487248778.0,
    "date_created": "2017-02-15",
    "time_created": "23:39:38",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt395k",
    "parent_id": "t1_ddt0e2w",
    "subreddit_name_prefixed": "r/politics",
    "body": "Doesn't matter now. You chose this against the best advice and intel openly available to you before the election. Anyone with common sense and good instincts could have seen he was utterly incapable of handling the responsibilities of the presidency.Trump voters made America an international laughing stock. It's unforgivable because it could have been so easily avoided by not voting for Trump. I forgive none of his voters. They are a disgrace to our nation. ",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1487249569.0,
    "date_created": "2017-02-15",
    "time_created": "23:52:49",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt3wv5",
    "parent_id": "t1_ddsyatm",
    "subreddit_name_prefixed": "r/politics",
    "body": "Donald's dream scenario was to lose in a close loss that's narrow enough for him to claim voter fraud, and retain a loyal following.  He'd go on FOX whenever he wanted to complain about Clinton while talking about how he could have done it so much better and maintaining his what-could-have-been dream scenario purely as a hypothetical.  Now he's actually expected to deliver on it.",
    "controversiality": 0,
    "ups": 128,
    "downs": 0,
    "score": 128,
    "created": 1487250644.0,
    "date_created": "2017-02-16",
    "time_created": "00:10:44",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt5gg5",
    "parent_id": "t1_ddt2lxv",
    "subreddit_name_prefixed": "r/politics",
    "body": "Constitutional amendment requiring release of tax returns for presidential candidates.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1487253384.0,
    "date_created": "2017-02-16",
    "time_created": "00:56:24",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt6o2b",
    "parent_id": "t1_ddt2lxv",
    "subreddit_name_prefixed": "r/politics",
    "body": "you forgot to address the only issue that matters. How can we get the right and left social/communication bubbles to pop. The two sides don't get their news from the same sources. Until that is fixed NO healing will happen.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1487255875.0,
    "date_created": "2017-02-16",
    "time_created": "01:37:55",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddswj1i",
    "parent_id": "t1_ddsvtos",
    "subreddit_name_prefixed": "r/politics",
    "body": "And the first time I ever believed there is good cause for an intelligence test to gain voting rights :(\n\nStupid stupid people are stupid :(",
    "controversiality": 0,
    "ups": 114,
    "downs": 0,
    "score": 114,
    "created": 1487240053.0,
    "date_created": "2017-02-15",
    "time_created": "21:14:13",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2k1q",
    "parent_id": "t1_ddstn7f",
    "subreddit_name_prefixed": "r/politics",
    "body": "Not to mention his blatant violations of Article I, Section 9, Clause 8 of the US Constitution.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1487248481.0,
    "date_created": "2017-02-15",
    "time_created": "23:34:41",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt0mil",
    "parent_id": "t1_ddswcaf",
    "subreddit_name_prefixed": "r/politics",
    "body": "I wouldn't let this guy serve me fries. ",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1487245613.0,
    "date_created": "2017-02-15",
    "time_created": "22:46:53",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt5c0j",
    "parent_id": "t1_ddsxbwx",
    "subreddit_name_prefixed": "r/politics",
    "body": "Back to the Future 2 was extremely straightforward about how this entire situation would pan out.\n\nAnd yet here we are. Biff is president and I've still got no fucking hoverboard.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1487253152.0,
    "date_created": "2017-02-16",
    "time_created": "00:52:32",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt7x9x",
    "parent_id": "t1_ddt3ldj",
    "subreddit_name_prefixed": "r/politics",
    "body": "Respect man. It takes some real nuts to admit you fucked up.",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1487258820.0,
    "date_created": "2017-02-16",
    "time_created": "02:27:00",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt7lg6",
    "parent_id": "t1_ddt3ldj",
    "subreddit_name_prefixed": "r/politics",
    "body": "It is refreshing to read your thoughts after reading so many diehard supporters who can't even reassess. Thank you. ",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1487258022.0,
    "date_created": "2017-02-16",
    "time_created": "02:13:42",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt3rph",
    "parent_id": "t1_ddt3ldj",
    "subreddit_name_prefixed": "r/politics",
    "body": "Did you honestly not see this prior to the election?  When a dozen women accused him of sexual assault?  When he mocked a disabled reporter?  When he shit on POWs or the family of a decorated war hero?",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1487250407.0,
    "date_created": "2017-02-16",
    "time_created": "00:06:47",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsxflp",
    "parent_id": "t1_ddsv44x",
    "subreddit_name_prefixed": "r/politics",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 159,
    "downs": 0,
    "score": 159,
    "created": 1487241274.0,
    "date_created": "2017-02-15",
    "time_created": "21:34:34",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddszweo",
    "parent_id": "t1_ddsxxrc",
    "subreddit_name_prefixed": "r/politics",
    "body": "I know conservatives who voted for trump because they wanted to hold the Supreme Court. They literally do not give a fuck about human rights, so long as a zygote can develop. ",
    "controversiality": 0,
    "ups": 135,
    "downs": 0,
    "score": 135,
    "created": 1487244586.0,
    "date_created": "2017-02-15",
    "time_created": "22:29:46",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt96os",
    "parent_id": "t1_ddt84pq",
    "subreddit_name_prefixed": "r/politics",
    "body": "This may seem like a good thing but I think there shouldn't be an unchecked majority in Congress, be it Republican or Democrat. On the other hand, dems right now seem less prone to the \"party before country\" kind of mindset.\n\nI mean, reps look like they won't mind ruling over a post apocalyptic wasteland as long as they are the rulers.",
    "controversiality": 0,
    "ups": 162,
    "downs": 0,
    "score": 162,
    "created": 1487262181.0,
    "date_created": "2017-02-16",
    "time_created": "03:23:01",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtdb7x",
    "parent_id": "t1_ddta1s9",
    "subreddit_name_prefixed": "r/politics",
    "body": "Every time I thought the list was almost done, I'd scroll and it just kept fucking going. Yet, on the entire list there's only one thing where I thought, \"that's not quite fair, because that's more complicated than you're making it sound\" (China's \"islands\" in the South China Sea), and even that is balanced by a couple of things where I thought he actually kind of downplayed just how bad they were (e.g. the Secretary of Energy pick who called for abolishing the Department of Energy admitted that he'd done so without actually knowing what the DoE does).",
    "controversiality": 0,
    "ups": 86,
    "downs": 0,
    "score": 86,
    "created": 1487274893.0,
    "date_created": "2017-02-16",
    "time_created": "06:54:53",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtdi2b",
    "parent_id": "t1_ddta1s9",
    "subreddit_name_prefixed": "r/politics",
    "body": "Apparently you're tired of \"winning\" so much.",
    "controversiality": 0,
    "ups": 188,
    "downs": 0,
    "score": 188,
    "created": 1487275399.0,
    "date_created": "2017-02-16",
    "time_created": "07:03:19",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtd2hq",
    "parent_id": "t1_ddta1s9",
    "subreddit_name_prefixed": "r/politics",
    "body": "Imagine those of us living it!",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1487274243.0,
    "date_created": "2017-02-16",
    "time_created": "06:44:03",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtdjhy",
    "parent_id": "t1_ddta1s9",
    "subreddit_name_prefixed": "r/politics",
    "body": "I thought it wouldn't be a good two good scroll downs but I was wrong, much like our elected.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1487275502.0,
    "date_created": "2017-02-16",
    "time_created": "07:05:02",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtdxhx",
    "parent_id": "t1_ddta1s9",
    "subreddit_name_prefixed": "r/politics",
    "body": "Mentally and emotionally drained.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1487276465.0,
    "date_created": "2017-02-16",
    "time_created": "07:21:05",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddta9of",
    "parent_id": "t1_ddt92dn",
    "subreddit_name_prefixed": "r/politics",
    "body": "It's not that they think he's worthy, it's that many people hold their party as close as they do their family or their religion.\n\nFrankly, it's quite scary to watch people contort their views as their party and its leader change what they're all about, rather than leave their party or demand it retains the morals they used to have.",
    "controversiality": 0,
    "ups": 296,
    "downs": 0,
    "score": 296,
    "created": 1487265353.0,
    "date_created": "2017-02-16",
    "time_created": "04:15:53",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtbr5k",
    "parent_id": "t1_ddt92dn",
    "subreddit_name_prefixed": "r/politics",
    "body": "Apparently he also had a cozy meeting with RF Kennedy about setting up a 'Vaccine Safety Council'. \n\nFor a bit of info RF Kennedy is a man who knows nothing about autism or vaccines or science in general. \n\nThe fact that the President even met a man like this concerning vaccines is incredibly troubling and potentially indicative that Trump is willing to get his information from not even questionable, but outright unintelligible sources concerning serious issues like the anti-vaccine rhetoric.",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1487270143.0,
    "date_created": "2017-02-16",
    "time_created": "05:35:43",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtc43t",
    "parent_id": "t1_ddt92dn",
    "subreddit_name_prefixed": "r/politics",
    "body": "When the USA was founded compromises were made to appease the the southern states. Such as every state gets 2 senators and they set up the electoral collage. So California with a population of 38,332,521 gets the same representation in the senate as Wyoming with a population of 582,658. So a person in Wyoming vote counts the same as 65.7 people that live in California.   Over the last 20 years the republicans have successfully gerrymandered many states so many congressional districts will favor a republican candidate by successfully wining state legislatures. ie. http://www.austinchronicle.com/news/2011-08-26/riding-the-pinwheel/ Austin Texas is a vary liberal city FYI. Conservatives and republicans are popular in rural America. Trump won the election by pandering to the conservative republican base. He is still vary popular with them. The republicans now are trapped by their own successful decades long rigging of the system. If they are seen by these Trump supporters as opposing Donald many republican seats will be in jeopardy.  As  Mitch McConnell  a top republican has said \" I see no benefit in us investigating one of our own\" Now if you look at the last eight presidential elections the democrats won the popular vote seven times. This would suggest to me that the majority of U.S. voters tend to lean in favor of the Democrats. BUT because of the fact that our system is rigged from the start to favor rural states the Republicans are able to hold power because of the geographic distribution of the U.S.A's population. Manly that liberal democrats are concentrated in a few vary populous states. \n\n\nEdit Thanks you berriuh for your clarifications and corrections.   ps TIL that we are more screwed up than i thought.\n\nEdit2: fixed gerrymandered",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1487271321.0,
    "date_created": "2017-02-16",
    "time_created": "05:55:21",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtasa5",
    "parent_id": "t1_ddt92dn",
    "subreddit_name_prefixed": "r/politics",
    "body": "He's doing everything they wish they had the balls to try. They won't speak a word against him until they're afraid of something, and right now they have nothing to be afraid of. \n\nOn top of that, they're bound to this, because their constituency voted for him. Going against him now would damage their power base. Something even worse than Trump would have to threaten that power base before they'd even consider saying anything. \n\nThey'll say something if he fucks with their money. \n\nThey'll say something if he tries to start a war with anyone who can actually fight back. \n\nOther than that, it's game on. ",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1487266989.0,
    "date_created": "2017-02-16",
    "time_created": "04:43:09",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtemdo",
    "parent_id": "t1_ddtamr9",
    "subreddit_name_prefixed": "r/politics",
    "body": "As an American, i deeply apologize for this.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1487278033.0,
    "date_created": "2017-02-16",
    "time_created": "07:47:13",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtc7tk",
    "parent_id": "t1_ddtats1",
    "subreddit_name_prefixed": "r/politics",
    "body": "Meh, the MAGAs won't read the links. My dad literally told me to have a discussion with him without providing links. They don't want information. They think feelings are more important. See Newt Gingrich's statement where he said he'll go with how he feels rather than the numbers he was just given that proved him wrong.",
    "controversiality": 0,
    "ups": 86,
    "downs": 0,
    "score": 86,
    "created": 1487271655.0,
    "date_created": "2017-02-16",
    "time_created": "06:00:55",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtf2mq",
    "parent_id": "t1_ddtats1",
    "subreddit_name_prefixed": "r/politics",
    "body": "I saved this from another comment a while back. \n\nShit 45's done so far \n\nhttps://www.reddit.com/r/politics/comments/5stvbn/comment/ddhsyue?st=IYXOR6UP&sh=b19b1f57\n\n\n>Time to update the list, huh?  \nAs always, this week's updates are in italics.  \n  \n\"He's totally not, like, a dictator, believe me folks!\"\n  \n[Donald Trump wants to take Iraq's oil.](https://www.salon.com/2017/01/24/iraq-is-worried-that-donald-trump-says-he-wants-to-re-invade-to-take-their-oil/)  \n  \n[Donald Trump is making enemies lists.](http://www.cnn.com/2016/11/09/politics/omarosa-list-donald-trump/)  \n\n\n  \n[Donald Trump is calling his critics \"enemies.\"](http://www.independent.co.uk/news/world/americas/donald-trump-inauguration-calling-his-critics-enemies-twitter-great-way-of-bypassing-mainstream-a7539006.html)\n\n[Donald Trump is keeping his own security force.](http://www.politico.com/story/2016/12/donald-trump-security-force-232797)    \n\n[Donald Trump wants the Army to target civilians.](http://thehill.com/blogs/ballot-box/presidential-races/261757-trump-on-terrorists-you-have-to-take-out-their-families)   \n  \n[Donald Trump would *make* the Army target civilians.](http://www.washingtontimes.com/news/2016/mar/3/donald-trump-says-hed-force-us-military-commit-war/)    \n\n[Donald Trump wants to expand domestic survailance.](http://truthinmedia.com/trump-supports-reauthorizing-patriot-act-nsa-metadata-collection/)    \n\n[Donald Trump wants to make it easier to sue the press.](http://billmoyers.com/story/trumps-threat-first-amendment/)    \n\n[Donald Trump wants to cut back our intelligence agencies.](http://www.slate.com/blogs/the_slatest/2017/01/04/trump_reportedly_wants_to_cut_back_cia_because_too_politicized.html)  \n\n[Donald Trump thinks security takes precedence over privacy.](http://www.theverge.com/2016/2/17/11031910/donald-trump-apple-encryption-backdoor-statement)  \n\n[*Donald Trump is undermining the legitimacy of the court system.*](https://www.washingtonpost.com/news/the-fix/wp/2017/02/08/president-trump-is-not-so-subtly-threatening-the-american-court-system/?utm_term=.924cd11884e0)  \n  \n[Donald Trump is threatening journalists for unfavorable reporting.](http://nymag.com/daily/intelligencer/2017/01/trump-blasts-media-for-reporting-size-of-inauguration-crowd.html)  \n\n[Donald Trump is threatening to enact martial law in American cities.](http://chicago.cbslocal.com/2017/01/24/trump-threatens-to-send-in-the-feds-if-chicago-doesnt-fix-carnage/)\n  \n[Donald Trump needs the names of people working on climate change.](http://www.reuters.com/article/us-usa-trump-climate-idUSKBN1421V0)  \n\n[Donald Trump thinks the 1st Amendment offers too much protection.](https://thinkprogress.org/trump-first-amendment-too-much-protection-37e72ee16ea2#.lqjm79u30)  \n  \n[Donald Trump needs the names of people working on gender equality.](http://www.npr.org/sections/thetwo-way/2016/12/22/506629695/trump-team-asks-state-dept-to-name-those-working-on-gender-equality)  \n\n[*Donald Trump offered to \"destroy the career\" of a Texas state Senator.*](http://thehill.com/homenews/administration/318275-trump-offers-to-destroy-career-of-texas-state-senator-at-meeting-with)\n\n[Donald Trump is banning a religion from immigrating to the United States.](http://www.independent.co.uk/news/donald-trump-immigration-refugees-muslim-countries-sign-executive-orders-iraq-iran-libya-restrict-a7544566.html)  \n    \n[Donald Trump will prevent administration officials from appearing on CNN.](http://talkingpointsmemo.com/livewire/white-house-no-cnn)  \n  \n[*Donald Trump is undermining and telling lies to delegitimize the media.*](https://www.washingtonpost.com/news/politics/wp/2017/02/06/president-trump-is-now-speculating-that-the-media-is-covering-up-terrorist-attacks/?tid=sm_tw&utm_term=.ff06c6caeaa7)  \n  \n[Donald Trump is going to publish a list of crimes committed by immigrants.](https://www.indy100.com/article/trump-weekly-list-immigrants-crimes-7547211)  \n  \n[Donald Trump is seeking the ability to purge the government of non-loyalists.](http://www.huffingtonpost.com/entry/trumps-purge-of-non-loyalists-takes-shape_us_586f9b3ee4b08052400ee18c)  \n  \n[*Donald Trump is appointing unqualified cronies to national cabinet positions.*](https://www.nytimes.com/2017/02/07/us/politics/betsy-devos-education-secretary-confirmed.html?action=Click&contentCollection=BreakingNews&contentID=64887255&pgtype=Homepage&_r=0)\n\n[Donald Trump is freezing federal agencies from communicating through twitter.](http://time.com/4645559/donald-trump-epa-social-media-blackout/)   \n  \n[*Donald Trump is using his position as President to make money for his businesses.*](https://thinkprogress.org/trump-mar-a-lago-dues-trump-hotels-profit-off-presidency-92f33bf9f7fb#.c95gdmv3c)\n  \n[Donald Trump is presenting \"alternative facts\" (lying) to the American people.](http://www.cnn.com/2017/01/22/opinions/alternative-facts-lies-obeidallah-opinion/index.html) [*(2,*](http://www.vox.com/world/2017/2/2/14494478/bowling-green-massacre) [*3,*](http://www.thedailybeast.com/articles/2017/02/08/sean-spicer-makes-up-atlanta-islamist-attack.html) [*4)*](http://www.politicususa.com/2017/02/03/trump-busted-big-lie-government-admits-court-100000-impacted-muslim-ban.html)   \n\n[Donald Trump needs the names of State Department employees working on extremism.](http://www.cnn.com/2016/12/24/politics/donald-trump-state-department/)  \n\n[Donald Trump has fired the acting Attorney General for \"betraying the State Department.\"](http://www.cnn.com/2017/01/30/politics/donald-trump-immigration-order-department-of-justice/index.html)  \n\n[Donald Trump is completely ignoring communications from the Office of Government Ethics.](https://thinkprogress.org/trump-business-ethics-129d508178c9#.lbmsmmsia)    \n  \n[Donald Trump is allowing his chief strategist to destroy or prevent a White House paper trail.](https://foreignpolicy.com/2017/01/30/steve-bannon-is-making-sure-theres-no-white-house-paper-trail-trump-president/)\n  \n[Donald Trump wanted to oust all inspectors general to remove ethics oversight over government agencies.](https://www.washingtonpost.com/news/politics/wp/2017/02/01/trump-transition-email-shows-initial-effort-to-oust-all-inspectors-general/?postshare=2911485966740129&tid=ss_tw&utm_term=.6b90f6811dd4)  \n  \n[Donald Trump has removed the Chairman of the Joint Chiefs of Staff's permanent seat on the National Security Council.](http://www.npr.org/2017/01/30/512489785/fact-check-spin-aside-trumps-national-security-council-has-a-very-big-change)  \n  \n\n  \n[Donald Trump has given Steve Bannon, an alt-right white nationalist, a permanent seat on the National Security Council.](http://www.gq.com/story/donald-trump-is-just-a-puppet-steve-bannon-is-president)  \n  \n[*Donald Trump insulted Australia, an ally of the United States, and may have threatened to invade Mexico, also an ally of the United States.*](http://www.motherjones.com/kevin-drum/2017/02/donald-trump-hangs-australia-threatens-invade-mexico)  \n  \n---\n\nAnd now how about some humor, just to lighten up the mood?  \n  \n\"Donald Trump is, like, a smart person.\"  \n  \n[Donald Trump is signing executive orders that he doesn’t read or understand.](http://www.gq.com/story/donald-trump-is-signing-executive-orders-that-he-doesnt-read-or-understand)  \n\n[Donald Trump is uncomfortable that Sean Spicer was played by a woman on SNL.](http://www.politico.com/story/2017/02/melissa-mccarthy-sean-spicer-234715)\n\n[Donald Trump may have threatened to invade Mexico to root out the \"bad hombres.\"](http://time.com/4657474/donald-trump-enrique-pena-nieto-mexico-bad-hombres/)  \n\n[Donald Trump 'didn't realise he promoted Steve Bannon to National Security Council.'](http://www.independent.co.uk/news/world/americas/donald-trump-steve-bannon-nsc-national-security-council-order-a7565191.html)  \n\n[Donald Trump had to ask his national security advisor whether we wanted a weak dollar, or a strong dollar.](http://www.businessinsider.com/trump-called-mike-flynn-about-us-dollar-at-3-am-2017-2)  \n  \n[Donald Trump’s team could not find the light switches to the cabinet room in which they conduct their meetings, so they had their meeting in the dark.](http://www.independent.co.uk/news/world/americas/donald-trump-bannon-conway-meetings-light-switch-darkness-a7565136.html)  \n  \n---\n\nEdit: In the BestOf thread that brought many of you here I'm starting to see one of the disadvantages of making this list so long: People don't believe it.  Rather than seeing each item and realizing that Donald Trump really *is* that bad, they're starting to dismiss the criticisms entirely.  \"The List\" has offically contracted [***Three Stooges Syndrome***](https://www.youtube.com/watch?v=gmBj8r1-fDo), which is why next week I'll be paring this down to just ten or fifteen links.  All the good arguments in the world don't do a whit of good if no one bothers to read them.  [The complete, untruncated list will always be available here.](https://np.reddit.com/r/EnoughTrumpSpam/comments/5rhuz4/maximumeffort443s_list_hes_totally_not_like_a/)\n\n---  \n  \nMore to the point: /u/bwob, [why do Republicans hate America?](https://www.reddit.com/r/politics/comments/5sim8w/its_official_congress_has_rolled_back_two/ddg6ez0/?st=iyvsioi5&sh=0ecba4ca",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1487278980.0,
    "date_created": "2017-02-16",
    "time_created": "08:03:00",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt8508",
    "parent_id": "t1_ddt6fgq",
    "subreddit_name_prefixed": "r/politics",
    "body": "I remember the grave looks on Obama, Biden and Hillary's faces in the situation room.  They were all having this normal human reaction to sending men into possible deadly situations to likely kill people.\n\nTrump didn't even bother being in the room.  Because he totally just doesn't give 2 shits.\n\nI love how he politicized the dead soldier afterward too.  I am sure his family LOVED when he did that.\n\nHe is unfit to be a human.  Not just unfit to be President.  ",
    "controversiality": 0,
    "ups": 783,
    "downs": 0,
    "score": 783,
    "created": 1487259364.0,
    "date_created": "2017-02-16",
    "time_created": "02:36:04",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt6xlv",
    "parent_id": "t1_ddt6fgq",
    "subreddit_name_prefixed": "r/politics",
    "body": "> I'm surprised this went under the rug so quickly.\n\nDear god, yes.  How did this insanely botched raid get swept under the rug so quickly...  especially since the media debunked the evidence of the raid's success before the administration even had the chance to present it.",
    "controversiality": 0,
    "ups": 831,
    "downs": 0,
    "score": 831,
    "created": 1487256465.0,
    "date_created": "2017-02-16",
    "time_created": "01:47:45",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt7f0n",
    "parent_id": "t1_ddt6fgq",
    "subreddit_name_prefixed": "r/politics",
    "body": "And they bragged about how successful it was. And then Trump gave the most emotionless tribute to the fallen Navy Seal.  ",
    "controversiality": 0,
    "ups": 211,
    "downs": 0,
    "score": 211,
    "created": 1487257584.0,
    "date_created": "2017-02-16",
    "time_created": "02:06:24",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt8nbc",
    "parent_id": "t1_ddt6fgq",
    "subreddit_name_prefixed": "r/politics",
    "body": "I'm guessing it got swept under the rug in order to save face for the military. It seems logical that they probably weren't chomping at the bit to do something so foolhardy and dangerous since it's also their people and reputation on the line.  ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1487260688.0,
    "date_created": "2017-02-16",
    "time_created": "02:58:08",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt85jh",
    "parent_id": "t1_ddt77ai",
    "subreddit_name_prefixed": "r/politics",
    "body": "Yes, yes yes.\n\nI've been saying this for fifteen years.  Groups like Al Qaeda and ISIS love republicans because republicans feed their propaganda.\n\nEvery time dumbass republicans treat muslims as the enemy, they give ISIS and Al Qaeda propaganda.  Republicans make it easy for ISIS and Al Qaeda to say this is a holy war against Islam.  And it's crazy!  We have more radical Christian terrorists in the U.S. than radical Muslim terrorists... but we never refer to white terrorists as terrorists.  When a Muslim kills someone in the U.S., he's a radical Muslim terrorist.  When a white guy kills someone in the U.S., it's just reported as crime.\n\nRepublicans need the Muslim terrorist angle to stay in power because republicans campaign on fear.  Terrorists need people like republicans to stir up fear, because that gives the terrorists power.  Sadly, too many Americans are too dumb to understand what I'm talking about.\n\nI love my country, but I wish my fellow citizens weren't so poorly informed.",
    "controversiality": 0,
    "ups": 534,
    "downs": 0,
    "score": 534,
    "created": 1487259401.0,
    "date_created": "2017-02-16",
    "time_created": "02:36:41",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt7vvz",
    "parent_id": "t1_ddt77ai",
    "subreddit_name_prefixed": "r/politics",
    "body": "I can imagine. Or at least I can think of a parallel scenario, in which a Texas family dinner, gathering of good ole boys, maybe affiliated with the \"Republicans\" grouping, with political and other discussions, is cut short by foreign thugs, ending with a shootout, several dead, including a daughter and some of the foreign thugs.\n\nThe foreigners then describe this as a successful antiterror exercise, and all dead males as enemy combatants successfully eliminated.\n\nHow would the rest of that Texan family feel about the event, about the country that held responsibility for it, and for the leader who gave the order?",
    "controversiality": 0,
    "ups": 165,
    "downs": 0,
    "score": 165,
    "created": 1487258723.0,
    "date_created": "2017-02-16",
    "time_created": "02:25:23",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt7t93",
    "parent_id": "t1_ddt77ai",
    "subreddit_name_prefixed": "r/politics",
    "body": "This. It's really fucked up. I hate ISIS as much as the next guy, but no  kids deserves to bleed out like that. What a cluster fuck.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1487258546.0,
    "date_created": "2017-02-16",
    "time_created": "02:22:26",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt8fon",
    "parent_id": "t1_ddt77ai",
    "subreddit_name_prefixed": "r/politics",
    "body": "It's well known that US bombs are creating more and more future terrorists. That's the whole point -- to create a perpetual war and an excuse to continue it. Peace is not an option for the US military complex. It needs constant war to justify its existence. ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1487260133.0,
    "date_created": "2017-02-16",
    "time_created": "02:48:53",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt6rf3",
    "parent_id": "t1_ddt62y6",
    "subreddit_name_prefixed": "r/politics",
    "body": "I just remembered this one because it got worse and worse each day until another scandal overtook it.\n\nI still think the Yemen raid is going to come back into the news again.  There's more to the story than we got, and it can only get worse.\n\nTrump wasn't fully briefed before the raid.\n\nI'm convinced he didn't seek the counsel of all parties involved.\n\nMy theory is, somebody was sent to find Trump while he was having dinner and basically say \"Obama didn't have the balls to do this raid but you do.  Give me the order and it's a go.\"  And Trump, who is already on record as saying he knows more than the generals, was easily baited into approving the raid.  Because he's a puppet.",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1487256081.0,
    "date_created": "2017-02-16",
    "time_created": "01:41:21",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt6crs",
    "parent_id": "t1_ddsxnpo",
    "subreddit_name_prefixed": "r/politics",
    "body": "The *tweetings* will continue until morale improves.",
    "controversiality": 0,
    "ups": 267,
    "downs": 0,
    "score": 267,
    "created": 1487255203.0,
    "date_created": "2017-02-16",
    "time_created": "01:26:43",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsz96k",
    "parent_id": "t1_ddsxnpo",
    "subreddit_name_prefixed": "r/politics",
    "body": "I can't stop laughing. This is perfect. ",
    "controversiality": 0,
    "ups": 190,
    "downs": 0,
    "score": 190,
    "created": 1487243691.0,
    "date_created": "2017-02-15",
    "time_created": "22:14:51",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt3sih",
    "parent_id": "t1_ddt3hs6",
    "subreddit_name_prefixed": "r/politics",
    "body": "\"Works\"",
    "controversiality": 0,
    "ups": 120,
    "downs": 0,
    "score": 120,
    "created": 1487250445.0,
    "date_created": "2017-02-16",
    "time_created": "00:07:25",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt7yqa",
    "parent_id": "t1_ddt3hs6",
    "subreddit_name_prefixed": "r/politics",
    "body": "This idea is precisely why a lot of people I know pushed them over the edge which resulted in them having voted for him -- I am summarizing my ignorant friends arguments:\n\n\"He runs a successful business, he can of course run the country like that successful business given his experience.\"\n\nThe problem is you really cant run the govt like a business for a variety of reasons, unless of course, your goal is to profit yourself or other peoples businesses, which you could argue is his (Trump's) goal.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1487258919.0,
    "date_created": "2017-02-16",
    "time_created": "02:28:39",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt6t7z",
    "parent_id": "t1_ddszcrb",
    "subreddit_name_prefixed": "r/politics",
    "body": "Ah yes, climate science, the direct path to power, fame, fortune and the global oppression of humanity. I'm so tired of all those climate scientists with their limousines, gaudy mansions all over the world, private jets, and concern only for themselves. \n\nWhy must they, while living in the lap of luxury, try to impose upon all these poor billionaires, these monumental adjustments to their business practices like 'reducing how many toxins their global operations release into the air we breathe'.\n\nI mean, these climate scientists are clearly drunk with power and self interest!\n\nAnd don't get me started on the way they're constantly in the spotlight showing off their wealth and influence. Such unbelievable monsters!",
    "controversiality": 0,
    "ups": 187,
    "downs": 0,
    "score": 187,
    "created": 1487256188.0,
    "date_created": "2017-02-16",
    "time_created": "01:43:08",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt31wx",
    "parent_id": "t1_ddszcrb",
    "subreddit_name_prefixed": "r/politics",
    "body": "And it all comes back to jews, they showed they are nothing but nazis with better pr when /r/altright existed. ",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1487249248.0,
    "date_created": "2017-02-15",
    "time_created": "23:47:28",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt82fr",
    "parent_id": "t1_ddt50eo",
    "subreddit_name_prefixed": "r/politics",
    "body": "> These protestors funded by Soros, who I might add was thrown out of several European countries\n\nI feel like they're the kind of person who reads a lot of anti-Semitic \"history\" and has begun using Soros as a synonym for Jews.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1487259177.0,
    "date_created": "2017-02-16",
    "time_created": "02:32:57",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsukzx",
    "parent_id": "t1_ddsuj5r",
    "subreddit_name_prefixed": "r/politics",
    "body": "He's like a fascism vaccine injected into America so we figure out how to fight it off.",
    "controversiality": 0,
    "ups": 3127,
    "downs": 0,
    "score": 3127,
    "created": 1487237427.0,
    "date_created": "2017-02-15",
    "time_created": "20:30:27",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsy62n",
    "parent_id": "t1_ddsuj5r",
    "subreddit_name_prefixed": "r/politics",
    "body": "We should consider ourselves extremely lucky that this administration is just so incompetent at fascism.",
    "controversiality": 0,
    "ups": 120,
    "downs": 0,
    "score": 120,
    "created": 1487242250.0,
    "date_created": "2017-02-15",
    "time_created": "21:50:50",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsuuez",
    "parent_id": "t1_ddsuj5r",
    "subreddit_name_prefixed": "r/politics",
    "body": "I'm thinking more and more a Clinton or Sanders presidency would have been wasted on us.  This is a weird worse/potentially better option. And it's insane. ",
    "controversiality": 0,
    "ups": 307,
    "downs": 0,
    "score": 307,
    "created": 1487237782.0,
    "date_created": "2017-02-15",
    "time_created": "20:36:22",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsx18k",
    "parent_id": "t1_ddsuj5r",
    "subreddit_name_prefixed": "r/politics",
    "body": "And it would be wise for none of us to forget it: freedom is a fragile treasure that can be snatched from you without warning. Defend it. Don't wait for someone else to do it for you. It's valuable and important and up to all of us to defend. Our grandparents and great grandparents got to watch the rise and fall of Franco and Hitler and Moussolini. There's no reason to repeat that shit other than to keep us from total complacency. ",
    "controversiality": 0,
    "ups": 76,
    "downs": 0,
    "score": 76,
    "created": 1487240733.0,
    "date_created": "2017-02-15",
    "time_created": "21:25:33",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsxc3z",
    "parent_id": "t1_ddsuj5r",
    "subreddit_name_prefixed": "r/politics",
    "body": "I was completely uninterested in politics until Trump ran. So silver lining, I guess?",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1487241144.0,
    "date_created": "2017-02-15",
    "time_created": "21:32:24",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsw5q9",
    "parent_id": "t1_ddsuj5r",
    "subreddit_name_prefixed": "r/politics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1487239547.0,
    "date_created": "2017-02-15",
    "time_created": "21:05:47",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsuvgy",
    "parent_id": "t1_ddsuodn",
    "subreddit_name_prefixed": "r/politics",
    "body": "I was at the Woman's March and haven't been as proud to be an American since right after 9/11 when out of nowhere there were American flags *everywhere*. ",
    "controversiality": 0,
    "ups": 254,
    "downs": 0,
    "score": 254,
    "created": 1487237822.0,
    "date_created": "2017-02-15",
    "time_created": "20:37:02",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsztsx",
    "parent_id": "t1_ddsyja4",
    "subreddit_name_prefixed": "r/politics",
    "body": "We did.\n\nAny shred of \"well, maybe he wont be as bad as he seems\" was snuffed quickly for many of us the moment his cabinet nominations started to be revealed.\n\nThe vast majority of the picks seemed to be almost sarcastic they were so terribly suited for their roles. ",
    "controversiality": 0,
    "ups": 1535,
    "downs": 0,
    "score": 1535,
    "created": 1487244486.0,
    "date_created": "2017-02-15",
    "time_created": "22:28:06",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt0oii",
    "parent_id": "t1_ddszdpi",
    "subreddit_name_prefixed": "r/politics",
    "body": "Yeah, think of all the damage Pence could do domestically, and remember that with Trump you get all that *PLUS* the fear of all out international war!",
    "controversiality": 0,
    "ups": 266,
    "downs": 0,
    "score": 266,
    "created": 1487245697.0,
    "date_created": "2017-02-15",
    "time_created": "22:48:17",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt0at9",
    "parent_id": "t1_ddszdpi",
    "subreddit_name_prefixed": "r/politics",
    "body": "I just looked him up on I side with. Its bad, but at least he's an adult. He should be able to act as presidential as W. Trump is a crazy orange toddler.",
    "controversiality": 0,
    "ups": 320,
    "downs": 0,
    "score": 320,
    "created": 1487245139.0,
    "date_created": "2017-02-15",
    "time_created": "22:38:59",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt0kwo",
    "parent_id": "t1_ddszdpi",
    "subreddit_name_prefixed": "r/politics",
    "body": "Trump is uniting the country against him, and the GOP.  I'm starting to like this aspect of it.  If it causes a huge wave for 2018, it will all have been worth it. ",
    "controversiality": 0,
    "ups": 100,
    "downs": 0,
    "score": 100,
    "created": 1487245546.0,
    "date_created": "2017-02-15",
    "time_created": "22:45:46",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt0ikz",
    "parent_id": "t1_ddsyfxn",
    "subreddit_name_prefixed": "r/politics",
    "body": "You should be. \n\nPence called the Muslim ban \"UnAmerican.\" \n\nPence does not excite white nationalists.\n\nPence does not threaten invasion of our allies.\n\nPence does not listen to infowars and consider them credible.\n\nPence does not show any authoritarian tendencies.\n\nPence does not have a cult of personality that allows him to get away with things other politicians can't.\n\nPence said the booing he received at Hamilton was \"what democracy sounds like.\"\n\nPence calls Russia a hostile state.\n\nPence does not have narcissistic personality disorder.\n\nPence does not call to undermine our democratic norms.\n\nPence would be someone I disagree with domestically to my core, and someone I'd occasionally disagree with abroad. But I would not fear for the sanctity of the Republic or for the continuance of peace brought about by the post-war order under Pence.",
    "controversiality": 0,
    "ups": 978,
    "downs": 0,
    "score": 978,
    "created": 1487245453.0,
    "date_created": "2017-02-15",
    "time_created": "22:44:13",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsz0y1",
    "parent_id": "t1_ddsyfxn",
    "subreddit_name_prefixed": "r/politics",
    "body": "That's what's waiting on deck if Trump gets impeached, so buckle up.",
    "controversiality": 0,
    "ups": 97,
    "downs": 0,
    "score": 97,
    "created": 1487243379.0,
    "date_created": "2017-02-15",
    "time_created": "22:09:39",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt6f51",
    "parent_id": "t1_ddt1tdr",
    "subreddit_name_prefixed": "r/politics",
    "body": "No wonder Trump ran as a Republican.\n\nThat's the standard tactic of the GOP - Grand Old Projections.\n\n",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1487255345.0,
    "date_created": "2017-02-16",
    "time_created": "01:29:05",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt26re",
    "parent_id": "t1_ddt0dmu",
    "subreddit_name_prefixed": "r/politics",
    "body": "The PMs of Japan, the U.K., Canada, Israel, and Australia are probably having late night conference calls laughing about their visits. \n\nJustin's like, \"Who should we send next?\"",
    "controversiality": 0,
    "ups": 331,
    "downs": 0,
    "score": 331,
    "created": 1487247908.0,
    "date_created": "2017-02-15",
    "time_created": "23:25:08",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt0pr9",
    "parent_id": "t1_ddt0dmu",
    "subreddit_name_prefixed": "r/politics",
    "body": "\"Look once these two sides who haven't agreed on this particular matter for decades decide what they want to do without my opinion, I'll be happy to support them\"",
    "controversiality": 0,
    "ups": 214,
    "downs": 0,
    "score": 214,
    "created": 1487245750.0,
    "date_created": "2017-02-15",
    "time_created": "22:49:10",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt4go1",
    "parent_id": "t1_ddt0dmu",
    "subreddit_name_prefixed": "r/politics",
    "body": "That makes me want to smack Netanyahu upside the head. You want an intelligent, effective President who understands the conflict and is willing to work as an ally? Well you had one, and you used your power to help undermine him and prop up a party based in nationalism and ignorance. ",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1487251576.0,
    "date_created": "2017-02-16",
    "time_created": "00:26:16",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt526a",
    "parent_id": "t1_ddsz4qd",
    "subreddit_name_prefixed": "r/politics",
    "body": "His rally is for reelection in 2020. Fucking serious. He filed his intent to run on his inauguration day.",
    "controversiality": 0,
    "ups": 66,
    "downs": 0,
    "score": 66,
    "created": 1487252645.0,
    "date_created": "2017-02-16",
    "time_created": "00:44:05",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt7bph",
    "parent_id": "t1_ddsz4qd",
    "subreddit_name_prefixed": "r/politics",
    "body": "Are you serious? He has nothing better to do like, oh, I don't know, try to fill the massive security-agency vulnerabilities we have right now? All this floofing around at his tacky Barbie castle must be an absolute security nightmare.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1487257371.0,
    "date_created": "2017-02-16",
    "time_created": "02:02:51",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsxrwu",
    "parent_id": "t1_ddsvo4i",
    "subreddit_name_prefixed": "r/politics",
    "body": "And Bibi fucking laughed at him because he knows he's talking to a complete buffoon. It really says something when Netanyahu isn't the most insufferable person in a room.",
    "controversiality": 0,
    "ups": 518,
    "downs": 0,
    "score": 518,
    "created": 1487241736.0,
    "date_created": "2017-02-15",
    "time_created": "21:42:16",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddswe75",
    "parent_id": "t1_ddsvo4i",
    "subreddit_name_prefixed": "r/politics",
    "body": "I think the most telling point in which you could see Trump is almost 100% checked out was when he was spewing off some shit about Rudy Giuliani speaking some words and while staring RIGHT at Rudy, asked \"Where's Rudy?\" then looked around the room like he had no clue wtf a \"Rudy\" was or where it was hiding.\n\nhttp://www.mediaite.com/online/wheres-rudy-trump-doesnt-appear-to-realize-that-giulianis-sitting-right-across-from-him/ ",
    "controversiality": 0,
    "ups": 237,
    "downs": 0,
    "score": 237,
    "created": 1487239867.0,
    "date_created": "2017-02-15",
    "time_created": "21:11:07",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt3sh6",
    "parent_id": "t1_ddsvo4i",
    "subreddit_name_prefixed": "r/politics",
    "body": "He also read the initial speech like a kid who is reading a book report his parents wrote for him. He's a disgrace. He clearly didn't know the issues, he deflected, avoided, and then basically ran off the stage before answering anything. Netanyahu licked his asshole because they have no choice if they hope to survive over there.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1487250443.0,
    "date_created": "2017-02-16",
    "time_created": "00:07:23",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsw8q5",
    "parent_id": "t1_ddsw3sm",
    "subreddit_name_prefixed": "r/politics",
    "body": "Your analogy basically nailed how it went",
    "controversiality": 0,
    "ups": 53,
    "downs": 0,
    "score": 53,
    "created": 1487239662.0,
    "date_created": "2017-02-15",
    "time_created": "21:07:42",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt4m7d",
    "parent_id": "t1_ddsw3sm",
    "subreddit_name_prefixed": "r/politics",
    "body": "You sure you didn't watch it? Because that was a chillingly accurate description of what happened. \n\nI'm going to drink myself to sleep now. ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1487251845.0,
    "date_created": "2017-02-16",
    "time_created": "00:30:45",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt3av2",
    "parent_id": "t1_ddsw3sm",
    "subreddit_name_prefixed": "r/politics",
    "body": "But, but... Trump is a master negotiator.  Haven't you seen the way he dominates people with his handshakes?  /s",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1487249645.0,
    "date_created": "2017-02-15",
    "time_created": "23:54:05",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt4vs2",
    "parent_id": "t1_ddsyd01",
    "subreddit_name_prefixed": "r/politics",
    "body": "No. We are not laughing. We are fucking terrified. ",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1487252320.0,
    "date_created": "2017-02-16",
    "time_created": "00:38:40",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddszfgr",
    "parent_id": "t1_ddswfqd",
    "subreddit_name_prefixed": "r/politics",
    "body": "The galaxy. People in Andromeda are looking at us and shaking their damn heads.",
    "controversiality": 0,
    "ups": 241,
    "downs": 0,
    "score": 241,
    "created": 1487243934.0,
    "date_created": "2017-02-15",
    "time_created": "22:18:54",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt5jk4",
    "parent_id": "t1_ddswfqd",
    "subreddit_name_prefixed": "r/politics",
    "body": "Woah there. Non-American here. I'm not embarrassed by trump. This is all on you guys. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1487253553.0,
    "date_created": "2017-02-16",
    "time_created": "00:59:13",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsyutt",
    "parent_id": "t1_ddsvpmh",
    "subreddit_name_prefixed": "r/politics",
    "body": "I want another white Bronco chase.",
    "controversiality": 0,
    "ups": 148,
    "downs": 0,
    "score": 148,
    "created": 1487243148.0,
    "date_created": "2017-02-15",
    "time_created": "22:05:48",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsw915",
    "parent_id": "t1_ddsvpmh",
    "subreddit_name_prefixed": "r/politics",
    "body": "Sadly, he's gonna get a full pardon and medal or something fucking stupid like that.",
    "controversiality": 0,
    "ups": 208,
    "downs": 0,
    "score": 208,
    "created": 1487239673.0,
    "date_created": "2017-02-15",
    "time_created": "21:07:53",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt14ac",
    "parent_id": "t1_ddsvpmh",
    "subreddit_name_prefixed": "r/politics",
    "body": "\"Shame....shame....shame....shame....shame...\"",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1487246321.0,
    "date_created": "2017-02-15",
    "time_created": "22:58:41",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt0sb8",
    "parent_id": "t1_ddsvpmh",
    "subreddit_name_prefixed": "r/politics",
    "body": "If there were an opportunity, I'd fly across the country on a day's notice to be there.",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1487245850.0,
    "date_created": "2017-02-15",
    "time_created": "22:50:50",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2fwk",
    "parent_id": "t1_ddsvpmh",
    "subreddit_name_prefixed": "r/politics",
    "body": "the crowd at his sentencing will be bigger than his inauguration. what a fucking perfect piece of poetic justice that would be",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1487248304.0,
    "date_created": "2017-02-15",
    "time_created": "23:31:44",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt0cqf",
    "parent_id": "t1_ddsz42w",
    "subreddit_name_prefixed": "r/politics",
    "body": "I don't think he takes the nuclear football, but I've been convinced since LATE NOVEMBER that his Presidency will end with him and his family boarding a chartered jet to Moscow at 3 in the morning, seeking asylum.\n\nMy friends and family thought I was losing it a couple of months ago, now I'm getting a lot of \"My God you may be right\" comments thrown my way.",
    "controversiality": 0,
    "ups": 229,
    "downs": 0,
    "score": 229,
    "created": 1487245215.0,
    "date_created": "2017-02-15",
    "time_created": "22:40:15",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddszs4e",
    "parent_id": "t1_ddsz42w",
    "subreddit_name_prefixed": "r/politics",
    "body": "They can disable it at a moments notice. Don't worry they got this shit planned out incase anybody ever goes rogue.",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1487244418.0,
    "date_created": "2017-02-15",
    "time_created": "22:26:58",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt3p93",
    "parent_id": "t1_ddt1iup",
    "subreddit_name_prefixed": "r/politics",
    "body": "Turns out enough snowflakes creates an avalanche",
    "controversiality": 0,
    "ups": 70,
    "downs": 0,
    "score": 70,
    "created": 1487250292.0,
    "date_created": "2017-02-16",
    "time_created": "00:04:52",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt60ce",
    "parent_id": "t1_ddt3kd6",
    "subreddit_name_prefixed": "r/politics",
    "body": "Fedoras and Guy Fawkes masks for everyone!",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1487254487.0,
    "date_created": "2017-02-16",
    "time_created": "01:14:47",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt5h0r",
    "parent_id": "t1_ddt3cju",
    "subreddit_name_prefixed": "r/politics",
    "body": "I only read about right wing terrorism. The only left wing terrorism I hear about is stuff involving vandalism to corporate property or expressing themselves in a peaceful protest or some shit that may end with a assault charge or something.",
    "controversiality": 0,
    "ups": 53,
    "downs": 0,
    "score": 53,
    "created": 1487253415.0,
    "date_created": "2017-02-16",
    "time_created": "00:56:55",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt5mat",
    "parent_id": "t1_ddt4jez",
    "subreddit_name_prefixed": "r/politics",
    "body": "\"This is bigger than 1776, if Trump can deliver!\"\n\nBigger than the American Revolution? So many times in the last few weeks I've found myself at a loss for words....",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1487253703.0,
    "date_created": "2017-02-16",
    "time_created": "01:01:43",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt3n40",
    "parent_id": "t1_ddt387x",
    "subreddit_name_prefixed": "r/politics",
    "body": "Yup. \"Would-be school shooters\" is more like it. ",
    "controversiality": 0,
    "ups": 57,
    "downs": 0,
    "score": 57,
    "created": 1487250194.0,
    "date_created": "2017-02-16",
    "time_created": "00:03:14",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsyl35",
    "parent_id": "t1_ddswn87",
    "subreddit_name_prefixed": "r/politics",
    "body": "Indeed. I lived through Watergate, and that's the last time there was something this juicy. \n\nAnd it's so early! It can only get better, and I'll enjoy watching him and his assortment of crooked fools fall even more than I did Nixon.",
    "controversiality": 0,
    "ups": 114,
    "downs": 0,
    "score": 114,
    "created": 1487242787.0,
    "date_created": "2017-02-15",
    "time_created": "21:59:47",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtc040",
    "parent_id": "t1_ddt6hak",
    "subreddit_name_prefixed": "r/politics",
    "body": "Would have worked if the electors did what they were intended to do. Evaluate the candidates fitness to serve. The electors were not just intended to be an abstraction layer on top of the actual votes. But a stop gap against voters being swayed by populism.\n\nThat is not to say your suggestion is not an improvement.\n\n",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1487270950.0,
    "date_created": "2017-02-16",
    "time_created": "05:49:10",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt0tmz",
    "parent_id": "t1_ddt0m02",
    "subreddit_name_prefixed": "r/politics",
    "body": "I still kind of like the anti-establishment MAGA mentality so my shitposting has continued but, yes, it's become impossible to defend the man. ",
    "controversiality": 0,
    "ups": 328,
    "downs": 0,
    "score": 328,
    "created": 1487245903.0,
    "date_created": "2017-02-15",
    "time_created": "22:51:43",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt3sod",
    "parent_id": "t1_ddt2r3c",
    "subreddit_name_prefixed": "r/politics",
    "body": ">he's doing pretty much exactly what he promised to,\n\nI'm pretty sure he promised to be at the White House working, not playing golf at a pay-for-access-to-POTUS resort in Florida.\n\nPlus by this point in time Obama had an $800B stimulus bill signed, in comparison Trump has done fuck all.\n\n",
    "controversiality": 0,
    "ups": 37,
    "downs": 0,
    "score": 37,
    "created": 1487250452.0,
    "date_created": "2017-02-16",
    "time_created": "00:07:32",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt5ham",
    "parent_id": "t1_ddt3wv5",
    "subreddit_name_prefixed": "r/politics",
    "body": "He looks utterly miserable. ",
    "controversiality": 0,
    "ups": 55,
    "downs": 0,
    "score": 55,
    "created": 1487253430.0,
    "date_created": "2017-02-16",
    "time_created": "00:57:10",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsyv16",
    "parent_id": "t1_ddswj1i",
    "subreddit_name_prefixed": "r/politics",
    "body": "I keep coming back to this, and have to keep reminding myself that such an intelligence test would almost certainly be developed by the states, in which case the majority of them would be written by Republicans...",
    "controversiality": 0,
    "ups": 118,
    "downs": 0,
    "score": 118,
    "created": 1487243156.0,
    "date_created": "2017-02-15",
    "time_created": "22:05:56",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt09rv",
    "parent_id": "t1_ddswj1i",
    "subreddit_name_prefixed": "r/politics",
    "body": "It's worth mentioning that restrictions on voting hurts DEMS not republicans, in recent history at least.",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1487245098.0,
    "date_created": "2017-02-15",
    "time_created": "22:38:18",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt23xs",
    "parent_id": "t1_ddswj1i",
    "subreddit_name_prefixed": "r/politics",
    "body": "That would be a terrible idea. Completely opens the door for more voter suppression and discrimination.\n\n ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1487247790.0,
    "date_created": "2017-02-15",
    "time_created": "23:23:10",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt1f5v",
    "parent_id": "t1_ddt0mil",
    "subreddit_name_prefixed": "r/politics",
    "body": "These fries are the most tremendous fries. I only grow the best potatoes, the very best. ",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1487246760.0,
    "date_created": "2017-02-15",
    "time_created": "23:06:00",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2ozx",
    "parent_id": "t1_ddszweo",
    "subreddit_name_prefixed": "r/politics",
    "body": "And as soon as that embryo exits the womb it's their fault they exist, and that baby better pull itself up by it's bootstraps!",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1487248690.0,
    "date_created": "2017-02-15",
    "time_created": "23:38:10",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt9bcs",
    "parent_id": "t1_ddt96os",
    "subreddit_name_prefixed": "r/politics",
    "body": "Well, some other party would presumably rise to fill the void. \n\nProbably the Tea Party or some bullshit. Ick. ",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1487262546.0,
    "date_created": "2017-02-16",
    "time_created": "03:29:06",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtgb35",
    "parent_id": "t1_ddtdb7x",
    "subreddit_name_prefixed": "r/politics",
    "body": ">the Secretary of Energy pick who called for abolishing the Department of Energy admitted that he'd done so **without actually knowing what the DoE does**\n\nIt goes from ridiculous to straight up incomprehensible",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1487281242.0,
    "date_created": "2017-02-16",
    "time_created": "08:40:42",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddte798",
    "parent_id": "t1_ddtd2hq",
    "subreddit_name_prefixed": "r/politics",
    "body": "Yeah man, I don't envy you for a second. We in Europe have our own right wing shit going on, bit you're fucked on a whole different level.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1487277097.0,
    "date_created": "2017-02-16",
    "time_created": "07:31:37",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddte1ir",
    "parent_id": "t1_ddta9of",
    "subreddit_name_prefixed": "r/politics",
    "body": "Or you get a history lesson on how; Obama did the same thing, Hillary did the same thing...  Blah blah blah... No they didn't do the same thing. lol",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1487276738.0,
    "date_created": "2017-02-16",
    "time_created": "07:25:38",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtal1k",
    "parent_id": "t1_ddta9of",
    "subreddit_name_prefixed": "r/politics",
    "body": "Are they contorting their views and morals?",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1487266333.0,
    "date_created": "2017-02-16",
    "time_created": "04:32:13",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtcf8s",
    "parent_id": "t1_ddtc43t",
    "subreddit_name_prefixed": "r/politics",
    "body": "> When the USA was founded compromises were made to appease the the southern states. Such as every state gets 2 senators and they set up the electoral collage. \n\nOK, these are two separate compromises. And the Senate thing had little to do with the South (many Southern states were large states once you factor in the 2/3 compromise, though a few were still small) -- it was called the Connecticut Compromise by many. Small states, like Connecticut, benefited from the Senate. \n\nIn fact (from Wikipedia, about the Connecticut Compromise), the majority of the small states were Northern and the South was growing faster:\n\n>At the time of the convention, the South was growing more quickly than the North, and Southern states had the most extensive Western claims. South Carolina, North Carolina, and Georgia were small in the 1780s, but they expected growth, and thus favored proportional representation. New York was one of the largest states at the time, but two of its three representatives (Alexander Hamilton being the exception) supported an equal representation per state, as part of their desire to see maximum autonomy for the states. \n\nThe Electoral College was designed for a number of reasons, but it was not part of the Connecticut Compromise that created the Senate. A major factor in the creation/support of the Electoral College was slavery, and the Southern states factor in there (popular vote was out because even though many Southern states were large states, they heavily restricted voting to land-owning folk in most cases, whereas more voters existed in the North, plus they wanted credit for that slave population to be factored in but weren't going to let those folks vote, obviously). But there were also other factors, like the idea of another check and balance against tyrannical state legislatures and the idea that an independent body of educated men could best assess whether someone would be too dangerous to be President, etc. Obviously, all that is archaic. The authors of the Constitution were actually pretty annoyed when states started voting in blocs instead of districts for EC (this happened quickly, as states realized they could consolidate power better that way). But they were never able to successfully do anything about it. The die had been cast. \n\nThe EC is further compromised/fucked by the House caps of the 1920s that also **make it so that populous states like California don't even have truly equitable-to-population representation in the House and therefore not in the Electoral College** anymore. The EC reflects the House #s plus Senate. If the House were not capped, the proportion of CA's EC votes to WY's would be very different. The House can be capped by legislation, not a Constitutional Amendment, and was, so it inadvertently fucks over a Constitutional body like the EC (this was likely not an intention of the 1920s laws; capping the House is practical). Most people don't know that because when they learn about the EC briefly in Government class, that's not taught typically. \n\nThis also means the House is fucked not just by gerrymandering but by this factor. People are not getting truly equal-to-population representation by the body of the bicameral legislature that was designed to do so. A lot of people don't know that either. \n\nYour other points stand, but I want as much accurate information as can get out there about the EC as possible. The Senate is fine, and people tend to justify the EC by lumping it in with the Senate, but the EC actually has massive problems that the Senate does not have *and* has a much stronger connection to slavery and the Southern states than the Senate compromise (which really wasn't about that). ",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1487272317.0,
    "date_created": "2017-02-16",
    "time_created": "06:11:57",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtbkp7",
    "parent_id": "t1_ddtasa5",
    "subreddit_name_prefixed": "r/politics",
    "body": "Fairly sure trump will start a war in a way so that congress or senate can't do anything about, because it'll be to late to do anything but commit to it. ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1487269555.0,
    "date_created": "2017-02-16",
    "time_created": "05:25:55",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtj1z9",
    "parent_id": "t1_ddtemdo",
    "subreddit_name_prefixed": "r/politics",
    "body": "No need to apologize, it´s not your personal fault.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1487285294.0,
    "date_created": "2017-02-16",
    "time_created": "09:48:14",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtekby",
    "parent_id": "t1_ddtc7tk",
    "subreddit_name_prefixed": "r/politics",
    "body": "i had a conversation with a guy online and told him to post links to back up his POV. and he did. \n\nfirst, none of them had anything to do with the conversation at hand, and second, they were all from goofy sources.\n\nyou can't get into a link war with these guys...they will have as many as you do and they will answer any argument you have against their sources with arguments of their own that your sources are \"fake\" news.\n\napart from literally taking their nose and rubbing in the shit like you'd do with a dog, they won't concede a single point, link or not.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1487277912.0,
    "date_created": "2017-02-16",
    "time_created": "07:45:12",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtbi2w",
    "parent_id": "t1_ddt8508",
    "subreddit_name_prefixed": "r/politics",
    "body": "Every military guy I know is a strong Trump supporter because \"he has balls\".... Whatever that means... He's made fun of dead service members, he's made fun of POWs and still they support him. Now he's getting them killed too.... Some people simply do not give a shit as long as he's a Republican they'll give him rim jobs all day. ",
    "controversiality": 0,
    "ups": 181,
    "downs": 0,
    "score": 181,
    "created": 1487269319.0,
    "date_created": "2017-02-16",
    "time_created": "05:21:59",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtb2ym",
    "parent_id": "t1_ddt8508",
    "subreddit_name_prefixed": "r/politics",
    "body": "I sometimes forget that Hillary was in the situation room during Bin Laden's raid. I'm sorry, but even if Trump didn't have anything fishy about him (Russia, pussy grabbing, failed business, ect..), I'd rather have Clinton. I live in a country where corruption isn't that surprising, sadly, so maybe that's why.\n\nBut if I needed surgery and had to choose between a doctor who had a dodgy medical past and a mechanic, I know who I would chose. But this election was about way more than that...\n\nEdit: grammatical errors",
    "controversiality": 0,
    "ups": 60,
    "downs": 0,
    "score": 60,
    "created": 1487267953.0,
    "date_created": "2017-02-16",
    "time_created": "04:59:13",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt9tpc",
    "parent_id": "t1_ddt8508",
    "subreddit_name_prefixed": "r/politics",
    "body": "Can't even be bothered to be present when he sends his own people to die. ",
    "controversiality": 0,
    "ups": 80,
    "downs": 0,
    "score": 80,
    "created": 1487264021.0,
    "date_created": "2017-02-16",
    "time_created": "03:53:41",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt7wbi",
    "parent_id": "t1_ddt6xlv",
    "subreddit_name_prefixed": "r/politics",
    "body": "I don't think necesesarily got swept under the rug so much as buried underneath the mountain shit that the administration has done since",
    "controversiality": 0,
    "ups": 554,
    "downs": 0,
    "score": 554,
    "created": 1487258753.0,
    "date_created": "2017-02-16",
    "time_created": "02:25:53",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt85ng",
    "parent_id": "t1_ddt6xlv",
    "subreddit_name_prefixed": "r/politics",
    "body": "It is one of the many insane blowups which have occurred in the last month since Trump took office. If this was any other president (especially one which just got into office) it would be a major scandal, but it is difficult to focus on just one thing since nearly every day a new scandal seems to occur. ",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1487259409.0,
    "date_created": "2017-02-16",
    "time_created": "02:36:49",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt8hj1",
    "parent_id": "t1_ddt7f0n",
    "subreddit_name_prefixed": "r/politics",
    "body": "He prefers people that don't get killed.",
    "controversiality": 0,
    "ups": 179,
    "downs": 0,
    "score": 179,
    "created": 1487260264.0,
    "date_created": "2017-02-16",
    "time_created": "02:51:04",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt9ef1",
    "parent_id": "t1_ddt85jh",
    "subreddit_name_prefixed": "r/politics",
    "body": "If they campaign and gain power through fear, does that make them terrorists?",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1487262781.0,
    "date_created": "2017-02-16",
    "time_created": "03:33:01",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt9m6t",
    "parent_id": "t1_ddt85jh",
    "subreddit_name_prefixed": "r/politics",
    "body": "> Republicans make it easy for ISIS and Al Qaeda to say this is a holy war against Islam.\n\nThat's because, not only do many Republicans WANT a holy war against Islam, they want it because they are dominionist Christians who believe that certain things have to be accomplished before Jesus can return and do away with the current Heaven and Earth.\n\nThey WANT the end of the world to happen during their lifetimes.",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1487263406.0,
    "date_created": "2017-02-16",
    "time_created": "03:43:26",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddta7pq",
    "parent_id": "t1_ddt85jh",
    "subreddit_name_prefixed": "r/politics",
    "body": "> Groups like Al Qaeda and ISIS love republicans\n\nBirds of a feather.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1487265186.0,
    "date_created": "2017-02-16",
    "time_created": "04:13:06",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtbrty",
    "parent_id": "t1_ddt7vvz",
    "subreddit_name_prefixed": "r/politics",
    "body": "Have you read \"The Mirage\" by Matt Ruff? Its an alternate history novel where the US and Middle East have switched places, and extreme Christian fundamentalists from the US crashed planes into towers in Riyadh on 9/11. Interesting premise and a decent book. ",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1487270203.0,
    "date_created": "2017-02-16",
    "time_created": "05:36:43",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt8tq0",
    "parent_id": "t1_ddt7vvz",
    "subreddit_name_prefixed": "r/politics",
    "body": "I am deeply worried for the human race that the kind of thought process and empathy you display here are distressingly uncommon. That 'us' vs 'them' tribal mentality that totally Other-izes and demonizes \"Them\" beyond all semblance of reality is one hell of a problem. ",
    "controversiality": 0,
    "ups": 37,
    "downs": 0,
    "score": 37,
    "created": 1487261177.0,
    "date_created": "2017-02-16",
    "time_created": "03:06:17",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt72jy",
    "parent_id": "t1_ddt6rf3",
    "subreddit_name_prefixed": "r/politics",
    "body": "I hope it does come back into the news. Do you aggregate multiple news source to keep abreast of a situation? Is there any one source that did the yemen raid justice?",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1487256783.0,
    "date_created": "2017-02-16",
    "time_created": "01:53:03",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2pwr",
    "parent_id": "t1_ddsz96k",
    "subreddit_name_prefixed": "r/politics",
    "body": "Have you never heard that saying before?",
    "controversiality": 0,
    "ups": 122,
    "downs": 0,
    "score": 122,
    "created": 1487248728.0,
    "date_created": "2017-02-15",
    "time_created": "23:38:48",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt7vgr",
    "parent_id": "t1_ddt3sih",
    "subreddit_name_prefixed": "r/politics",
    "body": "For him. What else is there?",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1487258697.0,
    "date_created": "2017-02-16",
    "time_created": "02:24:57",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt9lkl",
    "parent_id": "t1_ddt6t7z",
    "subreddit_name_prefixed": "r/politics",
    "body": "It's as though they want to destroy the planet! FFS!\n",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1487263358.0,
    "date_created": "2017-02-16",
    "time_created": "03:42:38",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsus5n",
    "parent_id": "t1_ddsukzx",
    "subreddit_name_prefixed": "r/politics",
    "body": "[We figured it out way back when...](https://www.youtube.com/watch?v=23X14HS4gLk)\n\nBut I guess a booster is required every now and again.\n\nEdit: If you want an interesting response to the folks about free speech and Milo, show them that and tell them that Milo is the guy on the soapbox.",
    "controversiality": 0,
    "ups": 1866,
    "downs": 0,
    "score": 1866,
    "created": 1487237695.0,
    "date_created": "2017-02-15",
    "time_created": "20:34:55",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsz4kx",
    "parent_id": "t1_ddsukzx",
    "subreddit_name_prefixed": "r/politics",
    "body": "It does bring warmth to my neo-liberal self to join with progressives and libertarians to defend our common values.  \n\nI hope that after this is over it ushers in an era of cooperation between those of us who want to keep things moving forward.  \n\nJust kidding, we'll get back to fighting when the orange monster is gone.  ",
    "controversiality": 0,
    "ups": 126,
    "downs": 0,
    "score": 126,
    "created": 1487243516.0,
    "date_created": "2017-02-15",
    "time_created": "22:11:56",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsvplo",
    "parent_id": "t1_ddsukzx",
    "subreddit_name_prefixed": "r/politics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 90,
    "downs": 0,
    "score": 90,
    "created": 1487238942.0,
    "date_created": "2017-02-15",
    "time_created": "20:55:42",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsuw9d",
    "parent_id": "t1_ddsukzx",
    "subreddit_name_prefixed": "r/politics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1487237851.0,
    "date_created": "2017-02-15",
    "time_created": "20:37:31",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt4s81",
    "parent_id": "t1_ddsy62n",
    "subreddit_name_prefixed": "r/politics",
    "body": "Everyone here is patting themselves on the back but nothing has been accomplished yet.  There's no way Trump and Bannon are going to give up Trumpbannonstan without a fight.",
    "controversiality": 0,
    "ups": 54,
    "downs": 0,
    "score": 54,
    "created": 1487252139.0,
    "date_created": "2017-02-16",
    "time_created": "00:35:39",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsvhe9",
    "parent_id": "t1_ddsuuez",
    "subreddit_name_prefixed": "r/politics",
    "body": "We're either going to come out of this stronger and more politically active, or our republic is dead.",
    "controversiality": 0,
    "ups": 493,
    "downs": 0,
    "score": 493,
    "created": 1487238633.0,
    "date_created": "2017-02-15",
    "time_created": "20:50:33",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsw2dn",
    "parent_id": "t1_ddsuuez",
    "subreddit_name_prefixed": "r/politics",
    "body": "I don't know about better, but it's definitely a political awakening for a lot of people who would have snoozed through a Democratic presidency, so that's been kind of cool to see.",
    "controversiality": 0,
    "ups": 63,
    "downs": 0,
    "score": 63,
    "created": 1487239421.0,
    "date_created": "2017-02-15",
    "time_created": "21:03:41",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsx6vg",
    "parent_id": "t1_ddsuuez",
    "subreddit_name_prefixed": "r/politics",
    "body": "Any political figure you could name, from Sanders to Clinton to Cruz to Rubio to Bush would have been in the realm of normal. I don't know exactly what normal means, I know that sounds weird, but none of this is normal. And, it'd be one thing if like half the changes were for the better but they are all for the worse. . . Now keep in mind, I can think of at least two things that I agree with Trump on. . . Or, that I'd agree with a sane person on, deporting more illegal immigrants, although not all of them by any means, and letting Israel do almost anything it wants. I'm not bringing this up to start an argument, I'm bringing it up to try and illustrate that Trump is not dangerously abnormal because of his policies, he's abnormal because of the content of his character, he can't do this job well, or even do it ok, its not in him. He could adopt Bernie's platform tomorrow, and mean it, and he'd still suck, the lying, the thin skin, the instability, that would all still be here.",
    "controversiality": 0,
    "ups": 107,
    "downs": 0,
    "score": 107,
    "created": 1487240946.0,
    "date_created": "2017-02-15",
    "time_created": "21:29:06",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsw6ru",
    "parent_id": "t1_ddsuvgy",
    "subreddit_name_prefixed": "r/politics",
    "body": "That juxtaposition is kind of amazing within itself.",
    "controversiality": 0,
    "ups": 78,
    "downs": 0,
    "score": 78,
    "created": 1487239586.0,
    "date_created": "2017-02-15",
    "time_created": "21:06:26",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt24f8",
    "parent_id": "t1_ddsuvgy",
    "subreddit_name_prefixed": "r/politics",
    "body": "Oh yeah, it was like all of DC was a small town. Everybody offering snacks and water if someone needed it, free hats from knitters, you could strike up a conversation with anyone. I got stranded in the airport after the bad storms and was invited to stay with someone on my flight who had family in Virginia. It was magical. ",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1487247810.0,
    "date_created": "2017-02-15",
    "time_created": "23:23:30",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt3mkf",
    "parent_id": "t1_ddsuvgy",
    "subreddit_name_prefixed": "r/politics",
    "body": "My wife was there.  She was equally astounded by the universal sense of unity and camaraderie amongst protesters and the public in general. She remarked particularly about the level of mutual respect between the protestors and law enforcement as well.  Seemed like a good day for America.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1487250170.0,
    "date_created": "2017-02-16",
    "time_created": "00:02:50",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt14jy",
    "parent_id": "t1_ddsztsx",
    "subreddit_name_prefixed": "r/politics",
    "body": "Seriously. Oil exec with Russia ties for State, the guy who forgot he wanted to close Energy to run it, Doctor Sleepy after he said he's not qualified for government, former Goldman Sachs for Treasury, Jeff \"anyone who smokes weed is evil\" Sessions for AG, rabid anti-net neutrality for FCC, and Betsy freaking DeVos. It's such a disrespectful clusterfuck.",
    "controversiality": 0,
    "ups": 752,
    "downs": 0,
    "score": 752,
    "created": 1487246332.0,
    "date_created": "2017-02-15",
    "time_created": "22:58:52",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt0pf8",
    "parent_id": "t1_ddsztsx",
    "subreddit_name_prefixed": "r/politics",
    "body": "I knew he was going to be as extreme as his rhetoric as soon as he picked his VP.",
    "controversiality": 0,
    "ups": 162,
    "downs": 0,
    "score": 162,
    "created": 1487245735.0,
    "date_created": "2017-02-15",
    "time_created": "22:48:55",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt1x6e",
    "parent_id": "t1_ddsztsx",
    "subreddit_name_prefixed": "r/politics",
    "body": "We knew long before then, but if there was a moment post-election, it was Bannon as Chief Strategist. First time I've ever called my Congressperson, first of probably now 50.",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1487247505.0,
    "date_created": "2017-02-15",
    "time_created": "23:18:25",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt15ii",
    "parent_id": "t1_ddsztsx",
    "subreddit_name_prefixed": "r/politics",
    "body": "I still have a friend who is on the \"let's see what he does\" boat. He's always been a bit of a moron, but what shocks me the most is he's one of those \"I wanna be off the grid\" hippy types. You'd think his environmental stances would have been enough to make him hate Trump to the core but still he doesn't want to admit anything is wrong. \n\nI guess religion really does matter more than anything else to religious people. ",
    "controversiality": 0,
    "ups": 137,
    "downs": 0,
    "score": 137,
    "created": 1487246371.0,
    "date_created": "2017-02-15",
    "time_created": "22:59:31",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt0t3j",
    "parent_id": "t1_ddt0oii",
    "subreddit_name_prefixed": "r/politics",
    "body": "My thinking exactly! As a Canadian, I'm sorry that Pence will fuck up your country, but he won't do as much damage on an international scale as Trump will.",
    "controversiality": 0,
    "ups": 162,
    "downs": 0,
    "score": 162,
    "created": 1487245881.0,
    "date_created": "2017-02-15",
    "time_created": "22:51:21",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt16i2",
    "parent_id": "t1_ddt0at9",
    "subreddit_name_prefixed": "r/politics",
    "body": "This is exactly how a lot of reasonable conservatives advocated for Hillary. \"She's wrong, but she's wrong within normal parameters.\" Trump is just unworkable",
    "controversiality": 0,
    "ups": 468,
    "downs": 0,
    "score": 468,
    "created": 1487246410.0,
    "date_created": "2017-02-15",
    "time_created": "23:00:10",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt1wrz",
    "parent_id": "t1_ddt0at9",
    "subreddit_name_prefixed": "r/politics",
    "body": "He actually cares about getting caught telling lies. That's where we are right now.",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1487247490.0,
    "date_created": "2017-02-15",
    "time_created": "23:18:10",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2bva",
    "parent_id": "t1_ddt0kwo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Even if it does lead to massive landslides in 2018 and 2020, the public will just vote the GOP back in in 2022 or 2024. \n\nThis election made me totally lose faith in the American people. I have no faith in the average voter to act intelligently after 63 million decided a bigoted moron with a serious mental illness and authoritarian tendencies was qualified to be president. ",
    "controversiality": 0,
    "ups": 243,
    "downs": 0,
    "score": 243,
    "created": 1487248128.0,
    "date_created": "2017-02-15",
    "time_created": "23:28:48",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2gs2",
    "parent_id": "t1_ddt0kwo",
    "subreddit_name_prefixed": "r/politics",
    "body": "You realize he still has a very strong approval rating among Republicans right? ",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1487248343.0,
    "date_created": "2017-02-15",
    "time_created": "23:32:23",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt17p6",
    "parent_id": "t1_ddt0ikz",
    "subreddit_name_prefixed": "r/politics",
    "body": "Yeah I'd like to go back to debating social issues. I don't have the energy to deal with facism. \n\nLet's go back to arguing about transgender bathrooms. ",
    "controversiality": 0,
    "ups": 450,
    "downs": 0,
    "score": 450,
    "created": 1487246457.0,
    "date_created": "2017-02-15",
    "time_created": "23:00:57",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt294h",
    "parent_id": "t1_ddt0ikz",
    "subreddit_name_prefixed": "r/politics",
    "body": "When Pence is a better option than the current POTUS.\n\nNever thought I would want that, ever.",
    "controversiality": 0,
    "ups": 120,
    "downs": 0,
    "score": 120,
    "created": 1487248009.0,
    "date_created": "2017-02-15",
    "time_created": "23:26:49",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt1u4q",
    "parent_id": "t1_ddt0ikz",
    "subreddit_name_prefixed": "r/politics",
    "body": " Wow when you put it that way ..",
    "controversiality": 0,
    "ups": 55,
    "downs": 0,
    "score": 55,
    "created": 1487247380.0,
    "date_created": "2017-02-15",
    "time_created": "23:16:20",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt0lbu",
    "parent_id": "t1_ddsz0y1",
    "subreddit_name_prefixed": "r/politics",
    "body": "Buckaroo",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1487245564.0,
    "date_created": "2017-02-15",
    "time_created": "22:46:04",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt0q4t",
    "parent_id": "t1_ddsz0y1",
    "subreddit_name_prefixed": "r/politics",
    "body": "Pence was a part of the same campaign that was colluding with Russia.",
    "controversiality": 0,
    "ups": 53,
    "downs": 0,
    "score": 53,
    "created": 1487245765.0,
    "date_created": "2017-02-15",
    "time_created": "22:49:25",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt5lxy",
    "parent_id": "t1_ddt26re",
    "subreddit_name_prefixed": "r/politics",
    "body": "\"Lol can we get Kim on the phone or nah\"",
    "controversiality": 0,
    "ups": 91,
    "downs": 0,
    "score": 91,
    "created": 1487253684.0,
    "date_created": "2017-02-16",
    "time_created": "01:01:24",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt5wt5",
    "parent_id": "t1_ddt26re",
    "subreddit_name_prefixed": "r/politics",
    "body": "I imagine it like how Mean Girls did their three way calls.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1487254286.0,
    "date_created": "2017-02-16",
    "time_created": "01:11:26",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt15jq",
    "parent_id": "t1_ddt0pr9",
    "subreddit_name_prefixed": "r/politics",
    "body": "152D Candyland.  What a master strategist.  ",
    "controversiality": 0,
    "ups": 114,
    "downs": 0,
    "score": 114,
    "created": 1487246372.0,
    "date_created": "2017-02-15",
    "time_created": "22:59:32",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtbvuu",
    "parent_id": "t1_ddt526a",
    "subreddit_name_prefixed": "r/politics",
    "body": "Probably so he can claim campaign donations as an avenue for bribes tbh.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1487270569.0,
    "date_created": "2017-02-16",
    "time_created": "05:42:49",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt22mz",
    "parent_id": "t1_ddsxrwu",
    "subreddit_name_prefixed": "r/politics",
    "body": "Yeah, he was like, \"Uh please stop the settlements?\"\nNetanyahu was like, \"Ha, I'll let you know.\"\n\nTrump's right-hand man on Israel is his son in law, whose only qualification is that he's Jewish. ",
    "controversiality": 0,
    "ups": 228,
    "downs": 0,
    "score": 228,
    "created": 1487247735.0,
    "date_created": "2017-02-15",
    "time_created": "23:22:15",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt0u91",
    "parent_id": "t1_ddsxrwu",
    "subreddit_name_prefixed": "r/politics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 72,
    "downs": 0,
    "score": 72,
    "created": 1487245928.0,
    "date_created": "2017-02-15",
    "time_created": "22:52:08",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsyk8r",
    "parent_id": "t1_ddswe75",
    "subreddit_name_prefixed": "r/politics",
    "body": "Jesus what the fuck was that?  He was right in front of him?  Trump is in a daze...",
    "controversiality": 0,
    "ups": 129,
    "downs": 0,
    "score": 129,
    "created": 1487242756.0,
    "date_created": "2017-02-15",
    "time_created": "21:59:16",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsydwj",
    "parent_id": "t1_ddswe75",
    "subreddit_name_prefixed": "r/politics",
    "body": "\nWtf...",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1487242529.0,
    "date_created": "2017-02-15",
    "time_created": "21:55:29",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt1vj2",
    "parent_id": "t1_ddszfgr",
    "subreddit_name_prefixed": "r/politics",
    "body": "Well, they will in roughly 2.5 million years, anyway.",
    "controversiality": 0,
    "ups": 144,
    "downs": 0,
    "score": 144,
    "created": 1487247439.0,
    "date_created": "2017-02-15",
    "time_created": "23:17:19",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt3af9",
    "parent_id": "t1_ddsyutt",
    "subreddit_name_prefixed": "r/politics",
    "body": "Escalator chase. ",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1487249625.0,
    "date_created": "2017-02-15",
    "time_created": "23:53:45",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt5xj5",
    "parent_id": "t1_ddsyutt",
    "subreddit_name_prefixed": "r/politics",
    "body": "But this time, the glove WILL fit. \n",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1487254327.0,
    "date_created": "2017-02-16",
    "time_created": "01:12:07",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsyz5k",
    "parent_id": "t1_ddsw915",
    "subreddit_name_prefixed": "r/politics",
    "body": "Yep.  Trump is not up to the task of being President, but he's far from a moron.  When the writing's on the wall and the GOP turns against him, he will gladly resign if he believes a pardon from President Pence *gag* is forthcoming.",
    "controversiality": 0,
    "ups": 136,
    "downs": 0,
    "score": 136,
    "created": 1487243310.0,
    "date_created": "2017-02-15",
    "time_created": "22:08:30",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt1oks",
    "parent_id": "t1_ddt0cqf",
    "subreddit_name_prefixed": "r/politics",
    "body": "No. If shit goes down and the whole Trump family gets caught up in a RICO-type scandal, their Secret Service protection (as mandated by law) will likely turn on them instantly and detain them until such time as they can be properly arrested by the FBI or similar agency. Moreover, I doubt any of the protectees could direct their agents to allow them to board a private aircraft without prior notice.\n\nTrump himself is boned. There's no way he gets outside the White House, much less makes it to an airport. He would literally need to be in whatever country he was planning on defecting to when he did it, and even then there's a question on whether he would be allowed to defect.\n\nBut let's say that Trump manages to dig a tunnel from underneath the Resolute desk to the outside world, make it to an airport, and board and take off on an aircraft owned by a foreign government (Russia, for example). Does the US shoot down the plane? It took 99 minutes from Kennedy's death to LBJ's swearing in. Assuming the cruising speed of a Gulfstream V, that puts Trump about 843 miles from the US coast in the Atlantic. He couldn't land anywhere in Western Europe or enter their airspace, so he'd be heading over the Arctic Circle. The range of our fully fueled Gulfstream V is about 7,000 miles, and its about 4900mi to Moscow.\n\nOn a practical level, it's certainly doable. No commercial or private airline could successfully evade a modern US Air Force fighter jet.\n\nAnd on a purely practical level, the idea of letting the guy that up until 90 minutes ago was privy to the country's most sensitive information defect to Russia would be an unconscionable breach of national security - he could not be allowed to touchdown in Moscow.\n\nSo ultimately, the first order of President Pence in this scenario would be to command the US Air Force to force Donald Trump's plane to land in the US or Canada, and failing that shoot it down.",
    "controversiality": 0,
    "ups": 299,
    "downs": 0,
    "score": 299,
    "created": 1487247150.0,
    "date_created": "2017-02-15",
    "time_created": "23:12:30",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt70fu",
    "parent_id": "t1_ddt5h0r",
    "subreddit_name_prefixed": "r/politics",
    "body": "But corporations are people, therefore buildings are people, therefore vandalism is violence. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1487256647.0,
    "date_created": "2017-02-16",
    "time_created": "01:50:47",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt5a8n",
    "parent_id": "t1_ddt3n40",
    "subreddit_name_prefixed": "r/politics",
    "body": "Can't be a school shooter if you dropped out of school",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1487253060.0,
    "date_created": "2017-02-16",
    "time_created": "00:51:00",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddszqbz",
    "parent_id": "t1_ddsyl35",
    "subreddit_name_prefixed": "r/politics",
    "body": "I bet that time was quite wild without the Internet providing constant updates on the goings on in dc. Pins and needles daily to hear the next big juicy thing happen, yea?",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1487244350.0,
    "date_created": "2017-02-15",
    "time_created": "22:25:50",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt1ty4",
    "parent_id": "t1_ddt0tmz",
    "subreddit_name_prefixed": "r/politics",
    "body": "That's fair. I get the anti establishment part and what trump represents in that regard. but he's too far gone. ",
    "controversiality": 0,
    "ups": 93,
    "downs": 0,
    "score": 93,
    "created": 1487247372.0,
    "date_created": "2017-02-15",
    "time_created": "23:16:12",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt293p",
    "parent_id": "t1_ddt0tmz",
    "subreddit_name_prefixed": "r/politics",
    "body": "You are a real American. I'm sure we disagree on most political issues (except being anti-establishment because obviously), but I have profound respect for you. I wish my fellow liberals were as intellectually honest when evaluating Barack's endless drone campaigns or his immigration EO. (don't get me wrong, I love the idea of it, but it was almost indefensibly unconstitutional)",
    "controversiality": 0,
    "ups": 152,
    "downs": 0,
    "score": 152,
    "created": 1487248008.0,
    "date_created": "2017-02-15",
    "time_created": "23:26:48",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2zct",
    "parent_id": "t1_ddt0tmz",
    "subreddit_name_prefixed": "r/politics",
    "body": "For what it's worth nobody likes corruption, cronyism, and the fact that our political systems are so dominated by lobbyists and donors. Nobody wants that, and virtually everyone can agree that \"the establishment\" is problematic. But those  that oppose Trump are mostly saying that the last person on earth we want to fix any of those problems is Donald Trump - and we say that because his track record and behavior does not lend credence to the idea that he can fix or even understands how to improve our democracy.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1487249137.0,
    "date_created": "2017-02-15",
    "time_created": "23:45:37",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt4unh",
    "parent_id": "t1_ddt0tmz",
    "subreddit_name_prefixed": "r/politics",
    "body": "I can respect your approach. Some of my friends who are more rational who voted for Trump are starting to reject him as well. I agreed with some of his ideas, but rejected him because of his propensity to divide people, his lying, and his neurotic narcissism. ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1487252262.0,
    "date_created": "2017-02-16",
    "time_created": "00:37:42",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt3arz",
    "parent_id": "t1_ddt0tmz",
    "subreddit_name_prefixed": "r/politics",
    "body": "What was your tipping point? Also, I think you're like me who doesn't support Trump but scavenges the memes.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1487249641.0,
    "date_created": "2017-02-15",
    "time_created": "23:54:01",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt692d",
    "parent_id": "t1_ddt5ham",
    "subreddit_name_prefixed": "r/politics",
    "body": "Good.  Fuck him.  Fuck his happiness.  I hope the burden of the presidency obliterates what little spark is keeping his cold, dead heart beating and ruins the remainder of his worthless life.",
    "controversiality": 0,
    "ups": 104,
    "downs": 0,
    "score": 104,
    "created": 1487254987.0,
    "date_created": "2017-02-16",
    "time_created": "01:23:07",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddszgdc",
    "parent_id": "t1_ddsyv16",
    "subreddit_name_prefixed": "r/politics",
    "body": "1) Who is the greatest person ever\n\nA) Trump\n\nB) Jesus\n\nC) All of the Above\n\nD) I'm Muslim",
    "controversiality": 0,
    "ups": 156,
    "downs": 0,
    "score": 156,
    "created": 1487243966.0,
    "date_created": "2017-02-15",
    "time_created": "22:19:26",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtb48p",
    "parent_id": "t1_ddt9bcs",
    "subreddit_name_prefixed": "r/politics",
    "body": "Libertarians would. Who are kind of fantasists but less actively evil. ",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1487268066.0,
    "date_created": "2017-02-16",
    "time_created": "05:01:06",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtb22j",
    "parent_id": "t1_ddtal1k",
    "subreddit_name_prefixed": "r/politics",
    "body": "More accurately, contorting what they have publicly stated them to be. ",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1487267874.0,
    "date_created": "2017-02-16",
    "time_created": "04:57:54",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtecsi",
    "parent_id": "t1_ddtal1k",
    "subreddit_name_prefixed": "r/politics",
    "body": "well, given what a vast majority of them said about DJT when he was running for office, it is amazing how quiet they all are. it's like a bunch of bully sidekicks seeing their leader getting taken to the principal's office...they're all cowering in the corner wondering what will come of their leader, afraid to break ranks for fear of retribution, but equally afraid to cower in the corner because of guilt by association.\n\nTL;DR: they've made their beds...and they can't decide whether to crawl back in those beds, or move the fuck out of the house entirely.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1487277442.0,
    "date_created": "2017-02-16",
    "time_created": "07:37:22",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtd4ct",
    "parent_id": "t1_ddtcf8s",
    "subreddit_name_prefixed": "r/politics",
    "body": "I swear nearly all our problems would be solved if we just passed a bill fixing the limit on Representatives to track population like it should.\n\nThat and some sort of automated redrawing of district lines at census time.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1487274380.0,
    "date_created": "2017-02-16",
    "time_created": "06:46:20",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtczj7",
    "parent_id": "t1_ddtbi2w",
    "subreddit_name_prefixed": "r/politics",
    "body": "\"He has balls\" = \"He's an asshole.\"\n\nThat's literally all it means. They enjoy being huge dickwaffles and are happy their shitty behavior is now being reflected in the highest office of the land.",
    "controversiality": 0,
    "ups": 163,
    "downs": 0,
    "score": 163,
    "created": 1487274008.0,
    "date_created": "2017-02-16",
    "time_created": "06:40:08",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtdz5y",
    "parent_id": "t1_ddtbi2w",
    "subreddit_name_prefixed": "r/politics",
    "body": "I live next to a shipyard and two bases. Lots of friends working at all three them (but I honestly know like 100+ people in the shipyard.) The workers in the shipyard love trump, the workers on the federal bases dislike him. The majority of shipyard workers don't go to college and got shipbuilding jobs after high school, the federal base workers got college degrees, commonly masters degrees. My girlfriend works at one of the bases (has her MBA,) she's heard one person talking pro-Trump and it's the only guy in her division without a degree. My best friend is a pipe-welder in the shipyard and completely surrounded by militaristic alpha males that LOVE trump endlessly but will not set foot in a political discussion. Education and military industrial complex, they've really pulled the wool over a good portion of our populations eyes.",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1487276580.0,
    "date_created": "2017-02-16",
    "time_created": "07:23:00",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtezog",
    "parent_id": "t1_ddtbi2w",
    "subreddit_name_prefixed": "r/politics",
    "body": "The military is split on trump just like the rest of the nation. \n\nThe people in the military that support trump tend to be the type to try and use their military status to impress people, if that makes sense. \n\nSo liberal democrats who are also marines (like myself) are far less likely to use their veteran or active duty status to try and add weight to their opinions. Because we don't think our jobs make us \"hero/patriot/mericans\" \n\nRepublicans worship the military. So the republican members of the military will flaunt their jobs to everyone they know. They love to be constantly thanked for their service. ",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1487278811.0,
    "date_created": "2017-02-16",
    "time_created": "08:00:11",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtfnn7",
    "parent_id": "t1_ddtbi2w",
    "subreddit_name_prefixed": "r/politics",
    "body": "I have a cousin who truly believes no Dem has ever done anything right and no Repub has ever done anything wrong. I'm truly an independent voter who has voted for both D's and R's in the past. It's impossible to have a conversation with him. After Trump was elected he texted me gloating and we had a \"discussion\" about Trump and I explained to him my biggest concern about a Trump presidency is foreign affairs since Trump can't even handle a celebrity bashing him on twitter how does he deal with a beligerante Kim Jung-Un? My cousins response: \"Don't worry, Trump isn't a fucking pussy like Obama! We'll be fine.\" That's it! No real explanation or critical thinking at all. It's baffling to me that that is the extent of his thought process on the matter. ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1487280097.0,
    "date_created": "2017-02-16",
    "time_created": "08:21:37",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddte00w",
    "parent_id": "t1_ddtbi2w",
    "subreddit_name_prefixed": "r/politics",
    "body": "Military guy here (15 years active, now reserves).  \n\nHe is the commander in chief. We follow his (edit - lawful) orders.  But I abso-fucking-lutely do not support him or his policies.\n\nEdit because I didn't want to keep getting called a nazi sheeple.",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1487276638.0,
    "date_created": "2017-02-16",
    "time_created": "07:23:58",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtd2z8",
    "parent_id": "t1_ddtbi2w",
    "subreddit_name_prefixed": "r/politics",
    "body": "Perhaps they mean literally and that's enough?",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1487274280.0,
    "date_created": "2017-02-16",
    "time_created": "06:44:40",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtgqf6",
    "parent_id": "t1_ddtbi2w",
    "subreddit_name_prefixed": "r/politics",
    "body": "I DONT FUCKING UNDERSTAND WHY MILITARY PEOPLE SUPPORT A GUY AND PARTY WHO DOES NOT GIVE A SHIT ABOUT THEM.\n\nThe next time someone asks why we let refugees in when there are homeless vets, ask them why Republicans struck down a bill that would have funded the VA to the tune of $21 billion.  That would have built new facilities, treated soldiers with PTSD, help keep them off the streets.\n\nWhen they predictably say it was too expensive, then ask them how much the fucking wall will cost, because that's at the low end... Coincidentally, $21 billion!!!\n\nWhen will the military realize that Democrats actually care about vets and Republicans don't actually give a shit about them???  They're being used for their lives and used as political strawmen, and it's sickening.\n\n",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1487281933.0,
    "date_created": "2017-02-16",
    "time_created": "08:52:13",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtcz73",
    "parent_id": "t1_ddtbi2w",
    "subreddit_name_prefixed": "r/politics",
    "body": "I mean, in the Era of a volunteer service, being in the military often means you come from a culture that celebrates war, so, the South, and are violent and stupid enough to think that the most heroic thing one can do is murdering a vague enemy.",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1487273983.0,
    "date_created": "2017-02-16",
    "time_created": "06:39:43",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtby55",
    "parent_id": "t1_ddtb2ym",
    "subreddit_name_prefixed": "r/politics",
    "body": ">a mechanic\n\nYou mean a snake oil salesman",
    "controversiality": 0,
    "ups": 45,
    "downs": 0,
    "score": 45,
    "created": 1487270776.0,
    "date_created": "2017-02-16",
    "time_created": "05:46:16",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtbxx5",
    "parent_id": "t1_ddtb2ym",
    "subreddit_name_prefixed": "r/politics",
    "body": "Clinton is not corrupt.  The implication that she's involved in all of this corrupt, quid pro quo, God knows what else is utter nonsense. \n\nLet's review.  Her charity has the highest possible rating and actually uses the vast majority of donated funds >80% iirc towards helping their target (as opposed to administrative costs, which even well known charities like the red Cross have a much lower percentage of funds donated actually going to help ppl bc they're squandered on admin). The implication was that donating to the charity got u an audience w the secretary of state. They continually cited the one example w the crown prince of X or some other such foreign figure that had significant status in his country. The secretary of state would meet with foreign leaders/dignitaries regardless of whether they made a small donation or not. Also there was no evidence of any quid pro quo - u donate and I'll use my office to somehow help you.  NONE. \n\nUgh I could go on and on, but clinton suffered unprecedented smearing via Bengazi hearings  (>10 of them for some reason.... oh right! to keep it in the headlines and tarnish her reputation), and even the emails were blown wildly out of proportion.  The fact is that the emails were never compromised.  And she did accidently pass on some classified information in less than 10 emails. Also in a number of those very few pertinent emails either 1. The info wasn't classified at the time or 2. Hadn't been properly denoted in the header when it was sent to her before she passed it along.\n\nShe's not corrupt.  There's no evidence to the contrary.  None whatsoever. ",
    "controversiality": 0,
    "ups": 51,
    "downs": 0,
    "score": 51,
    "created": 1487270755.0,
    "date_created": "2017-02-16",
    "time_created": "05:45:55",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtbizh",
    "parent_id": "t1_ddt9tpc",
    "subreddit_name_prefixed": "r/politics",
    "body": "His bucket of KFC had just arrived! What do you expect him to do? Eat it cold?",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1487269398.0,
    "date_created": "2017-02-16",
    "time_created": "05:23:18",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt8lve",
    "parent_id": "t1_ddt7wbi",
    "subreddit_name_prefixed": "r/politics",
    "body": "&gt;the mountain shit that the administration has done since\n\nWe are currently 3 hours into day 26 of this administration. \n\nThe Yemen raid was on day 9, and reported within 24 hours, so give or take, day 10. \n\nThe total days between Yemen raid reports and today: 16. \n\n**The mountain of shit that they buried this under was built in 16 days.** ",
    "controversiality": 0,
    "ups": 436,
    "downs": 0,
    "score": 436,
    "created": 1487260585.0,
    "date_created": "2017-02-16",
    "time_created": "02:56:25",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt8w9u",
    "parent_id": "t1_ddt7wbi",
    "subreddit_name_prefixed": "r/politics",
    "body": "Sadly, you're exactly right.  There's been an avalanche of bad news during the past 24 days, but nothing sticks because there isn't a chance for any one story to gain traction since, holy fuck, look out!!!!  ...here comes another one!",
    "controversiality": 0,
    "ups": 66,
    "downs": 0,
    "score": 66,
    "created": 1487261376.0,
    "date_created": "2017-02-16",
    "time_created": "03:09:36",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt8hb8",
    "parent_id": "t1_ddt85ng",
    "subreddit_name_prefixed": "r/politics",
    "body": "> It is one of the many insane blowups which have occurred in the last month since Trump took office.\n\nAnd it hasn't even been a month yet.  Today is only day 24.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1487260249.0,
    "date_created": "2017-02-16",
    "time_created": "02:50:49",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt92yb",
    "parent_id": "t1_ddt8hj1",
    "subreddit_name_prefixed": "r/politics",
    "body": "He got killed. Low energy!",
    "controversiality": 0,
    "ups": 75,
    "downs": 0,
    "score": 75,
    "created": 1487261896.0,
    "date_created": "2017-02-16",
    "time_created": "03:18:16",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt9hl1",
    "parent_id": "t1_ddt9ef1",
    "subreddit_name_prefixed": "r/politics",
    "body": "We need a term for politicians whose words and actions lead to more terrorism.",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1487263036.0,
    "date_created": "2017-02-16",
    "time_created": "03:37:16",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt9cnh",
    "parent_id": "t1_ddt8tq0",
    "subreddit_name_prefixed": "r/politics",
    "body": "Probably doesn't help, but \"them\" and \"us\" tribalism is as old as humanity (way older, in fact). It's nothing new and will never leave us completely. Not excusing it BTW. ",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1487262641.0,
    "date_created": "2017-02-16",
    "time_created": "03:30:41",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2za8",
    "parent_id": "t1_ddt2pwr",
    "subreddit_name_prefixed": "r/politics",
    "body": "It seems like I have but I don't remember the context. It just fits so well here. ",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1487249134.0,
    "date_created": "2017-02-15",
    "time_created": "23:45:34",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsvh1a",
    "parent_id": "t1_ddsus5n",
    "subreddit_name_prefixed": "r/politics",
    "body": "> We figured it out way back when...\n> But I guess a booster is required every now and again.\n\n\"The price of liberty is eternal vigilance\"",
    "controversiality": 0,
    "ups": 940,
    "downs": 0,
    "score": 940,
    "created": 1487238618.0,
    "date_created": "2017-02-15",
    "time_created": "20:50:18",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsynkc",
    "parent_id": "t1_ddsus5n",
    "subreddit_name_prefixed": "r/politics",
    "body": "I *just* found this video the other day on archive.org  Did not expect to see it here.  \n\n>remember when you hear this kind of talk, somebody is going to get something out of it, and it isn't going to be you",
    "controversiality": 0,
    "ups": 175,
    "downs": 0,
    "score": 175,
    "created": 1487242877.0,
    "date_created": "2017-02-15",
    "time_created": "22:01:17",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddswtx1",
    "parent_id": "t1_ddsus5n",
    "subreddit_name_prefixed": "r/politics",
    "body": "I don't think that the sentiment from that film ever took off in America. The idea of \"American Exceptionalism\" has always made us think that it couldn't happen here, but it has.",
    "controversiality": 0,
    "ups": 115,
    "downs": 0,
    "score": 115,
    "created": 1487240457.0,
    "date_created": "2017-02-15",
    "time_created": "21:20:57",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsxosf",
    "parent_id": "t1_ddsus5n",
    "subreddit_name_prefixed": "r/politics",
    "body": "I've come to expect it from Reddit that I'm like, \"Thanks, /u/DickButtwoman, for that sobering and relevant thought.\"",
    "controversiality": 0,
    "ups": 120,
    "downs": 0,
    "score": 120,
    "created": 1487241621.0,
    "date_created": "2017-02-15",
    "time_created": "21:40:21",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsvg6d",
    "parent_id": "t1_ddsus5n",
    "subreddit_name_prefixed": "r/politics",
    "body": "Thanks for sharing that. It's frighteningly relevant.",
    "controversiality": 0,
    "ups": 64,
    "downs": 0,
    "score": 64,
    "created": 1487238587.0,
    "date_created": "2017-02-15",
    "time_created": "20:49:47",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsvcav",
    "parent_id": "t1_ddsus5n",
    "subreddit_name_prefixed": "r/politics",
    "body": "That was awesome. I'm going to show this to my students.",
    "controversiality": 0,
    "ups": 126,
    "downs": 0,
    "score": 126,
    "created": 1487238444.0,
    "date_created": "2017-02-15",
    "time_created": "20:47:24",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsxq56",
    "parent_id": "t1_ddsus5n",
    "subreddit_name_prefixed": "r/politics",
    "body": "Ok while I'm passing through can someone give me the lowdown on why this Milo character is so in demand. What are his qualifications? What is he supposed to be an authority on? What is he saying that right-leaning groups at universities want to see him say in person so badly? All I hear about is the ruckus a potential appearance causes.",
    "controversiality": 0,
    "ups": 97,
    "downs": 0,
    "score": 97,
    "created": 1487241672.0,
    "date_created": "2017-02-15",
    "time_created": "21:41:12",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsx0c7",
    "parent_id": "t1_ddsus5n",
    "subreddit_name_prefixed": "r/politics",
    "body": "That is powerful stuff. Thanks for sharing!\n\nedit: I just got to the part where he said they would be able to resist if they banded together & stood up for one another. I'd like to think that's what liberals are doing at every protest & march we attend. We're doing everything in our power to keep him from dividing us. Maybe we did learn a thing or two!",
    "controversiality": 0,
    "ups": 76,
    "downs": 0,
    "score": 76,
    "created": 1487240699.0,
    "date_created": "2017-02-15",
    "time_created": "21:24:59",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2jff",
    "parent_id": "t1_ddsus5n",
    "subreddit_name_prefixed": "r/politics",
    "body": ">In Nazi Germany, you had to get your information from Dr Goebbels. He knew what was best for you.\n\n",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1487248455.0,
    "date_created": "2017-02-15",
    "time_created": "23:34:15",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt19xf",
    "parent_id": "t1_ddsz4kx",
    "subreddit_name_prefixed": "r/politics",
    "body": "It's good that we will still have disagreements when this is all over. Debate is good for democracy.",
    "controversiality": 0,
    "ups": 78,
    "downs": 0,
    "score": 78,
    "created": 1487246545.0,
    "date_created": "2017-02-15",
    "time_created": "23:02:25",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2g84",
    "parent_id": "t1_ddsz4kx",
    "subreddit_name_prefixed": "r/politics",
    "body": "British social democrat here, and I'll gladly join you in opposing this crazy populist wave. We may disagree economically, but I feel that we share fundamental social values (I'm imagining you as a David Cameron-esque socially liberal neo-liberal). That means I disagree with you but don't hate and fear you. I can't say the same for the likes of Trump, Le Pen etc.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1487248319.0,
    "date_created": "2017-02-15",
    "time_created": "23:31:59",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddszww7",
    "parent_id": "t1_ddsvplo",
    "subreddit_name_prefixed": "r/politics",
    "body": "How great will it look when it's shamefully dragged away from the White House in handcuffs?",
    "controversiality": 0,
    "ups": 58,
    "downs": 0,
    "score": 58,
    "created": 1487244605.0,
    "date_created": "2017-02-15",
    "time_created": "22:30:05",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt76ld",
    "parent_id": "t1_ddt4s81",
    "subreddit_name_prefixed": "r/politics",
    "body": "We're one false flag terrorist attack away from the fourth Reich. We've seen it before and can see it again: Americans lose all perspective about rights and politics when someone blows up a building",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1487257040.0,
    "date_created": "2017-02-16",
    "time_created": "01:57:20",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsvk9u",
    "parent_id": "t1_ddsvhe9",
    "subreddit_name_prefixed": "r/politics",
    "body": "After these last two days, my thoughts are less apocalyptic.  We might just make it through this.  Well be a changed country for sure, but our democracy will be together.",
    "controversiality": 0,
    "ups": 251,
    "downs": 0,
    "score": 251,
    "created": 1487238740.0,
    "date_created": "2017-02-15",
    "time_created": "20:52:20",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddszdgl",
    "parent_id": "t1_ddsvhe9",
    "subreddit_name_prefixed": "r/politics",
    "body": "And remember when we thought Bush was the worst thing that could possibly happen? So naive",
    "controversiality": 0,
    "ups": 58,
    "downs": 0,
    "score": 58,
    "created": 1487243855.0,
    "date_created": "2017-02-15",
    "time_created": "22:17:35",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsxtmj",
    "parent_id": "t1_ddsx6vg",
    "subreddit_name_prefixed": "r/politics",
    "body": "I completely agree.  Our ability to rationally discuss issues with multiple sane positions is integral to our democracy.  With Trump at the helm, this is threaten by his example.  He simply is not fit for a to be a leader.",
    "controversiality": 0,
    "ups": 51,
    "downs": 0,
    "score": 51,
    "created": 1487241798.0,
    "date_created": "2017-02-15",
    "time_created": "21:43:18",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2g4i",
    "parent_id": "t1_ddt14jy",
    "subreddit_name_prefixed": "r/politics",
    "body": "How could you forget making the guy who has spent his career submitting lawsuits against the EPA to run it?",
    "controversiality": 0,
    "ups": 421,
    "downs": 0,
    "score": 421,
    "created": 1487248314.0,
    "date_created": "2017-02-15",
    "time_created": "23:31:54",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt1qlv",
    "parent_id": "t1_ddt14jy",
    "subreddit_name_prefixed": "r/politics",
    "body": "Don't forget the zany retired brain surgeon picked to run Housing & Urab Development. Trump probably just heard the word \"Urban\" and picked a black guy",
    "controversiality": 0,
    "ups": 177,
    "downs": 0,
    "score": 177,
    "created": 1487247234.0,
    "date_created": "2017-02-15",
    "time_created": "23:13:54",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt34lz",
    "parent_id": "t1_ddt15ii",
    "subreddit_name_prefixed": "r/politics",
    "body": "The only religious ties to the GOP are manipulations of Christianity. People that care about what Jesus told us to do(the very definition of a Christian) welcome the stranger and care for the poor. Which political party does that sound like? When Jesus came he created a new covenant. He said yes the old rules matter but the greatest of these is love. I don't see a lot of love coming from the GOP. These voters have been brainwashed into thinking abortion=murder and gays/trans are abomination. The GOP realized a lot of people base their votes solely on religion and ignore the rest and they capitalized on it. ",
    "controversiality": 0,
    "ups": 101,
    "downs": 0,
    "score": 101,
    "created": 1487249365.0,
    "date_created": "2017-02-15",
    "time_created": "23:49:25",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt3bmy",
    "parent_id": "t1_ddt0t3j",
    "subreddit_name_prefixed": "r/politics",
    "body": "I'm curious what do you make of Trudeau's meeting with Trump?",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1487249681.0,
    "date_created": "2017-02-15",
    "time_created": "23:54:41",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2cip",
    "parent_id": "t1_ddt16i2",
    "subreddit_name_prefixed": "r/politics",
    "body": "I'm left leaning mostly, didn't like Hilary (and I'm the odd man out - didn't like Bernie really either, though more than her) and when faced to decide between the two, my thought process was, \"Yeah, I think Hilary is probably corrupt, but she's corrupt in the way politicians *normally* are\".\n\nTrump is an utter buffoon and I'm upset he'll forever stain our list of presidents.",
    "controversiality": 0,
    "ups": 335,
    "downs": 0,
    "score": 335,
    "created": 1487248156.0,
    "date_created": "2017-02-15",
    "time_created": "23:29:16",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2d26",
    "parent_id": "t1_ddt16i2",
    "subreddit_name_prefixed": "r/politics",
    "body": "Hell, it's also the wording many liberals had to use to try to convince their Berner friends not to vote for Trump just to watch the world burn.  I spent plenty of time trying to convince people that Hillary isn't the antichrist - people whose stance on progressive issues is basically the antithesis of Trump or Pence.",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1487248179.0,
    "date_created": "2017-02-15",
    "time_created": "23:29:39",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt4rdq",
    "parent_id": "t1_ddt2bva",
    "subreddit_name_prefixed": "r/politics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1487252099.0,
    "date_created": "2017-02-16",
    "time_created": "00:34:59",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt6656",
    "parent_id": "t1_ddt2bva",
    "subreddit_name_prefixed": "r/politics",
    "body": "Unfortunately, by far the biggest problem with America is fucking Americans. :/",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1487254822.0,
    "date_created": "2017-02-16",
    "time_created": "01:20:22",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt31z6",
    "parent_id": "t1_ddt2gs2",
    "subreddit_name_prefixed": "r/politics",
    "body": "People seem to often forget that this guy was elected president. I personally think he's a moron, but most of the people I know that voted for him haven't really changed their minds",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1487249250.0,
    "date_created": "2017-02-15",
    "time_created": "23:47:30",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2w8d",
    "parent_id": "t1_ddt17p6",
    "subreddit_name_prefixed": "r/politics",
    "body": "Remember the good ol' days when the issue du jour was public breastfeeding?",
    "controversiality": 0,
    "ups": 123,
    "downs": 0,
    "score": 123,
    "created": 1487249003.0,
    "date_created": "2017-02-15",
    "time_created": "23:43:23",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt1hte",
    "parent_id": "t1_ddt0q4t",
    "subreddit_name_prefixed": "r/politics",
    "body": "Ah, here comes President Ryan. Holy shit, that'll be a conservative wet dream. ",
    "controversiality": 0,
    "ups": 47,
    "downs": 0,
    "score": 47,
    "created": 1487246871.0,
    "date_created": "2017-02-15",
    "time_created": "23:07:51",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt6xg4",
    "parent_id": "t1_ddt5lxy",
    "subreddit_name_prefixed": "r/politics",
    "body": "I'm confident that you could introduce Kim to Trump as the President of East Korea and Trump would believe you.",
    "controversiality": 0,
    "ups": 83,
    "downs": 0,
    "score": 83,
    "created": 1487256455.0,
    "date_created": "2017-02-16",
    "time_created": "01:47:35",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt3vb3",
    "parent_id": "t1_ddt15jq",
    "subreddit_name_prefixed": "r/politics",
    "body": "He'll go down as the greatest, best Eenie-Meanie-Miney-Moe President ever. The best.",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1487250574.0,
    "date_created": "2017-02-16",
    "time_created": "00:09:34",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt4011",
    "parent_id": "t1_ddt22mz",
    "subreddit_name_prefixed": "r/politics",
    "body": "According to Trump, Kushner's the man who's going to solve the conflict in Israel/Palestine...because what we were lacking in those decades of failed diplomacy was more billionaire real-estate playboys. ",
    "controversiality": 0,
    "ups": 132,
    "downs": 0,
    "score": 132,
    "created": 1487250789.0,
    "date_created": "2017-02-16",
    "time_created": "00:13:09",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddszjvm",
    "parent_id": "t1_ddsyk8r",
    "subreddit_name_prefixed": "r/politics",
    "body": "He really is ... I'm pretty sure he's checked out at least 50% of the time based on the slip ups I've seen like this. The dude isn't all there, he's either not mentally well, or so out of his league he doesn't even pretend to care",
    "controversiality": 0,
    "ups": 157,
    "downs": 0,
    "score": 157,
    "created": 1487244101.0,
    "date_created": "2017-02-15",
    "time_created": "22:21:41",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt0qwe",
    "parent_id": "t1_ddsyk8r",
    "subreddit_name_prefixed": "r/politics",
    "body": "he's 70. So, surely he can't see shit he has to read. He's too vain to wear glasses in public. He even says in a deposition he can't read something that's in front of him because he didn't bring his glasses. If he had some contacts in so he could read what was in front of him, might have some problem with distance focus. A bunch of old guys wearing the exact same dark blue suit sitting around a table, I'm maybe going to have trouble making them out too if I'm wearing my reading glasses.\n\nNever wore contacts though so maybe I am full of it.\n",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1487245795.0,
    "date_created": "2017-02-15",
    "time_created": "22:49:55",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2a8m",
    "parent_id": "t1_ddsyk8r",
    "subreddit_name_prefixed": "r/politics",
    "body": "It's called dementia. ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1487248058.0,
    "date_created": "2017-02-15",
    "time_created": "23:27:38",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt52mp",
    "parent_id": "t1_ddt1vj2",
    "subreddit_name_prefixed": "r/politics",
    "body": "Well, they are doing it 'now' depending on how you define time.",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1487252668.0,
    "date_created": "2017-02-16",
    "time_created": "00:44:28",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsze4a",
    "parent_id": "t1_ddsyz5k",
    "subreddit_name_prefixed": "r/politics",
    "body": "I gotta say I do think he's a moron. \"Where's Rudy?\" comes to mind.",
    "controversiality": 0,
    "ups": 106,
    "downs": 0,
    "score": 106,
    "created": 1487243881.0,
    "date_created": "2017-02-15",
    "time_created": "22:18:01",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddszzvd",
    "parent_id": "t1_ddsyz5k",
    "subreddit_name_prefixed": "r/politics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 74,
    "downs": 0,
    "score": 74,
    "created": 1487244717.0,
    "date_created": "2017-02-15",
    "time_created": "22:31:57",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt13r5",
    "parent_id": "t1_ddsyz5k",
    "subreddit_name_prefixed": "r/politics",
    "body": "I really can't say. The man has no humility, and is completely unable to save face - despite the enormity of it. I can only imagine that he will declare any movements towards impeachment to be \"unfair\" and \"rigged\", as he sticks it out to the bitter end.\n\nThe crowd size of his inauguration, the popular vote.. even in the presence of the most disputable controversies involved, he is *always* the winner, the most tremendous winner - in his own head. Humility is like kryptonite to his ego.\n",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1487246300.0,
    "date_created": "2017-02-15",
    "time_created": "22:58:20",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2de6",
    "parent_id": "t1_ddt1oks",
    "subreddit_name_prefixed": "r/politics",
    "body": "Could you imagine watching this on TV as it unfolds? It'd be like watching the white bronco all over again.",
    "controversiality": 0,
    "ups": 185,
    "downs": 0,
    "score": 185,
    "created": 1487248194.0,
    "date_created": "2017-02-15",
    "time_created": "23:29:54",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2ax0",
    "parent_id": "t1_ddt1oks",
    "subreddit_name_prefixed": "r/politics",
    "body": "That was reassuring, thank you. ",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1487248087.0,
    "date_created": "2017-02-15",
    "time_created": "23:28:07",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2g5p",
    "parent_id": "t1_ddszqbz",
    "subreddit_name_prefixed": "r/politics",
    "body": "Not op, but, yeah.  Information flow, even if you had access to 2+ important newspapers and CBS News at 6, was far, far slower.  It makes me wonder how people chose candidates prior to the days of radio.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1487248315.0,
    "date_created": "2017-02-15",
    "time_created": "23:31:55",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt8zr5",
    "parent_id": "t1_ddt1ty4",
    "subreddit_name_prefixed": "r/politics",
    "body": "The thing about his anti-establishment bent is that it was (clearly) pure talk to get votes. He had zero intention of doing anything anti-establishment as is clear from his Cabinet picks and the way he's run his Presidency so far.\n\nI think this is why Bernie is gaining so much momentum, because he is an actual anti-establishment candidate with the record to prove it.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1487261650.0,
    "date_created": "2017-02-16",
    "time_created": "03:14:10",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt71uc",
    "parent_id": "t1_ddt1ty4",
    "subreddit_name_prefixed": "r/politics",
    "body": "What he said he represented, at least.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1487256737.0,
    "date_created": "2017-02-16",
    "time_created": "01:52:17",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt85ny",
    "parent_id": "t1_ddt293p",
    "subreddit_name_prefixed": "r/politics",
    "body": "I've heard a good deal of liberals talk about their hate of the drone strikes or the expanded and continued spying on the country's own citizens. But aside from those things I was extremely pleased with Obama and it's a shame the GOP couldn't be more centrist so that the country could've been less polarized and we could've actually got shit done in the last 8 years.",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1487259410.0,
    "date_created": "2017-02-16",
    "time_created": "02:36:50",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt3l8z",
    "parent_id": "t1_ddt3arz",
    "subreddit_name_prefixed": "r/politics",
    "body": "There have been so many tipping points I can't even begin to tell ya.\n\nThe \"maybe the second ammendment people...\" line was the beginning of me realizing there might be something wrong with him but I figured it totally wasn't what he meant.\n\nThe closest you'd get to a binary tipping point is the disaster of his immigration EO. I don't even explicitly disagree with it, but it was obviously a clusterfuck and betrayed a very poor understanding of his role in running the nation. The idea of banning people with green cards is simple appalling.\n\nOverall I just slowly realized that, whereas yeah everyone slips up sometimes and deserves to explain what they really meant (this includes world leaders, they should be held to high standard but they are people), if legit anytime you open your mouth you need an army of media whipping boys and half the internet to explain why you aren't racist or sexist or whathaveyou... maybe you are the problem and not people's interpretations of what you are saying.",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1487250111.0,
    "date_created": "2017-02-16",
    "time_created": "00:01:51",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt6e3k",
    "parent_id": "t1_ddt692d",
    "subreddit_name_prefixed": "r/politics",
    "body": "That outcome seems more and more likely every day. ",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1487255284.0,
    "date_created": "2017-02-16",
    "time_created": "01:28:04",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt34qg",
    "parent_id": "t1_ddszgdc",
    "subreddit_name_prefixed": "r/politics",
    "body": "Nah heres the real quiz\n\nAre you now, or have you ever been, black?",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1487249370.0,
    "date_created": "2017-02-15",
    "time_created": "23:49:30",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtbb1r",
    "parent_id": "t1_ddtb48p",
    "subreddit_name_prefixed": "r/politics",
    "body": "I'll take naive idealists over whimsical biblical-law pushing holier than thou ignoramuses.  The Republican party strives to be the king of ashes.  To sacrifice everything in the name of national security so we can have a safe nation with no ideals.",
    "controversiality": 0,
    "ups": 72,
    "downs": 0,
    "score": 72,
    "created": 1487268682.0,
    "date_created": "2017-02-16",
    "time_created": "05:11:22",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtca35",
    "parent_id": "t1_ddtb48p",
    "subreddit_name_prefixed": "r/politics",
    "body": "I wish, but you have to remember that running a \"social conservative\" platform instantly nets you like 40% support in this country ... just by virtue of the abortion wedge issue. It's difficult to see the extremist religious element going away.  ",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1487271860.0,
    "date_created": "2017-02-16",
    "time_created": "06:04:20",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtritq",
    "parent_id": "t1_ddtczj7",
    "subreddit_name_prefixed": "r/politics",
    "body": "Bingo. If you make it sound like being an ass is just 'fulfilling your natural male instincts', you never have to face the fact that you're a terrible human being.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1487295074.0,
    "date_created": "2017-02-16",
    "time_created": "12:31:14",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtfe9r",
    "parent_id": "t1_ddtezog",
    "subreddit_name_prefixed": "r/politics",
    "body": "I'm sure there's dissenters but no way is the military anywhere near 50/50 split. ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1487279616.0,
    "date_created": "2017-02-16",
    "time_created": "08:13:36",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtca3u",
    "parent_id": "t1_ddtbxx5",
    "subreddit_name_prefixed": "r/politics",
    "body": "You're right, that's not corruption. Thanks for explaining it to me. What they had against her was nothing, and I really mean \"nothing\", compared to what the politicians in my country do. But that's what *they* like to claim when pointing fingers at all her wrongdoings (as if the opponent candidate had a clean record), that's why I used the same word. \n\nThank you again for explaining.",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1487271862.0,
    "date_created": "2017-02-16",
    "time_created": "06:04:22",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtciht",
    "parent_id": "t1_ddtbizh",
    "subreddit_name_prefixed": "r/politics",
    "body": "Couldn't he just chow down in the situation room?  Shit, bring extra for everybody.  Pizza party!  No?  Does the situation room have an sundae bar?  It should.  What the fuck are my taxes for then?  Jeez. Lou. Ease.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1487272601.0,
    "date_created": "2017-02-16",
    "time_created": "06:16:41",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtc28f",
    "parent_id": "t1_ddtbizh",
    "subreddit_name_prefixed": "r/politics",
    "body": "The bar with Trump is now set so low that I don't even expect him to eat it with his fingers.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1487271144.0,
    "date_created": "2017-02-16",
    "time_created": "05:52:24",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt9938",
    "parent_id": "t1_ddt8lve",
    "subreddit_name_prefixed": "r/politics",
    "body": "Well, the last week HAS been an insane parade of fuckup after fuckup",
    "controversiality": 0,
    "ups": 91,
    "downs": 0,
    "score": 91,
    "created": 1487262369.0,
    "date_created": "2017-02-16",
    "time_created": "03:26:09",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt9u3g",
    "parent_id": "t1_ddt8lve",
    "subreddit_name_prefixed": "r/politics",
    "body": "So thats how he's planning to build the wall. With bullshit. ",
    "controversiality": 0,
    "ups": 70,
    "downs": 0,
    "score": 70,
    "created": 1487264054.0,
    "date_created": "2017-02-16",
    "time_created": "03:54:14",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtabyi",
    "parent_id": "t1_ddt92yb",
    "subreddit_name_prefixed": "r/politics",
    "body": "Sad.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1487265553.0,
    "date_created": "2017-02-16",
    "time_created": "04:19:13",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtaqli",
    "parent_id": "t1_ddt9hl1",
    "subreddit_name_prefixed": "r/politics",
    "body": "[demagogue](https://en.wikipedia.org/wiki/Demagogue) I just found my new favorite word to describe Trump. I still maintain he is a textbook definition of a [Megalomaniac or (NPD)](https://en.wikipedia.org/wiki/Narcissistic_personality_disorder)",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1487266832.0,
    "date_created": "2017-02-16",
    "time_created": "04:40:32",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtagv8",
    "parent_id": "t1_ddt9hl1",
    "subreddit_name_prefixed": "r/politics",
    "body": "Republican",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1487265971.0,
    "date_created": "2017-02-16",
    "time_created": "04:26:11",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt9i7f",
    "parent_id": "t1_ddt9cnh",
    "subreddit_name_prefixed": "r/politics",
    "body": "Yeah, agreed, and it is a good portion of the reason why I'm so worried. It seems to be hardwired into people. I don't know why only some of us are able to break free from it (or, and I wonder if this is more correct, why only some people are able to widen their sense of 'this person is in my group' to include everyone.) ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1487263086.0,
    "date_created": "2017-02-16",
    "time_created": "03:38:06",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt33ao",
    "parent_id": "t1_ddt2za8",
    "subreddit_name_prefixed": "r/politics",
    "body": "I worked on a ship and someone hung a flag with this statement from their top bunk. ",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1487249308.0,
    "date_created": "2017-02-15",
    "time_created": "23:48:28",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt00qh",
    "parent_id": "t1_ddsvh1a",
    "subreddit_name_prefixed": "r/politics",
    "body": "http://imgur.com/a/etMnk",
    "controversiality": 0,
    "ups": 216,
    "downs": 0,
    "score": 216,
    "created": 1487244749.0,
    "date_created": "2017-02-15",
    "time_created": "22:32:29",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddswlk4",
    "parent_id": "t1_ddsvh1a",
    "subreddit_name_prefixed": "r/politics",
    "body": "Well you're obviously a liberal. The right wing always said the price was \"the blood of patriots.\"\n\nPatriots meaning other Americans with different views. \n\n",
    "controversiality": 0,
    "ups": 339,
    "downs": 0,
    "score": 339,
    "created": 1487240148.0,
    "date_created": "2017-02-15",
    "time_created": "21:15:48",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2jhk",
    "parent_id": "t1_ddswtx1",
    "subreddit_name_prefixed": "r/politics",
    "body": "American Exceptionalism has caused a lot of problems.\n\n\"Gun control might work in other countries, but never here!\"\n\n\"Worker's rights might work in other countries, but never here!\"\n\n\"Socialized healthcare might work in other countries, but never here!\"",
    "controversiality": 0,
    "ups": 226,
    "downs": 0,
    "score": 226,
    "created": 1487248458.0,
    "date_created": "2017-02-15",
    "time_created": "23:34:18",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt0ifo",
    "parent_id": "t1_ddsxosf",
    "subreddit_name_prefixed": "r/politics",
    "body": "that's why /r/BestOf is one of my favorite subs. Threads like \"/u/pussydestroyer420 explains how to maximize your 401k\"",
    "controversiality": 0,
    "ups": 107,
    "downs": 0,
    "score": 107,
    "created": 1487245447.0,
    "date_created": "2017-02-15",
    "time_created": "22:44:07",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsxnl5",
    "parent_id": "t1_ddsvcav",
    "subreddit_name_prefixed": "r/politics",
    "body": "I was impressed that it was a military video - though we certainly do still have training on diversity. I'd like to show it to my Sailors sometime.",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1487241575.0,
    "date_created": "2017-02-15",
    "time_created": "21:39:35",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2abe",
    "parent_id": "t1_ddsxq56",
    "subreddit_name_prefixed": "r/politics",
    "body": "He's a rich British gay guy who writes for Breitbart and trolls and strawmans Left wing ideals and values. He tends to spout extreme homophobia and does things like take pictures of fat people in the gym to shame them.\n\nThe Right love this shit and, from what I gather, they seem to think that being gay means the Left are hypocrites if they criticise or protest him.",
    "controversiality": 0,
    "ups": 176,
    "downs": 0,
    "score": 176,
    "created": 1487248061.0,
    "date_created": "2017-02-15",
    "time_created": "23:27:41",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddszwt6",
    "parent_id": "t1_ddsxq56",
    "subreddit_name_prefixed": "r/politics",
    "body": "He's the token gay guy they can point to.",
    "controversiality": 0,
    "ups": 199,
    "downs": 0,
    "score": 199,
    "created": 1487244602.0,
    "date_created": "2017-02-15",
    "time_created": "22:30:02",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddszjea",
    "parent_id": "t1_ddsxq56",
    "subreddit_name_prefixed": "r/politics",
    "body": "It's *ONLY* because people on the left don't like him. That's why he is in demand. They care of nothing but causing \"liberal tears\" when they ask for him.",
    "controversiality": 0,
    "ups": 148,
    "downs": 0,
    "score": 148,
    "created": 1487244081.0,
    "date_created": "2017-02-15",
    "time_created": "22:21:21",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt1ho0",
    "parent_id": "t1_ddsxq56",
    "subreddit_name_prefixed": "r/politics",
    "body": "He is a off line troll.  He is intended to get people pissed off, over-react, and make them look narrow minded and extreme themselves.",
    "controversiality": 0,
    "ups": 48,
    "downs": 0,
    "score": 48,
    "created": 1487246865.0,
    "date_created": "2017-02-15",
    "time_created": "23:07:45",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2gfr",
    "parent_id": "t1_ddt19xf",
    "subreddit_name_prefixed": "r/politics",
    "body": "You have no idea how much I want to get back to arguing about governments place in health care or minimum wage.  This white nationalism and facsism is exhausting.  ",
    "controversiality": 0,
    "ups": 147,
    "downs": 0,
    "score": 147,
    "created": 1487248327.0,
    "date_created": "2017-02-15",
    "time_created": "23:32:07",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt1id4",
    "parent_id": "t1_ddszww7",
    "subreddit_name_prefixed": "r/politics",
    "body": "Do you really think the people this man inspires will suddenly be embarrassed?",
    "controversiality": 0,
    "ups": 47,
    "downs": 0,
    "score": 47,
    "created": 1487246894.0,
    "date_created": "2017-02-15",
    "time_created": "23:08:14",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsvvsf",
    "parent_id": "t1_ddsvk9u",
    "subreddit_name_prefixed": "r/politics",
    "body": "Me, too. I was very worried there for a while, since it seemed like there were no checks and balances. The Republican Congress doesn't give a fuck.\n\nBut the courts and our intelligence agencies are stepping up to protect the Constitution, and I'm a bit more optimistic.",
    "controversiality": 0,
    "ups": 325,
    "downs": 0,
    "score": 325,
    "created": 1487239180.0,
    "date_created": "2017-02-15",
    "time_created": "20:59:40",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsvqwi",
    "parent_id": "t1_ddsvk9u",
    "subreddit_name_prefixed": "r/politics",
    "body": "That's the spirit, I'm with ya there.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1487238990.0,
    "date_created": "2017-02-15",
    "time_created": "20:56:30",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsxlsv",
    "parent_id": "t1_ddsvk9u",
    "subreddit_name_prefixed": "r/politics",
    "body": "Laws will be passed that prevent culty dumbasses from holding office.",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1487241511.0,
    "date_created": "2017-02-15",
    "time_created": "21:38:31",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsz0bt",
    "parent_id": "t1_ddsvk9u",
    "subreddit_name_prefixed": "r/politics",
    "body": "when I saw the response to the Trump muslim ban was for spontaneous protests to set fire across the entire nation, I gained hope for this country ",
    "controversiality": 0,
    "ups": 37,
    "downs": 0,
    "score": 37,
    "created": 1487243355.0,
    "date_created": "2017-02-15",
    "time_created": "22:09:15",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddszhke",
    "parent_id": "t1_ddszdgl",
    "subreddit_name_prefixed": "r/politics",
    "body": "I've found myself longing for the ineptitude of Bush. While he was terrible, I never felt like he wanted to destroy the country.",
    "controversiality": 0,
    "ups": 85,
    "downs": 0,
    "score": 85,
    "created": 1487244012.0,
    "date_created": "2017-02-15",
    "time_created": "22:20:12",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt10vr",
    "parent_id": "t1_ddsxtmj",
    "subreddit_name_prefixed": "r/politics",
    "body": "He's a paper man. There is no depth to anything he says.",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1487246186.0,
    "date_created": "2017-02-15",
    "time_created": "22:56:26",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt56ms",
    "parent_id": "t1_ddt2g4i",
    "subreddit_name_prefixed": "r/politics",
    "body": "Still eight in the works, in which he would be both prosecution and defense? Not sure if there's anything that prevents that.",
    "controversiality": 0,
    "ups": 70,
    "downs": 0,
    "score": 70,
    "created": 1487252872.0,
    "date_created": "2017-02-16",
    "time_created": "00:47:52",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt6hv0",
    "parent_id": "t1_ddt2g4i",
    "subreddit_name_prefixed": "r/politics",
    "body": "To be fair, it's hard to keep up with all the fuckery in the Trump administration.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1487255505.0,
    "date_created": "2017-02-16",
    "time_created": "01:31:45",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt1wy6",
    "parent_id": "t1_ddt1qlv",
    "subreddit_name_prefixed": "r/politics",
    "body": "That was the Doctor Sleepy I mentioned.",
    "controversiality": 0,
    "ups": 192,
    "downs": 0,
    "score": 192,
    "created": 1487247496.0,
    "date_created": "2017-02-15",
    "time_created": "23:18:16",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2gn4",
    "parent_id": "t1_ddt1qlv",
    "subreddit_name_prefixed": "r/politics",
    "body": "Not just any black guy, the token black guy. ",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1487248336.0,
    "date_created": "2017-02-15",
    "time_created": "23:32:16",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt75wz",
    "parent_id": "t1_ddt34lz",
    "subreddit_name_prefixed": "r/politics",
    "body": "The [Matthew 25 Movement](http://justice.crcna.org/matthew-25-movement) is gaining traction in some religious communities, though...a sign of hope.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1487256996.0,
    "date_created": "2017-02-16",
    "time_created": "01:56:36",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt8y5r",
    "parent_id": "t1_ddt34lz",
    "subreddit_name_prefixed": "r/politics",
    "body": "So I've been kind of on a crusade (no pun intended) on Facebook...  Basically if I see fake news or any type of misleading BS being shared I call my friends and family out on it.  Its really shed a light on how delusional some of these people are. I have a family member in particular that talks about Trump as if his hand our president's hand is being guided by Jesus himself.  My conversation with that family member was so one sided it was comical. I'd reply with facts and reasonable conclusions thanks to just a little bit of critical thinking. But the usual reply was that I need to find Jesus in my heart and ultimately led to me being blocked when I questioned Trumps actions as not being very Christian like.  ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1487261525.0,
    "date_created": "2017-02-16",
    "time_created": "03:12:05",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt3m46",
    "parent_id": "t1_ddt3bmy",
    "subreddit_name_prefixed": "r/politics",
    "body": "I don't think Trudeau's visit meant much to the US, Canada isn't too important, but I thought that Trudeau outclassed Trump in every way. From stopping his dumbass alpha male/80s real estate seminar handshake in it's tracks, to giving cohesive, actual answers in both English and French, he made Trump look like a moron. Trump could barely get through his prepared statement, and couldn't answer a simple question and instead relied on his 'electoral college landslide' crap again. He's deranged and out of his league in the presence of other world leaders.",
    "controversiality": 0,
    "ups": 77,
    "downs": 0,
    "score": 77,
    "created": 1487250150.0,
    "date_created": "2017-02-16",
    "time_created": "00:02:30",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2hvg",
    "parent_id": "t1_ddt2cip",
    "subreddit_name_prefixed": "r/politics",
    "body": "There's pretty much nothing negative you can say about Hilary that you can't also say about Trump. And then some. ",
    "controversiality": 0,
    "ups": 277,
    "downs": 0,
    "score": 277,
    "created": 1487248389.0,
    "date_created": "2017-02-15",
    "time_created": "23:33:09",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt4mur",
    "parent_id": "t1_ddt31z6",
    "subreddit_name_prefixed": "r/politics",
    "body": "This. Trump didn't just happen. Trump didn't coup his way to the White House. He was voted in there. People need to acknowledge that. Almost 63 million people voted for him. He had a very strong support. He won a shitton of states. And you can't sweep that under the rug  and pretend like everything is great and the country is united against him because there are protests- he was put in power by the people. Yes, you can discuss the electorate system's role in it, but everybody knew the rules beforehand. And he was voted in, by 63 million people who though'd he'd be an appropriate president. Who wanted him to lead. \n\nIn a way, it's lucky that he's so incompetent, because that way it might be possible to get rid of him. But next time the fascist might not be a bumbling orange idiot who'll repeatedly screw up enough to be replaced. That 63 million population that is prepared to vote for  demagogue- that's a problem that needs fixing, whether it's through education or a boost in the rural job market or whatever. Replacing Trump, if it's done, won't make them go away. \n  \nAnd I wouldn't talk about a united country rising up against him when a very large part of that same country chose him. Had American values been what people pretend they are, Trump wouldn't even have made it to become a candidate. \n\nEdit: Thank you for my first gold ever, kind Redditor. It's very much appreciated. ",
    "controversiality": 0,
    "ups": 57,
    "downs": 0,
    "score": 57,
    "created": 1487251878.0,
    "date_created": "2017-02-16",
    "time_created": "00:31:18",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt3rp5",
    "parent_id": "t1_ddt2w8d",
    "subreddit_name_prefixed": "r/politics",
    "body": "I am old. But I remember the days when the most heated discussion was about what to do with the federal budget *surplus*. That was in early 2000.",
    "controversiality": 0,
    "ups": 127,
    "downs": 0,
    "score": 127,
    "created": 1487250406.0,
    "date_created": "2017-02-16",
    "time_created": "00:06:46",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt3w1e",
    "parent_id": "t1_ddt2w8d",
    "subreddit_name_prefixed": "r/politics",
    "body": "How fucked in the head do you have to be to get offended at the sight of a woman feeding her infant? ",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1487250607.0,
    "date_created": "2017-02-16",
    "time_created": "00:10:07",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2y1k",
    "parent_id": "t1_ddt1hte",
    "subreddit_name_prefixed": "r/politics",
    "body": "Unless Trump and Pence are impeached and convicted simultaneously, Ryan is far from a shoo-in. If Trump is removed first, Pence moves up and picks his own VP. Think what happened during Watergate.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1487249081.0,
    "date_created": "2017-02-15",
    "time_created": "23:44:41",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt9atm",
    "parent_id": "t1_ddt6xg4",
    "subreddit_name_prefixed": "r/politics",
    "body": "\"They control Taiwan, right?\"",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1487262506.0,
    "date_created": "2017-02-16",
    "time_created": "03:28:26",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt7103",
    "parent_id": "t1_ddt4011",
    "subreddit_name_prefixed": "r/politics",
    "body": "They're making deals man! Don't you remember that all \"deals\" are basically interchangeable; from real estate in New York to indefinite religious war in the middle East!?",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1487256684.0,
    "date_created": "2017-02-16",
    "time_created": "01:51:24",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2q3o",
    "parent_id": "t1_ddszjvm",
    "subreddit_name_prefixed": "r/politics",
    "body": "Early Alzheimer's maybe? His father had it, and Donald is 70 years old. Probably some form of sundown syndrome as well.",
    "controversiality": 0,
    "ups": 66,
    "downs": 0,
    "score": 66,
    "created": 1487248736.0,
    "date_created": "2017-02-15",
    "time_created": "23:38:56",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2vbu",
    "parent_id": "t1_ddszjvm",
    "subreddit_name_prefixed": "r/politics",
    "body": "My wife called it after the election. Trump will be fully checked out after 6 months. His personality just isn't fit for the presidential position. I've seen this type of personality in I/T management. Production issue occurs and all the key people join a call and discuss the next steps. Trump is the manager that shows up 30 minutes after the meeting already started. By the time he joins the initial group already discussed the possible solutions and are now implementing the fix. He doesn't truly understand the issue or the ramifications but the people under him do. He shows up late cause he knows he won't be able to contribute to the conversation without looking like a fool. Managers like this can slip under the radar for a while. The problem is that the people under him cant make all the judgement calls and those calls need to come from management. Ever after explaining the issue to the manager and explaining everything they still pussy foot around making a decision cause. This is where they start to fall apart. Since they never took the time to understand the issue or the ramifications to the decisions they can't give proper direction when its needed.\n\n\nThe President can't possibly know every detail. Thats why they have a staff and cabinet to help him. But even then they have to sit down and listen to the advice and spend countless nights pouring over the details. I remember reading about Obama staying up till 1-2 in the morning just reading over the topics and issues that he needed to understand. He wasn't up at 2 in morning tweeting bullshit.",
    "controversiality": 0,
    "ups": 123,
    "downs": 0,
    "score": 123,
    "created": 1487248964.0,
    "date_created": "2017-02-15",
    "time_created": "23:42:44",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt6614",
    "parent_id": "t1_ddt52mp",
    "subreddit_name_prefixed": "r/politics",
    "body": "Don't...don't do this to my head right now.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1487254816.0,
    "date_created": "2017-02-16",
    "time_created": "01:20:16",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt5rsb",
    "parent_id": "t1_ddt52mp",
    "subreddit_name_prefixed": "r/politics",
    "body": "I'm such a nard I logged in to upvote this... currently reading The Fabric of the Cosmos.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1487254004.0,
    "date_created": "2017-02-16",
    "time_created": "01:06:44",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt1niq",
    "parent_id": "t1_ddsze4a",
    "subreddit_name_prefixed": "r/politics",
    "body": "This is the guy who led the birther movement for over half a decade.\n\nWhen I'm tempted to think he's just misunderstood, I remind myself of that.",
    "controversiality": 0,
    "ups": 98,
    "downs": 0,
    "score": 98,
    "created": 1487247106.0,
    "date_created": "2017-02-15",
    "time_created": "23:11:46",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2pkv",
    "parent_id": "t1_ddt2de6",
    "subreddit_name_prefixed": "r/politics",
    "body": "\"For those of you just joining us, the Trump family has absconded Washington in a plane owned by a close associate of Vladimir Putin and is currently en route to Moscow. Earlier today, the Senate began impeachment hearings, with the expectation that Donald Trump would be removed from office and likely charged with multiple counts of fraud, corruption, and sedition. In addition, his sons Eric and Donald Jr and his daughter Ivanka are all wanted for questioning regarding their role in the scandal.\"\n\n\"I'm now receiving word that the fighters have made visual and radio contact and are being told to return to US airspace where they will be escorted to the ground.\"\n\n\"The pilot of the jet is refusing to land and has said \"Cyka blyat, capitalist pigs!\", and the fighters have dropped back behind the passenger jet.\"\n\n\"Ladies and gentlemen, I've just received word that a pair of F-35s belonging to the US Air Force fired on a jet containing Eric Trump, Donald Trump Jr., Ivanka Trump, and former president Donald J. Trump. There were no survivors.\"\n\n\"Donald J. Trump, the 45th President of the United States, is dead after trying to defect to Russia. And now for analysis on this stunning and unprecedented turn of events, Ja Rule.\"",
    "controversiality": 0,
    "ups": 359,
    "downs": 0,
    "score": 359,
    "created": 1487248713.0,
    "date_created": "2017-02-15",
    "time_created": "23:38:33",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt4dzn",
    "parent_id": "t1_ddt3l8z",
    "subreddit_name_prefixed": "r/politics",
    "body": "Cool beans, thanks for the explanation. \n\nI'd like to know what you think of Trump's refusal to read intelligence briefings. \n\nI think that recent events have taught us all how critical to the United States organizations such as the NSA, CIA and FBI are. As critical as I am of some of their methods...",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1487251446.0,
    "date_created": "2017-02-16",
    "time_created": "00:24:06",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtf40w",
    "parent_id": "t1_ddtbb1r",
    "subreddit_name_prefixed": "r/politics",
    "body": "> To sacrifice everything in the name of national security so we can have a safe nation with no ideals.\n\nThey claimed to be the party of fiscal responsibility, until they revealed what a joke that was by repeatedly getting into expensive wars for no clear benefit.\n\nThey claim to be the party of national security, only this active kowtowing to and shielding of a despotic president who's enthusiastically dismantling checks and balances and *may* even be the agent of a hostile power give lie to that claim, too.\n\nAt this stage the Republican party have exactly two \"principles\":\n\n1. Treat women and minorities like shit\n2. Stay in power at all costs",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1487279061.0,
    "date_created": "2017-02-16",
    "time_created": "08:04:21",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtc3k9",
    "parent_id": "t1_ddtbb1r",
    "subreddit_name_prefixed": "r/politics",
    "body": "libertarians will sacrifice everything for the sake of allowing the free-market to work itself out along with isolationism.  It's just as dangerous and it's just as destructive in their hands.",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1487271267.0,
    "date_created": "2017-02-16",
    "time_created": "05:54:27",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddteqnq",
    "parent_id": "t1_ddtca35",
    "subreddit_name_prefixed": "r/politics",
    "body": "I wish we had a LAW. ..and a ruling..that made abortion legal...thereby taking abortion out of our discussions so that we wouldn't be so divided by that one particular topic.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1487278287.0,
    "date_created": "2017-02-16",
    "time_created": "07:51:27",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtfiwm",
    "parent_id": "t1_ddtfe9r",
    "subreddit_name_prefixed": "r/politics",
    "body": "what makes you think so?\n\nRepublicans use us as a prop. So they will always paint us as loyal robots that just wants ammo girls and guns. But we are just as diverse as the citizen population. \n\nAnd believe it or not. There are many military members that would never support a draft dodger. Someone who mocks pows. ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1487279857.0,
    "date_created": "2017-02-16",
    "time_created": "08:17:37",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtcn86",
    "parent_id": "t1_ddt9938",
    "subreddit_name_prefixed": "r/politics",
    "body": "You guys had more insane fuck ups in a single week than my country (Canada) had in probably an entire decade.  I'm even counting elbowgate.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1487273001.0,
    "date_created": "2017-02-16",
    "time_created": "06:23:21",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt0ch2",
    "parent_id": "t1_ddt00qh",
    "subreddit_name_prefixed": "r/politics",
    "body": "Ayy googly eyed Steve Bannon",
    "controversiality": 0,
    "ups": 222,
    "downs": 0,
    "score": 222,
    "created": 1487245205.0,
    "date_created": "2017-02-15",
    "time_created": "22:40:05",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2ker",
    "parent_id": "t1_ddswlk4",
    "subreddit_name_prefixed": "r/politics",
    "body": "I don't want to put too fine a point on it, but what Jefferson was actually saying in his letter is that every so often the people must show their rulers that they \"still possess the spirit of resistance.\" The whole \"the tree of liberty must be refreshed from time to time with the blood of patriots and tyrants\" line was saying that people who care to protect their liberties (patriots) must occasionally fight, violently if necessary, to preserve them and remove whatever obstacles (tyrants) were denying them those liberties. It's not remotely so partisan as you would seem to make it out to be. Although the message seems to have been distorted in the interim. ",
    "controversiality": 0,
    "ups": 107,
    "downs": 0,
    "score": 107,
    "created": 1487248494.0,
    "date_created": "2017-02-15",
    "time_created": "23:34:54",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddsx043",
    "parent_id": "t1_ddswlk4",
    "subreddit_name_prefixed": "r/politics",
    "body": "Its day 27, let's not rule out any method yet.",
    "controversiality": 0,
    "ups": 212,
    "downs": 0,
    "score": 212,
    "created": 1487240691.0,
    "date_created": "2017-02-15",
    "time_created": "21:24:51",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt67ia",
    "parent_id": "t1_ddt2jhk",
    "subreddit_name_prefixed": "r/politics",
    "body": "If America had less income inequality and better social safety nets we wouldn't need gun control ",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1487254899.0,
    "date_created": "2017-02-16",
    "time_created": "01:21:39",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2c5b",
    "parent_id": "t1_ddt0ifo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Of course. Of course that's a real username.",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1487248140.0,
    "date_created": "2017-02-15",
    "time_created": "23:29:00",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt5665",
    "parent_id": "t1_ddt2abe",
    "subreddit_name_prefixed": "r/politics",
    "body": "Gay people can also be huge pieces of shit.  We're working towards equality in the world, let's not give Milo a pass for being a fucking douchebag.  I refuse to be called a homophobe for thinking that dude is a piece of shit.  His sexual preferences are meaningless.",
    "controversiality": 0,
    "ups": 101,
    "downs": 0,
    "score": 101,
    "created": 1487252849.0,
    "date_created": "2017-02-16",
    "time_created": "00:47:29",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2vis",
    "parent_id": "t1_ddszwt6",
    "subreddit_name_prefixed": "r/politics",
    "body": "A huge part of it is tokenism. After the Berkeley thing I saw sooooo many alt-right \"people\" online going on about how homophobic it was for antifa and other leftist protestors to shut him down. If anything it's the opposite. All fash gets bashed equally regardless of their identity. That's equality in action.\n\nEDIT: Don't use Amazon tablets if you don't like making 8 typos per sentence.",
    "controversiality": 0,
    "ups": 131,
    "downs": 0,
    "score": 131,
    "created": 1487248972.0,
    "date_created": "2017-02-15",
    "time_created": "23:42:52",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2jwp",
    "parent_id": "t1_ddszwt6",
    "subreddit_name_prefixed": "r/politics",
    "body": "He is a character. Just like Rush Limbaugh or any other comedian or actor. Like Andrew Dice Clay. He is full of shit and only Republicans are dumb enough to cheer for him",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1487248475.0,
    "date_created": "2017-02-15",
    "time_created": "23:34:35",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2ipo",
    "parent_id": "t1_ddszjea",
    "subreddit_name_prefixed": "r/politics",
    "body": "He is invited to speak on these college campuses by conservative student groups. They should be asked by the media why they invite him to speak",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1487248426.0,
    "date_created": "2017-02-15",
    "time_created": "23:33:46",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt309w",
    "parent_id": "t1_ddt2gfr",
    "subreddit_name_prefixed": "r/politics",
    "body": "Yeah. I just want to get back to not having to worry about peoples rights being taken away. Is that too much to ask?",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1487249177.0,
    "date_created": "2017-02-15",
    "time_created": "23:46:17",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt274n",
    "parent_id": "t1_ddt1id4",
    "subreddit_name_prefixed": "r/politics",
    "body": "No, but I do believe that most Americans are at least half-decent people, and that if we stand up and are visible, heard, and present in our numbers, that the scumbags can be spooked back into the shadows.\n\nAt least… I hope.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1487247924.0,
    "date_created": "2017-02-15",
    "time_created": "23:25:24",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt1mh8",
    "parent_id": "t1_ddsvvsf",
    "subreddit_name_prefixed": "r/politics",
    "body": "Don't fucking take it for granted that Trump is going down. Some bullshit might happen and all our worst nightmares come true. It might not seem like it now, but remember that in October it seemed like a sure thing that Hillary Clinton would win the election. Stay vigilant. ",
    "controversiality": 0,
    "ups": 279,
    "downs": 0,
    "score": 279,
    "created": 1487247062.0,
    "date_created": "2017-02-15",
    "time_created": "23:11:02",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddswx3u",
    "parent_id": "t1_ddsvvsf",
    "subreddit_name_prefixed": "r/politics",
    "body": "I'm pretty sure the answer to this is to simply support what ever group Trump is attacking. \n\nIf he is pissed off a group is doing something right. \n\n",
    "controversiality": 0,
    "ups": 87,
    "downs": 0,
    "score": 87,
    "created": 1487240579.0,
    "date_created": "2017-02-15",
    "time_created": "21:22:59",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt12tu",
    "parent_id": "t1_ddsxlsv",
    "subreddit_name_prefixed": "r/politics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 114,
    "downs": 0,
    "score": 114,
    "created": 1487246262.0,
    "date_created": "2017-02-15",
    "time_created": "22:57:42",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt1afy",
    "parent_id": "t1_ddszhke",
    "subreddit_name_prefixed": "r/politics",
    "body": "He did lie to start a war of choice. That's worse than anything Trump has done so far. ",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1487246565.0,
    "date_created": "2017-02-15",
    "time_created": "23:02:45",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt68u1",
    "parent_id": "t1_ddt56ms",
    "subreddit_name_prefixed": "r/politics",
    "body": "Is reality even real anymore? ",
    "controversiality": 0,
    "ups": 57,
    "downs": 0,
    "score": 57,
    "created": 1487254974.0,
    "date_created": "2017-02-16",
    "time_created": "01:22:54",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt4gem",
    "parent_id": "t1_ddt1wy6",
    "subreddit_name_prefixed": "r/politics",
    "body": "Full name Dr. Sleepy McBeltbuckle",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1487251563.0,
    "date_created": "2017-02-16",
    "time_created": "00:26:03",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt4j6w",
    "parent_id": "t1_ddt3m46",
    "subreddit_name_prefixed": "r/politics",
    "body": "It's amazing how the conservative party in our country ran on the idea of \"he's just not ready\" and yet he collectively out-classed Trump by half a mile. ",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1487251697.0,
    "date_created": "2017-02-16",
    "time_created": "00:28:17",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt58t1",
    "parent_id": "t1_ddt3m46",
    "subreddit_name_prefixed": "r/politics",
    "body": "Trudeau was allegedly overheard remarking to his Foreign Minister that Trump was an idiot and had no idea what he was doing.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1487252985.0,
    "date_created": "2017-02-16",
    "time_created": "00:49:45",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt5f8f",
    "parent_id": "t1_ddt3m46",
    "subreddit_name_prefixed": "r/politics",
    "body": "> Trump could barely get through his prepared statement\n\nHe was probably itching to get his phone back so he could tweet some inane BS while watching Fox News.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1487253320.0,
    "date_created": "2017-02-16",
    "time_created": "00:55:20",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt4j80",
    "parent_id": "t1_ddt3m46",
    "subreddit_name_prefixed": "r/politics",
    "body": "Well shit, now you made me want to watch it.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1487251699.0,
    "date_created": "2017-02-16",
    "time_created": "00:28:19",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt75l6",
    "parent_id": "t1_ddt3m46",
    "subreddit_name_prefixed": "r/politics",
    "body": "> He's deranged and out of his league in the presence of other world leaders.\n\nHe's scheduled to attend the G7 meeting in Italy in May. If you thought there was a contrast between him and other world leaders when one on one at the White House, wait until it's him and a group in a neutral setting. Ugh.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1487256975.0,
    "date_created": "2017-02-16",
    "time_created": "01:56:15",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2n0i",
    "parent_id": "t1_ddt2hvg",
    "subreddit_name_prefixed": "r/politics",
    "body": "Exactly.\n\nI wasn't happy with the choice I had to make, but that was more being upset about not having better options.\n\nTrump was never on the table as a potential vote for me. Ever.",
    "controversiality": 0,
    "ups": 153,
    "downs": 0,
    "score": 153,
    "created": 1487248604.0,
    "date_created": "2017-02-15",
    "time_created": "23:36:44",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt5z1z",
    "parent_id": "t1_ddt3rp5",
    "subreddit_name_prefixed": "r/politics",
    "body": "the answer was invade Iraq.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1487254415.0,
    "date_created": "2017-02-16",
    "time_created": "01:13:35",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt345d",
    "parent_id": "t1_ddt2y1k",
    "subreddit_name_prefixed": "r/politics",
    "body": "Good point. If Trump is impeached, Pence would go down in history as a great man if he nominated Mitt Romney as his VP then resigned. \n\nWon't happen, but it's a hell of thing to dream about. ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1487249344.0,
    "date_created": "2017-02-15",
    "time_created": "23:49:04",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt391t",
    "parent_id": "t1_ddt2q3o",
    "subreddit_name_prefixed": "r/politics",
    "body": "> Probably some form of sundown syndrome as well. \n\nhttps://en.m.wikipedia.org/wiki/Sundowning",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1487249564.0,
    "date_created": "2017-02-15",
    "time_created": "23:52:44",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt4ofc",
    "parent_id": "t1_ddt2vbu",
    "subreddit_name_prefixed": "r/politics",
    "body": "I've read the Donald checks out at 630 pm to eat and watch tv",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1487251956.0,
    "date_created": "2017-02-16",
    "time_created": "00:32:36",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt71z5",
    "parent_id": "t1_ddt2vbu",
    "subreddit_name_prefixed": "r/politics",
    "body": "He reportedly spends most of his time watching TV.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1487256746.0,
    "date_created": "2017-02-16",
    "time_created": "01:52:26",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt3ujt",
    "parent_id": "t1_ddt1niq",
    "subreddit_name_prefixed": "r/politics",
    "body": "Not only did he lead it, but afterward he denied ever being a part of it.",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1487250538.0,
    "date_created": "2017-02-16",
    "time_created": "00:08:58",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt60e8",
    "parent_id": "t1_ddt1niq",
    "subreddit_name_prefixed": "r/politics",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1487254490.0,
    "date_created": "2017-02-16",
    "time_created": "01:14:50",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2ym5",
    "parent_id": "t1_ddt2pkv",
    "subreddit_name_prefixed": "r/politics",
    "body": "And then the entire world just lets out a sigh.  ",
    "controversiality": 0,
    "ups": 99,
    "downs": 0,
    "score": 99,
    "created": 1487249105.0,
    "date_created": "2017-02-15",
    "time_created": "23:45:05",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt42yv",
    "parent_id": "t1_ddt2pkv",
    "subreddit_name_prefixed": "r/politics",
    "body": "Oh my god he left Melania. ",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1487250924.0,
    "date_created": "2017-02-16",
    "time_created": "00:15:24",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt43fh",
    "parent_id": "t1_ddt2pkv",
    "subreddit_name_prefixed": "r/politics",
    "body": "Upvote for Ja.",
    "controversiality": 0,
    "ups": 37,
    "downs": 0,
    "score": 37,
    "created": 1487250944.0,
    "date_created": "2017-02-16",
    "time_created": "00:15:44",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt4ffm",
    "parent_id": "t1_ddt2pkv",
    "subreddit_name_prefixed": "r/politics",
    "body": "That was one of the most cathartic things I've ever read. Thank you for that. ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1487251515.0,
    "date_created": "2017-02-16",
    "time_created": "00:25:15",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt4rak",
    "parent_id": "t1_ddt2pkv",
    "subreddit_name_prefixed": "r/politics",
    "body": "In my mind Dave Chappelle is narrating this.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1487252095.0,
    "date_created": "2017-02-16",
    "time_created": "00:34:55",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt4q89",
    "parent_id": "t1_ddt4dzn",
    "subreddit_name_prefixed": "r/politics",
    "body": "He's directly putting our lives at risk due to his hubris and stupidity. It's inexcusable. \n\nReally makes you wonder if he isn't hoping for a terrorist attack to get his \"I told you so\" moment.",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1487252044.0,
    "date_created": "2017-02-16",
    "time_created": "00:34:04",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtg88u",
    "parent_id": "t1_ddtfiwm",
    "subreddit_name_prefixed": "r/politics",
    "body": "I still can't believe any military member would forgive him for that comment he made about John McCain. I am not military, but grew up in a Military family, was babysat in VFW halls, went to a Vietnam veteran's house when I got off the bus each day. The black POWMIA flag was basically more sacred than the American flag. People I knew as a kid were POWs. People I knew as a kid had good friends MIA and still hoped they were alive out there somewhere, or just that their remains would be identified. To say that he likes the people who weren't captured, it's just sickening, unforgivable. It shows a complete misunderstanding of what the military *is*, what it stands for, and the immense respect owed to all service members, especially those who make ultimate sacrifices. ",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1487281104.0,
    "date_created": "2017-02-16",
    "time_created": "08:38:24",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt1hld",
    "parent_id": "t1_ddt0ch2",
    "subreddit_name_prefixed": "r/politics",
    "body": "How dare you insult Mad Eye Moody's beauty that way! Steve Bannon looks like a chewed up sugar free gum ball with an alcohol problem!   ",
    "controversiality": 0,
    "ups": 194,
    "downs": 0,
    "score": 194,
    "created": 1487246862.0,
    "date_created": "2017-02-15",
    "time_created": "23:07:42",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt4vwy",
    "parent_id": "t1_ddt2ker",
    "subreddit_name_prefixed": "r/politics",
    "body": "> put too fine a point on it\n\n...Say I'm the only bee in your bonnet!",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1487252327.0,
    "date_created": "2017-02-16",
    "time_created": "00:38:47",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt0zcp",
    "parent_id": "t1_ddsx043",
    "subreddit_name_prefixed": "r/politics",
    "body": ">day 27\n\nWhy do I get suprised by this every time?",
    "controversiality": 0,
    "ups": 367,
    "downs": 0,
    "score": 367,
    "created": 1487246127.0,
    "date_created": "2017-02-15",
    "time_created": "22:55:27",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt5nkq",
    "parent_id": "t1_ddt5665",
    "subreddit_name_prefixed": "r/politics",
    "body": "Yeah it's not homophobic to think Milo is a douche. His sexual orientation isn't even relevant to the hate he gets.",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1487253769.0,
    "date_created": "2017-02-16",
    "time_created": "01:02:49",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt5l2t",
    "parent_id": "t1_ddt5665",
    "subreddit_name_prefixed": "r/politics",
    "body": "\"Member of the LGBT community\" here. LGBT people are just as capable of being douchebags as anyone else. Don't feel bad about it.",
    "controversiality": 0,
    "ups": 37,
    "downs": 0,
    "score": 37,
    "created": 1487253634.0,
    "date_created": "2017-02-16",
    "time_created": "01:00:34",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt49re",
    "parent_id": "t1_ddt2ipo",
    "subreddit_name_prefixed": "r/politics",
    "body": "The Berkeley College Republicans said they invited him (if my memory is correct) because he's \"fun\", more or less. \n\nThat Milo, a prick who outed a transgender student at one speech he gave, is \"fun\" to them says a lot about their sense of ethics. Or lack thereof. \n\nHonestly, I don't know why people are treating them like victims. They're fucking assholes. Milo's an asshole, the BCR are assholes, the people who showed up to see Milo talk are assholes. Nobody who knows who this guy is and isn't disgusted by him is not an asshole. \n\nI don't know why all of a sudden there's this tendency in our society to mindlessly grovel to the feelings of people who are one step away from stormfront. If they haven't already taken that step. And indeed, the BCR [seem like they have](https://itsgoingdown.org/everybody-hates-berkeley-college-republicans/), based on the company they seem to like keeping. Though I would take that source with a grain of salt, that doesn't change the fact that they also invited fucking Milo, which is undeniable. \n\nI'm not going to claim that republicans are all a bunch of neo-nazis. They aren't. Like, I wouldn't call John McCain a fascist. I can hate somebody's politics without considering them pure evil. Hell, even that snake Mitch McConnel I wouldn't pin to that particular word. \n\nBut conservative discourse in this country is getting increasingly defined by an extremist, fascistic, kind of rhetoric and outlook on the world. And this should frighten more people than it does. Our friends at the Alt-Reich have managed to sneak white supremacist talking points and ideology into the republican mainstream, and it is especially apparent if you're looking at groups like the BCR or its brethren at campuses around the country. There's conservatism and then there's whatever the fuck Milo is. And they have no relation (in theory). \n\nI keep seeing the entire republican party get more and more extreme. The old guard has been trying to hold back the lunatics somewhat, but if you look at younger conservative figures and people involved in the grassroots (tea party for example) it is very, very, hard to see anything but pure and simple insanity. \n\nRepublicans need to give these people the boot if they want to save their souls and their party. So far they're trying to use them like a bunch of sycophants. And it is leading us down a path that will get darker before it ever gets brighter\n\n",
    "controversiality": 0,
    "ups": 57,
    "downs": 0,
    "score": 57,
    "created": 1487251241.0,
    "date_created": "2017-02-16",
    "time_created": "00:20:41",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt1qre",
    "parent_id": "t1_ddt1mh8",
    "subreddit_name_prefixed": "r/politics",
    "body": "Oh, absolutely. Thus my **\"a bit more optimistic.\"** We need to keep fighting.",
    "controversiality": 0,
    "ups": 71,
    "downs": 0,
    "score": 71,
    "created": 1487247239.0,
    "date_created": "2017-02-15",
    "time_created": "23:13:59",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt1a8z",
    "parent_id": "t1_ddswx3u",
    "subreddit_name_prefixed": "r/politics",
    "body": "BRB, off to buy shoes at Nordstrom.",
    "controversiality": 0,
    "ups": 57,
    "downs": 0,
    "score": 57,
    "created": 1487246557.0,
    "date_created": "2017-02-15",
    "time_created": "23:02:37",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt27ac",
    "parent_id": "t1_ddt12tu",
    "subreddit_name_prefixed": "r/politics",
    "body": "Yes. The federal government needs to carry out a thorough and unbiased psychological evaluation of all parties involved in the administration/cabinet. There is no reason a fat orange pussy from a crappy reality TV show, with a reputation for assaulting women and whining about ratings should ever become the leader of the free world. This should be impossible if we assume every single reality TV star is unfit to be President. Donald Trump is the worst kind of underdeveloped, dysfunctional, emotionally stunted, spoiled mama's boy with no friends or relationships of any substance. He is the most absolutist, unwavering, insecure, projectile vomiting finger pointer in the history of the country. He is that sad, pathetic, pitiful, rotten little man that is cruel to everyone until they give into prestigious admiration of said petulant baby-whiner to have an ally in demagoguery. He is Steve Bannon and friends political fuck toy. A wet doll. God, what a pussy. Fuck Donald Trump and fuck his family. ",
    "controversiality": 0,
    "ups": 139,
    "downs": 0,
    "score": 139,
    "created": 1487247930.0,
    "date_created": "2017-02-15",
    "time_created": "23:25:30",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt270s",
    "parent_id": "t1_ddt12tu",
    "subreddit_name_prefixed": "r/politics",
    "body": "In order to run for POTUS on a major ticket you must pass a comprehensive medical exam that includes a full mental health screening. \n\nAlso you should be required to pass a civics exam. \n\nEither one would've stopped Trump. ",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1487247919.0,
    "date_created": "2017-02-15",
    "time_created": "23:25:19",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt3azf",
    "parent_id": "t1_ddt12tu",
    "subreddit_name_prefixed": "r/politics",
    "body": "Forgot one big one: kill the electoral college. Kill it, burn it with fire. Obviously not as simple to pass, but that shit's gotta go asap. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1487249650.0,
    "date_created": "2017-02-15",
    "time_created": "23:54:10",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt6baq",
    "parent_id": "t1_ddt68u1",
    "subreddit_name_prefixed": "r/politics",
    "body": "Yes it is. Welcome to the US tradition of backsliding, put on fast-forward.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1487255118.0,
    "date_created": "2017-02-16",
    "time_created": "01:25:18",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt7s7u",
    "parent_id": "t1_ddt4j6w",
    "subreddit_name_prefixed": "r/politics",
    "body": "To be fair that's not a very high bar...",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1487258473.0,
    "date_created": "2017-02-16",
    "time_created": "02:21:13",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt5dgt",
    "parent_id": "t1_ddt58t1",
    "subreddit_name_prefixed": "r/politics",
    "body": "I mean, even without having any proof of it, I'm 100% certain Trudeau made some sort of remark of that nature regarding Trump.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1487253228.0,
    "date_created": "2017-02-16",
    "time_created": "00:53:48",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt4opg",
    "parent_id": "t1_ddt4j80",
    "subreddit_name_prefixed": "r/politics",
    "body": "Here you go!\n\n\nhttp://www.bbc.com/news/world-us-canada-38971859\n\nhttps://www.youtube.com/watch?v=NK5Gm_nvzzA",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1487251969.0,
    "date_created": "2017-02-16",
    "time_created": "00:32:49",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt77f2",
    "parent_id": "t1_ddt75l6",
    "subreddit_name_prefixed": "r/politics",
    "body": "At the rate he's going he'll be impeached by then. *Fingers crossed.*",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1487257092.0,
    "date_created": "2017-02-16",
    "time_created": "01:58:12",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt5ufh",
    "parent_id": "t1_ddt345d",
    "subreddit_name_prefixed": "r/politics",
    "body": "lol @ even pretending Pence would do a good thing.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1487254151.0,
    "date_created": "2017-02-16",
    "time_created": "01:09:11",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt67g5",
    "parent_id": "t1_ddt391t",
    "subreddit_name_prefixed": "r/politics",
    "body": "My grandma had that. We would always take a day a week to go visit, which meant we'd get up in the morning and have lunch or breakfast with her. After 1-2:00 she would get crabby and forgetful and all this other stuff, she just got worse in the evenings.\n\nI'm glad I know what it's called now at least, I didn't know it was a legit thing until now.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1487254896.0,
    "date_created": "2017-02-16",
    "time_created": "01:21:36",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt69lk",
    "parent_id": "t1_ddt391t",
    "subreddit_name_prefixed": "r/politics",
    "body": "The part about changes to circadian rhythm impacting it really makes me think about his middle of the night tweets",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1487255018.0,
    "date_created": "2017-02-16",
    "time_created": "01:23:38",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt9s7q",
    "parent_id": "t1_ddt71z5",
    "subreddit_name_prefixed": "r/politics",
    "body": "'i watch the shows'  \n  \nit really is scary that if you look at his tweets and public statements it's painfully obvious he's literally just responding to what he's sees on the tv.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1487263897.0,
    "date_created": "2017-02-16",
    "time_created": "03:51:37",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt4wmp",
    "parent_id": "t1_ddt2ym5",
    "subreddit_name_prefixed": "r/politics",
    "body": "But at least we'll know what Ja thinks.",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1487252365.0,
    "date_created": "2017-02-16",
    "time_created": "00:39:25",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt4k3z",
    "parent_id": "t1_ddt2ym5",
    "subreddit_name_prefixed": "r/politics",
    "body": "Oh, I let out more than a sigh just from reading that. It would probably be more akin to the entire wolrd orgasming simultaneously followed by the biggest party the world ever saw.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1487251742.0,
    "date_created": "2017-02-16",
    "time_created": "00:29:02",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt4k3q",
    "parent_id": "t1_ddt42yv",
    "subreddit_name_prefixed": "r/politics",
    "body": "Wouldn't be the first wife.",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1487251742.0,
    "date_created": "2017-02-16",
    "time_created": "00:29:02",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt5mu3",
    "parent_id": "t1_ddt42yv",
    "subreddit_name_prefixed": "r/politics",
    "body": "And Tiffany. Nobody remembers Tiffany :-(",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1487253730.0,
    "date_created": "2017-02-16",
    "time_created": "01:02:10",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddtmh30",
    "parent_id": "t1_ddtg88u",
    "subreddit_name_prefixed": "r/politics",
    "body": "Yeah I've never liked trump. He's always seemed like a douche. \n\nBut after hearing his comments about pows I just flat out hated him as a person. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1487289459.0,
    "date_created": "2017-02-16",
    "time_created": "10:57:39",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2jlg",
    "parent_id": "t1_ddt1hld",
    "subreddit_name_prefixed": "r/politics",
    "body": "He's just an alcohol problem but alive.",
    "controversiality": 0,
    "ups": 84,
    "downs": 0,
    "score": 84,
    "created": 1487248462.0,
    "date_created": "2017-02-15",
    "time_created": "23:34:22",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt3qtj",
    "parent_id": "t1_ddt1hld",
    "subreddit_name_prefixed": "r/politics",
    "body": "If hangover was a person it would be Steve Bannon",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1487250364.0,
    "date_created": "2017-02-16",
    "time_created": "00:06:04",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt1kd4",
    "parent_id": "t1_ddt0zcp",
    "subreddit_name_prefixed": "r/politics",
    "body": "It feels like a mixture of groundhog day and hell.  \n\nEdit: Thank y'all so much for the Gold and Silver! Just made day 27 feel a little bit better.",
    "controversiality": 0,
    "ups": 800,
    "downs": 0,
    "score": 800,
    "created": 1487246976.0,
    "date_created": "2017-02-15",
    "time_created": "23:09:36",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt1nsj",
    "parent_id": "t1_ddt0zcp",
    "subreddit_name_prefixed": "r/politics",
    "body": "Because it feels like its been three fucking years. ",
    "controversiality": 0,
    "ups": 90,
    "downs": 0,
    "score": 90,
    "created": 1487247117.0,
    "date_created": "2017-02-15",
    "time_created": "23:11:57",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2q2z",
    "parent_id": "t1_ddt0zcp",
    "subreddit_name_prefixed": "r/politics",
    "body": "28 days later...",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1487248735.0,
    "date_created": "2017-02-15",
    "time_created": "23:38:55",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt81nc",
    "parent_id": "t1_ddt5l2t",
    "subreddit_name_prefixed": "r/politics",
    "body": "For instance I hate Caitlyn Jenner because she is a homophobic piece of shit. ",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1487259122.0,
    "date_created": "2017-02-16",
    "time_created": "02:32:02",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt5s0y",
    "parent_id": "t1_ddt5l2t",
    "subreddit_name_prefixed": "r/politics",
    "body": "One of my very best friends in the world is gay, happily married to her lovely wife.  She would give up her kidney for you.  Not just for *me*, for **you,** a total stranger.\n\nAnd a person in my life took great advantage of our kindness, and never apologized or made amends, and is also gay.  I don't dislike him for being gay, I dislike him for being a dick.\n\n",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1487254017.0,
    "date_created": "2017-02-16",
    "time_created": "01:06:57",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt30n5",
    "parent_id": "t1_ddt27ac",
    "subreddit_name_prefixed": "r/politics",
    "body": "Wow, reading that was SO savage that I actually felt better for a moment!",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1487249192.0,
    "date_created": "2017-02-15",
    "time_created": "23:46:32",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt65dd",
    "parent_id": "t1_ddt5dgt",
    "subreddit_name_prefixed": "r/politics",
    "body": "Oh absolutely.  I only put the \"allegedly\" in there because the source for the quote is a supposed rogue White House staffer.  I, too, am 100% certain something of the sort (and perhaps even worse) was said.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1487254778.0,
    "date_created": "2017-02-16",
    "time_created": "01:19:38",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt8lj8",
    "parent_id": "t1_ddt4opg",
    "subreddit_name_prefixed": "r/politics",
    "body": "1 minute in and i'm shaking my head and cracking up already. \n\n>and we look forward - *very much* forward, i must say, to many more to come. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1487260559.0,
    "date_created": "2017-02-16",
    "time_created": "02:55:59",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt3rjo",
    "parent_id": "t1_ddt2jlg",
    "subreddit_name_prefixed": "r/politics",
    "body": "He's more booze than man now",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1487250399.0,
    "date_created": "2017-02-16",
    "time_created": "00:06:39",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt27bj",
    "parent_id": "t1_ddt1kd4",
    "subreddit_name_prefixed": "r/politics",
    "body": "Ahh, the elusive actual lol. Well done.",
    "controversiality": 0,
    "ups": 110,
    "downs": 0,
    "score": 110,
    "created": 1487247931.0,
    "date_created": "2017-02-15",
    "time_created": "23:25:31",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt2efv",
    "parent_id": "t1_ddt1kd4",
    "subreddit_name_prefixed": "r/politics",
    "body": "Mixed with Back to the Future and the Simpsons, I had a bad feeling when the Cubs won the World Series.",
    "controversiality": 0,
    "ups": 84,
    "downs": 0,
    "score": 84,
    "created": 1487248240.0,
    "date_created": "2017-02-15",
    "time_created": "23:30:40",
    "submission_id": "politics-5ubnzs"
  },
  {
    "id": "ddt5xfk",
    "parent_id": "t1_ddt5s0y",
    "subreddit_name_prefixed": "r/politics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1487254321.0,
    "date_created": "2017-02-16",
    "time_created": "01:12:01",
    "submission_id": "politics-5ubnzs"
  }
]