[
  {
    "id": "diiw7ef",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think they will be quite disappointed tbh, they actually quite like us and are sad to see us go. Kinda like one of your friends sold their house and joined a cult one weekend. ",
    "controversiality": 0,
    "ups": 1168,
    "downs": 0,
    "score": 1168,
    "created": 1496770098.0,
    "date_created": "2017-06-06",
    "time_created": "05:28:18",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diivfaf",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Nope they are going to Willy Wonka her, \"You get NOTHING!\" ",
    "controversiality": 0,
    "ups": 128,
    "downs": 0,
    "score": 128,
    "created": 1496767815.0,
    "date_created": "2017-06-06",
    "time_created": "04:50:15",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiuozn",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think from before the time of the GE campaigning just looking at EU leader reactions to her, they all disliked her. Now they dislike her, and probably think they can push her around due to gaffs on the campaign trail that have undermined her authority (the social care U-turn and sending a proxy to debates being the key two).\n\nHonestly I hope Corbyn gets in over her as I don't think he has had his authority undermined in quite the same way, and I don't think the EU leaders have so much of a personal bias against him. While you would hope EU leaders would be able to rise above a dislike of May, I still imagine it would factor in and we'll get a worse deal under May than we would do Corbyn.",
    "controversiality": 0,
    "ups": 214,
    "downs": 0,
    "score": 214,
    "created": 1496765722.0,
    "date_created": "2017-06-06",
    "time_created": "04:15:22",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiuobm",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "the EU are going to go in without lube. ",
    "controversiality": 0,
    "ups": 116,
    "downs": 0,
    "score": 116,
    "created": 1496765668.0,
    "date_created": "2017-06-06",
    "time_created": "04:14:28",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwib7",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It's important to remember that the negotiations go far beyond the PM.",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1496770965.0,
    "date_created": "2017-06-06",
    "time_created": "05:42:45",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiuwj0",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "In some was going against an incompetent negotiator can be more daunting than a skilled one.",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1496766312.0,
    "date_created": "2017-06-06",
    "time_created": "04:25:12",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diitzpv",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No I think they will think what a shit show. And we'd best not fuck around with May or she might take the EU down with her.",
    "controversiality": 0,
    "ups": 164,
    "downs": 0,
    "score": 164,
    "created": 1496763837.0,
    "date_created": "2017-06-06",
    "time_created": "03:43:57",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diitck4",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think they'll be more interested in the final results.",
    "controversiality": 0,
    "ups": 51,
    "downs": 0,
    "score": 51,
    "created": 1496762156.0,
    "date_created": "2017-06-06",
    "time_created": "03:15:56",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diivwhg",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think countries see the UK as the little kid in class that spend all day flexing his muscles and trying to assert his dominance on everyone, when in reality he's a little bitch.\n\n\"Close the door on your way out\" i think will be the response when we finally leave.",
    "controversiality": 0,
    "ups": 62,
    "downs": 0,
    "score": 62,
    "created": 1496769205.0,
    "date_created": "2017-06-06",
    "time_created": "05:13:25",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diivaf7",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'm sure they already knew how weak her and by extension the country's position is. This is just another nail in the coffin. \n\nThey'll be running rings around Davis as well. ",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1496767432.0,
    "date_created": "2017-06-06",
    "time_created": "04:43:52",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diizvl3",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It's less about having a strong mandate to take to the negotiation table. It's more about having as large a majority as possible to be able to force a terrible outcome down the public's throats.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1496779019.0,
    "date_created": "2017-06-06",
    "time_created": "07:56:59",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijab9n",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "She looks and speaks like a complete idiot and I don't believe a word the woman says.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496792601.0,
    "date_created": "2017-06-06",
    "time_created": "11:43:21",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diivaj9",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It doesn't matter.\n\nThe EU will tell us what deal we can have and we will take it and like it.\n\nEnd of.",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1496767441.0,
    "date_created": "2017-06-06",
    "time_created": "04:44:01",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiy3ru",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I met her once for a work event (government related). I remember her speech and how she handled questions and can honestly say that she seems much more formidable if she doesn't open her mouth.\n\nI can't see our European brethren shaking in their seats (unless it is laughter) when she voices an opinion.\n\nI used to have conservative leanings (I blame bad parenting) but at the moment I am working out where to spend my vote tactically to reduce conservative support in my home constituency.",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1496775243.0,
    "date_created": "2017-06-06",
    "time_created": "06:54:03",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diixq3w",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "May's been an obvious political incompetent from the day she got the job by default. She's savagely tried to divide the country into us and them, ignoring the 48%, calling those who stood up for the rule of law traitors. They were her ticket to a compromised deal allowing her to aim for anything she wanted and actually get a deal which really works for the UK, but it quickly became very clear she had no idea what her plan was and just became a meme generator, Brexit means Bullshit, etc. She has seemingly taken every opertunity to turn the negotiation process into a farce, putting stuanch Brexiters into prominent positions, and letting BoJo be the countries mouthpiece. As things have progressed it has become evident she doesn't have a grip on the reality of the challenge ahead. For one thing, calling a snap general election in the middle of the negotiations is beyond mental, and she has decided that now is the time to make ridiculous Trump like accusations at our European neighbours who we will want to have a good relationship with regardless of what happens. \n\nShe's the last person who should be leading the country right now. We need a new Churchill, and we got a Mary Whitehouse. Not one political leader in Europe will have ever considered her more than a daily mail puppet, and they'd be right.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1496774298.0,
    "date_created": "2017-06-06",
    "time_created": "06:38:18",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiyoax",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Is anyone thinking that about Corbyn though? There's just a lack of good politicians these days",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1496776546.0,
    "date_created": "2017-06-06",
    "time_created": "07:15:46",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diizbbu",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The majority of EU politicians are probably sorry to see us go as it diminishes us both but at the same time I'm going to guess they also have the popcorn out and are watching the drama unfold. \n\nAs for them thinking May is a smooth political operator, no way, she's lurched from one mess to the next and they are pretty much all of her own making. The lack of willingness to engage with people that aren't 100% on her side must be causing them some alarm as well.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496777907.0,
    "date_created": "2017-06-06",
    "time_created": "07:38:27",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diizn8a",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496778570.0,
    "date_created": "2017-06-06",
    "time_created": "07:49:30",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij0dkk",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The honest answer is that if they're savvy politicians they will always assume there is more going on. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496779949.0,
    "date_created": "2017-06-06",
    "time_created": "08:12:29",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij3dav",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I can't see them having to communicate much with her anyway. She will be replaced by the end of the year. Not fit to lead an election campaign that she called, never mind a country facing the most challenging negotiations for a generation. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496784594.0,
    "date_created": "2017-06-06",
    "time_created": "09:29:54",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiw98r",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I don't really see what the point of this post is. It has a lot of upvotes because it's anti-conservative and that seems to be the prevailing mood on this subreddit at the moment... but the point of the GE was never to 'intimidate' other global leaders with the magnitude of Theresa May's big throbbing mandate or her domestic political expertise. To cast it in some perspective, do you care that Donald Trump has an electoral mandate when you criticize him? - of course you don't. \n\nI think the EU should probably learn a few things from this GE;\n\n* The highest point of the entire campaign for May was when Juncker clumsily leaked that meeting to a German newspaper and thought he could outplay May using the British press (who were obviously going to pick up the story). What he didn't appreciate was that the British press are incredibly bloodthirsty and they aren't exactly sympathetic to him (indeed most of the papers have been vilifying Juncker for some time now). The lesson there was that you don't wade cock deep into someone elses political arena (in this case the British press) and expect to out-play them at it. The government very smoothly turned the story around and used it as evidence of the EU's intransigence to accept Brexit.\n\n* Brexit hasn't really dominated this election in the way most people assumed it would... and that is because the two parties that can win the election both back Brexit. Indeed the difference on their EU policy is outwardly miniscule - May argues we should be strong and stable, whilst Corbyn argues we need to be stable and strong. This is backed up by domestic polling data which shows the public continue to support Brexit... in effect Brexit has become 'old news' because people have accepted that it has to happen and it is going to happen. \n\n* A broader lesson for politicians around the world is to remember a political fundamental lesson: domestic political issues generally trump global issues. The reason the Conservatives and Lib dems have suffered is because they have tried to fight a GE on an international issue of Brexit whereas Corbyn has exceeded expectations because he has fought on a domestic political agenda of public sector reforms and an end to the deeply unpopular period of austerity.\n\nIt might also be worth pointing one small detail out: **Theresa May is almost certainly still going to win this election**. So how well Corbyn did is likely to become pretty moot other than in the ensuing labour leadership challenge.",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1496770241.0,
    "date_created": "2017-06-06",
    "time_created": "05:30:41",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiubiu",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "They don't care already set out in detail what they want can offer. Brexit GE has avoided the debate not given us anything. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496764682.0,
    "date_created": "2017-06-06",
    "time_created": "03:58:02",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiw2uh",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Theresa May isn't actually going to be negotiating you know. Its not going to be her and Junker in a darkened room with cigars and guns under the table. All she does is appoint civil servants to do it.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496769729.0,
    "date_created": "2017-06-06",
    "time_created": "05:22:09",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diitzuk",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Do you really think politicians judge other politicians in the same way a member of the public does?",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1496763847.0,
    "date_created": "2017-06-06",
    "time_created": "03:44:07",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diixrsf",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The EU politicians all know the whole thing will be run by bureaucrats with the tiniest amendments from the politicians so they can claim grand victory*. May would come out with a giant document she's never read being waved in the air.\n\n*hell the \"ever closer union\" argument was about changing the fucking preamble. Never mind making superficial changes to the actual body.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496774412.0,
    "date_created": "2017-06-06",
    "time_created": "06:40:12",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij06dc",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Was there a question.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496779586.0,
    "date_created": "2017-06-06",
    "time_created": "08:06:26",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij0i8d",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I thought you told them to all fuck off during Brexit",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496780173.0,
    "date_created": "2017-06-06",
    "time_created": "08:16:13",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij0uob",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496780758.0,
    "date_created": "2017-06-06",
    "time_created": "08:25:58",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij1e15",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Are you kidding? We're stronger and stabler than ever!",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496781642.0,
    "date_created": "2017-06-06",
    "time_created": "08:40:42",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij7l4j",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "From 10 Things Political Scientists know (Noel)\n\n> In a narrow sense, winning the election gives you a “mandate.” You are\nnow legally empowered to exercise your authority. But after every election,\npundits will declare a more complex “mandate.” They will tell you not simply\nwho won, but what that victory means. The winners won because they promised\nX and voters wanted Y and were afraid of Z.\nThese narratives are created after the fact by people who want you to think\none thing or another (Grossback, Peterson, and Stimson, 2006, 2007). Winners\nclaim a mandate to change everything, and losers explain it all away as an\nanomaly. But exit polls saying that some voters cared about some things are thin\nreeds on which to spin out the will of the people. \n\nThe best predictor of elections is economic conditions and how political parties position themselves relative to those conditions. However much May wants this election to give her a mandate for negotiations it cannot as that's not what elections do. *Even* if that wasn't true and somehow it could be shown that she has popular legitimacy what difference does that make to EU leaders. We have done all the damage we can to them and at this point it's like that bit in some old Western where the Sheriff says 'Hands up or I'll Blow my Brains out'. Cameron didn't pull shit like this jc. \n",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496789638.0,
    "date_created": "2017-06-06",
    "time_created": "10:53:58",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij86rx",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "They look at her the same way as the look at Trump.\n\n",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496790305.0,
    "date_created": "2017-06-06",
    "time_created": "11:05:05",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij9dxt",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I thought that Theresa May was a RL illustration of the Peter Principle when she was merely Home Secretary. As Prime Minister she's broken new territory for the Principle.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496791606.0,
    "date_created": "2017-06-06",
    "time_created": "11:26:46",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijhq60",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "She's the best the Conservatives have got?..",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496800412.0,
    "date_created": "2017-06-06",
    "time_created": "13:53:32",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diit5zo",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I guess it depends how many EU politicians form their opinion of her based on articles in the Independent and Guardian, rather than in person.",
    "controversiality": 1,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1496761699.0,
    "date_created": "2017-06-06",
    "time_created": "03:08:19",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiw15f",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No, I think they recognise the difference in abilities required for campaigning and negotiating. Being shit at dealing with the public is not the same as being shit in talks between political bodies. I'm a lefty but this seems pretty obvious. There might be a little schadenfreude in some parts but that's about it.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496769589.0,
    "date_created": "2017-06-06",
    "time_created": "05:19:49",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diivw3j",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Lol no",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496769174.0,
    "date_created": "2017-06-06",
    "time_created": "05:12:54",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij45wk",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think is her plan.\n\nhttps://www.youtube.com/watch?v=kGex0kLgNok",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496785665.0,
    "date_created": "2017-06-06",
    "time_created": "09:47:45",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiy44d",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "They had in David Cameron the chance to negotiate a deal that would have prevented the leave vote. I'm pretty sure many of them will have reflected on this and will be keen to get the balance of these negotiations right regardless of who's on the other side of the table. There's a lot of talk here about May having to sell the deal she strikes to the British people and to parliment but actually it's the EU leaders who are going to have a much tougher time selling any sort of outcome to their electorates. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496775266.0,
    "date_created": "2017-06-06",
    "time_created": "06:54:26",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij0nmy",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The communist take over of this sub during another election day has been marvellous to watch.\n\nBTW, the left are fucked.",
    "controversiality": 1,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496780424.0,
    "date_created": "2017-06-06",
    "time_created": "08:20:24",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diivvjw",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "madman theory",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496769130.0,
    "date_created": "2017-06-06",
    "time_created": "05:12:10",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diixb0a",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "How could they know? All she has done is given carefully prepared speeches and hasnt given herself the opportunity to argue properly. Going up against Jeremy Paxman isn't really something to be proud of, because  JP just behaves like a bit of a bully and doesnt even let someone finish their sentence before firing another question / accusation. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496773201.0,
    "date_created": "2017-06-06",
    "time_created": "06:20:01",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diixo8u",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yes, sarcastically.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496774167.0,
    "date_created": "2017-06-06",
    "time_created": "06:36:07",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij6pex",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "My dad..",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496788660.0,
    "date_created": "2017-06-06",
    "time_created": "10:37:40",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij72dy",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "... oh they are definitely going to re-think their approach...",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496789055.0,
    "date_created": "2017-06-06",
    "time_created": "10:44:15",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij7e4j",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Depends how much she wins by.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496789421.0,
    "date_created": "2017-06-06",
    "time_created": "10:50:21",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij7riq",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Not only politicians have seen May's performance. I have been walking around british owned houses in la costa del sol to see which one I will take! ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496789832.0,
    "date_created": "2017-06-06",
    "time_created": "10:57:12",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijaq97",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The funny think is she won't be negotiating it will be civil servants and solicitors. She'll swoop in now and again to have lunch with them and  make out she got shit done but only contribution she'll make is to sign any deal we make at the end",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496793045.0,
    "date_created": "2017-06-06",
    "time_created": "11:50:45",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijavsd",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I genuinely dont give a fuck about eu politicians.\n\nShe is crap though",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496793209.0,
    "date_created": "2017-06-06",
    "time_created": "11:53:29",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijb5ie",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Videos in this thread: [Watch Playlist &#9654;](http://subtletv.com/_r6fk62s?feature=playlist)\n\nVIDEO|COMMENT\n-|-\n[Yes Minister — Why Britain Joined the European Union](http://www.youtube.com/watch?v=37iHSwA1SwE)|[+6](https://www.reddit.com/r/ukpolitics/comments/6fk62s/_/dij0t6a?context=10#dij0t6a) - Why Britain joined the European Union.\n[Dinner of Doom](http://www.youtube.com/watch?v=3MgyRO3c870)|[+6](https://www.reddit.com/r/ukpolitics/comments/6fk62s/_/diitinp?context=10#diitinp) - Yeah...\n[Zach Galifianakis Laugh](http://www.youtube.com/watch?v=zBkuNpgACH0)|[+1](https://www.reddit.com/r/ukpolitics/comments/6fk62s/_/dijj0kf?context=10#dijj0kf) - http://www.youtube.com/watch?v=zBkuNpgACH0\n[Jam - Thick People](http://www.youtube.com/watch?v=kGex0kLgNok)|[+1](https://www.reddit.com/r/ukpolitics/comments/6fk62s/_/dij45wk?context=10#dij45wk) - I think is her plan.\nI'm a bot working hard to help Redditors find related videos to watch. I'll keep this updated as long as I can.\n***\n[Play All](http://subtletv.com/_r6fk62s?feature=playlist&ftrlnk=1) | [Info](https://np.reddit.com/r/SubtleTV/wiki/mentioned_videos) | Get me on [Chrome](https://chrome.google.com/webstore/detail/mentioned-videos-for-redd/fiimkmdalmgffhibfdjnhljpnigcmohf) / [Firefox](https://addons.mozilla.org/en-US/firefox/addon/mentioned-videos-for-reddit)",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496793501.0,
    "date_created": "2017-06-06",
    "time_created": "11:58:21",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijc2vx",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Maybe I'm an idiot but I was under the impression that the UK Government basically hired a bunch of professional negotiators, the EU would hire a bunch of professional negotiators, and the leaders sit back and twiddle their thumbs while the professionals hash it out, both trying to get the best deal for their side (similar to the way you hire a lawyer in court).\n\nTheresa May's negotiating ability actually isn't overly important therefore (neither is Corbyn's). Is that not how this works?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496794501.0,
    "date_created": "2017-06-06",
    "time_created": "12:15:01",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijda0r",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[Better stock up!](http://www.eastessence.com/?gclid=CjwKEAjwpdnJBRC4hcTFtc6fwEkSJABwupNiQJ1dBMJUa9JCzaHullmaq0JB4cn3cF5sYy1IviDBDBoCg6Pw_wcB&whence=)",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496795780.0,
    "date_created": "2017-06-06",
    "time_created": "12:36:20",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijeazn",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "This entire questioned is premised on May negotiating any portion of the deal herself. Of course, that assumption is false. No PM negotiates trade deals or much of anything for that manner. There are professional negotiators that do it.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496796849.0,
    "date_created": "2017-06-06",
    "time_created": "12:54:09",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijf7nv",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496797806.0,
    "date_created": "2017-06-06",
    "time_created": "13:10:06",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijij0c",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "What do you think they think about Corbyn?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496801245.0,
    "date_created": "2017-06-06",
    "time_created": "14:07:25",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijku9y",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think the only thing that matters is the vote next thursday. I may (substantially) increases her majority it won't look like a cock-up at all in hindsight.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496803675.0,
    "date_created": "2017-06-06",
    "time_created": "14:47:55",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijm6os",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Get May the fuck out of there Britain. Vote Labour. Get out of Brexit any way you can. May has been manipulating Englands grief. From an outsider looking in, UK stood up to the fascism and bigotry and as one voice chose to say, \"Fuck off, Hitler\" \n\nIts time to do that again. Vote Labour. Be patriots to your people and the world.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496805060.0,
    "date_created": "2017-06-06",
    "time_created": "15:11:00",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijm8vz",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No but they would probably rather play football against Estonia than San Marino",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496805124.0,
    "date_created": "2017-06-06",
    "time_created": "15:12:04",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijofev",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I suspect the EU opinion of Britain's leaders has always been \"What Le Fuck?\" and little changes.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496807385.0,
    "date_created": "2017-06-06",
    "time_created": "15:49:45",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijotbg",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think the long time members of the EU knew to expect although some of the newer members may have conflicting feelings about it. They'd ask why would a nation that hasn't been occupied leave a voluntary union of sovereign states. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496807782.0,
    "date_created": "2017-06-06",
    "time_created": "15:56:22",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijxllb",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "This sub has been overrun by Momentum people. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496817670.0,
    "date_created": "2017-06-06",
    "time_created": "18:41:10",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dik6u9h",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "... NO !",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496829510.0,
    "date_created": "2017-06-06",
    "time_created": "21:58:30",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dik7kyw",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "What if the EU offer the UK everything they want but on the condition that England has to rename itself to Smellycuntland?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496830498.0,
    "date_created": "2017-06-06",
    "time_created": "22:14:58",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dikiv3x",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think they will play it out and push for the 4freedoms resulting in no deal.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496850732.0,
    "date_created": "2017-06-07",
    "time_created": "03:52:12",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diklk5g",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "After seeing her performance, they may well rethink their approach...",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496858044.0,
    "date_created": "2017-06-07",
    "time_created": "05:54:04",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dinftji",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Wrong question. Better question is whether corbyns team would be any more formidable. Answer is no.  ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496992883.0,
    "date_created": "2017-06-08",
    "time_created": "19:21:23",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiw6yz",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Lol @ implying election calpaigning has anything to do with negotiating.",
    "controversiality": 1,
    "ups": -1,
    "downs": 0,
    "score": -1,
    "created": 1496770065.0,
    "date_created": "2017-06-06",
    "time_created": "05:27:45",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiypd7",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Now name the shadow brexit minister? shadow foreign minister?  Shadow anything that isn't the marxist shadow chancellor or \"ill\" shadow home secretary?",
    "controversiality": 1,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1496776609.0,
    "date_created": "2017-06-06",
    "time_created": "07:16:49",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij2ffv",
    "parent_id": "t3_6fk62s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "We get it. May is bad. You all agree.",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496783243.0,
    "date_created": "2017-06-06",
    "time_created": "09:07:23",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diix1w2",
    "parent_id": "t1_diiw7ef",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Kinda like one of your friends sold their house and joined a cult one weekend.\n\nHaha! You win Analogy of the Day. Fucking excellent!",
    "controversiality": 0,
    "ups": 392,
    "downs": 0,
    "score": 392,
    "created": 1496772527.0,
    "date_created": "2017-06-06",
    "time_created": "06:08:47",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diixzd4",
    "parent_id": "t1_diiw7ef",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "that's why brexit will be so much better with corbyn at the helm. there will be a common sense of 'let's clean up this mess left by those loonies' the room",
    "controversiality": 0,
    "ups": 167,
    "downs": 0,
    "score": 167,
    "created": 1496774941.0,
    "date_created": "2017-06-06",
    "time_created": "06:49:01",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diji2nc",
    "parent_id": "t1_diiw7ef",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Actually they don't really care anymore. Some pretty sharp remarks have been bandied around in the press and by Tory ministers so the good will is rapidly drying up.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496800768.0,
    "date_created": "2017-06-06",
    "time_created": "13:59:28",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij8d34",
    "parent_id": "t1_diiw7ef",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "This very much. Denmark originally only joined the EEC because UK joined. Now you guys are leaving and with that the voice of northern Europe will be strongly weakened. It'll be bad for all of us.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496790496.0,
    "date_created": "2017-06-06",
    "time_created": "11:08:16",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij07mp",
    "parent_id": "t1_diiw7ef",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Ya I'm pretty disappointed as a Brussels representative.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496779651.0,
    "date_created": "2017-06-06",
    "time_created": "08:07:31",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij4ybr",
    "parent_id": "t1_diiw7ef",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'm Irish. I will really miss you guys. We love your culture, we hate to admit it, and we dig at you with every chance. But that's because we're like a family. Family can slag each other.  \n  Hope we can achieve some sort normality between ourselves ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496786668.0,
    "date_created": "2017-06-06",
    "time_created": "10:04:28",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij8tjd",
    "parent_id": "t1_diiw7ef",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That's the best way to put it I've heard for a while. :)",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496790995.0,
    "date_created": "2017-06-06",
    "time_created": "11:16:35",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijt8pu",
    "parent_id": "t1_diiw7ef",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Did we sell the house ... I though we were just dismantling it so that we could rebuild it on a sunlit upland somewhere (maybe in the south of Spain?)",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496812549.0,
    "date_created": "2017-06-06",
    "time_created": "17:15:49",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijx744",
    "parent_id": "t1_diiw7ef",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Hope they understand not all of us wanted to join the cult. I got dragged along.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496817178.0,
    "date_created": "2017-06-06",
    "time_created": "18:32:58",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwce0",
    "parent_id": "t1_diivfaf",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "\"You lose! Good day, madam!\"",
    "controversiality": 0,
    "ups": 76,
    "downs": 0,
    "score": 76,
    "created": 1496770496.0,
    "date_created": "2017-06-06",
    "time_created": "05:34:56",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiybmz",
    "parent_id": "t1_diivfaf",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "\"Wrong, sir! Wrong! Under section 37B of the contract signed by him, it states quite clearly that all offers shall become null and void if - and you can read it for yourself in this photostatic copy - \"I, the undersigned, shall forfeit all rights, privileges, and licenses herein and herein contained,\" et cetera, et cetera... \"Fax mentis, incendium gloria cultum,\" et cetera, et cetera... Memo bis punitor delicatum! It's all there! Black and white, clear as crystal!\"",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1496775757.0,
    "date_created": "2017-06-06",
    "time_created": "07:02:37",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diixkcs",
    "parent_id": "t1_diiuozn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think they'd appreciate someone and cooperate more with someone who talks like them and wants to make deals in ways they appreciate, and Corbyn fits that description way more than May.\n\nI think they'd be more cooperative with Corbyn than May, and I don't think May has the anything to serious threaten them with, which kind of renders her negotiating style useless.",
    "controversiality": 0,
    "ups": 63,
    "downs": 0,
    "score": 63,
    "created": 1496773882.0,
    "date_created": "2017-06-06",
    "time_created": "06:31:22",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijj42k",
    "parent_id": "t1_diiuozn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Besides, Labour have appointed Kier Starmer to do all of the negotiating. \n\nId trust a top tier lawyer over the current pm any day of my life. ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1496801877.0,
    "date_created": "2017-06-06",
    "time_created": "14:17:57",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiv52g",
    "parent_id": "t1_diiuozn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "makes sense.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496767001.0,
    "date_created": "2017-06-06",
    "time_created": "04:36:41",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij1i6m",
    "parent_id": "t1_diiuozn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "They said they would halt crunch talks if there is a change of government (and they must realise he is the only other person but May to get in?) and I'm pretty sure May has been banned from talking to anyone in the EU but one negotiator?\n\nIt says it all really. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496781825.0,
    "date_created": "2017-06-06",
    "time_created": "08:43:45",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij5tom",
    "parent_id": "t1_diiuozn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think you're overestimating the uniqueness of the proposal the UK is going to receive. If UK wants to remain in the single market they'll be proposed the \"Norway deal\", if they don't they'll probably receive a free trade deal after the divorce settlement, with no access to anything else.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496787669.0,
    "date_created": "2017-06-06",
    "time_created": "10:21:09",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwwq9",
    "parent_id": "t1_diiuobm",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "you think there is magic lube tree?",
    "controversiality": 0,
    "ups": 136,
    "downs": 0,
    "score": 136,
    "created": 1496772119.0,
    "date_created": "2017-06-06",
    "time_created": "06:01:59",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwd74",
    "parent_id": "t1_diiuobm",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Good job she doesn't think it's a sin.",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1496770557.0,
    "date_created": "2017-06-06",
    "time_created": "05:35:57",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiutgm",
    "parent_id": "t1_diiuobm",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "She's used to that, but usually she's wearing the strap-on",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496766069.0,
    "date_created": "2017-06-06",
    "time_created": "04:21:09",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij7dt9",
    "parent_id": "t1_diiuobm",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The EU has no leverage over Britain whatsoever, and people who think otherwise are delusional. \n\n- Trade: Britain buys far more from the EU than vice-versa. \n- Money: Britain pays far more to the EU than vice-versa.\n- Rights of nationals: Britain provides far more employment to EU citizens than vice-versa\n- Natural resources: The EU takes far more fish from Britain than vice-versa.\n- Banking: The EU is far more susceptible to financial shocks than is Britain, due to the Euro straitjacket.\n- Defence: The EU is far more reliant on the British military and intelligence services for defence against Russia than vice-versa.\n\nIf Britain trades less with the EU, it will either make more stuff for itself - boosting the economy - or import more stuff from poorer, cheaper countries - boosting the economy. \n\nThese are just facts. It's odd to me that so many people are in complete denial about them. ",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496789411.0,
    "date_created": "2017-06-06",
    "time_created": "10:50:11",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dikju1o",
    "parent_id": "t1_diiuobm",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The Tories will just use the blood of the proles.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496853312.0,
    "date_created": "2017-06-07",
    "time_created": "04:35:12",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij1dhl",
    "parent_id": "t1_diiwib7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Even importanter to remember that that includes Boris Johnston",
    "controversiality": 0,
    "ups": 61,
    "downs": 0,
    "score": 61,
    "created": 1496781618.0,
    "date_created": "2017-06-06",
    "time_created": "08:40:18",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij3ayf",
    "parent_id": "t1_diiwib7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "This is true, but on the other hand Mayism essentially demands that all political decisions be signed off by her. The Tory cabinet and government generally are already reportedly frustrated by this. It's going to get worse when teams of negotiators are sent to Europe. No one quite knows how much authority they have.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1496784503.0,
    "date_created": "2017-06-06",
    "time_created": "09:28:23",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijn7g8",
    "parent_id": "t1_diiwib7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> It's important to remember that the negotiations go far beyond the PM.\n\n\nIt's important to remember that the UK has few people experimented in such negotiations.\n",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496806106.0,
    "date_created": "2017-06-06",
    "time_created": "15:28:26",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij6i92",
    "parent_id": "t1_diiwib7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Didn't she say she would be negotiating tho",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496788434.0,
    "date_created": "2017-06-06",
    "time_created": "10:33:54",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiw95r",
    "parent_id": "t1_diiuwj0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Ah, the Donald Trump school of diplomacy. ",
    "controversiality": 0,
    "ups": 96,
    "downs": 0,
    "score": 96,
    "created": 1496770233.0,
    "date_created": "2017-06-06",
    "time_created": "05:30:33",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwaap",
    "parent_id": "t1_diiuwj0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Only if they feared negotiations failing. To be honest, I think its more likely that 27 countries banding together can weather the fallout of failed negotiations better than a single country on the outside of a protectionist bloc.",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1496770325.0,
    "date_created": "2017-06-06",
    "time_created": "05:32:05",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiy9vh",
    "parent_id": "t1_diiuwj0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Like playing chess against a player who knows the rules but has no skill. Making wild moves that are actually difficult to deal with.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496775644.0,
    "date_created": "2017-06-06",
    "time_created": "07:00:44",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijgfqg",
    "parent_id": "t1_diiuwj0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That is a very common property of games in general. Novices make unexpected moves hurting themselves and some other players.\n\nNegotiation is about finding a solution that benefits all parties when there are some conflicts of interest involved. It's not a zero sum game.\n\nEven an ideal negotiator who has a complete knowledge of all benefits and interests on the table and knows what's the optimal game for each party can't guarantee a good outcome for anyone if there's a random element like an incompetent negotiator around.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496799083.0,
    "date_created": "2017-06-06",
    "time_created": "13:31:23",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwnn2",
    "parent_id": "t1_diiuwj0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Because it can take time to realise it is incompetence and not some feng shui 3D chess. But once you have a handle on the situation you can take particular delight as they eventually succumb under the weight of their own hubris. Not the long lasting pleasure of besting a formidable opponent, but pleasure all the same.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496771391.0,
    "date_created": "2017-06-06",
    "time_created": "05:49:51",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiuet6",
    "parent_id": "t1_diitzpv",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "She made Corbyn go from unelectable autistic groundskeeper to charming relatable and compassionate leader of a movement in the eyes of a large amount of people in under 2 months, by the end of brexit we'll probably think the EU negotiators are the angels here to deliver us from the Tories",
    "controversiality": 0,
    "ups": 372,
    "downs": 0,
    "score": 372,
    "created": 1496764932.0,
    "date_created": "2017-06-06",
    "time_created": "04:02:12",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij04zr",
    "parent_id": "t1_diitzpv",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">we'd best not fuck around with May or she might take the EU down with her.\n\nI don't think they see her as that much of a threat at all. If anything I think the various gaffes and fiascos of this election will embolden them to squeeze her on various terms. \n\nIf she walks away the EU will be hurt, this is true. However, they understand from the outset that their leverage is much heavier than hers. Without any kind of deal at all the UK will be under WTO trade standards and our goods will get squeezed with tarriffs where before there were none. Air traffic will come to a halt as previous agreements on unrestricted air access are torn up. The absense of border agreements will strangle trade with not only the 27 countries of the EU, but further abroad too. Japan has voiced their grievances, threatening a sharp loss of investment if Britain cannot retain access to the single market. America has already shown it's priorities in favouring a deal with the EU over Britain, for whom it's off to the back of the queue again. The question of security is also one where they hold all the cards, with Macron suggesting that moving border controls currently in place at Calais over to the UK may become a condition to any border deal.\n\nWanna know the best part of all? EU countries have a convenient patsy for any damage caused to their economies by brexit. Theresa May has repeatedly gone on record saying no deal is better than a bad deal and that she'll be \"a bloody difficult woman\". She's lined herself up for taking on all the blame for whatever consequences come from negotiations whether she walks away from the negotiating table or not.",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1496779515.0,
    "date_created": "2017-06-06",
    "time_created": "08:05:15",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiv4ax",
    "parent_id": "t1_diitzpv",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think their thoughts are \"glad they are leaving..\"",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1496766939.0,
    "date_created": "2017-06-06",
    "time_created": "04:35:39",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diixdo7",
    "parent_id": "t1_diitzpv",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": " She Clintoned it. All she had to do was look mildly competent and she would have a landslide but nope. Constant robotic fuck ups from start to finish.",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1496773388.0,
    "date_created": "2017-06-06",
    "time_created": "06:23:08",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diivj5i",
    "parent_id": "t1_diitzpv",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Maybe that's her plan? Run such a disastrous campaign to force the EU in to giving the UK a good deal. Or risk Theresa May refusing to take the UK out of the EU, leaving her with influence in the EU and running it into the ground. \n\nA stroke of genius! ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1496768127.0,
    "date_created": "2017-06-06",
    "time_created": "04:55:27",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiv53y",
    "parent_id": "t1_diitzpv",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">And we'd best not fuck around with May or she might take the EU down with her. \n\nShe couldn't even if she wanted to. We need them far more than they need us. \n\n",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1496767005.0,
    "date_created": "2017-06-06",
    "time_created": "04:36:45",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij700y",
    "parent_id": "t1_diitzpv",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Even worst case scenario would not take the EU down despite the wet dreams of ukip. It would be damaged economically, Ireland in particular would be hurt badly but the EU has broad shoulders and a very strong Franco German core. I would hope that lessons have been learned about emergency management from the euro/sovereign debt crisis.\n\nThe UK however has limited if any external support mechanisms to help cope with such a cliff edge. Possible that an EU/IMF rescue package may be necessary in that scenario. Having lived through one, I wouldn't reccomend it.\n\nWorst case scenario is best avoided.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496788986.0,
    "date_created": "2017-06-06",
    "time_created": "10:43:06",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiy4ye",
    "parent_id": "t1_diitzpv",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">And we'd best not fuck around with May or she might take the EU down with her.\n\nThat is the most incredible mental gymnastics I have ever seen.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496775325.0,
    "date_created": "2017-06-06",
    "time_created": "06:55:25",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diitka7",
    "parent_id": "t1_diitck4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It will be her mandate against their mandate. Hilarious that people say the EU ignores democracies but they will somehow take notice of ours!",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1496762693.0,
    "date_created": "2017-06-06",
    "time_created": "03:24:53",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwxdz",
    "parent_id": "t1_diivwhg",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "A number of EU members has always seen the UK as a distorting factor for unity as far back as the early '90s when John Major was negotiating the Maastricht Treaty and was vocal of an 'a la carte' Europe, effectively opposing any integration process. No doubt they want you in, but 'all in'. They won't be sad to see you go the way things evolved ",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1496772172.0,
    "date_created": "2017-06-06",
    "time_created": "06:02:52",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij6bvo",
    "parent_id": "t1_diivwhg",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I kinda thought they viewed us as the weird kid in the corner eating glue from the pot",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496788235.0,
    "date_created": "2017-06-06",
    "time_created": "10:30:35",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij7uco",
    "parent_id": "t1_diivwhg",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I would disagree. Both Thatcher and Blair were respected in Europe even if they weren't agreed with. Both actively sought dialogue with their EU peers and argued well thought-out positions. Other EU leaders respected that. The current government lacks that credibility.\n\n\n\n",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496789920.0,
    "date_created": "2017-06-06",
    "time_created": "10:58:40",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diivfo5",
    "parent_id": "t1_diivaf7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Well Davis is an incompetent ideologue. Running rings around him won't exactly be hard.",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1496767846.0,
    "date_created": "2017-06-06",
    "time_created": "04:50:46",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijnb4x",
    "parent_id": "t1_diizvl3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I suspect it's the brexit nut jobs on the right of her party who are going to get something rammed down their throats if she gets a big majority.\n\nA hung parliament could be the worst of all worlds in terms of brexit as the tail could start wagging the dog again.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496806213.0,
    "date_created": "2017-06-06",
    "time_created": "15:30:13",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijdbcr",
    "parent_id": "t1_diivaj9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> The EU will tell us what deal we can have and we will take it and like it.\n\nI know this because reasons",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496795820.0,
    "date_created": "2017-06-06",
    "time_created": "12:37:00",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiy5xn",
    "parent_id": "t1_diivaj9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I still think the Tories are preparing to crash us out into WTO.",
    "controversiality": 1,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496775390.0,
    "date_created": "2017-06-06",
    "time_created": "06:56:30",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij0iqq",
    "parent_id": "t1_diiy3ru",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "https://www.tactical2017.com/",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1496780196.0,
    "date_created": "2017-06-06",
    "time_created": "08:16:36",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijd28o",
    "parent_id": "t1_diixq3w",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">ignoring the 48%\n\nSomething tells me that if Remain won and Brexiteers were the 48 percent, you'd be quite content with ignoring them. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496795547.0,
    "date_created": "2017-06-06",
    "time_created": "12:32:27",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij0mvy",
    "parent_id": "t1_diiyoax",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You mean the guy that's capitalised on his opponents mistakes, put up a united front for a party that was in massive disarray only a year ago and highly closed a 20 point lead according to the polls?\n\nYeah, that guy clearly isn't a good political operator.",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1496780390.0,
    "date_created": "2017-06-06",
    "time_created": "08:19:50",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijf4yx",
    "parent_id": "t1_diizn8a",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It's the same shitty campaigning we have seen from brexit to Clinton in the us. A campaign run on negativity about the 'other side', and contempt for anyone who is either unsure or leaning the other way.\n\"Your going to vote Labour, you must be an idiot\".\n\nThe lack of a serious, costed, well thought out manifesto shows just how dangerous a cocky Tory party is. I actually want a hung parliament at this point. A Tory party in check (see the last coalition) is a pretty decent government, but we need a strong opposition to keep them in check!",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496797727.0,
    "date_created": "2017-06-06",
    "time_created": "13:08:47",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diix7zs",
    "parent_id": "t1_diiw98r",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">I don't really see what the point of this post is. It has a lot of upvotes because it's anti-conservative and that seems to be the prevailing mood on this subreddit at the moment... but the point of the GE was never to 'intimidate' other global leaders with the magnitude of Theresa May's big throbbing mandate or her domestic political expertise.\n\nI don't think the purpose of the GE was to intimidate EU leaders in the slightest. However, the GE has forced Theresa May to make moves and fight battles. There is much that EU leaders and diplomats can take from the way that May has run her campaign and I don't think she has revealed herself to be either strong or stable.\n\nOf course, she will likely win. But what OP is saying is that the characteristics that May has revealed of herself have not exactly been positive.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496772978.0,
    "date_created": "2017-06-06",
    "time_created": "06:16:18",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwmb7",
    "parent_id": "t1_diiw98r",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I agree with a lot of this. For a Brexit election there's not been any particularly engaging debate around Brexit at all by the main parties.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496771285.0,
    "date_created": "2017-06-06",
    "time_created": "05:48:05",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiy29e",
    "parent_id": "t1_diiw98r",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> So how well Corbyn did is likely to become pretty moot other than in the ensuing labour leadership challenge.\n\nIf he loses no seats and gains, I don't think there will be a challenge. Corbyn has shown himself to be quite the statesman who can, and will, hold the Tories to account.\n\nI doubt the PLP will shoot themselves once more, in the foot.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496775141.0,
    "date_created": "2017-06-06",
    "time_created": "06:52:21",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij5elj",
    "parent_id": "t1_diiw98r",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It's because it's election season. When the Tories win comfortably they'll all leave. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496787200.0,
    "date_created": "2017-06-06",
    "time_created": "10:13:20",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij47rh",
    "parent_id": "t1_diiw98r",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Not that I disagree with any of the meat and potatoes here - most Americans don't see Trump as having a mandate since he lost the popular vote by 3 million.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496785734.0,
    "date_created": "2017-06-06",
    "time_created": "09:48:54",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiuh3a",
    "parent_id": "t1_diiubiu",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Nah, she hasn't been thinking about the election, she's been thinking about Brexit negotiations instead, she said on the TV and then pulled a face that looked like she was having a minor stroke. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496765105.0,
    "date_created": "2017-06-06",
    "time_created": "04:05:05",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijjq1z",
    "parent_id": "t1_diiw2uh",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That's the funny thing a lot of people don't realise its civil servants running the country day to day and they just take direction from politicians. \n\nIf there were no MP's tomorrow the country could still function its just decisions could not be made on certain things you can still apply the legislation which is current. \n\nBut there again when MP's come in and out of the \"job\" you don't see the top level civil servants constantly changing, those that run departments and are not elected in the same way if at all as MP's.  ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496802512.0,
    "date_created": "2017-06-06",
    "time_created": "14:28:32",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijd8eh",
    "parent_id": "t1_diiw2uh",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Shh, let people enjoy circlejerks",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496795733.0,
    "date_created": "2017-06-06",
    "time_created": "12:35:33",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dikl38m",
    "parent_id": "t1_diiw2uh",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Except that image is exactly how she's been arguing it, so you can hardly blame people for turning it around on her: 'Vote for me, **I'm** a strong negotiator, Corbyn isn't'",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496856784.0,
    "date_created": "2017-06-07",
    "time_created": "05:33:04",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diivbhn",
    "parent_id": "t1_diitzuk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "david cameron and george osborne didn't have much respect for her either.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1496767514.0,
    "date_created": "2017-06-06",
    "time_created": "04:45:14",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiuda9",
    "parent_id": "t1_diitzuk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "There's plenty of quotes going round from Tory MPs complaining about her performance in the campaign. Do you honestly believe that her colleagues have been anything other than appalled at the pigs ear she's making of an election that she called?",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1496764816.0,
    "date_created": "2017-06-06",
    "time_created": "04:00:16",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diixzqx",
    "parent_id": "t1_diitzuk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Given that a politician derives their mandate from the votes of the people, judging politicians at least partly on the opinions of the public that voted for them is not only normal, but necessary. If leaders in the rest of Europe look at May, even if she wins a majority, and see a leader who has done nothing but slide in the polls since she announced an election it was supposed to be *impossible* for her to lose, stating it was about a strong bargaining position, they will know her position is weak and she has little political capital to play with in negotiations.\n\nImagine you were an EU leader and you saw the British PM barely clinging to power, knowing she had to do whatever she could to avoid being ousted by her party. Would that person seem like a strong negotiator who could call your bluff? Or would she seem like a person desperate for any bit of good press even if it means a bigger sacrifice for her country?",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496774969.0,
    "date_created": "2017-06-06",
    "time_created": "06:49:29",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijaeg1",
    "parent_id": "t1_diitzuk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "They will judge her based on the fact that she is a robot and has been useless up against one inexperienced, uncharismatic politician and crumbles under pressure when challenged or questioned. She should be seeing Putin levels of popularity at this point given the cards that she's been dealt. \n\nIn the negotiations May is going up against dozens of twattish Brussels Bureaucrats (who will do everything in their power to wrong-foot her and make Brexit fail) and at least 27 elected politicians, many of whom are far better political operators than she is. \n\nThe best we can hope for is that she'll actually bother to fucking turn up to the negotiations rather than no-show, but it's going to be a shit-show regardless. She's completely out of her depth, she can't even run a general election campaign against the easiest candidate in decades, let alone debate him, and people actually think that she's going to outplay and outmanoeuvre all of Europe? \n\nWe need a Machievellian genius to lead the negotiations who can divide and conquer Europe, not an incompetent that has never met a single one of her self-set targets in political office. Unfortunately we don't have a genius so May it is. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496792697.0,
    "date_created": "2017-06-06",
    "time_created": "11:44:57",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiv6gg",
    "parent_id": "t1_diit5zo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It's OK, they get to meet her face to face. And that's even *worse*.",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1496767118.0,
    "date_created": "2017-06-06",
    "time_created": "04:38:38",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diitku3",
    "parent_id": "t1_diit5zo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Come on mate even the BBC can't prop her up any more. She is useless. ",
    "controversiality": 0,
    "ups": 111,
    "downs": 0,
    "score": 111,
    "created": 1496762731.0,
    "date_created": "2017-06-06",
    "time_created": "03:25:31",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diivmdd",
    "parent_id": "t1_diit5zo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Shes completely incompetent, basically she looks the part but this campaign has shown her up as completely empty she knows nothing she believes in nothing. No politician should become prime minster by default shes worse than brown. She should never become pm, the brexit campaign was a mess but the result was what it was and the next leader needed to come from, boris, gove or davis all of whom are very flawed people and politicians but at least have a slight bit of intelligence and political cunning may has nothing.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496768391.0,
    "date_created": "2017-06-06",
    "time_created": "04:59:51",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiv7pr",
    "parent_id": "t1_diit5zo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "or telegraph, or conservativehome",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496767216.0,
    "date_created": "2017-06-06",
    "time_created": "04:40:16",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diit75c",
    "parent_id": "t1_diit5zo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Well we read what happened at the dinner with Juncker.",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1496761782.0,
    "date_created": "2017-06-06",
    "time_created": "03:09:42",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diixldt",
    "parent_id": "t1_diit5zo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">I guess it depends how many EU politicians form their opinion of her based on articles in the Independent and Guardian, rather than in person.\n\nHow else can they base an opinion. Whenever they have an appointment she cancels and sends someone else instead.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496773960.0,
    "date_created": "2017-06-06",
    "time_created": "06:32:40",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diizv71",
    "parent_id": "t1_diit5zo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "How about her polling performance? How about her refusal to be interviewed? Her refusal to debate? Her refusal to allow any questions that weren't handpicked? Her propensity for lying very obviously (look at the U-Turn)?\n\nYou don't need to read the Indie or the Guardian to see any of those things, Guido has even commented on half of them ffs.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496778999.0,
    "date_created": "2017-06-06",
    "time_created": "07:56:39",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwoa7",
    "parent_id": "t1_diit5zo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Are you blind?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496771443.0,
    "date_created": "2017-06-06",
    "time_created": "05:50:43",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diix4j8",
    "parent_id": "t1_diiw15f",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "While the two are markedly different I would argue the general election has revealed and reinforced many of May's characteristics that are relevant to the negotiation.\n\nHer constant U-turns, her inability to speak clearly and succinctly talking instead in soundbites (already shown in the No. 10 dinner) or vague and hollow phrases, her paranoia and lack of teamwork, her micromanagement etc.\n\nForeign leaders can see this and then some. ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1496772726.0,
    "date_created": "2017-06-06",
    "time_created": "06:12:06",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij6l32",
    "parent_id": "t1_diiw15f",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "If she can't handle the punters who have no idea what they're talking about, how can she handle the experienced and trained negotiators she will be talking to?\n\nShe has no chance.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496788526.0,
    "date_created": "2017-06-06",
    "time_created": "10:35:26",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij469v",
    "parent_id": "t1_dij45wk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "SECTION | CONTENT\n:--|:--\nTitle | Jam - Thick People\nDescription | \"We specialise in providing thick people for jobs that they're particularly good at.\"\r \r A sketch from Chris Morris' surreal, dark comedy 'Jam'.\r \r It's supposed to go slow and jerky at the start and the end, it's not an error.\nLength | 0:03:13\n\n \n\n \n \n \n****\n \n^(I am a bot, this is an auto-generated reply | )^[Info](https://www.reddit.com/u/video_descriptionbot) ^| ^[Feedback](https://www.reddit.com/message/compose/?to=video_descriptionbot&subject=Feedback) ^| ^(Reply STOP to opt out permanently)",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496785678.0,
    "date_created": "2017-06-06",
    "time_created": "09:47:58",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijmcr6",
    "parent_id": "t1_diiy44d",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> There's a lot of talk here about May having to sell the deal she strikes to the British people and to parliment but actually it's the EU leaders who are going to have a much tougher time selling any sort of outcome to their electorates.\n\nAre you that deluded? From my perspective in an EU country, I find that few people care about the UK, it out of the EU will probably mean some loss, but that is because of the UK, which is perceived as a spoiled brat that was ruining things most of the time.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496805231.0,
    "date_created": "2017-06-06",
    "time_created": "15:13:51",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diizb8d",
    "parent_id": "t1_diiy44d",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I thought my vote swung on if we can get a better deal. I didn't even hear about what was proposed and if anything happened. In the end I voted but wasn't cast. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496777902.0,
    "date_created": "2017-06-06",
    "time_created": "07:38:22",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij4r8x",
    "parent_id": "t1_dij0nmy",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You using the word communist makes me laugh. Can I call you fascist or Nazis now then? Is that where you're setting the bar? ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496786418.0,
    "date_created": "2017-06-06",
    "time_created": "10:00:18",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij4oc3",
    "parent_id": "t1_dij0nmy",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I don't know about you but I don't see any call for the blood of the Bourgeoisie or to seize the means of production...",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496786316.0,
    "date_created": "2017-06-06",
    "time_created": "09:58:36",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij6bpq",
    "parent_id": "t1_dij0nmy",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yeah, so communist. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496788230.0,
    "date_created": "2017-06-06",
    "time_created": "10:30:30",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dinwjsc",
    "parent_id": "t1_dijc2vx",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The negotiators do the paperwork...the leaders do the talking",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1497015804.0,
    "date_created": "2017-06-09",
    "time_created": "01:43:24",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diizix9",
    "parent_id": "t1_diiypd7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Keir Starmer & Emily Thornberry?",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496778329.0,
    "date_created": "2017-06-06",
    "time_created": "07:45:29",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijlnw4",
    "parent_id": "t1_diiypd7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Most EU countries do not have a shadow government^(*), why would that matter?\n\n^(*) maybe because they have usually more parties than two, and need to accommodate for a coalition government. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496804518.0,
    "date_created": "2017-06-06",
    "time_created": "15:01:58",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijcyaj",
    "parent_id": "t1_dij2ffv",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Props for username. Kek",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496795428.0,
    "date_created": "2017-06-06",
    "time_created": "12:30:28",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diixj21",
    "parent_id": "t1_diix1w2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "L Ron Farage.",
    "controversiality": 0,
    "ups": 178,
    "downs": 0,
    "score": 178,
    "created": 1496773783.0,
    "date_created": "2017-06-06",
    "time_created": "06:29:43",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijg3e5",
    "parent_id": "t1_diix1w2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The webarumour is they are going to negotiate the exit in any European language except English. So lets see how the bloody minded women enjoys telling our European cousins what deal we want. Seriously the sad immutable fact is the British tax payer will be footing the bill for whoever claims they can deliver the best deal.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496798729.0,
    "date_created": "2017-06-06",
    "time_created": "13:25:29",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiy9uo",
    "parent_id": "t1_diixzd4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 158,
    "downs": 0,
    "score": 158,
    "created": 1496775642.0,
    "date_created": "2017-06-06",
    "time_created": "07:00:42",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiyygm",
    "parent_id": "t1_diixzd4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You know what - after his campaign performance I'm not even that averse to Corbyn. I should point out that I worked for a Tory minister. So this is a turnaround (voting lib dem tho this time around on pure Brexit).\n\nIt's Dianne abbot that scares me.  ",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1496777154.0,
    "date_created": "2017-06-06",
    "time_created": "07:25:54",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiz2cu",
    "parent_id": "t1_diixzd4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Corbyn still wants to take us out of the single market, so I fail to see how it would be \"so much better\" with him at the helm.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496777386.0,
    "date_created": "2017-06-06",
    "time_created": "07:29:46",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij2lxg",
    "parent_id": "t1_diixzd4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You know that Corbyn is going to take us out of the single market and stop free movement, right? Labour and Tories are basically indistinguishable on Brexit.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496783511.0,
    "date_created": "2017-06-06",
    "time_created": "09:11:51",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijjlab",
    "parent_id": "t1_diji2nc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "As in they like the British in general, it's not like we were all hated. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496802375.0,
    "date_created": "2017-06-06",
    "time_created": "14:26:15",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijd51a",
    "parent_id": "t1_dij07mp",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No personal stake there at all",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496795632.0,
    "date_created": "2017-06-06",
    "time_created": "12:33:52",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij06ny",
    "parent_id": "t1_diiybmz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "\"You stole fizzy lifting drinks! You bumped into the ceiling which now has to be washed and sterilised, so you get nothing! You lose! Good day, sir!\"",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1496779602.0,
    "date_created": "2017-06-06",
    "time_created": "08:06:42",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij6e6j",
    "parent_id": "t1_dij1i6m",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "A friend up on EU politics was talking to me about how Labour are more likely to negotiate well with Europe because Labour sit with the social democratic bloc in the EU Parliament, which is large and has many nations represented. Conservatives split from the conservative bloc to sit effectively alone, with only some polish and separatists for company.\n\nAs you said, that extension if Corbyn wins is a massive indicator of goodwill. The EU doesn't want the chaos of David Davis turning up and saying 'fuck off [wow I'm a genius I can't believe I just cut the gordian knot]' and that aftermath.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1496788306.0,
    "date_created": "2017-06-06",
    "time_created": "10:31:46",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijcdca",
    "parent_id": "t1_dij5tom",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I can't us remaining in the single market because that does require freedom of movement, and if we don't have freedom of movement I don't think they'd be so kind as to offer us tariff free trade either (low tariff maybe, but tariff free seems out of the question). As such, I think more negotiation is going to be needed than you may think.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496794812.0,
    "date_created": "2017-06-06",
    "time_created": "12:20:12",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij5zyi",
    "parent_id": "t1_diiwwq9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You can't just shake the magic lube tree, you've got to squeeze from the bottom and apply to the top 1%",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1496787866.0,
    "date_created": "2017-06-06",
    "time_created": "10:24:26",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij6d1o",
    "parent_id": "t1_diiwwq9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "perfect",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496788272.0,
    "date_created": "2017-06-06",
    "time_created": "10:31:12",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwzd5",
    "parent_id": "t1_diiwd74",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Relevant username.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1496772326.0,
    "date_created": "2017-06-06",
    "time_created": "06:05:26",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijl87u",
    "parent_id": "t1_diiwd74",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Theresa May is pro-anal",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496804073.0,
    "date_created": "2017-06-06",
    "time_created": "14:54:33",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij7a4w",
    "parent_id": "t1_diiutgm",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I need to cleanse my mind of that image. Thank you.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496789296.0,
    "date_created": "2017-06-06",
    "time_created": "10:48:16",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijb9oh",
    "parent_id": "t1_dij7dt9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think the first four points are fair, although they are mostly irrelevant when you compare them to the total size of the Eurozone itself - the UK wasn't paying that much more (especially with the rebate), the trade surplus will hurt the EU but is only in the single figures percent of EU trade, and the fish are irrelevant these days (most fish are farmed now). EU citizens will get a reciprocal deal, I don't see the EU bending over backwards for this.\n\nAs for the last two points - The UK banking establishment will be devestated by Brexit, not that I think that is necessarily too bad. Britain is pretty much reliant on the financial industry though.\n\nAnd as for defence - what do you think will happen if someone threatens Britain and the US or EU aren't interested? Britain has to realise about itself that it's now a small country in a world of giant federations.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496793625.0,
    "date_created": "2017-06-06",
    "time_created": "12:00:25",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij940g",
    "parent_id": "t1_dij7dt9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "😂😂😂😂😂😂😂😂😂😂😂",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1496791306.0,
    "date_created": "2017-06-06",
    "time_created": "11:21:46",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij9i3x",
    "parent_id": "t1_dij7dt9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> If Britain trades less with the EU, it will either make more stuff for itself - boosting the economy - or import more stuff from poorer, cheaper countries - boosting the economy. \n\nSo basically, less trade with the EU is a win-win scenario?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496791733.0,
    "date_created": "2017-06-06",
    "time_created": "11:28:53",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij9cqo",
    "parent_id": "t1_dij7dt9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "sources please",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496791570.0,
    "date_created": "2017-06-06",
    "time_created": "11:26:10",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dikgxtv",
    "parent_id": "t1_dij7dt9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Trade: Britain buys far more from the EU than vice-versa.\n\nWhich also means that Britain is more dependent on goods and services from the EU than vice versa. We buy it from them for a reason.\n\n> Natural resources: The EU takes far more fish from Britain than vice-versa.\n\nAnd that fish is sold to the EU, so what good is that to us without a deal? \n\n>If Britain trades less with the EU, it will either make more stuff for itself - boosting the economy - or import more stuff from poorer, cheaper countries - boosting the economy.\n\nOr we'll just pay higher tariffs, making us poorer. Or by being restricted to domestic goods we'll pay higher prices for inferior goods with less choice. This will hit our entire industry, bear in mind that many British factories rely on imports for both materials and components. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496846062.0,
    "date_created": "2017-06-07",
    "time_created": "02:34:22",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dik3lo9",
    "parent_id": "t1_dij3ayf",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "She's toast if she doesn't get a significant increase in Tory seats. They'll try to push Boris into the role, but he doesn't want it while Brexit is looming. Wonder which dreg we'll get... Fallon? Hammond?... Hunt? Jesus.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496825318.0,
    "date_created": "2017-06-06",
    "time_created": "20:48:38",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiyxx0",
    "parent_id": "t1_diiw95r",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "3D pigeon chess...",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1496777121.0,
    "date_created": "2017-06-06",
    "time_created": "07:25:21",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijiw9p",
    "parent_id": "t1_diiw95r",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "https://twitter.com/ToryFibs/status/871769965430542336",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496801643.0,
    "date_created": "2017-06-06",
    "time_created": "14:14:03",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diix0bl",
    "parent_id": "t1_diiwaap",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The UK will be fine we have the really reliable ally that is the USA remember/s",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1496772404.0,
    "date_created": "2017-06-06",
    "time_created": "06:06:44",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij01ox",
    "parent_id": "t1_diiwaap",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Really if they see them going badly they just need to give a little lee way and make the drag on until 2022 or a change of internal leadership. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496779339.0,
    "date_created": "2017-06-06",
    "time_created": "08:02:19",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij0frq",
    "parent_id": "t1_diiy9vh",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Control the centre, develop your pieces, castle, connect/double rooks, attack pawn structure weaknesses. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496780054.0,
    "date_created": "2017-06-06",
    "time_created": "08:14:14",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwn8a",
    "parent_id": "t1_diiuet6",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">by the end of brexit we'll probably think the EU negotiators are the angels here to deliver us from the Tories\n\nI already believe this.",
    "controversiality": 0,
    "ups": 260,
    "downs": 0,
    "score": 260,
    "created": 1496771359.0,
    "date_created": "2017-06-06",
    "time_created": "05:49:19",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwmoh",
    "parent_id": "t1_diiuet6",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That's giving her too much credit. \n\nLook at the difference between Corbyn now and at the end of 2016. He's gone from a scruffy old man who refused to do up his top button to someone who at least looks like a politician - even if he refuses to buy a properly fitting suit. They've also done a lot of work on his cadence, slowing down his speech and lowering the tone. ",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1496771315.0,
    "date_created": "2017-06-06",
    "time_created": "05:48:35",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwhpp",
    "parent_id": "t1_diiuet6",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Traitors like me are already there mate. ",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1496770917.0,
    "date_created": "2017-06-06",
    "time_created": "05:41:57",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diix9mu",
    "parent_id": "t1_diiuet6",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1496773098.0,
    "date_created": "2017-06-06",
    "time_created": "06:18:18",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwjo8",
    "parent_id": "t1_diiuet6",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yeah I'm on that point already. Hope they rip her to shreds.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1496771075.0,
    "date_created": "2017-06-06",
    "time_created": "05:44:35",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dija6ni",
    "parent_id": "t1_diiuet6",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> by the end of brexit we'll probably think the EU negotiators are the angels here to deliver us from the Tories\n\nCurbing the Tories' worst excesses has been one of the long-running purposes and benefits of the EU in our lives, like overturning May's own snoopers charter or the working time directive. \n\nThere are many things I can't fucking stand about the EU but on the morning of the result, that was what hit me worst - there's no longer anybody to save us from ourselves, as long as we're brainwashed by pure ideology into idiotically voting against our interests. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496792464.0,
    "date_created": "2017-06-06",
    "time_created": "11:41:04",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij17qc",
    "parent_id": "t1_diiuet6",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "He always was, the media just never gave him a look in. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496781364.0,
    "date_created": "2017-06-06",
    "time_created": "08:36:04",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij27u1",
    "parent_id": "t1_diiuet6",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "He does look just like a groundskeeper, you're right! ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496782921.0,
    "date_created": "2017-06-06",
    "time_created": "09:02:01",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diixjxy",
    "parent_id": "t1_diiv4ax",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Nobody would want a net contributor to leave. ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1496773851.0,
    "date_created": "2017-06-06",
    "time_created": "06:30:51",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diixofk",
    "parent_id": "t1_diixdo7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Thing was the Democrat's problems came preloaded Sanders even pointed half of them out, they happened before the campaign they ignored it believing no one would vote for Trump so it wouldn't matter. May created her problems during her campaign, it's a much more impressive and comprehensive failure than Clinton's.",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1496774181.0,
    "date_created": "2017-06-06",
    "time_created": "06:36:21",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiw3lp",
    "parent_id": "t1_diivj5i",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That was the plan (if you believe Sir Humphrey) but it was cut short by the referendum.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1496769790.0,
    "date_created": "2017-06-06",
    "time_created": "05:23:10",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwgh8",
    "parent_id": "t1_diivj5i",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I made a post on here a while ago about tin foil hat theories, and this has always been my favourite. \n\nThe worst part is I'm not sure the hat is doing anything and this theory might be true.\n\n(She's probably just incompetent though really)",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1496770817.0,
    "date_created": "2017-06-06",
    "time_created": "05:40:17",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiyb17",
    "parent_id": "t1_diivj5i",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">risk Theresa May refusing to take the UK out of the EU\n\nExcept she's already triggered Article 50, meaning that even if it's possible to revoke (a matter of... some debate, let's say), it would require the consent of the EU and its member states to do so. Put bluntly, the only way we get to stay in the EU now is if we beg and plead and agree to whatever terms we're given - because we've long since worn out any goodwill we might have had in exchange for budget rebates and exceptions from things like the Schengen Area or the Euro.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1496775720.0,
    "date_created": "2017-06-06",
    "time_created": "07:02:00",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiztbv",
    "parent_id": "t1_diiv53y",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "oh simple launch a few nukes a Brussels for not giving the deal she asked for should do it. \n\nRule in hell, server in heaven etc.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496778903.0,
    "date_created": "2017-06-06",
    "time_created": "07:55:03",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwhbs",
    "parent_id": "t1_diiv53y",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "But ukip says the opposite! How can it be? Muh brexit!",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1496770888.0,
    "date_created": "2017-06-06",
    "time_created": "05:41:28",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiur4c",
    "parent_id": "t1_diitka7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Did they ingnore Greece?",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1496765889.0,
    "date_created": "2017-06-06",
    "time_created": "04:18:09",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diivshb",
    "parent_id": "t1_diitka7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "What? She's not getting this so she can boast to the EU. She's getting it so that she has a better chance of getting things through parliament without being opposed all the way by Lab/Libdem.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496768874.0,
    "date_created": "2017-06-06",
    "time_created": "05:07:54",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij631g",
    "parent_id": "t1_diitka7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The EU don't give a crap what her \"mandate\" is; it changes nothing for them. That was just how the Tories tried to frame the election.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496787962.0,
    "date_created": "2017-06-06",
    "time_created": "10:26:02",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiynld",
    "parent_id": "t1_diiwxdz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "He didn't oppose 'any integration' process but specific integration processes like the single currency. The continent would have enjoyed a better 7 years had more countries shown the same scepticism. ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1496776504.0,
    "date_created": "2017-06-06",
    "time_created": "07:15:04",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij0iuy",
    "parent_id": "t1_diiwxdz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "They were willing to compromise for the kudos of keeping the UK onboard.  It looked good to eastern Europe;there were frewer members then and they needed to show the EU was growing.\n\nNow the EU has taken on a life of its own and they don't need us as much.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496780202.0,
    "date_created": "2017-06-06",
    "time_created": "08:16:42",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij6d4e",
    "parent_id": "t1_dij6bvo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "http://imgur.com/a/4ldOl",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496788274.0,
    "date_created": "2017-06-06",
    "time_created": "10:31:14",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij7xcz",
    "parent_id": "t1_dij7uco",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Which is my point. It's not about what they used to see. It's what they see now. Currently they see Nigel Fucking Farage. Not Tony Blair sat on stage with the rest of the EU leaders.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496790012.0,
    "date_created": "2017-06-06",
    "time_created": "11:00:12",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diivgwl",
    "parent_id": "t1_diivfo5",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Agreed. He really is out of his depth, but then I'm not sure who could replace him. ",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1496767948.0,
    "date_created": "2017-06-06",
    "time_created": "04:52:28",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijd7ez",
    "parent_id": "t1_dij0iqq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Fuck FPTP.\n\nUnbelievable that this has to exist.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496795702.0,
    "date_created": "2017-06-06",
    "time_created": "12:35:02",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij2bxu",
    "parent_id": "t1_dij0iqq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Thankyou kind sir/ma'am/Chipmunk.\n",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1496783093.0,
    "date_created": "2017-06-06",
    "time_created": "09:04:53",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijphb5",
    "parent_id": "t1_dijd28o",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "At the very best it would have remained the status quo where the country is still divided but in the EU - given the small margin of the vote there would likely be calls from Farage, as he promised, to hold a second referendum and refuse to accept the result. We probably still would have marched into Brussels thinking we own the place and they owe us a debt.\n\nImagine this. If remain had won 52-48 and we'd gone (or shown intention of) full integration, schengen, euro etc. then I'd support your hypothesis. But it wouldn't have been that way. Ergo why does a leave vote by the same margin mean hard brexit? It's the most absurd thing I've ever heard in my life. Eurosceptics would still be jumping up and down and throwing their toys out the pram. The pro EU camp is just doing to the eurosceptics what they've done to the pro EU for decades - except pro EU are barely being given a platform to speak anymore.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496808488.0,
    "date_created": "2017-06-06",
    "time_created": "16:08:08",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijep6i",
    "parent_id": "t1_dijd28o",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Typically said, little understood. No, I'm 100% sure that's not what would have happened in this happy little hypothetical of yours. I am 100% convinced that Davie Cameron would be going to Europe demanding more controls on immigration, a right to work rather than a right to live in the UK. I'm pretty sure the Farage in the Garage would be calling it the first step in the victory of the UKIPs, using it as a rallying cry for a second referendum in much the way he said he was going to when he thought he'd lost. I'm pretty sure that Leavers voices would only have gotten louder, but I'd be happy to live in this fantasy and listen to their stupid fucking yammering if we weren't doing literally the stupidest thing this country ever has and shooting ourselves in both feet. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496797259.0,
    "date_created": "2017-06-06",
    "time_created": "13:00:59",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijankr",
    "parent_id": "t1_dij0mvy",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'd also take Keir Starmer or Barry Gardiner over any Tory minister you could name, I mean, Hunt, Gove, Johnson, Leadsom, IDS, Green,  Rudd, Fallon, is there a scrap of competency between the lot of them?\n\nYou can point to some poor performance on Labour's side, but unless you can provide some examples of quality in the current government, it's shaky ground to start debating from.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496792967.0,
    "date_created": "2017-06-06",
    "time_created": "11:49:27",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijibnl",
    "parent_id": "t1_dij0mvy",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">Yeah, that guy clearly isn't a good political operator.\n\nHe is not a good political operator. Someone even reasonably politically astute would have had the Labour  Party miles ahead in the  opinion polls. He and his team through incompetence have missed opportunity after opportunity to make political capital out of Tory idiocy or missteps.\n\nHis re-clawing back of support over the last month or so  is more to with the Tories hubris, their  suicide note of a manifesto,  and some of the electorate realising that Ms May is of no great substance  and is a bit of a political coward. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496801030.0,
    "date_created": "2017-06-06",
    "time_created": "14:03:50",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij0ubt",
    "parent_id": "t1_diix7zs",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I honestly think a domestic election campaign is immaterial to international negotiations like Brexit. \n\nRemember; when May wins the GE on Thursday she will have bought herself 2 extra years in government at the cost of 8 weeks of campaigning. She already has about the smallest electoral majority possible so even if she lost 1-2 seats it won't make any significant difference to what she can or cannot do in government.\n\nEven if May fails to secure her 100 seat majority, she still ends up exactly where she started EXCEPT she has bought herself 2 extra years in government. So whilst she might have spaffed a 22 point lead up the wall, she's very politically astute because this was always a win-win election for the conservatives and people have forgotten that. It has also given the conservatives an opportunity to gain a new electoral mandate under May for reforms to areas like social care and the implementation of Brexit - this way labour cannot use it as a stick to beat the conservatives in 2020. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496780742.0,
    "date_created": "2017-06-06",
    "time_created": "08:25:42",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiyu34",
    "parent_id": "t1_diiwmb7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "There can't be, really. May is pro-Brexit - perhaps she hasn't always been, perhaps in her heart of hearts (if she had one of those) she still isn't, but she has committed herself to it. Corbyn is pro-Brexit - ableit with different ideological underpinnings to the Tories.\n\nThe smaller parties have no chance of taking power from the Tories alone, the best they can hope for is some kind of coalition (most likely on the opposing side) and they won't have enough power within it to stop or even slow Brexit. \n\nIf any of the players in this game were both willing and able to oppose Brexit, the Remain campaign would probably have had effective leadership and we wouldn't be in this moronic situation to begin with. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496776891.0,
    "date_created": "2017-06-06",
    "time_created": "07:21:31",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij0hhk",
    "parent_id": "t1_diiy29e",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think if he losses there will be a challenge irrespective of how well he does. What remains to be seen is how far that challenge gets. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496780136.0,
    "date_created": "2017-06-06",
    "time_created": "08:15:36",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij81ew",
    "parent_id": "t1_diiy29e",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "He's going to be stabbed in the back immediately. I would be shocked if Corbyn is still Labour leader at the end of June.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496790139.0,
    "date_created": "2017-06-06",
    "time_created": "11:02:19",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiuikn",
    "parent_id": "t1_diiuh3a",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Her voice crack with nervous look answering a question about brexit should tell you everything. She doing something nobody wanted. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496765218.0,
    "date_created": "2017-06-06",
    "time_created": "04:06:58",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijdt17",
    "parent_id": "t1_dijd8eh",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Just trying to alleviate fears.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496796332.0,
    "date_created": "2017-06-06",
    "time_created": "12:45:32",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dikmto4",
    "parent_id": "t1_dikl38m",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I don't blame people. I'm just saying that's how it will be.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496861271.0,
    "date_created": "2017-06-07",
    "time_created": "06:47:51",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diizd2q",
    "parent_id": "t1_diivbhn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Ah well then the enemy of my enemy is... fuck it she's still my enemy",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496778008.0,
    "date_created": "2017-06-06",
    "time_created": "07:40:08",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiy5r9",
    "parent_id": "t1_diixzqx",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "If May gets a 10-20 seat majority then it's utter failure and she's fucked, will be ousted by a leadership challenge etc\n\nIf May gets circa a 40-60 seat majority she will face a leadership challenge and likely win it, then suffer internal issues through the next parliament\n\nIf May get a 100+ seat majority ( which I think is likely) then all hail Queen May, she'll rid herself of opponents, the rest of her MPs that are neither greatly for or against will toe the line because Tories love a winner more than staunch ideology. \n\nTake a look yourself at foreign leaders, consider Macron, I've no idea how his campaign went day to day,did he have bad interviews etc but I do know he won coming from nowhere and right now is unassailable it appears\n\nWhat matters to you, doesn't necessarily mater to a distant EU politician",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496775379.0,
    "date_created": "2017-06-06",
    "time_created": "06:56:19",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiuc42",
    "parent_id": "t1_diitku3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">She is useless at media management / PR\n\nShe is definitely crap at presenting herself, public speaking, and wider management of her public profile.\n\nThat doesn't mean she isn't a competent politician.",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496764728.0,
    "date_created": "2017-06-06",
    "time_created": "03:58:48",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dik8qnx",
    "parent_id": "t1_diivmdd",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I was about to defend Brown for being competent enough, but then I remembered the gold.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496832019.0,
    "date_created": "2017-06-06",
    "time_created": "22:40:19",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diitinp",
    "parent_id": "t1_diit75c",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yeah...\n\nhttps://www.youtube.com/watch?v=3MgyRO3c870",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496762579.0,
    "date_created": "2017-06-06",
    "time_created": "03:22:59",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diitaxh",
    "parent_id": "t1_diit75c",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 1,
    "ups": -3,
    "downs": 0,
    "score": -3,
    "created": 1496762046.0,
    "date_created": "2017-06-06",
    "time_created": "03:14:06",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diitthi",
    "parent_id": "t1_diit75c",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Well we read what happened at the dinner with Juncker.\n\nNo, we read a Leak, that has 0 proof is accurate, and was then condemmned by Donald Tusk/Angela Merkel (Causing a division in the EU headship funnily enough)\n\nhttp://www.independent.co.uk/news/world/europe/angela-merkel-angry-jean-claude-juncker-leak-brexit-dinner-theresa-may-a7721316.html",
    "controversiality": 1,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1496763370.0,
    "date_created": "2017-06-06",
    "time_created": "03:36:10",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diivxbq",
    "parent_id": "t1_diit75c",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think the decision to leak left Juncker looking rather worse than May on that one. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496769274.0,
    "date_created": "2017-06-06",
    "time_created": "05:14:34",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijnqkv",
    "parent_id": "t1_dijmcr6",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It's not really the point I was making. (I was a staunch Remain voter btw). The EU has a lot more people to convince that the deal struck is the right deal for Europe. The UK only has one electorate now and this opportunistic election is going to convince May that she has free reign to negotiate as she wants during the talks.\n\n>but that is because of the UK, which is perceived as a spoiled brat that was ruining things most of the time.\n\nI find that pragmatism is usually more constructive than perception. It pains me to see some of the hateful rhetoric flying around my country (and other parts of Europe) right now. But people are entitled to their opinions. But you aren't going to change their minds or yours by petty name calling.  ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496806667.0,
    "date_created": "2017-06-06",
    "time_created": "15:37:47",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diizn3t",
    "parent_id": "t1_diizb8d",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "If you're talking about the Cameron talks pre the referendum then it's significant even if people didn't pay much attention to them because they were what swung Boris to campaign for leave. (He was still on the fence till those talks). Many would argue that he was the key player in securing that slim leave majority. If he'd decided to campaign for Remain I doubt Gove and IDS would have been able to carry the leave campaign to victory. I'm pretty sure the Big Red NHS Bus was a Johnson idea.\n\nIn terms of the upcoming talks we don't really know what to expect from May. \"The best deal for britain\" is a pretty vague statement. I think a lot of the hard brexiteers pushing to give her a \"strong hand in the negotiations\" might be surprised to learn that what she considers to be the \"best deal\" is nothing like what they insisted they voted for last June. (Even though the ballot paper didn't have any of those things on it.) I wouldn't be surprised if the vagueness of that \"best deal\" statement sees UKIP pick up more votes than the polls are suggesting. As much as I disagree with Nuttel I think he's actually campaigned well and kept his composure during the main media events. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496778563.0,
    "date_created": "2017-06-06",
    "time_created": "07:49:23",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijhtay",
    "parent_id": "t1_dij4oc3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I do ! \n\nBring back The Guillotine - start knitting grannies! :) ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496800498.0,
    "date_created": "2017-06-06",
    "time_created": "13:54:58",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diixrxr",
    "parent_id": "t1_diixj21",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Theresa Miscavige ",
    "controversiality": 0,
    "ups": 112,
    "downs": 0,
    "score": 112,
    "created": 1496774424.0,
    "date_created": "2017-06-06",
    "time_created": "06:40:24",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij5jqy",
    "parent_id": "t1_diixj21",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Pascal Sauvage",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496787357.0,
    "date_created": "2017-06-06",
    "time_created": "10:15:57",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiz9ww",
    "parent_id": "t1_diiy9uo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'd put money on whoever wins on Thursday losing the next election badly. It'll be impossible to come out of those negotiations looking good because no one will be satisfied with the outcome.\n\nThat's why I wouldn't be terribly disappointed to see the Tories with a small majority. Clean up your own mess.",
    "controversiality": 0,
    "ups": 155,
    "downs": 0,
    "score": 155,
    "created": 1496777826.0,
    "date_created": "2017-06-06",
    "time_created": "07:37:06",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiz3pa",
    "parent_id": "t1_diiy9uo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 51,
    "downs": 0,
    "score": 51,
    "created": 1496777465.0,
    "date_created": "2017-06-06",
    "time_created": "07:31:05",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiz0g1",
    "parent_id": "t1_diiy9uo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I would rather brexit go well and have 2 consecutive tory governments and I hate the tories. Brexit is the biggest issue for a generation, it has to go right.  ",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1496777272.0,
    "date_created": "2017-06-06",
    "time_created": "07:27:52",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijnt4v",
    "parent_id": "t1_diiy9uo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The best outcome would be the conservatives falling short of a majority, and the rest of the MPs switching the voting system to PR before the next election. The Tories are unlikely to ever get 50% popular support under PR, and reverting PR would be an extremely hard sell. Doesn't matter if Labour suffers fallout from Brexit, their ideals will live on.\n\nUnfortunately, I really can't see Labour doing this. A lot of them still think of themselves as \"temporarily out of power\", and are ignoring all the gerrymandering and subtle stabs at Democracy that the Tories are doing. They need to fix the voting system before it becomes impossible for them to realistically get into power.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496806740.0,
    "date_created": "2017-06-06",
    "time_created": "15:39:00",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dir4p3s",
    "parent_id": "t1_diiy9uo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Fuck you predicted the election. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1497215892.0,
    "date_created": "2017-06-11",
    "time_created": "09:18:12",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diizrq4",
    "parent_id": "t1_diiy9uo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Mystic Meg over here... Do you have next week's lottery numbers too? ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496778816.0,
    "date_created": "2017-06-06",
    "time_created": "07:53:36",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dikd138",
    "parent_id": "t1_diiy9uo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That would explain why May is doing everything she can to lose. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496838446.0,
    "date_created": "2017-06-07",
    "time_created": "00:27:26",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diizvn3",
    "parent_id": "t1_diiyygm",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[This](https://en.wikipedia.org/wiki/Official_Opposition_Shadow_Cabinet_(United_Kingdom\\)) shows how much the PLP have undermined Corbyn since the EU Ref.\n\nAbbott wasn't his first choice- that was Burnham- she was just one of the only ones with ministerial experience left after everybody had resigned",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1496779022.0,
    "date_created": "2017-06-06",
    "time_created": "07:57:02",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij3xwe",
    "parent_id": "t1_diiyygm",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Corbyn has gone up in my estimations during this campaign. I still hold on to a number of criticisms, but the prospect of a Corbyn premiership is fairly acceptable to me. The issue I take is the fact that he's kept figures like McDonnell and Abbott as his two most prominent spokespeople. It's like he's replacing the New Labour patronage with Socialist Campaign Group patronage. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1496785368.0,
    "date_created": "2017-06-06",
    "time_created": "09:42:48",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij64pc",
    "parent_id": "t1_diiyygm",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">It's Dianne abbot that scares me.\n\nI can't say this enough - Yvette Cooper was shadow home sec for years, is chair of the home affairs select committee, and in any labour government would be home sec. Abbott clearly doesn't want the job, and Cooper needs a ministry if she wants to still be leader.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1496788014.0,
    "date_created": "2017-06-06",
    "time_created": "10:26:54",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijinsb",
    "parent_id": "t1_diiyygm",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "In a similar way to you, the election campaign has taken away a lot of my \"Corbyn would be a disaster\" misconceptions. \n\nAs a Leaver, he seems to me to be one of the few politicians that understands the basic implications, from a supply and demand perspective, of free movement i.e. that where supply is effectively unrestricted, demand (and its corresponding impact on wages and job prospects for U.K. workers) necessarily declines. Weirdly him, Trump and Bernie Sanders all agree on this (DT and Sanders more in the context of the free trade arrangements in place under NAFTA though).\n\nThat said, my concerns with him are that he's backed by Momentum (and going on rUK I know how damn unreasonable those people are, and I don't like the idea of leader behoved to their interests), and frankly the idea of John McDonnell as Chancellor is absolutely terrifying. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496801389.0,
    "date_created": "2017-06-06",
    "time_created": "14:09:49",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dik3hyg",
    "parent_id": "t1_diiyygm",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Diane Abbott isn't going to be in the cabinet, should the unlikely happen and Labour win. They're just saddled with her now until the end of the campaign, so they don't get accused of being in chaos by removing her.\n\nRemember, her initial shadow cabinet post was International Development, which is about as minor a role as you can get. And this is a woman who has been Corbyn's closest ally for thirty years. He knows she's crap. She just got pushed into higher profile roles when most of the PLP were in a huff.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496825184.0,
    "date_created": "2017-06-06",
    "time_created": "20:46:24",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij033j",
    "parent_id": "t1_diiz2cu",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No, Corbyn is massively pro-single market and refused to rule out leaving without a deal ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496779417.0,
    "date_created": "2017-06-06",
    "time_created": "08:03:37",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij03t6",
    "parent_id": "t1_diiz2cu",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Does he? ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496779452.0,
    "date_created": "2017-06-06",
    "time_created": "08:04:12",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij2owm",
    "parent_id": "t1_dij2lxg",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "lib dems are getting desperate",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496783631.0,
    "date_created": "2017-06-06",
    "time_created": "09:13:51",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijmubw",
    "parent_id": "t1_dijjlab",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yeh for sure but on a inter-governmental side its not  great scenario to be in.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496805731.0,
    "date_created": "2017-06-06",
    "time_created": "15:22:11",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijda1p",
    "parent_id": "t1_dijd51a",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Wellll, *just because* I'm from Brussels and live in London doesn't mean I'm biased about Brexit okay... alright, maybe just a bit. The EU is pretty fucking great though, for reals.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496795781.0,
    "date_created": "2017-06-06",
    "time_created": "12:36:21",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dija1gl",
    "parent_id": "t1_dij06ny",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Seriously ruined me as a kid. Grandpa Joe is a dick.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496792307.0,
    "date_created": "2017-06-06",
    "time_created": "11:38:27",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijdqv7",
    "parent_id": "t1_dijcdca",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Well, not as convenient as it is inside the EU, surely more convenient than WTO tariffs, probably something like the deal with Canada. It would be the most likely hypothesis to not establish a precedent. But it would come surely after the two years, no way this is going to be negotiated in time.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496796271.0,
    "date_created": "2017-06-06",
    "time_created": "12:44:31",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij8w88",
    "parent_id": "t1_dij5zyi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The analogy game is strong with this one.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496791074.0,
    "date_created": "2017-06-06",
    "time_created": "11:17:54",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijc7o3",
    "parent_id": "t1_dijb9oh",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "\"Britain has to realise about itself that it's now a small country in a world of giant federations.\"\n\nI thought the same way for many years. That the world would inexorably merge into a European Union, and an African Union, and an Islamic Caliphate. It would be like Huntingdon's Clash of Civilizations.\n\nBut I now see this as a bit far-fetched. Let's face it - the British Isles are full of tubby, pasty, gingery men standing in pubs, playing snooker, and talking earnestly about how they're too different from the English/Irish/Scots/Welsh to live under the same government.\n\nIf people who are essentially identical can feel so different from one another, then how is a European Union, or an Asian Union, or an African Union ever going to work? \n\nWhat we'll find is that these unions are weak and dysfunctional, because they can only move very tentatively, particularly when confronted by big homogeneous countries like Russia. An American from Seattle can meet an American from Miami and there's immediate mutual recognition as Americans. A person from Ireland is unlikely ever to feel the same way about someone from Greece or Estonia. \n\nDefence-wise, Britain is an island stuck in the Atlantic, far from Russia, North Korea or Iran. Our only major military threat would be if the EU united against us, for some reason, but nuclear weapons and global alliances have made this a lot less concerning than it would have been a century ago. \n\nAs for the bankers, I agree that the City of London is likely to get smaller, though it won't be devastated - it predates the EU by many centuries. But this shrinkage is really the only way the rest of the British economy can grow - the City creates a Dutch Disease that keeps Sterling too high for our other exports to be competitive. \n\nAnd I disagree that fish are worthless. On the contrary, cod are quite valuable objects. Iceland's GDP per capita is not far below's Britain's, even though fish is virtually all they have. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496794644.0,
    "date_created": "2017-06-06",
    "time_created": "12:17:24",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijdecd",
    "parent_id": "t1_dijb9oh",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Implying the UK's alliance with the US counts for nothing",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496795906.0,
    "date_created": "2017-06-06",
    "time_created": "12:38:26",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijatdk",
    "parent_id": "t1_dij9i3x",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "He's basically going against accepted economics that has lasted and been built upon for many centuries.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496793138.0,
    "date_created": "2017-06-06",
    "time_created": "11:52:18",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijb75l",
    "parent_id": "t1_dij9i3x",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No, it's a win-lose scenario. \n\nAt the moment, we give Germany our hard-earned pounds to purchase BMWs. The Germans don't buy British products, in part for technical reasons involving the valuation of the Euro, so they lend us back our pounds, helping to keep our interest rates very, very low. \n\nThis enables Brits to borrow huge amounts of money on PCP deals to buy more BMWs, a pattern of behaviour which some people think is heading us towards a banking crisis. The only part of the British economy this benefits is the City of London, which repackages the debt.\n\nIf Britain were to make its own BMWs - say if McLaren expanded into the executive car market - while making it much more expensive to buy German cars by raising a 10% post-Brexit trade tax on them, then Germany loses a major source of foreign exchange, and the BMW factories have to lay off thousands of workers while McLaren hires thousands of British ones.  \n\nMultiply this across Europe, and you see why Britain holds the cards here. The only EU country with which Britain has a trade surplus is Ireland. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496793550.0,
    "date_created": "2017-06-06",
    "time_created": "11:59:10",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diklsfc",
    "parent_id": "t1_dikgxtv",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Which also means that Britain is more dependent on goods and services from the EU than vice versa. We buy it from them for a reason.\n\nWe're not in any way \"dependent\" on holidays in Ibiza, or racks of French cheese, or overpriced boxes of LEGO. These are luxuries that we could very, very easily live without.\n\n> And that fish is sold to the EU, so what good is that to us without a deal?\n\nIt would allow fish stocks to recover, for a start. Also, the EU buys seafood from many countries that aren't in the EU. \n\n> Or we'll just pay higher tariffs, making us poorer. \n\nYou do know that tariffs are taxes, right? Taxes that are paid to the UK government? So what you're saying is that we'll be \"paying higher taxes, making us poorer\". Which is daft, because the taxes will be spent on public goods. \n\n> Or by being restricted to domestic goods we'll pay higher prices for inferior goods with less choice.\n\nBritish goods aren't \"inferior\" to European ones. Unfortunately, many Britons have been brainwashed by advertising into not realising this, and so have effectively boycotted British goods and produce in what has been an economic and social disaster for large sections of this country. \n\nFor years, they honestly thought Stella was a good beer, even as it makes you feel physically unwell while actually still drinking it, let alone the day after. Hence 'Continental Fighting Lager'.\n\nHere's the list of most and least reliable cars for 2016. As you can see, Jaguar sits above VW, BMW-MINI, Audi, and Mercedes, all of which are in the bottom half of the table. How does that make them \"better\"\n\n http://www.autoexpress.co.uk/car-news/consumer-news/91220/the-most-and-least-reliable-car-manufacturers-2016\n\nTariffs act as a stupidity tax on people who don't bother to check this information.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496858643.0,
    "date_created": "2017-06-07",
    "time_created": "06:04:03",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diix4bf",
    "parent_id": "t1_diix0bl",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Well they do have that famous slogan \"America And Britain First\"",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1496772710.0,
    "date_created": "2017-06-06",
    "time_created": "06:11:50",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij1yms",
    "parent_id": "t1_dij01ox",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think whatever happens its going to drag on. I think we'll be well into a \"transitional deal\" in 2022.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496782537.0,
    "date_created": "2017-06-06",
    "time_created": "08:55:37",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwvzs",
    "parent_id": "t1_diiwn8a",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yup, me too",
    "controversiality": 0,
    "ups": 60,
    "downs": 0,
    "score": 60,
    "created": 1496772061.0,
    "date_created": "2017-06-06",
    "time_created": "06:01:01",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dik9kcc",
    "parent_id": "t1_diiwn8a",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "This is why I voted to remain.\nEvidence: https://www.theguardian.com/law/2016/dec/21/eus-highest-court-delivers-blow-to-uk-snoopers-charter",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496833151.0,
    "date_created": "2017-06-06",
    "time_created": "22:59:11",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diixl39",
    "parent_id": "t1_diiwmoh",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yeah, Corbyn and the team around him have clearly done a lot of work, it isn't all May's incompetence. I still have huge problems with Labour's refusal to stand up to the government on civil liberties (not that this is too relevant for my vote, I live in a moderately Conservative seat where the Lib Dems are the main opposition) but I have gained a lot of respect for Corbyn during this election campaign. He has become a more effective politician with a focus on actually making ground against the government, while staying true to the core principles that led to his election in the first place.",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1496773937.0,
    "date_created": "2017-06-06",
    "time_created": "06:32:17",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiyehb",
    "parent_id": "t1_diix9mu",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Sadly, because of Theresa May's stupidity of calling article 50 first, you are getting kicked out of the EU regardless. When the German's are talking about cooperating with Britain in the past tense, you know you are out of the club for good.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1496775938.0,
    "date_created": "2017-06-06",
    "time_created": "07:05:38",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiy3kz",
    "parent_id": "t1_diix9mu",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I don't think anyone wants to be labelled permanently in history as the person who relegated Britain into an irrelevant nation like Greece or Spain\n\nWhich is exactly what Brexit is going to do",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1496775230.0,
    "date_created": "2017-06-06",
    "time_created": "06:53:50",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijzz3y",
    "parent_id": "t1_dija6ni",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I voted remain because I trust Brussels to do a better job of governing the UK than the UK. I was called an unpatriotic traitor by a lot of people I know.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496820662.0,
    "date_created": "2017-06-06",
    "time_created": "19:31:02",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiyxyx",
    "parent_id": "t1_diixjxy",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think that's a bit of an underestimation of some of the pride involved.  Just as we have those who take the whole sovereigncy line, EU countries have many who take a pride in the union to the same extent.  To some, the union > the money.\n\nMany don't want us to leave, but many would also like us to just fuck off already.  To an extent, I feel their pain:  I'm not keen on leaving, but I am keen on not having to think about this any more.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1496777124.0,
    "date_created": "2017-06-06",
    "time_created": "07:25:24",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diixmy7",
    "parent_id": "t1_diixjxy",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Really depends on how much hassle they are",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1496774074.0,
    "date_created": "2017-06-06",
    "time_created": "06:34:34",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diixnx9",
    "parent_id": "t1_diixjxy",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "When the net contributor is dragging your organisation backwards, the words, \"we can do without this shit\" come to mind.",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1496774143.0,
    "date_created": "2017-06-06",
    "time_created": "06:35:43",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij7ag0",
    "parent_id": "t1_diixjxy",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Budget holes can be plugged or adjusted to. The long term damage to trading relationships, transfer of goods ideas and capital and people is a far worse problem. UK and EU are both stronger together and both weaker apart   I hope UK changes its mind over the next generation.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496789307.0,
    "date_created": "2017-06-06",
    "time_created": "10:48:27",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiz0b0",
    "parent_id": "t1_diixofk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Except... she could still win. At which point no matter how disatrous her campaign was, it's history and Trumped by the result.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1496777264.0,
    "date_created": "2017-06-06",
    "time_created": "07:27:44",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiz2zf",
    "parent_id": "t1_diiw3lp",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Could you ELI5 this? I don't know if I've taken stupid pills today but i can't really follow the theory.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496777424.0,
    "date_created": "2017-06-06",
    "time_created": "07:30:24",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diizjjn",
    "parent_id": "t1_diiyb17",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think we'd be OK. We've handed in notice to leave, but negotiations haven't started. I'm sure the EU would allow us to withdraw the notice without a change of terms. It would be hard to defend terms changes legally",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496778365.0,
    "date_created": "2017-06-06",
    "time_created": "07:46:05",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij07hr",
    "parent_id": "t1_diiztbv",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "... I can't even tell what is and isn't sarcasm anymore 😧",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1496779644.0,
    "date_created": "2017-06-06",
    "time_created": "08:07:24",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijd5sm",
    "parent_id": "t1_diiztbv",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Rule in hell, server in heaven\n\nThat sounds like the tagline from a B movie with an evil waiter.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496795655.0,
    "date_created": "2017-06-06",
    "time_created": "12:34:15",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diivnm6",
    "parent_id": "t1_diiur4c",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "*Especially* Greece.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1496768487.0,
    "date_created": "2017-06-06",
    "time_created": "05:01:27",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwivc",
    "parent_id": "t1_diiur4c",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No. That's why Greece has as good a deal as it currently has. The current deal is practically charity. ",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1496771009.0,
    "date_created": "2017-06-06",
    "time_created": "05:43:29",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwb9a",
    "parent_id": "t1_diiur4c",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The elected Greek government ignored their mandate and the Greek people mystifyingly went along with it. It was the Greeks that lost their nerve they should have left the Euro.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1496770404.0,
    "date_created": "2017-06-06",
    "time_created": "05:33:24",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diixv2i",
    "parent_id": "t1_diiur4c",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "They decided not to give Greece their money. I disagree with the thought process but Greece doesn't really have a democratic right to other nations money.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496774639.0,
    "date_created": "2017-06-06",
    "time_created": "06:43:59",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwsel",
    "parent_id": "t1_diiur4c",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I don't think anyone in the EU has ignored any democratic process held in Greece. Every time an election was called the EU waited patiently, always stating they intend to fully cooperate with any newly formed government",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496771773.0,
    "date_created": "2017-06-06",
    "time_created": "05:56:13",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijj0kf",
    "parent_id": "t1_diiur4c",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "https://www.youtube.com/watch?v=zBkuNpgACH0",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496801773.0,
    "date_created": "2017-06-06",
    "time_created": "14:16:13",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwy8q",
    "parent_id": "t1_diiur4c",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "So is the Greek mandate worth more than the Dutch or German mandates?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496772235.0,
    "date_created": "2017-06-06",
    "time_created": "06:03:55",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiw2ns",
    "parent_id": "t1_diivshb",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "She has a majority government. It is opposition in her own party, not obstruction from others, that she fears.",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1496769714.0,
    "date_created": "2017-06-06",
    "time_created": "05:21:54",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiw5vz",
    "parent_id": "t1_diivshb",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1496769974.0,
    "date_created": "2017-06-06",
    "time_created": "05:26:14",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiw37e",
    "parent_id": "t1_diivshb",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Well yes that is more the real story. Though it was also about her own back benchers as much as Lab/libdem.\n\nBUT she has also repeatedly said it's about getting a strong mandate to go to the EU with.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496769760.0,
    "date_created": "2017-06-06",
    "time_created": "05:22:40",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diizbef",
    "parent_id": "t1_diivshb",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> She's getting it so that she has a better chance of getting things through parliament without being opposed all the way by Lab/Libdem.\n\nNo, she's getting it so that there isn't an election shortly after we crash out of the EU with no deal. She wants a couple of years after the A50 period runs out to try and rebuild some credibility.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496777911.0,
    "date_created": "2017-06-06",
    "time_created": "07:38:31",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diizgtd",
    "parent_id": "t1_diiynld",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It is extremely difficult to determine whether it would have been \"better\". The fact is that he was pushing for individual countries to have the option to only participate in things they like, whereas the others were pushing for a complete package ultimately leading towards a sort of federation",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496778216.0,
    "date_created": "2017-06-06",
    "time_created": "07:43:36",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dik52ya",
    "parent_id": "t1_diiynld",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You are probably right, but it should be obvious by now that many EU countries are willing to sacrifice their economic well-being for the symbolic value of having a common currency. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496827225.0,
    "date_created": "2017-06-06",
    "time_created": "21:20:25",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij8d73",
    "parent_id": "t1_dij7xcz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "True. Farage is considered a bad joke on German TV, but a bit of a dangerous one (AfD and all that) and unfortunately rather visible in Eurparl. As for the Conservative government, they are looked on as non-entities. The EU kind of works using a consensus and that means chasing around a lot of countries, large and small. The conservatives have used EU events principally as a platform for domestic politics. The rest of the EU was not impressed, even with a departing UK, as you put it: \"Close the door on your way out\"",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496790500.0,
    "date_created": "2017-06-06",
    "time_created": "11:08:20",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiw5o7",
    "parent_id": "t1_diivgwl",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think that is because any one with understanding of the depth doesn't dive in.",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1496769957.0,
    "date_created": "2017-06-06",
    "time_created": "05:25:57",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiw0rd",
    "parent_id": "t1_diivgwl",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Keir Starmer",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1496769555.0,
    "date_created": "2017-06-06",
    "time_created": "05:19:15",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij2q6d",
    "parent_id": "t1_dij2bxu",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Thank you for voting with the same intention as me. Solidarity always feels good.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496783682.0,
    "date_created": "2017-06-06",
    "time_created": "09:14:42",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijlt8p",
    "parent_id": "t1_dijibnl",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Corbyn performance is probably conditioned by the internal Labour opposition, which I reckon is quite Blairite.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496804672.0,
    "date_created": "2017-06-06",
    "time_created": "15:04:32",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij2ccv",
    "parent_id": "t1_diiyu34",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Most people have accepted the referendum result and are now in that sense 'pro-Brexit' even though many voted to remain. This doesn't stop them having a frank debate about the method of getting the best deal though, and what terms with Europe are actually negotiable. \n\nAll four of the largest parties have different approaches, and the PM's brazen and antagonistic approach to what should be a *negotiation* with our European allies is deeply troubling. Equally, I think Labour's stance is pretty misleading, as they seem to accept that in practice we will have to leave the single market, but aren't saying that out loud.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496783112.0,
    "date_created": "2017-06-06",
    "time_created": "09:05:12",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij5xf2",
    "parent_id": "t1_dij0hhk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Let 'me try. He will win again, probably with an even bigger mandate ... again 😂",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496787787.0,
    "date_created": "2017-06-06",
    "time_created": "10:23:07",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiv1lc",
    "parent_id": "t1_diiuikn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It must be weird to have to pretend with such conviction that you want to do something, when you initially campaigned saying it was a bad idea. She loves power though, so I guess she's willing to do anything. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496766715.0,
    "date_created": "2017-06-06",
    "time_created": "04:31:55",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diixt21",
    "parent_id": "t1_diiuikn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Nobody wanted?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496774504.0,
    "date_created": "2017-06-06",
    "time_created": "06:41:44",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiyf1a",
    "parent_id": "t1_diiy5r9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "But your point was initially that politicians will judge other politicians in different ways to members of the public. I don't know how Macron's domestic situation is, but do you think that a person trying to broker major international agreements wouldn't know? Do you think that both sides for Brexit negotiations aren't going to leverage everything they can?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496775972.0,
    "date_created": "2017-06-06",
    "time_created": "07:06:12",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diivat5",
    "parent_id": "t1_diiuc42",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">That doesn't mean she isn't a competent politician.\n\nsinglehandedly blew a 20 point lead, unprecedented in UK politics i guess\n\n",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1496767463.0,
    "date_created": "2017-06-06",
    "time_created": "04:44:23",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diivlk5",
    "parent_id": "t1_diiuc42",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "What about her record as home secretary screams competence? \n\nBeing held in contempt of court? Altering/ignoring reports she doesn't agree with? Did she succeed in her task of reducing migration? ",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1496768323.0,
    "date_created": "2017-06-06",
    "time_created": "04:58:43",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiue3a",
    "parent_id": "t1_diiuc42",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">She is definitely crap at presenting herself, public speaking, and wider management of her public profile.\n>That doesn't mean she isn't a competent politician.\n\nMy sarcastometer is confused.",
    "controversiality": 0,
    "ups": 67,
    "downs": 0,
    "score": 67,
    "created": 1496764879.0,
    "date_created": "2017-06-06",
    "time_created": "04:01:19",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiuy3g",
    "parent_id": "t1_diiuc42",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> That doesn't mean she isn't a competent politician.\n\nDunno about that mate.  Her 'record', sweet policies and constant u-turns got my head in a right spin.  ",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1496766435.0,
    "date_created": "2017-06-06",
    "time_created": "04:27:15",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diivm8m",
    "parent_id": "t1_diiuc42",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Failing at her parties own targets on immigration year after year shows she's incompetent. Drastically cutting police numbers while the threat level is severe/critical shows she's incompetent. U-turning on several manifesto policies before the election is even over shows she's incompetent. Being unable to answer a question show's she's incompetent...",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496768380.0,
    "date_created": "2017-06-06",
    "time_created": "04:59:40",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiuuui",
    "parent_id": "t1_diiuc42",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "She's not been competent in the remaining areas either though - that is her issue. The one thing she had going for her was her public strength, and now she doesn't even have that.",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1496766179.0,
    "date_created": "2017-06-06",
    "time_created": "04:22:59",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwbas",
    "parent_id": "t1_diiuc42",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> That doesn't mean she isn't a competent politician.\n\nIt would be great if you could now mention a few examples of her being a competent politician to back up your point.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496770407.0,
    "date_created": "2017-06-06",
    "time_created": "05:33:27",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiusm7",
    "parent_id": "t1_diiuc42",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "What else is left? Lol you've just described 80% of politics. ",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1496766006.0,
    "date_created": "2017-06-06",
    "time_created": "04:20:06",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiv6vp",
    "parent_id": "t1_diiuc42",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "So we will ignore the fact that to be a good politician you need all of those things. She can't interact with the public which makes her a useless leader. ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1496767150.0,
    "date_created": "2017-06-06",
    "time_created": "04:39:10",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diivfgd",
    "parent_id": "t1_diiuc42",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I mean, no, it doesn't. That would be the complete failures in her role as both home secretary and prime minister.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496767830.0,
    "date_created": "2017-06-06",
    "time_created": "04:50:30",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwp8u",
    "parent_id": "t1_diiuc42",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">That doesn't mean she isn't a competent politician.  \n\nRepeatedly failed to meet immigration targets as Home Secretary.  \nCut policing to dangerously low levels.  \nWon't defend her own policies in a 1 to 1 debate with the opposition.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496771520.0,
    "date_created": "2017-06-06",
    "time_created": "05:52:00",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwq5w",
    "parent_id": "t1_diiuc42",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Ok leaving aside her political failures how about allowing 20,000 police to be cut and devastating the UK Border Agency at a time of increased concerns about terrorism and Immigration? ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496771591.0,
    "date_created": "2017-06-06",
    "time_created": "05:53:11",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diixux3",
    "parent_id": "t1_diiuc42",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Don't forget tactical decisions. She called an election with a total lack of foresight for her own weaknesses and her opponent's strengths. She has repeatedly struggled to be clear on her objectives or consistent in her policies.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496774629.0,
    "date_created": "2017-06-06",
    "time_created": "06:43:49",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diivtug",
    "parent_id": "t1_diiuc42",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "presumably then you would say the same about jeremy corbyn ;) except in the last 2 weeks he seems to have got much better at all 3",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496768985.0,
    "date_created": "2017-06-06",
    "time_created": "05:09:45",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diixtfz",
    "parent_id": "t1_diiuc42",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Politics is literally the art of being popular. You cannot do this if you are bad at all this stuff.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496774532.0,
    "date_created": "2017-06-06",
    "time_created": "06:42:12",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiv9s2",
    "parent_id": "t1_diitaxh",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Which the other side didn't deny.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1496767381.0,
    "date_created": "2017-06-06",
    "time_created": "04:43:01",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiv70f",
    "parent_id": "t1_diitthi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> was then condemmned by Donald Tusk/Angela Merkel\n\nthe fact that they were angry that the leak happened somewhat supports it's accuracy, no? they wouldn't be mad if it was a fake",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1496767159.0,
    "date_created": "2017-06-06",
    "time_created": "04:39:19",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dik1s99",
    "parent_id": "t1_dijnqkv",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "There are less people to convince that a no deal is good in the EU than in the UK. Any concession to the UK will be read as a selling.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496822974.0,
    "date_created": "2017-06-06",
    "time_created": "20:09:34",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij5jl1",
    "parent_id": "t1_diixrxr",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Accurate representation of the Tory youth wing. ",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1496787352.0,
    "date_created": "2017-06-06",
    "time_created": "10:15:52",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijb3h8",
    "parent_id": "t1_diixrxr",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Paul Nuttall from Top Gun.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496793439.0,
    "date_created": "2017-06-06",
    "time_created": "11:57:19",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij0nr0",
    "parent_id": "t1_diiz9ww",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think that's the only reason I can think of for wanting the Tories to have a larger majority – May can't blame anyone else for \"holding up negotiations\" and all the rest of the bullshit they've used to justify this snap election. It will stop them ditching May as well but her reputation will  have suffered enough for the backbenchers to go into full backstabbing mode. And the Tories won't have anyone else to blame when things go wrong.\n\nThe only downside is whoever wins in 2022 becomes King of the Ashes.",
    "controversiality": 0,
    "ups": 61,
    "downs": 0,
    "score": 61,
    "created": 1496780429.0,
    "date_created": "2017-06-06",
    "time_created": "08:20:29",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diizopy",
    "parent_id": "t1_diiz9ww",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Still going to be a tricky dance though.  Got to give them enough rope to hang themselves on the Brexit bullshit, whilst stepping in and preventing some of May's more lunatic, dangerous and cruel ideas.",
    "controversiality": 0,
    "ups": 48,
    "downs": 0,
    "score": 48,
    "created": 1496778657.0,
    "date_created": "2017-06-06",
    "time_created": "07:50:57",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dija8cs",
    "parent_id": "t1_diiz9ww",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That is quite a cynical way to look at this and it is awful that we even have to think like that. Theresa May is sending a career politician to lead negotiations while Jeremy Corbyn is sending a QC. Realistically, who do you think will give us a better deal?\n\nI agree with you that the winning party will lose next election. The electorate are only able to see one if these outcomes and will sadly vote accordingly.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496792513.0,
    "date_created": "2017-06-06",
    "time_created": "11:41:53",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij4mu6",
    "parent_id": "t1_diiz9ww",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Its ok though because theresa has put the feelers out that no deal is better than a bad deal. Ensuring that if we get no deal, its not a disaster.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496786263.0,
    "date_created": "2017-06-06",
    "time_created": "09:57:43",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij5be1",
    "parent_id": "t1_diiz9ww",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Its ok though because theresa has put the feelers out that no deal is better than a bad deal. Ensuring that if we get no deal, its not a disaster.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496787102.0,
    "date_created": "2017-06-06",
    "time_created": "10:11:42",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diizowo",
    "parent_id": "t1_diiz3pa",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Logic and polls... well fuck. ",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1496778667.0,
    "date_created": "2017-06-06",
    "time_created": "07:51:07",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diizro8",
    "parent_id": "t1_diiz3pa",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Because the (alt-)right are gaining power in the world and margins of error only ever work in their favour at the minute.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496778813.0,
    "date_created": "2017-06-06",
    "time_created": "07:53:33",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiz8vu",
    "parent_id": "t1_diiz0g1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think Brexit is a mess no matter what, I think we'll be dealing with the fallout for at least a generation",
    "controversiality": 0,
    "ups": 59,
    "downs": 0,
    "score": 59,
    "created": 1496777766.0,
    "date_created": "2017-06-06",
    "time_created": "07:36:06",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiz8d5",
    "parent_id": "t1_diiz0g1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> I would rather brexit go well\n\nWe all would but we're a year on from the referendum with still no reason to suspect that's actually going to be the case.",
    "controversiality": 0,
    "ups": 48,
    "downs": 0,
    "score": 48,
    "created": 1496777734.0,
    "date_created": "2017-06-06",
    "time_created": "07:35:34",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiza5q",
    "parent_id": "t1_diiz0g1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "And the Tories look prepared to walk away..they don't even seem to want it to go right. Their only plan is, have cake and eat it. Give us it all or nothing..",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1496777839.0,
    "date_created": "2017-06-06",
    "time_created": "07:37:19",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij2d1f",
    "parent_id": "t1_diiz0g1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "what do you mean by \"go well\"? because none of the promises made about benefits of leaving and negatives of staying are actually true. You won't save money that you can \"spend at home\", you won't be able to stop immigration, you will lose tens of thousands of highly trained and highly skilled workers - workers that your country needs to function. The economy will be negatively effected, funding for science education and healthcare will go down instead of up, you will still have to follow most of the EU rules you were upset with, and so on and so forth.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1496783141.0,
    "date_created": "2017-06-06",
    "time_created": "09:05:41",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij360p",
    "parent_id": "t1_diiz0g1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Whether or not you want Brexit to happen, we can all agree that if the decision to leave was taken by the people then the people should get to check that they've received a good deal. Whichever way you voted, you should hold the government to account.\n\nThe Lib Dems are the only party guaranteeing this, so they've won my vote.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1496784307.0,
    "date_created": "2017-06-06",
    "time_created": "09:25:07",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij1ram",
    "parent_id": "t1_diiz0g1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "would rather see no Brexit at all",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1496782224.0,
    "date_created": "2017-06-06",
    "time_created": "08:50:24",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijdmru",
    "parent_id": "t1_diiz0g1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I believe the problem is that definition of \"right Brexit\" doesn't exist, there will always be number of people not happy with final result.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496796153.0,
    "date_created": "2017-06-06",
    "time_created": "12:42:33",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij1ipe",
    "parent_id": "t1_diiz0g1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> I would rather brexit go well and have 2 consecutive tory governments and I hate the tories. Brexit is the biggest issue for a generation, it has to go right. \n\nThat implies that brexit _can_ go right.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496781849.0,
    "date_created": "2017-06-06",
    "time_created": "08:44:09",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijrssy",
    "parent_id": "t1_diiz0g1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Lol still thinking Brexit is going to go well. It's the hope that kills you.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496810961.0,
    "date_created": "2017-06-06",
    "time_created": "16:49:21",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij1u97",
    "parent_id": "t1_diiz0g1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I don't see how it can possibly go well with a party that has no plans whatsoever and the negotiation stance \"fuck off, we don't want a deal!\"",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496782351.0,
    "date_created": "2017-06-06",
    "time_created": "08:52:31",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dikkzw0",
    "parent_id": "t1_diiz0g1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "There's no such outcome as Brexit going well. If it isn't stopped it will be a total disaster. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496856533.0,
    "date_created": "2017-06-07",
    "time_created": "05:28:53",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diju0m5",
    "parent_id": "t1_diizvn3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think the PLP look pretty bad in hindsight. Reminds me of how a lot of Republicans were really frustrated by Trump tackling his own side cause they thought that Hillary was really vulnerable if he just focused, even if he wasn't their first choice.\n\nI think May's in the same position (she's even less charismatic and transparent than Hillary, who wouldn't get away with the shit May does), except the party did far more damage to their candidate at a time when they should have been hammering the conservatives.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496813424.0,
    "date_created": "2017-06-06",
    "time_created": "17:30:24",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij1epb",
    "parent_id": "t1_dij033j",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Leaving without a deal is not the same as membership of the single market.\n\nIn fact he's said that when we leave the EU freedom of movement of people will end. As freedom of movement of people is an integral part of the single market that means that the UK will be leaving the single market.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496781672.0,
    "date_created": "2017-06-06",
    "time_created": "08:41:12",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij1f1y",
    "parent_id": "t1_dij03t6",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "He's said that when we leave the EU freedom of movement of people will end. As freedom of movement of people is an integral part of the single market that means that the UK will be leaving the single market.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496781687.0,
    "date_created": "2017-06-06",
    "time_created": "08:41:27",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij3arc",
    "parent_id": "t1_dij2owm",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Take a look for yourself: https://www.facebook.com/Channel4News/videos/10154898247586939/",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496784496.0,
    "date_created": "2017-06-06",
    "time_created": "09:28:16",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijdgho",
    "parent_id": "t1_dijda1p",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Nah, I'll not take your word for it. Your gain is our loss",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496795969.0,
    "date_created": "2017-06-06",
    "time_created": "12:39:29",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diji7z8",
    "parent_id": "t1_dij8w88",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Don't we pour lube on the top and it trickles down onto the lower branches?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496800924.0,
    "date_created": "2017-06-06",
    "time_created": "14:02:04",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diki6qt",
    "parent_id": "t1_dijc7o3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">A person from Ireland is unlikely ever to feel the same way about someone from Greece or Estonia. \n\nJesus Christ do you actually feel that way? The only thing stopping us from being comfortable is the language barrier. Sounds as if you've never had a foreign friend. It's really not that awful, you don't have to be British to be nice.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496849008.0,
    "date_created": "2017-06-07",
    "time_created": "03:23:28",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijfmoq",
    "parent_id": "t1_dijdecd",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "At this point, the US's credibility amounts to nothing. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496798245.0,
    "date_created": "2017-06-06",
    "time_created": "13:17:25",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijm1xg",
    "parent_id": "t1_dijdecd",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "How did that alliance work out when the Falklands were invaded?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496804924.0,
    "date_created": "2017-06-06",
    "time_created": "15:08:44",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijxb8w",
    "parent_id": "t1_dijdecd",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "What alliance?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496817317.0,
    "date_created": "2017-06-06",
    "time_created": "18:35:17",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijcjyr",
    "parent_id": "t1_dijb75l",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Given that you seem to be using the German cars theory, I'm not quite sure how to respond. Assuming in good faith that you are doing so sincerely and unironically, I think you are underestimating the attractiveness of a more expensive foreign model as status symbol compared to a cheaper British model.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496795005.0,
    "date_created": "2017-06-06",
    "time_created": "12:23:25",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dikh1dj",
    "parent_id": "t1_dijb75l",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">At the moment, we give Germany our hard-earned pounds to purchase BMWs. The Germans don't buy British products, in part for technical reasons involving the valuation of the Euro,\n\nOr because BMWs are just better?\n\nIf you think a niche manufacturer like McLaren could be the next BMW then you're deluded. If they considered themselves capable of that then why aren't they doing it already?\n\nA 10% tariff won't mean shit. British consumers will have to pay it or get the bus. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496846284.0,
    "date_created": "2017-06-07",
    "time_created": "02:38:04",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dikyqym",
    "parent_id": "t1_diklsfc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">We're not in any way \"dependent\" on holidays in Ibiza, or racks of French cheese, or overpriced boxes of LEGO. These are luxuries that we could very, very easily live without.\n\nGreat. I can't wait to live in the Brexit paradise of no holidays, crap food and no fun.\n\n> British goods aren't \"inferior\" to European ones. Unfortunately, many Britons have been brainwashed by advertising into not realising this, \n\nNot just Brits, but evidently the rest of the world. I guess the entire world is in a conspiracy against Britain and in favour of Germany.\n\n",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496878445.0,
    "date_created": "2017-06-07",
    "time_created": "11:34:05",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiy7a7",
    "parent_id": "t1_diix4bf",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Hey, as long as the members of the Tory government all get cushy seats on the boards of the American companies that come to asset strip the UK, it's a win",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1496775478.0,
    "date_created": "2017-06-06",
    "time_created": "06:57:58",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diixwli",
    "parent_id": "t1_diiwvzs",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yup me too",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1496774748.0,
    "date_created": "2017-06-06",
    "time_created": "06:45:48",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiy3zr",
    "parent_id": "t1_diixl39",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Do you lI've in North Somerset? ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496775258.0,
    "date_created": "2017-06-06",
    "time_created": "06:54:18",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij3skw",
    "parent_id": "t1_diiyehb",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Of we said we don't want to leave we'd be welcomed back - just without the ridiculous special protection we receive now. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496785175.0,
    "date_created": "2017-06-06",
    "time_created": "09:39:35",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij5wu7",
    "parent_id": "t1_diiyehb",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Source because she never said that. \n\n\n\"The chancellor told a 2,500-strong crowd in the Bavarian capital that Germany and Europe would naturally strive to REMAIN on good terms with the US, Britain and other countries\" ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496787769.0,
    "date_created": "2017-06-06",
    "time_created": "10:22:49",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiyv9k",
    "parent_id": "t1_diiy3kz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">I don't think anyone wants to be labelled permanently in history as the person who relegated Britain into an irrelevant nation like Greece or Spain\n\nThat person already exists. ",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1496776962.0,
    "date_created": "2017-06-06",
    "time_created": "07:22:42",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij1xaj",
    "parent_id": "t1_diiy3kz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> the person who relegated Britain into an irrelevant nation like Greece or Spain\n\nAKA David Cameron",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1496782480.0,
    "date_created": "2017-06-06",
    "time_created": "08:54:40",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiy9z2",
    "parent_id": "t1_diiy3kz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Oh to be as relevant as Greece and Spain.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1496775650.0,
    "date_created": "2017-06-06",
    "time_created": "07:00:50",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diixpnq",
    "parent_id": "t1_diixnx9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Never been involved in a budget eh?",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496774265.0,
    "date_created": "2017-06-06",
    "time_created": "06:37:45",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij8bbs",
    "parent_id": "t1_dij7ag0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "With massive cuts!",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496790443.0,
    "date_created": "2017-06-06",
    "time_created": "11:07:23",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiz7vk",
    "parent_id": "t1_diiz0b0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "While yes she will probably still win the electorate don't reset back to zero at the end of the campaign, the opposition parties should now be able to make her completely unelectable by 2022. There will be a mid-term squeeze which brexit will make even worse and the Tories will likely have to make wholesale changes  including a new leader to what will be an exhausted Brexit government by 2020 to stand any chance.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1496777706.0,
    "date_created": "2017-06-06",
    "time_created": "07:35:06",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diizlm7",
    "parent_id": "t1_diiz0b0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "deleted because wrong",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496778477.0,
    "date_created": "2017-06-06",
    "time_created": "07:47:57",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij0t6a",
    "parent_id": "t1_diiz2zf",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[Why Britain joined the European Union.](https://m.youtube.com/watch?v=37iHSwA1SwE) ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496780688.0,
    "date_created": "2017-06-06",
    "time_created": "08:24:48",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij0yp3",
    "parent_id": "t1_diizjjn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Don't get me wrong, I'd love us to stay in the EU. But the requirements to do so are far, far too high for me to hope so.\n\nTo start, we'd need a PM willing to say 'actually, we're going to ignore the referendum and stay in the EU' - legally possible, it was only an advisory referendum, but politically... challenging (no doubt Sir Humphrey Appelby would describe it as 'courageous')\n\nThen you would (almost certainly) need an act of Parliament to revoke the notification, which would need a majority of MPs to agree to ignore the referendum result - again, legal but politically difficult for them, especially given how all the tabloids will be screaming their heads off to the large portion of voters that for some reason believes what they read in them.\n\nThen you'd need every single member state to agree to allow the UK to stay, either unconditionally or with additional terms. I don't see, for example, Spain allowing it without at least attempting to get some sort of concession regarding Gibraltar. And as I said before, we've dragged our heels for decades; demanding exceptions and opt-outs to otherwise universal rules like the Euro, or the Schengen Area, or the Charter of Fundamental Rights of the European Union, or the area of freedom, security and justice (AFSJ).\n\nTL;DR: would love to stay, but there's a whopping huge mountain of tangled politics standing between us and the goal.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496780947.0,
    "date_created": "2017-06-06",
    "time_created": "08:29:07",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij28j5",
    "parent_id": "t1_diizjjn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "the negotiations might not have started on our side but the EU is working on there plan. Also the clock as started ticking we have less than 2 years now ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496782951.0,
    "date_created": "2017-06-06",
    "time_created": "09:02:31",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij164l",
    "parent_id": "t1_dij07hr",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "here just for your sanity: /s",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1496781289.0,
    "date_created": "2017-06-06",
    "time_created": "08:34:49",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijt4tn",
    "parent_id": "t1_dijd5sm",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Have you hacked my hardrive? ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496812429.0,
    "date_created": "2017-06-06",
    "time_created": "17:13:49",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwtqy",
    "parent_id": "t1_diiwivc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "A deal so good the IMF are now refusing to back it. ",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1496771881.0,
    "date_created": "2017-06-06",
    "time_created": "05:58:01",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiw9u9",
    "parent_id": "t1_diiw5vz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "A very small majority. The lords is full of libdems who are massively into the EU.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496770289.0,
    "date_created": "2017-06-06",
    "time_created": "05:31:29",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwlcl",
    "parent_id": "t1_diiw37e",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "She's repeatedly said a lot of things ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496771207.0,
    "date_created": "2017-06-06",
    "time_created": "05:46:47",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijn5ji",
    "parent_id": "t1_diizgtd",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The trouble is if you have free trade then you need to have common rules, you can't have countries opting out for their own benefit because it undermines the whole thing.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496806051.0,
    "date_created": "2017-06-06",
    "time_created": "15:27:31",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiz1r8",
    "parent_id": "t1_diiw5o7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That would've been Sir Ivan Rogers getting out of the pool just after the referendum result.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1496777350.0,
    "date_created": "2017-06-06",
    "time_created": "07:29:10",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diixa6j",
    "parent_id": "t1_diiw5o7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Oomph, nicely worded. Wish I could upvote more.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496773140.0,
    "date_created": "2017-06-06",
    "time_created": "06:19:00",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diizxlp",
    "parent_id": "t1_diiw0rd",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "If only we had an actual trade negotiator at our disposal. Perhaps even a former MEP? Even better, perhaps a former cabinet member, even former deputy-PM! If only such a person existed ...",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1496779126.0,
    "date_created": "2017-06-06",
    "time_created": "07:58:46",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiw8rn",
    "parent_id": "t1_diiw0rd",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Would be nice. I was thinking from the Conservative pool, though. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496770204.0,
    "date_created": "2017-06-06",
    "time_created": "05:30:04",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij9abz",
    "parent_id": "t1_dij2q6d",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> she seems much more formidable if she doesn't open her mouth.\n\nLOL.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496791498.0,
    "date_created": "2017-06-06",
    "time_created": "11:24:58",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij7l1m",
    "parent_id": "t1_dij5xf2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think that would probably be the worst possible outcome for labour. If Corbyn cannot win **this** election then there is little reason to believe he will win one in 2022. Infact, the last time an opposition leader lost a general election and then won the subsequent general election was Harold Wilson in 1974. There is very little recent historical precedent for it. The last time labour tried to hammer home the same candidate (Kinnock) despite him losing elections it kept them out of power for a decade. As soon as labour changed candidate (first to Smith who unexpectedly died before the next GE, and then to Blair) they won... and they won by a landslide.  \n\nIf Corbyn has a chance, then his chance is now. If Corbyn fucks this up the left of the labour party should seriously consider rethinking their approach. His ideas have been popular but he has been unpopular - they need to decide what is more important; seeing their policies implemented or retaining their party leader in opposition.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496789635.0,
    "date_created": "2017-06-06",
    "time_created": "10:53:55",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij14jp",
    "parent_id": "t1_diixt21",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Nobody in the political elite I imagine he means. Or at least nobody wanted to be the one in charging of negotiating that deal.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496781216.0,
    "date_created": "2017-06-06",
    "time_created": "08:33:36",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiz2uq",
    "parent_id": "t1_diiyf1a",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yes they will. What you and I consider important is not the same as an international politician",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496777416.0,
    "date_created": "2017-06-06",
    "time_created": "07:30:16",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiw9ld",
    "parent_id": "t1_diivat5",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "In fairness, blowing the 20 point lead could have been a team effort. Well, except for not letting the rest of her team say anything, except for the occasional substitution of Amber Rudd as flak-taker-in-chief or Michael Fallon soundbite.\n\nIf ever there was an election that showed how out-of-date the way our PM is chosen has become, this is it.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1496770268.0,
    "date_created": "2017-06-06",
    "time_created": "05:31:08",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diivluf",
    "parent_id": "t1_diiuy3g",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yes ignore the fact that audiences laugh when told to judge her by her record.. ignore the fact that NHS workers are begging you not to vote for her, that head teachers are contemplating cutting the school week to 4 and a half days, that the police are in crisis. Ignore the fact millions of the next generation will spend their lives in the rent trap. Ignore the fact foodbank use is now the highest on record! Ignore the fact she thinks the solution to stopping terrorism is more internet surveillance when the Manchester bomber and London attackers were all identified by police *before* they attacked, but staff were too thinly spread to follow up. She's a **competent politican**!",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1496768347.0,
    "date_created": "2017-06-06",
    "time_created": "04:59:07",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwr81",
    "parent_id": "t1_diiwbas",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Oh, he did, didn't he? I see a blank line at the end of his comment!",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496771674.0,
    "date_created": "2017-06-06",
    "time_created": "05:54:34",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiuv58",
    "parent_id": "t1_diiusm7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Lying and avoiding questions, of course!",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1496766203.0,
    "date_created": "2017-06-06",
    "time_created": "04:23:23",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiyplc",
    "parent_id": "t1_diivtug",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Corbyn has actually massively won me round this election. He's obviously been working on his PR/media image.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496776621.0,
    "date_created": "2017-06-06",
    "time_created": "07:17:01",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiv7oe",
    "parent_id": "t1_diiv70f",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No, it's because it Undermines a Working Relationship to get a Deal, and also because it might set a precedent for UK Leaking EU stuff if you consider it.",
    "controversiality": 1,
    "ups": -1,
    "downs": 0,
    "score": -1,
    "created": 1496767213.0,
    "date_created": "2017-06-06",
    "time_created": "04:40:13",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dikf73k",
    "parent_id": "t1_dijb3h8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Did you know that Paul Nuttall actually starred in that film as a F-14?",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496842382.0,
    "date_created": "2017-06-07",
    "time_created": "01:33:02",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij4j76",
    "parent_id": "t1_dij0nr0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Brexit is not as important right now as our run down services..one of the reasons people voted for brexit...in a misguided way IMO. Save our NHS is top priority!",
    "controversiality": 0,
    "ups": 37,
    "downs": 0,
    "score": 37,
    "created": 1496786136.0,
    "date_created": "2017-06-06",
    "time_created": "09:55:36",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijbvxl",
    "parent_id": "t1_dij0nr0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "So, a cricket win for England in 2022, yeah? ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496794292.0,
    "date_created": "2017-06-06",
    "time_created": "12:11:32",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijdeae",
    "parent_id": "t1_dij0nr0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> It will stop them ditching May as wel\n\nnothing will stop them from ditching May. She's toast whether she wins or not. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496795904.0,
    "date_created": "2017-06-06",
    "time_created": "12:38:24",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij3ung",
    "parent_id": "t1_diizopy",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yeah it's all very well hoping the tories will be unelectable come the next election; there's a lot of damage they could do in the next five years.",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1496785252.0,
    "date_created": "2017-06-06",
    "time_created": "09:40:52",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij4xch",
    "parent_id": "t1_diizopy",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "As long as her majority is under 30, it can still happen. Especially super contentious policies like the dementia tax and new internet regulation could easily inspire enough of a rebellion to be defeated.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1496786634.0,
    "date_created": "2017-06-06",
    "time_created": "10:03:54",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij8r4p",
    "parent_id": "t1_diizowo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Polls put Conservatives 7 points ahead and a 95% confidence interval for British polls is ±10 points, so Labour has an 8% chance of being ahead in points.\n\nThat about matches the betting markets.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1496790923.0,
    "date_created": "2017-06-06",
    "time_created": "11:15:23",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijg7yd",
    "parent_id": "t1_diiz8vu",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yup but if it goes badly it could be more. Really wish someone would just go you know what let's not. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496798858.0,
    "date_created": "2017-06-06",
    "time_created": "13:27:38",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij12z8",
    "parent_id": "t1_diiz8d5",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Let's just call it off then",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1496781144.0,
    "date_created": "2017-06-06",
    "time_created": "08:32:24",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij031y",
    "parent_id": "t1_diiza5q",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Which is a desperate negotiating position. They're saying that they want to avoid all nuance, compromise or sense - because, as soon as you apply any intelligence to the process, we will lose out. ",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1496779414.0,
    "date_created": "2017-06-06",
    "time_created": "08:03:34",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij38gq",
    "parent_id": "t1_diiza5q",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Right. They're going in with the worst possible position, so they can't even compromise to something better: they've left no room for any concessions from the EU. It's totally irresponsible.\n\nWe've got to give the people the chance to review the deal and say 'Yes, this is what we voted for' or 'No, let's stay in the EU'.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496784405.0,
    "date_created": "2017-06-06",
    "time_created": "09:26:45",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij6lwt",
    "parent_id": "t1_diiza5q",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That's for home consumption.... I hope. Reality is that UK needs a 10 year disengagement transitional deal to avoid cliff edge. Between changing UK law, managing over 700 treaties and agreements with non EU countires , and the need to sort out a trade agreement with the EU there is just  far too much to do. Both lab and cons are not willing or politically able to be honest about it.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496788552.0,
    "date_created": "2017-06-06",
    "time_created": "10:35:52",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijh4s5",
    "parent_id": "t1_dij2d1f",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "But that's £350m per week we can afford in tax cuts for the wealthiest in society!\n\nThat'll motivate people not to be poor.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496799803.0,
    "date_created": "2017-06-06",
    "time_created": "13:43:23",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijfbgs",
    "parent_id": "t1_dij360p",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'd recommend using tactical2017.com to decide who you're voting for. Because of the glorious system that is FPTP, you might just end up indirectly voting for the Tories, and anyone in charge is better than them.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496797917.0,
    "date_created": "2017-06-06",
    "time_created": "13:11:57",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij5m23",
    "parent_id": "t1_dij1ipe",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Because it can ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496787430.0,
    "date_created": "2017-06-06",
    "time_created": "10:17:10",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij3j0d",
    "parent_id": "t1_dij1ipe",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "EEA & implement the FoM controls we already had seems like a decent compromise, though I agree it's a case of minimising losses rather than gaining anything.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496784815.0,
    "date_created": "2017-06-06",
    "time_created": "09:33:35",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijmxmj",
    "parent_id": "t1_dij1u97",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That clearly isn't their negotiating stance.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496805827.0,
    "date_created": "2017-06-06",
    "time_created": "15:23:47",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijuuth",
    "parent_id": "t1_dij1epb",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">  As freedom of movement of people is an integral part of the single market that means that the UK will be leaving the single market.\n\nThat is the EU's negotiating position.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496814379.0,
    "date_created": "2017-06-06",
    "time_created": "17:46:19",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij5np5",
    "parent_id": "t1_dij3arc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "the choice is between a corbyn or may brexit. childish to pretend otherwise. really have little time for lib dems",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496787482.0,
    "date_created": "2017-06-06",
    "time_created": "10:18:02",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dilizlz",
    "parent_id": "t1_dijfmoq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Great opinion. Mind if I trash it?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496899642.0,
    "date_created": "2017-06-07",
    "time_created": "17:27:22",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diliyjs",
    "parent_id": "t1_dijm1xg",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Not the US's problem and certainly more complex than you try to make it out to be",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496899608.0,
    "date_created": "2017-06-07",
    "time_created": "17:26:48",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dilivfz",
    "parent_id": "t1_dijxb8w",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You're stupid",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496899513.0,
    "date_created": "2017-06-07",
    "time_created": "17:25:13",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijdbze",
    "parent_id": "t1_dijcjyr",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It's true, Brits have been brainwashed into thinking that \"foreign is better\", and that a Stella tastes better than a Carling. \n\nIn effect, a 10% tariff on German car imports would act as a 'stupidity tax' on people who think they look flash. I can't honestly think of a more progressive form of taxation, off the top of my head. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496795838.0,
    "date_created": "2017-06-06",
    "time_created": "12:37:18",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dikljqt",
    "parent_id": "t1_dikh1dj",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Here is the list of most and least reliable cars in the UK in 2016:\n\nhttp://www.autoexpress.co.uk/car-news/consumer-news/91220/the-most-and-least-reliable-car-manufacturers-2016\n\nAs you can see, BMW is comfortably in the bottom half. Below Jaguar. How does that make them \"just better\"?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496858012.0,
    "date_created": "2017-06-07",
    "time_created": "05:53:32",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dikzfrm",
    "parent_id": "t1_dikyqym",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Great. I can't wait to live in the Brexit paradise of no holidays, crap food and no fun.\n\nYou'd be living in a Brexit paradise in which people in our coastal communities have jobs and a source of economic dignity, and probably better schools and hospitals. Why is Stilton crapper than Brie? Please, explain. \n\n> Not just Brits, but evidently the rest of the world. I guess the entire world is in a conspiracy against Britain and in favour of Germany.\n\n? The UK is easily the biggest export market for German cars. Other countries e.g. France prefer to buy French cars. \n\nFeel free to check if you don't believe me:\n\nhttps://global.handelsblatt.com/companies-markets/car-industry-would-bounce-back-experts-say-548880\n\nWhereas people like you bankrupted the British car industry because you declared British cars to be \"crap\", resulting in massive social and economic harm to the West Midlands in particular as companies like Austin and Rover went bust.\n",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496879162.0,
    "date_created": "2017-06-07",
    "time_created": "11:46:02",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diixxud",
    "parent_id": "t1_diixwli",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1496774835.0,
    "date_created": "2017-06-06",
    "time_created": "06:47:15",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij6j82",
    "parent_id": "t1_dij3skw",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I don't even know if that would be enough. Once bitten, twice shy. There would need to a fundamental shift among the population to basically Ireland's levels of pro-EU sentiment. You would likely be forced to use the Euro to forever lock you in as well.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496788465.0,
    "date_created": "2017-06-06",
    "time_created": "10:34:25",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij6dew",
    "parent_id": "t1_dij5wu7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "https://www.theguardian.com/world/2017/may/28/merkel-says-eu-cannot-completely-rely-on-us-and-britain-any-more-g7-talks",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496788283.0,
    "date_created": "2017-06-06",
    "time_created": "10:31:23",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij3jaz",
    "parent_id": "t1_diiyv9k",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You mean the British voting public?",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496784826.0,
    "date_created": "2017-06-06",
    "time_created": "09:33:46",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiy1m8",
    "parent_id": "t1_diixpnq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I mean, if someone offered you £100 to shit in your mouth you'd probably not take it despite them being a net contributor to your wallet. ",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1496775100.0,
    "date_created": "2017-06-06",
    "time_created": "06:51:40",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiyccy",
    "parent_id": "t1_diixpnq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Many times. Money isn't everything. There are more ways to contribute than financially. And constantly whingeing and expecting to be treated as a special case gets tiresome enough that organisations can take a hit to ensure smoother running.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496775802.0,
    "date_created": "2017-06-06",
    "time_created": "07:03:22",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij5v34",
    "parent_id": "t1_diiz7vk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I agree- the problem is that \"should\", right in the middle. If she still defeats Corbyn, that leaves the Labour Party right back in the middle of their infighting and division, now with a leader who lost an election despite playing a blinder. So while May could be unelectable by the end of term and Brexit, it's still dependent on Labour mounting some sort of coherent challenge.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496787713.0,
    "date_created": "2017-06-06",
    "time_created": "10:21:53",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij0927",
    "parent_id": "t1_diizlm7",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That's not true. She only looked good against Cruz but mediocre against Rubio and bad against Kasich.\n\nhttp://www.realclearpolitics.com/epolls/2016/president/us/general_election_cruz_vs_clinton-4034.html#polls\nhttp://www.realclearpolitics.com/epolls/2016/president/us/general_election_rubio_vs_clinton-3767.html#polls\nhttp://www.realclearpolitics.com/epolls/2016/president/us/general_election_kasich_vs_clinton-5162.html#polls",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496779723.0,
    "date_created": "2017-06-06",
    "time_created": "08:08:43",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij1tkp",
    "parent_id": "t1_dij0yp3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Then you would (almost certainly) need an act of Parliament to revoke the notification, which would need a majority of MPs to agree to ignore the referendum result - again, legal but politically difficult for them, especially given how all the tabloids will be screaming their heads off to the large portion of voters that for some reason believes what they read in them.\n\nI don't think it would. The European Union (Notice of Withdrawal) Act merely gave the PM the _ability_ to send a notification under Article 50, it didn't _mandate_ her to do so. So I see no reason why it would take an Act of Parliament to reverse the decision.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496782322.0,
    "date_created": "2017-06-06",
    "time_created": "08:52:02",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij21x1",
    "parent_id": "t1_dij0yp3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It's only the last issue I have a problem with. Why would we need every state to agree? We haven't left. Article 50 is deliberately vague on almost all points. If the PM notified the EU that we intended to withdraw the article 50 notification..there's no mechanism for every state's agreement, no process, no...anything really. I think it would be hard for the EU to invent a process and apply it retroactively to the UK and have it legally sound from challenges.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496782675.0,
    "date_created": "2017-06-06",
    "time_created": "08:57:55",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij2e4d",
    "parent_id": "t1_dij28j5",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I was just reading this [blog](http://eulawanalysis.blogspot.co.uk/2014/12/article-50-teu-uses-and-abuses-of.html)..when I get into conversations i'm interested in, I try look up sources. It seems to me, to say that article 50 can't be used to change terms without the consent of all members. If terms remain the same..it doesn't seem to need the same agreement. \n\n",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496783188.0,
    "date_created": "2017-06-06",
    "time_created": "09:06:28",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijtoqi",
    "parent_id": "t1_dijt4tn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Worst chat up line ever.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496813050.0,
    "date_created": "2017-06-06",
    "time_created": "17:24:10",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwxr1",
    "parent_id": "t1_diiwtqy",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The IMF wants a haircut. Politically, that's impossible. So this is the best the Greeks can expect. ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1496772199.0,
    "date_created": "2017-06-06",
    "time_created": "06:03:19",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwik4",
    "parent_id": "t1_diiw9u9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "But still a majority. It's Tories blocking her which she fears, her own party, not the Lib Dems. ",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1496770984.0,
    "date_created": "2017-06-06",
    "time_created": "05:43:04",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diixxfp",
    "parent_id": "t1_diiw9u9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Election doesn't change the lords.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496774806.0,
    "date_created": "2017-06-06",
    "time_created": "06:46:46",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dik3tsy",
    "parent_id": "t1_dijn5ji",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Abolutely right. That's the point and it's not just about trade. Political integration is a lot more complicated. The EU is about unanimous agreement. If one country disagrees, the agreement is watered down so that everyone is on board",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496825607.0,
    "date_created": "2017-06-06",
    "time_created": "20:53:27",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diixd1c",
    "parent_id": "t1_diixa6j",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Thanks. :-)",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496773343.0,
    "date_created": "2017-06-06",
    "time_created": "06:22:23",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijaq3k",
    "parent_id": "t1_dij9abz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Is that also the plan, that she's EVEN more formidable if she doesn't show up to debates and interviews at all?\n\nEurope will concede to all demands by May simple staying at home with a cup of tea!",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496793041.0,
    "date_created": "2017-06-06",
    "time_created": "11:50:41",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijb5hb",
    "parent_id": "t1_dij7l1m",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'd suggest if he gets around 40% of the vote after coming in SO low at the start, it's a sign there's a lot of people behind him, and sadly we're going to have to see the UK suffer a lot more before people actually realise the Tories are to blame, and not 'the previous Labour government', surely that would wear thin after another five years?\n\nHowever, if Barry Gardiner is relatively scandal free, I sense he could make for a good challenger next time around.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496793499.0,
    "date_created": "2017-06-06",
    "time_created": "11:58:19",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij1lkv",
    "parent_id": "t1_dij14jp",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Ah right. Fair enough.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496781972.0,
    "date_created": "2017-06-06",
    "time_created": "08:46:12",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiy7cg",
    "parent_id": "t1_diiw9ld",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "let's Just directly elect a Prime Minister using French runnoff or STV.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496775482.0,
    "date_created": "2017-06-06",
    "time_created": "06:58:02",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwk02",
    "parent_id": "t1_diivluf",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "This is very well put. Fuck Theresa May, she and her government have failed this country, it'll be a sham if she's still PM after Thursday. ",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1496771104.0,
    "date_created": "2017-06-06",
    "time_created": "05:45:04",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwpoo",
    "parent_id": "t1_diivluf",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You joke but I read on here somewhere that a guy was voting Tories because 1. uses private healthcare 2. Not in school and no kids. 4. Own's own house 3. Nothing to hide 4. Has a slightly higher take home wage.   \nCan't fault your argument there mate.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496771554.0,
    "date_created": "2017-06-06",
    "time_created": "05:52:34",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiwvmf",
    "parent_id": "t1_diivluf",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "this, in a nutshell!",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496772031.0,
    "date_created": "2017-06-06",
    "time_created": "06:00:31",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij6ktv",
    "parent_id": "t1_diivluf",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I agree. \n\nEdited because unintended unappropiate pun.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496788518.0,
    "date_created": "2017-06-06",
    "time_created": "10:35:18",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiuwq4",
    "parent_id": "t1_diiuv58",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Oh, she's exceptionally good at that! Very useful in extremely complicated negotiations I'm sure. ",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1496766327.0,
    "date_created": "2017-06-06",
    "time_created": "04:25:27",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij6sr8",
    "parent_id": "t1_diiyplc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Now imagine if he had been given a proper chance from the beginning! I'm not surprised it's taken him time to get THIS good (though I have always supported him) when he's spent two years being undermined and attacked by his own party, the media, the opposition and everyone's granny and their dog. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496788765.0,
    "date_created": "2017-06-06",
    "time_created": "10:39:25",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diivm1k",
    "parent_id": "t1_diiv7oe",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "okay? i was just pointing out that the fact that it's authenticity wasn't questioned surely lends credence to the legitimacy of that leak.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1496768365.0,
    "date_created": "2017-06-06",
    "time_created": "04:59:25",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij8fal",
    "parent_id": "t1_dij4j76",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The UK's capacity to  fund and staff  any of the public services is ALL about Brexit.\n\n\n\n",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1496790564.0,
    "date_created": "2017-06-06",
    "time_created": "11:09:24",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij2ena",
    "parent_id": "t1_dij12z8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "If there was public support for that, fine by me. Unfortunately, at the moment we're stuck with the decision of the 52%. And however much the Leave campaign arguments disintegrate, there's no plausible mechanism at the moment to show if that support exists. Other, of course, than a general election ... in a FPTP system where neither of the two big parties has the balls to present what they actually think is the best option for the UK as part of their manifesto. \n\nWhat a time to be alive and in what are supposed to be your best earning years ...",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1496783209.0,
    "date_created": "2017-06-06",
    "time_created": "09:06:49",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij0f1j",
    "parent_id": "t1_dij031y",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I do not understand why people think that the Tories will be better at negotiating Brexit. I actually think Labour could be better, as they would try to make a deal, whereas the Tories are trying to 'win'. They've shown that already. ",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1496780020.0,
    "date_created": "2017-06-06",
    "time_created": "08:13:40",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij604s",
    "parent_id": "t1_dij031y",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The idea that it's even a negotiating position is new. These same backbenchers have wanted to twist the knife in the EU since the 90s, throughout the 00s. How many of them are saying Brexit's good because it speeds up the EU's disintegration? Hard Brexit to them means damaging brexit.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496787871.0,
    "date_created": "2017-06-06",
    "time_created": "10:24:31",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dikdy64",
    "parent_id": "t1_dij031y",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Textbooks on negotiating (such as \"Getting To Yes\") emphasize the importance of what they call the BATNA - Best Alternative To a Negotiated Agreement. You need never settle for less than this. If your strategy is \"any agreement is better than no agreement\" then the other side can simply decide what is perfect for them and then tell you that they will never agree to anything else.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496840063.0,
    "date_created": "2017-06-07",
    "time_created": "00:54:23",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij7348",
    "parent_id": "t1_dij6lwt",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Both lab and cons are not willing or politically able to be honest about it.\n\nThat's what gets me as well. There is a significant proportion of brexit voters out there that are of the walk away persuasion, led by Gove and Farage..but FFS could Labour and teh Tories not even have a joint press conference saying...we are listening, but this is complicated, we will have to make some concessions, there will be more payments, but these are owed and much less than has been reported, we will need a transitional arrangement to save 1 million jobs. This isn't project fear, the vote is over, this is operation implementation",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496789079.0,
    "date_created": "2017-06-06",
    "time_created": "10:44:39",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijogl1",
    "parent_id": "t1_dijmxmj",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Why else would they repeatedly make unreasonable demands? They clearly don't want a deal, they just can't sell that to their voters.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496807418.0,
    "date_created": "2017-06-06",
    "time_created": "15:50:18",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijuylv",
    "parent_id": "t1_dijuuth",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">That is the EU's negotiating position.\n\nNo, it's the way the single market works. It's the _definition_ of a single market, along with freedom of movement of goods, freedom of movement of capital and freedom to establish and provide services.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496814499.0,
    "date_created": "2017-06-06",
    "time_created": "17:48:19",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijxfyv",
    "parent_id": "t1_dijdbze",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It is better. Their brands are popular all over the world for a reason.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496817478.0,
    "date_created": "2017-06-06",
    "time_created": "18:37:58",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dikysgg",
    "parent_id": "t1_dikljqt",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Oh right. You'd better tell the entire world then to stop buying awful BMWs and start buying ~~American~~Indian Jaguars instead.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496878490.0,
    "date_created": "2017-06-07",
    "time_created": "11:34:50",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dikztkg",
    "parent_id": "t1_dikzfrm",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> You'd be living in a Brexit paradise in which people in our coastal communities have jobs and a source of economic dignity, and probably better schools and hospitals.\n\nYou are aware that the Brexiters have given up on claiming any of that and are now saying that things will be worse off but it's a price worth paying? Do keep up, you're standing where the goalposts used to be.\n\n>Whereas people like you bankrupted the British car industry because you declared British cars to be \"crap\", resulting in massive social and economic harm to the West Midlands in particular as companies like Austin and Rover went bust.\n\nThey were crap. Or why isn't the world driving Austins and Rovers?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496879565.0,
    "date_created": "2017-06-07",
    "time_created": "11:52:45",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiyc9o",
    "parent_id": "t1_diixxud",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yup. Me too.",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1496775796.0,
    "date_created": "2017-06-06",
    "time_created": "07:03:16",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijv513",
    "parent_id": "t1_dij6j82",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'd welcome Euro GB tbh. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496814708.0,
    "date_created": "2017-06-06",
    "time_created": "17:51:48",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij6hqt",
    "parent_id": "t1_dij6dew",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Well done I can tell you haven't read the article, just the title, because that's where my quote comes from. \n\n",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496788419.0,
    "date_created": "2017-06-06",
    "time_created": "10:33:39",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiy5m3",
    "parent_id": "t1_diiy1m8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "But if I had taken the deal for 40 years I would miss the money. \n\nI get it; the UK is shit, we're shit, everything is shit. Travel a bit and appreciate that we are not shit. \n\nAnyway, about this £100",
    "controversiality": 1,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496775369.0,
    "date_created": "2017-06-06",
    "time_created": "06:56:09",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij12wc",
    "parent_id": "t1_diiy1m8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "\"I'm 14 and I like politics.\" - THE POST ",
    "controversiality": 1,
    "ups": -1,
    "downs": 0,
    "score": -1,
    "created": 1496781140.0,
    "date_created": "2017-06-06",
    "time_created": "08:32:20",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij6h15",
    "parent_id": "t1_dij5v34",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "If the PLP can't unite behind Corbyn now they're doomed to split the party. He's proven with a little momentum that he can make progress, I'm expecting a few of their big beasts to return to the top table no matter what the result is.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496788396.0,
    "date_created": "2017-06-06",
    "time_created": "10:33:16",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijhz36",
    "parent_id": "t1_dij1tkp",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Did it give her the ability to withdraw that notification?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496800664.0,
    "date_created": "2017-06-06",
    "time_created": "13:57:44",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dikiy8p",
    "parent_id": "t1_dij2e4d",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I agree with that but the problem is we need all 26 members to agree to revoke it and May hasn't exactly been making friends with the EU so you can bet one or two will say no.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496850951.0,
    "date_created": "2017-06-07",
    "time_created": "03:55:51",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijvikl",
    "parent_id": "t1_dijtoqi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You say that now...",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496815144.0,
    "date_created": "2017-06-06",
    "time_created": "17:59:04",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiz6q4",
    "parent_id": "t1_diiwik4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> It's Tories ... which she fears, her own party\n\nHuh, maybe she has more in common with the public than we thought",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496777641.0,
    "date_created": "2017-06-06",
    "time_created": "07:34:01",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diixz7n",
    "parent_id": "t1_diixxfp",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yes, I'm well aware of that, but if the mandate from the commons is larger, the lords will be less likely to kick up a fuss.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496774930.0,
    "date_created": "2017-06-06",
    "time_created": "06:48:50",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijd2yj",
    "parent_id": "t1_dijaq3k",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It's a bold move, Cotton....",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496795569.0,
    "date_created": "2017-06-06",
    "time_created": "12:32:49",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijaor8",
    "parent_id": "t1_diiy7cg",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I don't know what the best alternative is, but it seems to me that the days of the PM being merely a \"first among equals\" in Parliament are long gone, and any electoral system that assumes that's all they are should therefore go too.\n\nThe reality today is that many people vote for a candidate to be their MP not because of the candidate themselves but because of their party allegiance, and particularly in an election like this week's, because of the leader of that party.\n\nHowever, as we've seen several times in recent years, our system only guarantees that the candidate elected to be someone's MP remains in office for the full term or triggers a by-election when they step down. It provides no guarantee that voters will be given a new say if their MP changes allegiance or, crucially, if the PM steps down and someone new and potentially very different takes control of what is effectively our executive branch.\n\nWhen someone like Gordon Brown or Theresa May reaches such high office without a vote, there is always a complaint from those who don't like them that it's undemocratic. There is always a response from their supporters that of course it's democratic because people voted for their MP, invariably ignoring details like the MP running on the platform of a certain party whose leader was known at that time and expected to serve for the full length of the next parliament. I just don't think that's good enough any more.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496793002.0,
    "date_created": "2017-06-06",
    "time_created": "11:50:02",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diixyuh",
    "parent_id": "t1_diiwpoo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "But that's great. That's exactly the sort of people that should be voting Tory. And they should be getting 1% of the vote. \n\nThe other 39% who are voting Tory are doing it against their best interests. I read a few weeks back about someone who lost their car and disability allowance but will still vote Tory because of the benefits scroungers. Completely​ mad, you vote to fuck yourself up because of what you think someone else is getting.   ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1496774904.0,
    "date_created": "2017-06-06",
    "time_created": "06:48:24",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiyu2r",
    "parent_id": "t1_diiwpoo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "My Flatmates GF turned round to me and said that she doesn't care that thousands of people are dying or living in appalling conditions because she's got everything she wants and doesn't want her to pay more tax on her inheritance. now, the irony is is that her family is very wealthy because the government handed them a small mansion on the Thames after the war, and she's 18.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496776890.0,
    "date_created": "2017-06-06",
    "time_created": "07:21:30",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij6o31",
    "parent_id": "t1_diiwpoo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I've spoken to a few like this, including one who has about 4K a month after tax. Selfish pricks. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496788619.0,
    "date_created": "2017-06-06",
    "time_created": "10:36:59",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijgg7b",
    "parent_id": "t1_dij6sr8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Thing is though, while I might have warmed to him as a person, I still do not trust him or his front bench to actually deliver their manifesto, so I'm not sure more time (or starting from a better position) would help, at least in my case.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496799097.0,
    "date_created": "2017-06-06",
    "time_created": "13:31:37",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijlui9",
    "parent_id": "t1_dij8fal",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Of course it is...but most brexiteers weren't making that connection!",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496804709.0,
    "date_created": "2017-06-06",
    "time_created": "15:05:09",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijx16x",
    "parent_id": "t1_dij2ena",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Something about the only parties that want to improve the voting system never getting control says a lot about the FPTP system and the parties we're electing...",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496816976.0,
    "date_created": "2017-06-06",
    "time_created": "18:29:36",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij5mn1",
    "parent_id": "t1_dij0f1j",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Then you don't understand the EU then http://uk.mobile.reuters.com/article/idUKKBN18W1UI",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496787448.0,
    "date_created": "2017-06-06",
    "time_created": "10:17:28",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij95fs",
    "parent_id": "t1_dij7348",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> but these are owed\n\nno they arent.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496791350.0,
    "date_created": "2017-06-06",
    "time_created": "11:22:30",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijonar",
    "parent_id": "t1_dijogl1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "They haven't made any demands, negotiating hasn't started. Everything you are hearing up to now is theatre, nothing more than that.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496807611.0,
    "date_created": "2017-06-06",
    "time_created": "15:53:31",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dilnztb",
    "parent_id": "t1_dijuylv",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Again, that is the EU's negotiating position. But the value of the single market is tariff free trade (e.g. EUCU) and [financial passporting](http://www.bankofengland.co.uk/pra/Pages/authorisations/passporting/default.aspx). Starting with those, a lot of the value of being in the EEA would be gained without actually joining the EEA. If an agreement on passporting without being in the EEA can be reached - as Switzerland have done (though Switzerland are in Shengen which allows the free movement of people...) then most brexiteers will probably be happy.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496905642.0,
    "date_created": "2017-06-07",
    "time_created": "19:07:22",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dil0sg5",
    "parent_id": "t1_dikysgg",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "One day, you might be able to afford a plane ticket to visit another country. \n\nIf you do, try going to the United States of America. One thing you'll notice is that there aren't many German cars on the roads. Even the French much prefer their Renaults and Citroens to the Bavarian brands.\n\nIt's only in Britain where we have a critical mass of dickheads who are willing to put their own vehicle industry out of business because they are convinced that they'll look dead cool in a BMW X5. \n\nWhereas they actually look like twats. They also drive like twats.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496880615.0,
    "date_created": "2017-06-07",
    "time_created": "12:10:15",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dil03rb",
    "parent_id": "t1_dikztkg",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Sorry, I thought we were having a factual debate, not one based on you making shit up? \n\nAs it happens the last time I rode in a Rover was in China. They bought the company and moved its factories there. They quite like them. \n\nThe reason BMWs are popular in Britain is that they're very good at advertising to materialistic male arseholes. \n\nhttp://www.thedailymash.co.uk/news/business/bmw-4-x-4-openly-marketed-to-pricks-2014080489253",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496879861.0,
    "date_created": "2017-06-07",
    "time_created": "11:57:41",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiyhpc",
    "parent_id": "t1_diiyc9o",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "me too thanks",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1496776142.0,
    "date_created": "2017-06-06",
    "time_created": "07:09:02",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijxogl",
    "parent_id": "t1_dijv513",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The Euro gets an unfair rep in Britain. It has problems but its far from a failed currency and its problems only really apply on a large scale macro-economic level. To the average person on the street, it bloody convenient. I, a citizen of Ireland can get on a plane right now and be confident that the notes in my pocket remain useful across most of Western Europe. I don't have to fear about losing money through conversions etc. Britain on the other hand can't do that within its own borders. I've had people freak out with Northern Irish pounds (bizarrely minted in Dublin btw) or the 5 or so different Scottish pounds. NI sterling isn't even considered legal tender in the UK mainland.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496817772.0,
    "date_created": "2017-06-06",
    "time_created": "18:42:52",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij7ec7",
    "parent_id": "t1_dij6hqt",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The very first line in the article.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496789427.0,
    "date_created": "2017-06-06",
    "time_created": "10:50:27",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiybnp",
    "parent_id": "t1_diiy5m3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I mean, I've lived in four other countries including a third world one and my quality of life was by no means highest in the UK, and certainly the average quality of life is much lower here than most of Western Europe. I didn't really say anything about that though. You seem to be arguing that the UK being a net contributor means the EU is desperate to keep us, which is self-evidently nonsense. The point is that often enough grief is caused by the money that you aren't really sad to lose it. ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1496775758.0,
    "date_created": "2017-06-06",
    "time_created": "07:02:38",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diizohh",
    "parent_id": "t1_diiy5m3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "As someone who's travelled a lot and especially around Europe, the majority of the opinions I've gathered is, people are more than happy to let UK leave. The EU will miss our money but will be glad that UK is not asking special treatment anymore. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496778642.0,
    "date_created": "2017-06-06",
    "time_created": "07:50:42",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijjhyb",
    "parent_id": "t1_dijhz36",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Did it give her the ability to withdraw that notification?\n\nNo, but given that R (Miller) vs SoS DexEU held that Parliament's express will was that the UK be a member of the EU and _changing_ that status required powers be granted by Parliament, I don't foresee the same legal problems in withdrawing the notification.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496802277.0,
    "date_created": "2017-06-06",
    "time_created": "14:24:37",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dikjkqz",
    "parent_id": "t1_dikiy8p",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think the blog means we only have to have the 26 agreements if terms are changed. It doesn't say anything explicitly about changing our minds under the same terms",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496852604.0,
    "date_created": "2017-06-07",
    "time_created": "04:23:24",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijenwc",
    "parent_id": "t1_dijaor8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I agree so much with this, the time of unelected Prime Ministers must come to an end. I know most people arn't in favour of a Republic but atleast having a directly elected PM would be a good move and not get rid of the monarchy that is so loved.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496797222.0,
    "date_created": "2017-06-06",
    "time_created": "13:00:22",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiy7cv",
    "parent_id": "t1_diixyuh",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Agree with both points and have seen many examples of the other 39% as you say.  Its inexplicable. \n",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496775483.0,
    "date_created": "2017-06-06",
    "time_created": "06:58:03",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dik2pbv",
    "parent_id": "t1_dij5mn1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Okay. Interesting. I guess it makes sense that continuity is easier. \nIf that was her big worry, then perhaps she shouldn't have called this election then, because I think the EU must be watching her and now be less impressed than they were two months ago, and they weren't impressed then were they.\n\nFriend sent this, very interesting perspective:\n\nhttps://www.opendemocracy.net/uk/anthony-barnet/why-is-she-frit",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496824143.0,
    "date_created": "2017-06-06",
    "time_created": "20:29:03",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dij98kk",
    "parent_id": "t1_dij95fs",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "They are funds that are committed and owed. Nobody can argue that the UK has no commitments to the EU..till at least 2020",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496791444.0,
    "date_created": "2017-06-06",
    "time_created": "11:24:04",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dil1lh4",
    "parent_id": "t1_dil0sg5",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "If you think the British car industry failed because Brits are uniquely unpatriotic then you're deluded. Bentley, RR, Jaguar, McClaren remain decent brands in their categories, but they're all niche and all foreign owned like the rest of the British car industry.\n\nThat suggests that the British are incapable of running car companies. So it's no surprise that Rover and Austin failed. Brits drive X5s but they also drive Land Rovers, but again they're foreign owned.\n\nBritish premium brands were premium enough to dodge the fate of the lower end brands but we still need foreigners to run them.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496881467.0,
    "date_created": "2017-06-07",
    "time_created": "12:24:27",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dil1nas",
    "parent_id": "t1_dil03rb",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> The reason BMWs are popular in Britain is that they're very good at advertising to materialistic male arseholes.\n\nBut Britain is good at advertising, that doesn't make any sense. If advertising was enough to make people drive crap cars then no British car company would ever have gone bust.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496881522.0,
    "date_created": "2017-06-07",
    "time_created": "12:25:22",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiyyxz",
    "parent_id": "t1_diiyhpc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "annnnd me too.",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1496777183.0,
    "date_created": "2017-06-06",
    "time_created": "07:26:23",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiyzpc",
    "parent_id": "t1_diiyhpc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yessir. Me 'un all.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1496777226.0,
    "date_created": "2017-06-06",
    "time_created": "07:27:06",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiyopd",
    "parent_id": "t1_diiybnp",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'm not saying they're desperate to keep us at all. What I'm saying is they will not be so childish as to dismiss a net contributor as a trifle. \n\nThere's a lot of sabre rattling but when a bomb goes off, foreign leaders show their true self. They are and will remain our friends.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496776569.0,
    "date_created": "2017-06-06",
    "time_created": "07:16:09",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dijdd8b",
    "parent_id": "t1_dij98kk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Until at least 2019. We pay them their regular £350 million a week until then, at which point the treaties cease to apply.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496795874.0,
    "date_created": "2017-06-06",
    "time_created": "12:37:54",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dil891j",
    "parent_id": "t1_dil1lh4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> That suggests that the British are incapable of running car companies.\n\n...whereas what they should have done is lobby the European Union to require that people buy massively polluting diesel cars - disadvantaging companies competitors that hadn't specialised in diesel engines, like Austin/Rover - and then produce even MORE polluting diesel cars that have their emissions levels disguised by 'defeat devices'.\n\nAnd then get rumbled by the Americans and have to pay massive fines.\n\nYep, can't beat German management. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496888383.0,
    "date_created": "2017-06-07",
    "time_created": "14:19:43",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "dil730k",
    "parent_id": "t1_dil1nas",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No, we're bad at advertising. Which is why people are convinced that drinking Stella - a truly revolting lager - is sophisticated, whereas drinking Carling or Boddington's isn't.\n\nThis prejudice exists in most countries to some degree. Americans view Budweiser as a very unglamorous drink. Likewise with Australians and Foster's. But Britain's really taken it to an extreme, whereby anyone who tries to \"buy British\" is mocked as a lunatic jingoistic right-wing bigot. Rather than someone trying to support their local economy, say.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1496887176.0,
    "date_created": "2017-06-07",
    "time_created": "13:59:36",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diizkoq",
    "parent_id": "t1_diiyyxz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "*Sheepishly raises hand*.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1496778426.0,
    "date_created": "2017-06-06",
    "time_created": "07:47:06",
    "submission_id": "ukpolitics-6fk62s"
  },
  {
    "id": "diiyy2b",
    "parent_id": "t1_diiyopd",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> They are and will remain our friends.\n\nDon't you think it would be nicer if they were treated as such?",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1496777129.0,
    "date_created": "2017-06-06",
    "time_created": "07:25:29",
    "submission_id": "ukpolitics-6fk62s"
  }
]