[
  {
    "id": "dp8o5tb",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "Does this include people who are like 17 and have been caught taking nudes of themselves? Cause I know that's a charge currently...",
    "controversiality": 0,
    "ups": 16151,
    "downs": 0,
    "score": 16151,
    "created": 1509662566.0,
    "date_created": "2017-11-02",
    "time_created": "10:42:46",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8u4w3",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "If I murder 3 people, go to jail for 30 years.  When I come out it won't appear on my passport.  Nice",
    "controversiality": 0,
    "ups": 9109,
    "downs": 0,
    "score": 9109,
    "created": 1509668673.0,
    "date_created": "2017-11-02",
    "time_created": "12:24:33",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8n1jh",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "i was really confused as to why children were getting convicted as sex offenders until i read til the end of that second paragraph",
    "controversiality": 0,
    "ups": 1210,
    "downs": 0,
    "score": 1210,
    "created": 1509661327.0,
    "date_created": "2017-11-02",
    "time_created": "10:22:07",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8o0xa",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": ">“The bearer was convicted of a sex offense against a minor, and is a covered sex offender pursuant to (U.S. law).”\n\nThe only problem I have with this is that there a lot of registered sex offenders that are on there for being a few years older than their 16/17 year old counterpart. This language makes no room for distinction between a 20 year old having consensual sex with a 17 year old and a 20 year old raping a 5 year old.",
    "controversiality": 0,
    "ups": 3484,
    "downs": 0,
    "score": 3484,
    "created": 1509662417.0,
    "date_created": "2017-11-02",
    "time_created": "10:40:17",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8v0cj",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "The problem I have with this is that there is no system in place to give the person marked with the scarlet letter reprieve from it. It's amounts to a life sentence. \n\nFor instance, If someone as at a bar and, through an unfortunate series of events, ended up taking a 16 year old who lied about her age home, and then got in trouble for it, now for the rest of their life they cannot move freely?\n\nIf there is no way for this person to be freed from this life long punishment, then I think it is too severe. Sex offense is a huge umbrella now. It no longer means \"raped a women at knifepoint\" or \"took sexual pictures of an 8 year old\" or \"molested 10 year old niece\". Now it also encompasses situations like I described above. \n\nThis can't be put in place unless a system for appeal is in place. ",
    "controversiality": 0,
    "ups": 546,
    "downs": 0,
    "score": 546,
    "created": 1509669528.0,
    "date_created": "2017-11-02",
    "time_created": "12:38:48",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8oqfc",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "Why only sex offenders? \n\n\"This guy has 5 DUIs\"\n\n\"This guy has embezzled 3.4 Million.\"\n\n\"This guy tried, but couldn't rock, the hipster look.\"\n\nEdit: My point is, there are crimes that should be brought to the attention of any country you are traveling, and while I agree sex crimes (specially toward children) should be in the forefront, there are other crimes that countries should be made aware of. Serial DUIs should be one of them.",
    "controversiality": 0,
    "ups": 5963,
    "downs": 0,
    "score": 5963,
    "created": 1509663177.0,
    "date_created": "2017-11-02",
    "time_created": "10:52:57",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8v86t",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "As long as \"sex offenders\" or \"terrorists\" are the target, we have no problem eroding Constitutional protections.  This isn't a shitty law because it \"takes away rights from sex offenders\", it's a shitty law because it is unconstitutional, but because of the target the courts, Congress, and the public will let it slide.\n\n\nAmericans love bitching about their electronic privacy rights being taken away... but guess what?  Those privacy \"rights\" were tested in the courts a decade ago in sex offender cases, and it was determined there is virtually no electronic privacy.",
    "controversiality": 0,
    "ups": 576,
    "downs": 0,
    "score": 576,
    "created": 1509669737.0,
    "date_created": "2017-11-02",
    "time_created": "12:42:17",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9izu4",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "This will backfire spectacularly. It's medieval. Where in the world are people \"labeled\" publicly like this except in totalitarian societies? Look, I get it, child sex offenders are awful people. But we have punishments for that, and those punishments include fines and jail sentences. And what comes with that is a sex offender registration that makes it very, very difficult to get a decent job. \n\nSo, now we're basically going to brand people permanently for this particular crime? But we're not going to brand murderers or rapists? Or tax cheats? Or con artists who steal people's life savings, thus ruining their lives -- like Bernie Madoff? He gets his passport with no warning label, right? This is a really, really ridiculous idea. It's right out of the \"Scarlet Letter\". Why not brand sex offenders on the forehead so we all know who they are? We won't brand anyone else, though. It's also unAmerican to humiliate people permanently like this. Everyone deserves redemption. It's in the damn Bible, if you'd bother reading it. \n\nAnd you know very well that some of the people who are labeled this way will not have done anything much at all -- and a few of them will be mistakenly convicted of offenses they did not commit. Just like we imprison and even execute some people by mistake, we will mistakenly ruin some people's lives forever with this ridiculous law. What clown thought this up? He should be ashamed of himself. ",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1509694377.0,
    "date_created": "2017-11-02",
    "time_created": "19:32:57",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8nwkk",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "I've said it before, and I'll say it again: if we have a registry for sex offenders, I think we should also have a registry for burglars and murderers. As much as I'd like to know if a child molester is my neighbor, I'd too like to know if my neighbor is likely to bust into my house and/or kill me.\n\nEdit: inb4 someone suggests I'm on the registry. I am not, but I do know someone who is unfairly registered.",
    "controversiality": 0,
    "ups": 12307,
    "downs": 0,
    "score": 12307,
    "created": 1509662287.0,
    "date_created": "2017-11-02",
    "time_created": "10:38:07",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9506s",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "Lets take a second to think about the ramifications of something like this. Yes, a good amount of people who are registered sex offenders did something horrible, but this strikes me as a slippery slope into greater government power. I've already seen some people suggesting that we do the same with murders and homebreakers. If we do that, then where does it end?\nThen lets sew scarlet letters into the clothes of people convicted of prostitution, so that potentional sexual partners will know they may be in danger of getting an STD. \nAfter that lets label every persons religious and political affiliation on their passport, so that we can get a proper census.\n\nLoss of freedom doesnt come all at once, it comes little by little and often in the form of things that the general population supports. Labelling one scapegoat group helps normalize the idea of the government labelling everyone. \n\nEdit: this post was my first reddit gold, momma will be so proud.",
    "controversiality": 0,
    "ups": 143,
    "downs": 0,
    "score": 143,
    "created": 1509679239.0,
    "date_created": "2017-11-02",
    "time_created": "15:20:39",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8qxnr",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "This is not a good idea.  Not unless you change that list to people who are violent and likely repeat offenders.\n\nAn 18 year old who thinks he is in love with a 15 year old, only to have angry parents turn that into charges of rape and a brand of sex offender for life doesn't deserve to have that follow him to other countries.  Or a couple of boys who are 16 and 15, depending on where they live.\n\nThere was a huge push in this country for \"rape is rape\", and it was a bad push.  Rape, like everything, lives along a continuum and there is rape (legal definition) that happens when there are no parties harmed.  Yet they get the same brand as somebody who hangs a little boy from a tree, masturbating while the boy chokes, only to \"save\" the boy from dying so that he can do the same the next time the pervert feels the urge to jerk off.\n\nPeople who advocate for generic labels of sex offender hurt society.",
    "controversiality": 0,
    "ups": 886,
    "downs": 0,
    "score": 886,
    "created": 1509665449.0,
    "date_created": "2017-11-02",
    "time_created": "11:30:49",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8w6hf",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "Why is there sudden momentum behind this? It seems like this could be broadened to infringe on civil rights.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1509670658.0,
    "date_created": "2017-11-02",
    "time_created": "12:57:38",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8zy3b",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "The general consensus here is that sex offenders is a broad list that includes young people that had sex, had nudes of themselves, etc.\n\nWhy the fuck are those even crimes in the first place?!",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1509674293.0,
    "date_created": "2017-11-02",
    "time_created": "13:58:13",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9278p",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "Weird that people who have sex with a 16 year old and get convicted might be refused entry from countries who allow you to have sex with 13 year olds.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1509676506.0,
    "date_created": "2017-11-02",
    "time_created": "14:35:06",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8vj09",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "This is going down a Teflon coated mountain, drizzled with butter, sprinkled with graphite, riding on a superconducting toboggan. \n\n\n\nEdit since this is getting views:  a passport is a document assuring that the US will act within its interests in behalf of the traveler should the need arise.  That might not mean much in a developed country, but the more backward you go, the more important that assurance becomes.  How do you think you'd be treated traveling to Iran as it stands with a US passport.  Now how do you think you'll be treated if you have that stamp on your passport.  How can you be assured that the local embassy will act in your interest when that inflames international ire that the US is shielding and protecting the people internationally.  People may very well die as a direct result of this policy and it could be innocent embassy staff, not just the passport holder.  This is a public and international brand that we have second class citizens and they will not be afforded the same rights, despite any wording to that effect.  \n\nMake a policy blocking these people from getting passports in the first place.  Don't put the application of our justice to our citizens in the hands of foreign countries.",
    "controversiality": 0,
    "ups": 89,
    "downs": 0,
    "score": 89,
    "created": 1509670026.0,
    "date_created": "2017-11-02",
    "time_created": "12:47:06",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp941jm",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "Does this include kids that distribute child porn of themselves? Or the \"nude selfies\"?",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1509678313.0,
    "date_created": "2017-11-02",
    "time_created": "15:05:13",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8x4e3",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "Any strides the US makes into punishing chils sex offenders is a crime in its own right until they rewrite law so that innocent people are no longer convicted of being child sex offenders.\n\nA 17 year old who had consentual sex with a 16 year old can and has been convicted of this sex offense in the past, unable to attain jobs in later life.\n\nInexcusable. ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1509671568.0,
    "date_created": "2017-11-02",
    "time_created": "13:12:48",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9dl13",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "The definition of sex offender needs to be redefined before major action like this is taken. ",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1509687983.0,
    "date_created": "2017-11-02",
    "time_created": "17:46:23",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wmjy",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "How a about some patch they have to always wear visible on their cloth, or maybe better a tattoo to their forehead? \n\nYes, most of them probably committed some horrible crime (but there is a 100% chance some have been wrongfully accused and prosecuted, and some of them have been convicted for some of the very ridiculous laws, like an 19 year old having sex with a 17 year old). And this branding will take away any chance of redemption, and will probably do very little to make anyone more safe.",
    "controversiality": 0,
    "ups": 159,
    "downs": 0,
    "score": 159,
    "created": 1509671089.0,
    "date_created": "2017-11-02",
    "time_created": "13:04:49",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8oh4t",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "Hopefully they alert Thailand as I've heard that's a pretty popular spot for people like this. ",
    "controversiality": 0,
    "ups": 169,
    "downs": 0,
    "score": 169,
    "created": 1509662898.0,
    "date_created": "2017-11-02",
    "time_created": "10:48:18",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp95us6",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "I work with a guy who is a registered sex offender because he thought he was at a nude beach, but was like three blocks off. \n\nHe also has a felony for battery because he was in the middle of a fight at a baseball game; he had nothing to do with the fight. Poor guy.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1509680080.0,
    "date_created": "2017-11-02",
    "time_created": "15:34:40",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9hin7",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "This sets a precedent that allows the US government to effectively block groups of people from leaving the country. It'll start with child molesters but it won't end there. \n\nThe government has also moved this year to block renewing the passports of people who owe money to the IRS. \n\nImagine the US facing a shortage of doctors, engineers, teachers, etc. Congress passes a law requiring those with the right credentials to work 60 hours a week for minimum wage. Failure to comply makes you a registered felon. A message is added to your passports reading \"The bearer was convicted of a felony\" so that you can't leave the country. Without a way to know the specific crime the person committed, other countries won't take the chance they're letting in a violent felon. \n\nFreedom of movement is a human right. It's about damn time we add it to the constitution. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1509692629.0,
    "date_created": "2017-11-02",
    "time_created": "19:03:49",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8rdna",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "People seem to be missing the point. Child sex tourism is unfortunately a thing, which makes it worthwhile to have a passport restriction. Murder tourism and DUI tourism aren't as popular.",
    "controversiality": 0,
    "ups": 479,
    "downs": 0,
    "score": 479,
    "created": 1509665904.0,
    "date_created": "2017-11-02",
    "time_created": "11:38:24",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8uvyl",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "Nice. Not dystopian at all.",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1509669410.0,
    "date_created": "2017-11-02",
    "time_created": "12:36:50",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wn2i",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "I feel bad for US citizens that are going to be questionned for taking a piss in a park at 3AM...",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1509671103.0,
    "date_created": "2017-11-02",
    "time_created": "13:05:03",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp90wuq",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "This just opened the flood gates for criminal history to be listed on US passports.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1509675251.0,
    "date_created": "2017-11-02",
    "time_created": "14:14:11",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp94zzu",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "My friend stopped for a piss on the side of the highway during a 3 hour drive. Cop stops him and charges him as a Child Sex offender since apparently behind more trees then he could see through there was a school.\n\nMy friend isn’t bright but as long as child sex offender laws are vague enough to punish people like this, or even 17 year olds sending each other nudes, I don’t think these people need to be punished any more excessively then they already have.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1509679233.0,
    "date_created": "2017-11-02",
    "time_created": "15:20:33",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8weay",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "The slippery slippery slope.   \n       \nStep 1: Start with something most everyone agrees with. \n     \nStep 2: Add a parameter that appeals to everyone in the moment of a tragedy. \n     \nStep 3: Add a parameter that is: if we’re going to do Step 1 and 2, we clearly should add XYZ. Many will agree. Those who don’t aren’t quite passionate enough to prevent it. \n     \nStep 4: When the political opportunity arises, and one political party has a majority, Add a parameter that appeals to the party the in power.   \n  \nStep 5: Demonize those who don’t agree with the parameter you want to add now. Show how they are supporting said evil and are in fact, monsters themselves by not supporting the new parameter you want to add. \n  \nStep 6: Add a parameter that decreases the “humanity” of a section of the population that doesn’t support the power base of the party in power.  Make it clear that those people are “different”, not like “US”, and are in fact holding “US” back. \n  \nStep 7.  Add a parameter for dissidents.   This needs to be something to add people to who disagree with the voice in power, or who question it loudly. \n  \nStep 8.  Impose the Will of those in power.  \n  \n\nDespots and Dictators don’t get to be Despots and Dictators overnight.    Caution is prudent. ",
    "controversiality": 0,
    "ups": 116,
    "downs": 0,
    "score": 116,
    "created": 1509670866.0,
    "date_created": "2017-11-02",
    "time_created": "13:01:06",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8uroy",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "What about the 18 year old with a 16 year old girlfriend? \n\nWhat about the 16 year old who takes a naked selfie and sends it to their 15 year old boyfriend?\n\nAll of these people are child sex offenders, and on a list for life. \n\nFix that shit before you start heaping more bullshit on people's heads. ",
    "controversiality": 0,
    "ups": 122,
    "downs": 0,
    "score": 122,
    "created": 1509669292.0,
    "date_created": "2017-11-02",
    "time_created": "12:34:52",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp95a8g",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "From my understanding, sex offenders have one of the lowest reoffending rates after their first conviction. Is this really necessary?",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1509679514.0,
    "date_created": "2017-11-02",
    "time_created": "15:25:14",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp96cc8",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "If one jerks off looking at their reflection the night before their 18th birthday and finishes at midnight, does that count?",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1509680558.0,
    "date_created": "2017-11-02",
    "time_created": "15:42:38",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8vyqh",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "Horrible policy.\n\nNot defending \"real\" sex offenders, but people shouldn't be allowed to be put \"on a list\" for any significant period of time after they have served their sentence, unless that sentence is horrible enough that it warrants it (murder or child rape).\n\nThis is not justice.",
    "controversiality": 0,
    "ups": 98,
    "downs": 0,
    "score": 98,
    "created": 1509670451.0,
    "date_created": "2017-11-02",
    "time_created": "12:54:11",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp95k33",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "Bullshit. There are a lot of people on that registry that don't deserve it. This is a shitty, fascist ass idea",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1509679782.0,
    "date_created": "2017-11-02",
    "time_created": "15:29:42",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp95hmk",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "As a sex offender, tier 1, and 14 years to go till im off. This just makes me wish more and more i got the death penalty instead of probation. ",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1509679715.0,
    "date_created": "2017-11-02",
    "time_created": "15:28:35",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8vevd",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "I dont see the point of that outside of a dirty look off the passport control.\nA very slippery slope...especially when your passport becomes s database and mistakes are made.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1509669916.0,
    "date_created": "2017-11-02",
    "time_created": "12:45:16",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8z4gk",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "In my honest opinion, this would work if it included REAL pedophiles, not two under aged people sexting and sending nudes.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1509673491.0,
    "date_created": "2017-11-02",
    "time_created": "13:44:51",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp93ry7",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "Two friends of mine (under 18 at the time) were charged as sex offenders for getting caught having sex in a City Park. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1509678053.0,
    "date_created": "2017-11-02",
    "time_created": "15:00:53",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9iy23",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "Will humans ever learn that Scarlet Letters are a bad idea? ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1509694316.0,
    "date_created": "2017-11-02",
    "time_created": "19:31:56",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8x2nm",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "So, in the USA you can incarcerate an 18-year-old for having consensual sex with a 17-y-o? That is so weird. \nFeels like Star Trek, when they encounter a civilisation that has this deranged morality standards...",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1509671521.0,
    "date_created": "2017-11-02",
    "time_created": "13:12:01",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8mwis",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "What sex offender has a passport ? Oh you mean those who have paid for their crimes? When does a sex offender get to live a normal life? Or will they always be punished? Welcome to Merika where we treat once criminals as always criminals and we make sure they can never improve their situation. ",
    "controversiality": 0,
    "ups": 588,
    "downs": 0,
    "score": 588,
    "created": 1509661172.0,
    "date_created": "2017-11-02",
    "time_created": "10:19:32",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8vt51",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "This is so fucked. \n\nThe penal system is supposed to exist to rehabilitate people. You do a crime, you serve the punishment the justice system deems appropriate, and you try to live a normal life. \n\nThis turns something into a life sentence, regardless. Of course, sex crimes are a despicable thing, and people should receive the proper punishment, but rehabilitation should be the focus and it absolutely isn't. It's so sad to see. ",
    "controversiality": 0,
    "ups": 54,
    "downs": 0,
    "score": 54,
    "created": 1509670298.0,
    "date_created": "2017-11-02",
    "time_created": "12:51:38",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8r623",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "Rip Caucasian Thailand tourists",
    "controversiality": 0,
    "ups": 103,
    "downs": 0,
    "score": 103,
    "created": 1509665686.0,
    "date_created": "2017-11-02",
    "time_created": "11:34:46",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wjqr",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "What's the point of prison if your going to ruin their life afterwords?",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1509671015.0,
    "date_created": "2017-11-02",
    "time_created": "13:03:35",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ukyn",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "Ye that's great, people who rape kids and people who have pictures of teens on their computer are equally dangerous and should be treated the same!",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1509669107.0,
    "date_created": "2017-11-02",
    "time_created": "12:31:47",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wanh",
    "parent_id": "t3_7abp34",
    "subreddit_name_prefixed": "r/news",
    "body": "Does this seem like a measure to make the public feel good about this situation,  but is unlikely to do any real, tangible good? \n\nBecause that's the way it feels to me. This won't stop anyone from molesting kids in other countries. Hell, our registry here doesn't stop anyone from molesting kids, if they have their mind set on it.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1509670767.0,
    "date_created": "2017-11-02",
    "time_created": "12:59:27",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8pkix",
    "parent_id": "t1_dp8o5tb",
    "subreddit_name_prefixed": "r/news",
    "body": "I saw a case in NH where a young man had nudes of himself and was charged. He was a nerdy mensa type, but very polite and kind. He wanted to go to med school to be a cancer researcher. The police outed him as being gay too. Because he used the pics to try to pick up a male college freshman. The young man committed suicide.\n\n\n\nThese laws are extremely broad and over inclusive.    \n\n\n**Edit**: \n\nThis was from a presentation given by [Detective James F. McLaughlin](http://www.ottawacountysheriff.org/documents/mclaughlin.pdf) of the Keene Police Dept. It was part of a PowerPoint presentation on cybercrimes that he gave at my law school. He talked about cases that tested the limits of the law and used this \"John Doe\" as an example. As he was 16 years old, and not charged as an adult, the defendant's name was protected pre-trial ([More info here](https://communications-media.lawyers.com/privacy-law/identity-protection-in-court-cases.html)).  My guess is the family's embarrassment or shame precluded voluntarily releasing the identity posthumously. I don't know why this stuck with me over the years. Maybe it was seeing his face and thinking, \"that easily could have been me.\" \n\n\n**Lucy Carillo** was the prosecutor who worked with this case. [She resigned later for other reasons](http://www.unionleader.com/apps/pbcs.dll/article?AID=/20120617/NEWS06/706179924/-1/news). As a thought experiment, I said \"if a video is just a collection of fast moving images, why don't you charge 2000+ counts of images for possession of one video?\"  I was actually joking with her. And she straight-faced was into the idea and said she would explore it. ",
    "controversiality": 0,
    "ups": 15024,
    "downs": 0,
    "score": 15024,
    "created": 1509664060.0,
    "date_created": "2017-11-02",
    "time_created": "11:07:40",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wfni",
    "parent_id": "t1_dp8o5tb",
    "subreddit_name_prefixed": "r/news",
    "body": "I had an Army recruiter tell me about a guy he worked with that was registered over bullshit. He was a HS senior dating a sophomore. He turned 18, she got knocked up. Her parents hated they guy and called the cops on him and he ended up getting registered over it. Fast fwd a few years. They are both married with the kid, and he can't do shit for work, including join the military, because of the registration. ",
    "controversiality": 0,
    "ups": 1196,
    "downs": 0,
    "score": 1196,
    "created": 1509670903.0,
    "date_created": "2017-11-02",
    "time_created": "13:01:43",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8zgpu",
    "parent_id": "t1_dp8o5tb",
    "subreddit_name_prefixed": "r/news",
    "body": "i had to go to court for having pictures on my phone of my own nipples when i was 17.\n\ni was being investigated for child pornography....for my own body ",
    "controversiality": 0,
    "ups": 70,
    "downs": 0,
    "score": 70,
    "created": 1509673819.0,
    "date_created": "2017-11-02",
    "time_created": "13:50:19",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wleo",
    "parent_id": "t1_dp8o5tb",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 308,
    "downs": 0,
    "score": 308,
    "created": 1509671058.0,
    "date_created": "2017-11-02",
    "time_created": "13:04:18",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ouhi",
    "parent_id": "t1_dp8o5tb",
    "subreddit_name_prefixed": "r/news",
    "body": "If their registry entry includes the words \"sexual offense\" and \"minor\", then yes. This policy is too broad and overreaching.",
    "controversiality": 0,
    "ups": 721,
    "downs": 0,
    "score": 721,
    "created": 1509663296.0,
    "date_created": "2017-11-02",
    "time_created": "10:54:56",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ufzl",
    "parent_id": "t1_dp8o5tb",
    "subreddit_name_prefixed": "r/news",
    "body": "Yup. IML covers child pornography offenses, even if the \"victim\" and the \"perpetrator\" are one in the same. ",
    "controversiality": 0,
    "ups": 155,
    "downs": 0,
    "score": 155,
    "created": 1509668972.0,
    "date_created": "2017-11-02",
    "time_created": "12:29:32",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8pfag",
    "parent_id": "t1_dp8o5tb",
    "subreddit_name_prefixed": "r/news",
    "body": "Yes. It would include underage kids who have sex with each other (in some areas that can be an offense), young teenagers who send pictures of themselves to other young teenagers, and the slightly more understandable, but still shouldn't be on a list, say, 18 year old who has sex with his 16 year old girlfriend in the wrong state. Or even 16 year old and 15 year old (not all states have Romeo and Juliet laws)",
    "controversiality": 0,
    "ups": 283,
    "downs": 0,
    "score": 283,
    "created": 1509663909.0,
    "date_created": "2017-11-02",
    "time_created": "11:05:09",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xqsr",
    "parent_id": "t1_dp8o5tb",
    "subreddit_name_prefixed": "r/news",
    "body": "My friend had to register for a few years for mooning the Jr high school bus when he was in high school.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1509672170.0,
    "date_created": "2017-11-02",
    "time_created": "13:22:50",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8vxrr",
    "parent_id": "t1_dp8o5tb",
    "subreddit_name_prefixed": "r/news",
    "body": "Or people who moon other people. We did that all the time as kids in the 80s. Now it’ll get you on a sex offender registry. ",
    "controversiality": 0,
    "ups": 102,
    "downs": 0,
    "score": 102,
    "created": 1509670425.0,
    "date_created": "2017-11-02",
    "time_created": "12:53:45",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8vofz",
    "parent_id": "t1_dp8o5tb",
    "subreddit_name_prefixed": "r/news",
    "body": "People that pee in public also get put on those lists sometimes... ",
    "controversiality": 0,
    "ups": 45,
    "downs": 0,
    "score": 45,
    "created": 1509670172.0,
    "date_created": "2017-11-02",
    "time_created": "12:49:32",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wtcy",
    "parent_id": "t1_dp8o5tb",
    "subreddit_name_prefixed": "r/news",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1509671271.0,
    "date_created": "2017-11-02",
    "time_created": "13:07:51",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8y3xl",
    "parent_id": "t1_dp8o5tb",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1509672515.0,
    "date_created": "2017-11-02",
    "time_created": "13:28:35",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ypqj",
    "parent_id": "t1_dp8o5tb",
    "subreddit_name_prefixed": "r/news",
    "body": "The absurdity of this plan just highlights the absurdity of the sex offender registry itself. And even the absurdity of many of the laws around sex offenses.\n\nWhy do we need a public list of people's past crimes? Is it because we think they have not been rehabilitated? *Then let's make sure we rehabilitate them before giving them their freedom back.* Is it because we don't believe it is possible for them to be rehabilitated? *Then we shouldn't release them yet.* Is it because their prison times and fines were not sufficient punishment? *Then raise those times and fines.*\n\nAt best, the sex offender registry is a band-aid on a broken arm of a prison system. It is not helping and only serving as a distraction from real improvements.\n\nThere's a reason there are constantly problems around these laws. As other commenters have pointed out, taking a picture of yourself can classify you as a child sex offender. It's stupid. Despite what we have been taught, maybe these types of laws are a bad idea. To me, this is border line thought-crime territory. How can taking a picture, possessing a picture, or sharing a picture be a crime--regardless of what is in the picture? Obviously actual abuse should be a crime--and it is. But making pictures illegal is just a lazy way to avoid having to investigate real crimes. You can have pictures and videos of murders, terrorism, rape, animal abuse, etc. all day long. Those are perfectly legal. The inconsistency is very telling.\n\nIf you want to stop child abuse, then put your resources into fighting child abuse. Not tracking down people who downloaded a picture.\n",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1509673094.0,
    "date_created": "2017-11-02",
    "time_created": "13:38:14",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xh68",
    "parent_id": "t1_dp8o5tb",
    "subreddit_name_prefixed": "r/news",
    "body": "Yep! Sending it would be distributing child pornography regardless of who it's to. Even more ridiculously you could be 17 with pictures of yourself and be tried as an adult for possession of child pornography! Doesn't even have to leave your phone! ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1509671917.0,
    "date_created": "2017-11-02",
    "time_created": "13:18:37",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8zsle",
    "parent_id": "t1_dp8o5tb",
    "subreddit_name_prefixed": "r/news",
    "body": "That's what I was wondering too. \n\nIt is absolutely ridiculous how much sex offenders are targeted. Yes, rape and child abuse are serious crimes. But so is murder. However, if you murder a person, you don't have to be on a registry and you can live wherever you want. If you take a nude selfie at the age of 17, you might not be able to find a job, housing, etc. \n\nAnd what's more, if you can't find a place to live because of the laws preventing sexual offenders from living within proximity to a million things, you get sent to jail for failing to register a residence. \n\nSo adding it to the passport next is idiotic, unless we plan on putting in the whole host of crimes people commit. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1509674142.0,
    "date_created": "2017-11-02",
    "time_created": "13:55:42",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8waf1",
    "parent_id": "t1_dp8u4w3",
    "subreddit_name_prefixed": "r/news",
    "body": "There's an extremely limited number of countries that will let you in at that point anyway. ",
    "controversiality": 0,
    "ups": 2984,
    "downs": 0,
    "score": 2984,
    "created": 1509670761.0,
    "date_created": "2017-11-02",
    "time_created": "12:59:21",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8usxx",
    "parent_id": "t1_dp8u4w3",
    "subreddit_name_prefixed": "r/news",
    "body": "Right? Sounds fair to me.\n\nI've never committed a crime in my life, but fuck this ignorant and unjust lack of compassion.\n\nThe categorization of who a \"Sex Offender\" is is so broad that this new law is totally unfair to some people.\n\nIf when I was 19 and my 17 year old gf decided to ruin my life, she could fairly easily.",
    "controversiality": 0,
    "ups": 1246,
    "downs": 0,
    "score": 1246,
    "created": 1509669325.0,
    "date_created": "2017-11-02",
    "time_created": "12:35:25",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8x0ry",
    "parent_id": "t1_dp8u4w3",
    "subreddit_name_prefixed": "r/news",
    "body": "I feel like if you've done your time, you don't need to be on any kind of registry.  Same thing with sex offenders.  Im sure this isn't a popular opinion, but I don't think people should be punished for their whole lives for a crime.\n\nI can understand people trying to protect their children too, just not sure what is a good middle ground.",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1509671469.0,
    "date_created": "2017-11-02",
    "time_created": "13:11:09",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8qeu6",
    "parent_id": "t1_dp8n1jh",
    "subreddit_name_prefixed": "r/news",
    "body": "About [25% of sex offenders register](http://www.weeklystandard.com/senseless-policy/article/1020694?page=2) as juveniles.\n\nEdit: I should point out juveniles like adults can do a lot of fucked up shit.",
    "controversiality": 0,
    "ups": 1300,
    "downs": 0,
    "score": 1300,
    "created": 1509664923.0,
    "date_created": "2017-11-02",
    "time_created": "11:22:03",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp92eav",
    "parent_id": "t1_dp8n1jh",
    "subreddit_name_prefixed": "r/news",
    "body": "I worked in a group home with children aged 12-17 who were registered as sex offenders, some for life, and they were often suicidal because their lives were \"already over.\"  That's some heartbreaking shit.  All of them, ALL of them, had been abused themselves and had no way to process it.  Here's some of the offenses they were registered for:\n\n1. Streaking in his middle school (age 12) - indecent exposure in front of other minors.\n2. Masturbation in a bathroom (age 14) - caught by a minor so performing a lewd act in front of a minor.\n3. Having sex with his girlfriend (both 13) - child molestation.  He was required to register, she wasn't.\n\nAll three of these kids were already foster kids.  They were kicked out of their homes and no other foster home would take them because they were \"sex offenders\" so they got shuttled to this group home.  I work in suicide prevention and my mentor told me if I wanted to work with teens who were suicidal, this would be a good group to get that experience with, and oh man did I get it.  And these boys were by far my best clients (the group home had other cottages for boys and girls with other behavioral issues and I got way more problems out of them than I did the with the juvenile sex offender cottage).  I'm a woman and no other woman wanted to work with them out of fear, but they never did anything wrong by me.\n\nThese kids will have a passport stamp stating they committed a sex offense against a minor.  This is not justice.\n\n(edit: a word)",
    "controversiality": 0,
    "ups": 412,
    "downs": 0,
    "score": 412,
    "created": 1509676700.0,
    "date_created": "2017-11-02",
    "time_created": "14:38:20",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8r1k0",
    "parent_id": "t1_dp8o0xa",
    "subreddit_name_prefixed": "r/news",
    "body": "My brother-in-law is a sex offender for having sex with a 14-year-old when he was 24. She looked older, and showed him her 19-year-old sister's ID, so he had no idea he was committing a serious felony. This was *the second time* the girl had used her sister's ID to have sex with an older guy and then called the cops on him. My BIL even had their original chat saved where she sent him her ID and told him she was 19.\n\nBut the law doesn't allow \"she lied to me about her age\" as a defense, so he's been on the registry for 5 years. I believe he's able to get removed after 10 because of the extenuating circumstances. Meanwhile, the TV news shows up at his house periodically to do a story about local sexual predators.",
    "controversiality": 0,
    "ups": 2253,
    "downs": 0,
    "score": 2253,
    "created": 1509665560.0,
    "date_created": "2017-11-02",
    "time_created": "11:32:40",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ommb",
    "parent_id": "t1_dp8o0xa",
    "subreddit_name_prefixed": "r/news",
    "body": "What are the stats on this? Of X offenders what percentage we’re just Romeo and Juliet type offenses? ",
    "controversiality": 0,
    "ups": 438,
    "downs": 0,
    "score": 438,
    "created": 1509663061.0,
    "date_created": "2017-11-02",
    "time_created": "10:51:01",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8vxh2",
    "parent_id": "t1_dp8o0xa",
    "subreddit_name_prefixed": "r/news",
    "body": "Came here to say this.  I only know of one person on this list.  And he dated his gf in hs.  She was freshmen he was senior.  16 and 14 or something.  So ffw couple years later, her parents are crazy and press charges and now he's a sex offender.  It's such bullshit system.  There needs to be a system, but you shouldn't be labeled a SEXUAL PREDITOR if your victim was 4 or less years younger.  I dunno what the cutoff should be, but that seems reasonable.  ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1509670417.0,
    "date_created": "2017-11-02",
    "time_created": "12:53:37",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8vuqt",
    "parent_id": "t1_dp8v0cj",
    "subreddit_name_prefixed": "r/news",
    "body": "It's getting worse with how common dating apps are, a guy I know from high school ended up on the list because of someone lying about their age on tinder, I doubt that story is very uncommon.  \n\nI wouldn't have a problem with this or the list if it was only violent offenders that we thought might hurt someone else (though they really shouldn't be out of jail in the first place if we're that worried about it), but its political suicide for anyone to really try to reform sex offender laws in any meaningful way so not much will be done.",
    "controversiality": 0,
    "ups": 161,
    "downs": 0,
    "score": 161,
    "created": 1509670341.0,
    "date_created": "2017-11-02",
    "time_created": "12:52:21",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xodt",
    "parent_id": "t1_dp8v0cj",
    "subreddit_name_prefixed": "r/news",
    "body": "You don’t even have to serve time and to be on the registry.  I’m fairly certain you can be convicted of a felony that doesn’t require a sentence and be immediately expunged but still be on a registry and I think most states have registries that are 20+ to life. \n\nSeems fair. ",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1509672107.0,
    "date_created": "2017-11-02",
    "time_created": "13:21:47",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8qkdc",
    "parent_id": "t1_dp8oqfc",
    "subreddit_name_prefixed": "r/news",
    "body": "Just have someone follow them around with a bell repeating \"Shame.\"",
    "controversiality": 0,
    "ups": 4346,
    "downs": 0,
    "score": 4346,
    "created": 1509665079.0,
    "date_created": "2017-11-02",
    "time_created": "11:24:39",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8reph",
    "parent_id": "t1_dp8oqfc",
    "subreddit_name_prefixed": "r/news",
    "body": ">This guy has 5 DUIs\n\nCanada actually [does not allow people to enter if they have a DUI](https://help.cbp.gov/app/answers/detail/a_id/402/~/entering-the-u.s.-and-canada-with-dui-offenses).\n\nBut let’s be real, it’s not sex offenders its child sex offenders.  Meaning that they have sexually abused children and are attempting to travel.  Child sex tourism is a thing and is definitely a better reason to deny someone entry than DUI or embezzlement.\n\nEdit: as some commenters have pointed out, this policy is not always enforced.  Perhaps it's a discretionary policy or is not widely adhered to.",
    "controversiality": 0,
    "ups": 526,
    "downs": 0,
    "score": 526,
    "created": 1509665933.0,
    "date_created": "2017-11-02",
    "time_created": "11:38:53",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8rwar",
    "parent_id": "t1_dp8oqfc",
    "subreddit_name_prefixed": "r/news",
    "body": "pedophilia tourism is a very real thing. the others not so much.",
    "controversiality": 0,
    "ups": 346,
    "downs": 0,
    "score": 346,
    "created": 1509666424.0,
    "date_created": "2017-11-02",
    "time_created": "11:47:04",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8s8yp",
    "parent_id": "t1_dp8oqfc",
    "subreddit_name_prefixed": "r/news",
    "body": "The best rationale I can think of is that people who want to abuse children will go overseas to do so.\n\nThey don't usually go overseas to embezzle money, rob a bank, or download a car, but they'll plan a trip to be away from prying eyes, Amber alerts, etc.",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1509666775.0,
    "date_created": "2017-11-02",
    "time_created": "11:52:55",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8roy2",
    "parent_id": "t1_dp8oqfc",
    "subreddit_name_prefixed": "r/news",
    "body": "I can see why this might be seen as somewhat extreme but it could help in the fight against child sex trafficking and prostitution.",
    "controversiality": 0,
    "ups": 45,
    "downs": 0,
    "score": 45,
    "created": 1509666220.0,
    "date_created": "2017-11-02",
    "time_created": "11:43:40",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8rdkw",
    "parent_id": "t1_dp8oqfc",
    "subreddit_name_prefixed": "r/news",
    "body": "The second guy has three passports and works for the president anyway ",
    "controversiality": 0,
    "ups": 62,
    "downs": 0,
    "score": 62,
    "created": 1509665902.0,
    "date_created": "2017-11-02",
    "time_created": "11:38:22",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8u91f",
    "parent_id": "t1_dp8oqfc",
    "subreddit_name_prefixed": "r/news",
    "body": "There is an entire (disgusting) industry around child sex tourism that doesn't really exist around other crimes. That is, people travel to other (poor) countries in order to fuck children in a way that they don't travel just to DUI or embezzle money.\n\nThe only thing that comes close in terms of \"people traveling for the sole purposes of committing a crime they can't get away with at home\" is drug tourism. And in that case there's not really a moral element. \n\nThis seems to me like a quite rational basis for distinction.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1509668785.0,
    "date_created": "2017-11-02",
    "time_created": "12:26:25",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8tjhl",
    "parent_id": "t1_dp8oqfc",
    "subreddit_name_prefixed": "r/news",
    "body": "While I don't think this is a good idea, there are some valid reasons why they're doing it. Underage sex tourism is unfortunately a huge problem as is trafficking. Again, I don't think it's fair at all, but there is a slightly valid reason to target them.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1509668087.0,
    "date_created": "2017-11-02",
    "time_created": "12:14:47",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8zt93",
    "parent_id": "t1_dp8v86t",
    "subreddit_name_prefixed": "r/news",
    "body": "i was genuinely horrified when i found out there are some states that put ankle bracelets on all of the registered SO's to track them. and that in some states/counties, they make them live in specific communities. i mean, what in the actual fuck.",
    "controversiality": 0,
    "ups": 150,
    "downs": 0,
    "score": 150,
    "created": 1509674160.0,
    "date_created": "2017-11-02",
    "time_created": "13:56:00",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8pjz1",
    "parent_id": "t1_dp8nwkk",
    "subreddit_name_prefixed": "r/news",
    "body": "They say sex offenders, and \"we\" think, \"Oh, child rapists, yeah fuck 'em\"; but a lot of \"sex offenders\" are people caught public pissing or a 16 year old kid shares nudes with their 17 year old kid bf/gf. \n\nIt's a shit show, but who wants to defend \"sex offenders\"? \n\nEdit: Yes, my grammar sucks, no I am not going to fix it. Gotta fight the man! \n\nAlso, public pissing is \"on the books\" as what can land you on a sex offender list, but it has not actually occurred as far as I can tell. BUT a prosecutor can threaten it to get you to plea for a lesser charge. ",
    "controversiality": 0,
    "ups": 7950,
    "downs": 0,
    "score": 7950,
    "created": 1509664045.0,
    "date_created": "2017-11-02",
    "time_created": "11:07:25",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ojya",
    "parent_id": "t1_dp8nwkk",
    "subreddit_name_prefixed": "r/news",
    "body": "I think that this might be because child sex tourism is more of a thing than burglary or murder tourism. I might be wrong though.",
    "controversiality": 0,
    "ups": 713,
    "downs": 0,
    "score": 713,
    "created": 1509662982.0,
    "date_created": "2017-11-02",
    "time_created": "10:49:42",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8rnyn",
    "parent_id": "t1_dp8nwkk",
    "subreddit_name_prefixed": "r/news",
    "body": "> I'd too like to know if my neighbor is likely to bust into my house and/or kill me.\n\nNothing better to re-integrate someone into society than to brand him publicly I guess.",
    "controversiality": 0,
    "ups": 415,
    "downs": 0,
    "score": 415,
    "created": 1509666191.0,
    "date_created": "2017-11-02",
    "time_created": "11:43:11",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8s71q",
    "parent_id": "t1_dp8nwkk",
    "subreddit_name_prefixed": "r/news",
    "body": "To be honest I view these public registries to go beyond reasonable punishments for many cases.  While they can be handy tool but I've seen first hand how they are abused to attack others.  No, I'm not on the list but I've seen people online get DOXed because they are on those lists.  It also can serve as a major roadblock for reintegration into society which is a major problem in this country.",
    "controversiality": 0,
    "ups": 160,
    "downs": 0,
    "score": 160,
    "created": 1509666722.0,
    "date_created": "2017-11-02",
    "time_created": "11:52:02",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8qecg",
    "parent_id": "t1_dp8nwkk",
    "subreddit_name_prefixed": "r/news",
    "body": "Cop here: Murderers do have to register (at least in my state) and this info is public knowledge.",
    "controversiality": 0,
    "ups": 163,
    "downs": 0,
    "score": 163,
    "created": 1509664910.0,
    "date_created": "2017-11-02",
    "time_created": "11:21:50",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8s4yz",
    "parent_id": "t1_dp8nwkk",
    "subreddit_name_prefixed": "r/news",
    "body": "my roommate is literally on the list because she pissed in the boys bathroom back in highschool  \n  \nfuckin early 2000s, never again",
    "controversiality": 0,
    "ups": 133,
    "downs": 0,
    "score": 133,
    "created": 1509666664.0,
    "date_created": "2017-11-02",
    "time_created": "11:51:04",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8s1dg",
    "parent_id": "t1_dp8nwkk",
    "subreddit_name_prefixed": "r/news",
    "body": "Nah, then we'd just realize that nowhere is really safe to live. \n\nPlus, I've broken into homes and stolen cars and even been in gang fights.  Now I'm an engineer, and haven't commited a crime (that I'm aware of) in like 20 years.  I feel like such a list would have ruined that potential for me.  Like it would have pigeon holed me into remaining in the shit.  Resulting in more crime, and more burden to society... ",
    "controversiality": 0,
    "ups": 108,
    "downs": 0,
    "score": 108,
    "created": 1509666565.0,
    "date_created": "2017-11-02",
    "time_created": "11:49:25",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8rxwm",
    "parent_id": "t1_dp8nwkk",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm against all registries. Serve your time and be done.",
    "controversiality": 0,
    "ups": 81,
    "downs": 0,
    "score": 81,
    "created": 1509666469.0,
    "date_created": "2017-11-02",
    "time_created": "11:47:49",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8pkls",
    "parent_id": "t1_dp8nwkk",
    "subreddit_name_prefixed": "r/news",
    "body": ">The changes come in response to last year’s “International Megan’s Law,” which aims to curb child exploitation and child sex tourism, but also has been criticized by civil libertarians for being overly broad and targeting only one category of convicted felon.\n\nMurder and burglary doesn't really have a tourist market. Sadly, there is a sex trafficking market, so tracking child sex offenders makes more sense than tracking murderers/burglars.\n\n",
    "controversiality": 0,
    "ups": 65,
    "downs": 0,
    "score": 65,
    "created": 1509664062.0,
    "date_created": "2017-11-02",
    "time_created": "11:07:42",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8o4wl",
    "parent_id": "t1_dp8nwkk",
    "subreddit_name_prefixed": "r/news",
    "body": "I want a registry of people who like pineapple on pizza. ",
    "controversiality": 0,
    "ups": 260,
    "downs": 0,
    "score": 260,
    "created": 1509662538.0,
    "date_created": "2017-11-02",
    "time_created": "10:42:18",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8rod2",
    "parent_id": "t1_dp8nwkk",
    "subreddit_name_prefixed": "r/news",
    "body": "I don't think robbery should be a life sentence. You put them on a list and it makes the almost impossible task of getting a job as an ex con much more difficult. Since they can't work, they'll just turn back to what they know, crime. We need to do more to erase criminal histories and allow these people to reintegrate into society, not go in the exact opposite direction like you suggest. ",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1509666203.0,
    "date_created": "2017-11-02",
    "time_created": "11:43:23",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8p5bd",
    "parent_id": "t1_dp8nwkk",
    "subreddit_name_prefixed": "r/news",
    "body": "I get the feeling this is more about revenge than actually making anybody safer.",
    "controversiality": 0,
    "ups": 145,
    "downs": 0,
    "score": 145,
    "created": 1509663609.0,
    "date_created": "2017-11-02",
    "time_created": "11:00:09",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8rvvk",
    "parent_id": "t1_dp8qxnr",
    "subreddit_name_prefixed": "r/news",
    "body": "that jerking off / hanging boy scenario was kind of specific.",
    "controversiality": 0,
    "ups": 469,
    "downs": 0,
    "score": 469,
    "created": 1509666413.0,
    "date_created": "2017-11-02",
    "time_created": "11:46:53",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8vncm",
    "parent_id": "t1_dp8vj09",
    "subreddit_name_prefixed": "r/news",
    "body": "awesome metaphor, dude",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1509670142.0,
    "date_created": "2017-11-02",
    "time_created": "12:49:02",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp92jg9",
    "parent_id": "t1_dp8wmjy",
    "subreddit_name_prefixed": "r/news",
    "body": "Nah, man, let's make them wear a symbol and tattoo ID numbers on their arms. ",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1509676840.0,
    "date_created": "2017-11-02",
    "time_created": "14:40:40",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8q32g",
    "parent_id": "t1_dp8oh4t",
    "subreddit_name_prefixed": "r/news",
    "body": "hopefully this problem of exploitation of children in third world countries or ones without background checks has been a scandal for too long. Think it wasn't long ago someone was caught abusing kids as a volunteer in orphanages ",
    "controversiality": 0,
    "ups": 56,
    "downs": 0,
    "score": 56,
    "created": 1509664590.0,
    "date_created": "2017-11-02",
    "time_created": "11:16:30",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8s1h3",
    "parent_id": "t1_dp8rdna",
    "subreddit_name_prefixed": "r/news",
    "body": "I think this is what's being lost here. Lots of pedophiles specifically go to certain other countries specifically to have sex with children. They might even come up with some batshit excuse to go along with it-\n\n\"Oh, it's *normal* there...\"\n\n\"The children there are more *mature*...\"\n\n\"It's totes legal there, so it isn't wrong or emotionally damaging in any way!\"\n\nNo, none of these excuses work and anyone who think they do needs to rethink their life.",
    "controversiality": 0,
    "ups": 229,
    "downs": 0,
    "score": 229,
    "created": 1509666568.0,
    "date_created": "2017-11-02",
    "time_created": "11:49:28",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8zcim",
    "parent_id": "t1_dp8rdna",
    "subreddit_name_prefixed": "r/news",
    "body": "This isn't doing anything about that. It's a feel good measure. All this data is already shared internationally when traveling. How do you think Canada knows when you have DUI's? How do you think anyone ever denies a visa?\n\nThis is a Scarlet letter for no other reason than gaining votes and that's  what's fucked up. What's next? \"I shoplifted\", \"I am a drug user\"?",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1509673706.0,
    "date_created": "2017-11-02",
    "time_created": "13:48:26",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8zz6w",
    "parent_id": "t1_dp8weay",
    "subreddit_name_prefixed": "r/news",
    "body": "> Step 5: Demonize those who don’t agree with the parameter you want to add now. Show how they are supporting said evil and are in fact, monsters themselves by not supporting the new parameter you want to add.\n\nOr slightly differently, demonize them for disagreeing with the premise stated in step 1 just because they disagree with step 5's parameter. Straw man fallacies are really frequent in these cases.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1509674323.0,
    "date_created": "2017-11-02",
    "time_created": "13:58:43",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9120g",
    "parent_id": "t1_dp8weay",
    "subreddit_name_prefixed": "r/news",
    "body": "*cough* no-fly-list *cough*\n\nAlso, you forgot Step 0:  Make the list secret, so that the public cannot question it.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1509675389.0,
    "date_created": "2017-11-02",
    "time_created": "14:16:29",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp94mu8",
    "parent_id": "t1_dp8vyqh",
    "subreddit_name_prefixed": "r/news",
    "body": "> This is not justice.\n\nWe don't have that in the USA. We only have vengeance... and only for those in power. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1509678876.0,
    "date_created": "2017-11-02",
    "time_created": "15:14:36",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8x4wh",
    "parent_id": "t1_dp8x2nm",
    "subreddit_name_prefixed": "r/news",
    "body": "depends on the state really...",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1509671582.0,
    "date_created": "2017-11-02",
    "time_created": "13:13:02",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp97vz2",
    "parent_id": "t1_dp8x2nm",
    "subreddit_name_prefixed": "r/news",
    "body": "In my state, 16 year olds can consent to sex with anyone older than them. Kids from 13-15 may legally consent to anyone 4 years older than them or less. So a 13 year old and a 17 year old can have sex, and a 16 year old and 35 year old can have sex, but a 15 and a 20 year old can not. (I find all of those scenarios pretty gross.)\n\nNot all states are the same though.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1509682116.0,
    "date_created": "2017-11-02",
    "time_created": "16:08:36",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8oece",
    "parent_id": "t1_dp8mwis",
    "subreddit_name_prefixed": "r/news",
    "body": ">What sex offender has a passport.\n\n[The one who travels to Thailand ~~to fuck children.~~ for \"a thing\"](https://youtu.be/_UD4_m_XHB4)\n\n\n",
    "controversiality": 0,
    "ups": 337,
    "downs": 0,
    "score": 337,
    "created": 1509662818.0,
    "date_created": "2017-11-02",
    "time_created": "10:46:58",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8pv8m",
    "parent_id": "t1_dp8mwis",
    "subreddit_name_prefixed": "r/news",
    "body": "Many who have convictions in their home country to avoid getting caught again will fly out and abuse children in third world countries where background checks are not made. It's a pretty big problem at the moment. Not sure how much this will prevent it but something has to be done.  ",
    "controversiality": 0,
    "ups": 98,
    "downs": 0,
    "score": 98,
    "created": 1509664367.0,
    "date_created": "2017-11-02",
    "time_created": "11:12:47",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8oqtu",
    "parent_id": "t1_dp8mwis",
    "subreddit_name_prefixed": "r/news",
    "body": "Any of them?   Passports arent restricted for felons.\n\nAlso, this is no different than the registry.   If you disagree with that, thats reasonable too, but what this does is help other countries that dont have access to the same tools prevent child sex tourist trade.",
    "controversiality": 0,
    "ups": 47,
    "downs": 0,
    "score": 47,
    "created": 1509663189.0,
    "date_created": "2017-11-02",
    "time_created": "10:53:09",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wuo5",
    "parent_id": "t1_dp8ukyn",
    "subreddit_name_prefixed": "r/news",
    "body": "Or how about this [dangerous man](http://reason.com/blog/2015/09/02/teen-boy-will-be-charged-as-adult-for-ha) who is charged with producing child pornography...of himself.",
    "controversiality": 0,
    "ups": 37,
    "downs": 0,
    "score": 37,
    "created": 1509671306.0,
    "date_created": "2017-11-02",
    "time_created": "13:08:26",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8sosy",
    "parent_id": "t1_dp8pkix",
    "subreddit_name_prefixed": "r/news",
    "body": "Holy shit that’s so fucked up. Completely innocent young man be. Literally the worst monsters of society with the same charge.\n\nFuck that. \n\nWe need new laws and names for some of these like public urination, teenage selfies, etc. ",
    "controversiality": 0,
    "ups": 5757,
    "downs": 0,
    "score": 5757,
    "created": 1509667215.0,
    "date_created": "2017-11-02",
    "time_created": "12:00:15",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8v51l",
    "parent_id": "t1_dp8pkix",
    "subreddit_name_prefixed": "r/news",
    "body": "There needs to be serious overhaul with laws about teens and nudes sent to each other. How can anyone have that political or moral stance? That they're sex offenders. That's so absurd.\n\nI'm willing to bet the vast majority of sexually active young people send nudes to each other. It's part of society at this point due to smartphones and the internet. \n\nI just don't understand how someone could live with themselves after prosecuting that or sending them to jail and labeling them a sex offender.\n\nI don't even think that's a controversial statement. I'm sure most people here would agree. If it's consentual, it should not be a crime. Certainly not a crime of that magnitude at the very least.",
    "controversiality": 0,
    "ups": 795,
    "downs": 0,
    "score": 795,
    "created": 1509669654.0,
    "date_created": "2017-11-02",
    "time_created": "12:40:54",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8vdvs",
    "parent_id": "t1_dp8pkix",
    "subreddit_name_prefixed": "r/news",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 184,
    "downs": 0,
    "score": 184,
    "created": 1509669890.0,
    "date_created": "2017-11-02",
    "time_created": "12:44:50",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ua0n",
    "parent_id": "t1_dp8pkix",
    "subreddit_name_prefixed": "r/news",
    "body": "I hope the DA lost his job over that. fuck that shit.",
    "controversiality": 0,
    "ups": 160,
    "downs": 0,
    "score": 160,
    "created": 1509668811.0,
    "date_created": "2017-11-02",
    "time_created": "12:26:51",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8x9x5",
    "parent_id": "t1_dp8wfni",
    "subreddit_name_prefixed": "r/news",
    "body": "Must make for very awkward thanksgiving dinners",
    "controversiality": 0,
    "ups": 617,
    "downs": 0,
    "score": 617,
    "created": 1509671721.0,
    "date_created": "2017-11-02",
    "time_created": "13:15:21",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8yx6i",
    "parent_id": "t1_dp8wfni",
    "subreddit_name_prefixed": "r/news",
    "body": "My old across the road neighbours have a similar situation.\n\nThe guy is a registered sex offender because he got his girlfriend pregnant at the age of 15 when he was 18 (16 being age of consent in UK).\n\nThey now have 3 kids together and have been together for 10+ years, yet he's not allowed to pick the kids up from school. ",
    "controversiality": 0,
    "ups": 278,
    "downs": 0,
    "score": 278,
    "created": 1509673294.0,
    "date_created": "2017-11-02",
    "time_created": "13:41:34",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ycnt",
    "parent_id": "t1_dp8wfni",
    "subreddit_name_prefixed": "r/news",
    "body": "Yes I knew someone in high school who had this happen, except the parents were racists and hated the guy because he was black. Evil people man.",
    "controversiality": 0,
    "ups": 72,
    "downs": 0,
    "score": 72,
    "created": 1509672746.0,
    "date_created": "2017-11-02",
    "time_created": "13:32:26",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp96zpc",
    "parent_id": "t1_dp8wfni",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1509681205.0,
    "date_created": "2017-11-02",
    "time_created": "15:53:25",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9dybv",
    "parent_id": "t1_dp8wfni",
    "subreddit_name_prefixed": "r/news",
    "body": "Guy I knew had been sleeping with his girlfriend since they were both 16, against her parents wishes.\n\nHe turned 18 two weeks before she did, her parents caught them and pressed charges.\n\nThey've been married 20 years. She still won't talk to her parents. He still can't get a decent job with a PhD.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1509688388.0,
    "date_created": "2017-11-02",
    "time_created": "17:53:08",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9exa1",
    "parent_id": "t1_dp8wfni",
    "subreddit_name_prefixed": "r/news",
    "body": "I know a guy that went thru the same thing.\n\nThey have been married for like 15 years now. He was 18 or 19 and she was 15 or 16. Basically a senior in high school dating a freshman.\n\nThey have a good life and all that now -- he has a great job and provides for his family, but he is a registered sex offender for the same shit. Her parents hate(d) him.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1509689479.0,
    "date_created": "2017-11-02",
    "time_created": "18:11:19",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9wd2f",
    "parent_id": "t1_dp8zgpu",
    "subreddit_name_prefixed": "r/news",
    "body": "At this point I'm surprised masturbation isn't labeled as child molestation these days. ",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1509710637.0,
    "date_created": "2017-11-03",
    "time_created": "00:03:57",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9798q",
    "parent_id": "t1_dp8zgpu",
    "subreddit_name_prefixed": "r/news",
    "body": "How did they find out",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1509681470.0,
    "date_created": "2017-11-02",
    "time_created": "15:57:50",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp91lzn",
    "parent_id": "t1_dp8wleo",
    "subreddit_name_prefixed": "r/news",
    "body": "From 0-18 your parents can serve you alcohol, within reason.  So if they think their 16 year old son is mature enough to have a beer with his friday night pizza they can give it to him.  They can not get him wasted but one or two is fine.  Once he turns 18 they would be committing a crime for the same action.  You can legally drink while under 18 but there is no way to legally drink 18-21.  Make sense?",
    "controversiality": 0,
    "ups": 123,
    "downs": 0,
    "score": 123,
    "created": 1509675928.0,
    "date_created": "2017-11-02",
    "time_created": "14:25:28",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8p88c",
    "parent_id": "t1_dp8ouhi",
    "subreddit_name_prefixed": "r/news",
    "body": "The scary part time is that these measures never end where they began -- this starts about \"child sex offenders\" then becomes \"drug offences\" then becomes something else and soon every single person who has ever had to be in the defendant position in the criminal justice system is branded via passport. Note: in order to have the passport they have to have already repaid the social debt. This is virtual cattle branding, not punishment for a crime.",
    "controversiality": 0,
    "ups": 808,
    "downs": 0,
    "score": 808,
    "created": 1509663697.0,
    "date_created": "2017-11-02",
    "time_created": "11:01:37",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8t8zv",
    "parent_id": "t1_dp8ouhi",
    "subreddit_name_prefixed": "r/news",
    "body": "He FBI is also hell bent on convicting as many people as they can regardless of the means and thanks to the stigma juries are pretty ruthless too. Being on a registry ruins your life and if you’re charged with a felony you’re useless to society and condemned to a life without a job, friends, or any chance of anything. \n\nSo throwing the book at people for petty incidents or even non incidents isn’t fair and forcing people to be publicly shamed, especially with how easy it is for someone to search you online, is wrong. ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1509667788.0,
    "date_created": "2017-11-02",
    "time_created": "12:09:48",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8uo5g",
    "parent_id": "t1_dp8ufzl",
    "subreddit_name_prefixed": "r/news",
    "body": "Oh god, I'm getting old...an initialization has confused me: what's IML?",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1509669195.0,
    "date_created": "2017-11-02",
    "time_created": "12:33:15",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp917hg",
    "parent_id": "t1_dp8ufzl",
    "subreddit_name_prefixed": "r/news",
    "body": "That's disgusting. The laws need to be changed. The laws themselves are victimizing minors.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1509675537.0,
    "date_created": "2017-11-02",
    "time_created": "14:18:57",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wx42",
    "parent_id": "t1_dp8pfag",
    "subreddit_name_prefixed": "r/news",
    "body": "That last one is unreal. In sex ed, instead of \"abstinence only\", they should just remind you that you could be labeled the same as child rapist if you have sex while you're underage.",
    "controversiality": 0,
    "ups": 248,
    "downs": 0,
    "score": 248,
    "created": 1509671373.0,
    "date_created": "2017-11-02",
    "time_created": "13:09:33",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xznk",
    "parent_id": "t1_dp8pfag",
    "subreddit_name_prefixed": "r/news",
    "body": "Holy fucking shit, fuck the laws of your country. Holy shit.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1509672403.0,
    "date_created": "2017-11-02",
    "time_created": "13:26:43",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xlxm",
    "parent_id": "t1_dp8pfag",
    "subreddit_name_prefixed": "r/news",
    "body": "I have a friend who got caught up on the offender list because he was 19 and the girl was 16. When the law is used in that sense it’s ridiculous. I understand protecting children - we all do, that’s a no brainer - but when teens  get caught up with photos / otherwise consensual relationships like that it can really ruin their lives. ",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1509672043.0,
    "date_created": "2017-11-02",
    "time_created": "13:20:43",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp93650",
    "parent_id": "t1_dp8pfag",
    "subreddit_name_prefixed": "r/news",
    "body": "I was sexually active with my girlfriend in high school when we were both 15, she turned 16 six months before me. I certinalty don't feel like I was taken advantage of and raped by an older woman but the law would suggest so.\n",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1509677459.0,
    "date_created": "2017-11-02",
    "time_created": "14:50:59",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8x480",
    "parent_id": "t1_dp8wtcy",
    "subreddit_name_prefixed": "r/news",
    "body": "\"are you a normal sexually curious and horny adolescent?! To jail with you\"!!\n\nAnd to think: many of us were the *American Pie* generation. That entire movie is just a list of felonies now.",
    "controversiality": 0,
    "ups": 86,
    "downs": 0,
    "score": 86,
    "created": 1509671564.0,
    "date_created": "2017-11-02",
    "time_created": "13:12:44",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp960wz",
    "parent_id": "t1_dp8ypqj",
    "subreddit_name_prefixed": "r/news",
    "body": "Patty Wetterling (mother of Jacob Wetterling) agrees that these lists need to go back to being private (for law enforcement only) and the removal of juveniles from the list.  She's pretty active in trying to get this done and I, for one, hope she succeeds.  Her decades of experience in children's safety has shown her that 90% of abuse comes from family members or acquaintances.  Not the creepy guy in the corner house, which is what started the whole public registry craze.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1509680248.0,
    "date_created": "2017-11-02",
    "time_created": "15:37:28",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8y08o",
    "parent_id": "t1_dp8waf1",
    "subreddit_name_prefixed": "r/news",
    "body": "It's even more limited if you're a sex offender, what actual good does putting it on the passport do?",
    "controversiality": 0,
    "ups": 1291,
    "downs": 0,
    "score": 1291,
    "created": 1509672418.0,
    "date_created": "2017-11-02",
    "time_created": "13:26:58",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8y1yt",
    "parent_id": "t1_dp8waf1",
    "subreddit_name_prefixed": "r/news",
    "body": "Immigrating to another country would be difficult but I'm sure that you can travel to other countries quite easily.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1509672463.0,
    "date_created": "2017-11-02",
    "time_created": "13:27:43",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ybvi",
    "parent_id": "t1_dp8waf1",
    "subreddit_name_prefixed": "r/news",
    "body": "visa waiver countries will never know because you don't apply for a visa. there's nothing to identify you as a serial rapist or child murderer or anything dangerous like that.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1509672725.0,
    "date_created": "2017-11-02",
    "time_created": "13:32:05",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ywke",
    "parent_id": "t1_dp8waf1",
    "subreddit_name_prefixed": "r/news",
    "body": "Like absolutely every EU country, since you don’t need visas, but sure, probably Bangladesh will be safe from my murdering ass. ",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1509673278.0,
    "date_created": "2017-11-02",
    "time_created": "13:41:18",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8zbhp",
    "parent_id": "t1_dp8waf1",
    "subreddit_name_prefixed": "r/news",
    "body": "Really?  How would they know?  Many countries, including the entire EU, admit U.S. citizens as tourists without even requiring a visa, and they don't routinely run criminal background checks.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1509673679.0,
    "date_created": "2017-11-02",
    "time_created": "13:47:59",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wev2",
    "parent_id": "t1_dp8usxx",
    "subreddit_name_prefixed": "r/news",
    "body": "I had a friend who was 18 and his gf was 16, and her parents tried to ruin his life, it got extremely messy. While, I have no problem with actual sex offenders ( people who abuse and assault actual kids) being labeled as such, it really is too broad, and hopefully it can be condensed in such a manner, that it doesn’t hurt people who truly do nothing wrong.",
    "controversiality": 0,
    "ups": 416,
    "downs": 0,
    "score": 416,
    "created": 1509670882.0,
    "date_created": "2017-11-02",
    "time_created": "13:01:22",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8toou",
    "parent_id": "t1_dp8qeu6",
    "subreddit_name_prefixed": "r/news",
    "body": "It's almost like the justice system is broken or something.",
    "controversiality": 0,
    "ups": 815,
    "downs": 0,
    "score": 815,
    "created": 1509668232.0,
    "date_created": "2017-11-02",
    "time_created": "12:17:12",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9btkq",
    "parent_id": "t1_dp92eav",
    "subreddit_name_prefixed": "r/news",
    "body": "Why was he required to register and she wasn't? If they both did it, and if he didn't force himself on her (I assume he didn't?), shouldn't they both be required to register?\n\nHonestly, all of those are so stupid. It feels like people forget what it was like to be a teenager, it's the most confusing time to be a human, you're body is changing and you're growing up. You've got all these new hormones in your body and let's be honest, teenagers are idiots for the most part. They don't know any better and it's pretty thick to punish them for the rest of their lives for these things. Like look, if a teenager legitimately rapes somebody or something to that extent, ok fine but the ones you listed just do my head in.\n\nFair play to ya though for working with them and giving them a chance when it seems like other people wouldn't. Really is heartbreaking to see kids being suicidal and having their lives ruined over what are, really, just silly mistakes.",
    "controversiality": 0,
    "ups": 94,
    "downs": 0,
    "score": 94,
    "created": 1509686142.0,
    "date_created": "2017-11-02",
    "time_created": "17:15:42",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8smu8",
    "parent_id": "t1_dp8r1k0",
    "subreddit_name_prefixed": "r/news",
    "body": "Here, in Quebec, this defense is valid.",
    "controversiality": 0,
    "ups": 1331,
    "downs": 0,
    "score": 1331,
    "created": 1509667160.0,
    "date_created": "2017-11-02",
    "time_created": "11:59:20",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8taym",
    "parent_id": "t1_dp8r1k0",
    "subreddit_name_prefixed": "r/news",
    "body": "Same happened to a buddy of mine. Girl was in a bar with a fake ID. Had real tattoos and was drinking in a bar. Parents found them sexting and then pressed charges. Then it was found out she was in a bar with a fake ID and the parents tried to drop the charges. But the DA was out for blood and wouldn't have it. Ruined his life for like 6 years. But it got better for him. Shit was dumb.",
    "controversiality": 0,
    "ups": 572,
    "downs": 0,
    "score": 572,
    "created": 1509667844.0,
    "date_created": "2017-11-02",
    "time_created": "12:10:44",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xtoy",
    "parent_id": "t1_dp8r1k0",
    "subreddit_name_prefixed": "r/news",
    "body": "Statutory rape is one of a very small number of what are called strict liability crimes in the United States (NOTE: Criminal statutes are state matters not federal matters, so this differs by state.  There are many states where statutory rape is NOT a strict liability crime and your friend would have been able to use this evidence to assert his lack of knowledge.  I am speaking about those states where it is strict liability).  \n\nA strict liability crime is one where we drop the normal legal requirements to prove mens rea, or state of mind.  This is generally because these crimes are such where we have deemed that either it would be impossible for you not to know, or we don't care if you didn't know, or the societal burden in proving you knew is not worth the costs.  Because of this \"I didn't know he/she was underage\" is not a legal defense whereas it ordinarily probably would be.  \n\nAs you might imagine, strict liability is very rare and only applied when explicitly called for in statute.  Speed limits are the most common strict liability crime.  If you are driving 55 in a 25, we don't care if you knew or not, you're guilty.  Drunk driving is a less common but emerging one.  In some states, if the blood alcohol limit is .08 the state has to prove not only that your BAC was above .08 at the time, but that you had reasonable basis to know you were over the legal limit.  Other states cut out that step and say if your BAC is .09 that's enough.  \n\nDrug possession is another one, with regards to quantities being strict liability.  As you probably know, drug crimes are of different severity and carry different sentences based on the amount in your possession.  In many jurisdictions once the prosecutors have proven you knowingly carried meth with the intent to sell, we don't care about whether you knew it was 50 kilograms, or if you thought it was only 20.\n\nYou can probably see the rationale for all of these, even if you don't necessarily agree.  Speed limits are to save the court time on trivial offenses, drug quantities make it easier to target organized groups that use drug runners, the drunk driving one just follows logically, etc.  The statutory rape one is rather more controversial, and was originally only applied to instances where the victim was below the age of ten, for reasons which should immediately seem obvious.  Whether or not statutoty rape should be strict liability in all cases, is another issue.\n\nThat being said, there is legal precedent on your friend's side which has been adopted nationwide in United States v. Kantor, which creates a \"good faith\" defense against crimes in which the victim intentionally tricked the defendants into a factual mistake thinking that no crime was being committed.  Unless your friend's case was more than 20 years ago, I'm surprised he was still found guilty if he had all that evidence you said.  Unfortunately access to competent public defenders is sorely lacking, and our courts don't always operate in practice the way we say they do in theory.",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1509672246.0,
    "date_created": "2017-11-02",
    "time_created": "13:24:06",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8rkzt",
    "parent_id": "t1_dp8r1k0",
    "subreddit_name_prefixed": "r/news",
    "body": "That really sucks. I believe there should be consequences for the girl in this kind of case. Something like conspiracy to commit sexual offense to a minor through deceit.",
    "controversiality": 0,
    "ups": 202,
    "downs": 0,
    "score": 202,
    "created": 1509666110.0,
    "date_created": "2017-11-02",
    "time_created": "11:41:50",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xqwr",
    "parent_id": "t1_dp8r1k0",
    "subreddit_name_prefixed": "r/news",
    "body": "> Meanwhile, the TV news shows up at his house periodically to do a story about local sexual predators.\n\nhold on, what the fuck?",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1509672173.0,
    "date_created": "2017-11-02",
    "time_created": "13:22:53",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ryoo",
    "parent_id": "t1_dp8r1k0",
    "subreddit_name_prefixed": "r/news",
    "body": "If he felt the need to ID her, I suspect she didn't really look that much older.",
    "controversiality": 0,
    "ups": 332,
    "downs": 0,
    "score": 332,
    "created": 1509666491.0,
    "date_created": "2017-11-02",
    "time_created": "11:48:11",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8qii5",
    "parent_id": "t1_dp8ommb",
    "subreddit_name_prefixed": "r/news",
    "body": "Does it matter? Should we let people be wrongfully convicted or persecuted if it's only a minority ",
    "controversiality": 0,
    "ups": 597,
    "downs": 0,
    "score": 597,
    "created": 1509665026.0,
    "date_created": "2017-11-02",
    "time_created": "11:23:46",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8s92x",
    "parent_id": "t1_dp8ommb",
    "subreddit_name_prefixed": "r/news",
    "body": "Does it matter? Do you support the death penalty because \"who cares if a few innocent people get executed here and there\"?",
    "controversiality": 0,
    "ups": 93,
    "downs": 0,
    "score": 93,
    "created": 1509666778.0,
    "date_created": "2017-11-02",
    "time_created": "11:52:58",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xnf2",
    "parent_id": "t1_dp8vuqt",
    "subreddit_name_prefixed": "r/news",
    "body": "I dunno if it is political suicide anymore. Just judging from the comment trends in this thread alone, it seems as if we have reached the point where \"everybody knows somebody on the list\". I know I do, and he doesn't deserve to be on there. ",
    "controversiality": 0,
    "ups": 75,
    "downs": 0,
    "score": 75,
    "created": 1509672082.0,
    "date_created": "2017-11-02",
    "time_created": "13:21:22",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ynba",
    "parent_id": "t1_dp8xodt",
    "subreddit_name_prefixed": "r/news",
    "body": "My friend was put on probation for a misdemeanor and is on this list indefinitely.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1509673031.0,
    "date_created": "2017-11-02",
    "time_created": "13:37:11",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8s8yv",
    "parent_id": "t1_dp8qkdc",
    "subreddit_name_prefixed": "r/news",
    "body": "Perhaps a colored letter?",
    "controversiality": 0,
    "ups": 760,
    "downs": 0,
    "score": 760,
    "created": 1509666775.0,
    "date_created": "2017-11-02",
    "time_created": "11:52:55",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8snoj",
    "parent_id": "t1_dp8qkdc",
    "subreddit_name_prefixed": "r/news",
    "body": "Why not just use a branding iron to inscribe a letter describing their crime on their breast?  \"R\" for rape, \"D\" for DUI, \"A\" for adultery, \"M\" for murder, etc?  Hey, it worked for Nathaniel Hawthorne ...",
    "controversiality": 0,
    "ups": 71,
    "downs": 0,
    "score": 71,
    "created": 1509667184.0,
    "date_created": "2017-11-02",
    "time_created": "11:59:44",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8qxt6",
    "parent_id": "t1_dp8qkdc",
    "subreddit_name_prefixed": "r/news",
    "body": "Being a sex offender is a little bit more than just shameful. I can understand wanting to warn other countries that a person entering said countries is someone who wants to fuck children.",
    "controversiality": 0,
    "ups": 296,
    "downs": 0,
    "score": 296,
    "created": 1509665454.0,
    "date_created": "2017-11-02",
    "time_created": "11:30:54",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8skao",
    "parent_id": "t1_dp8qkdc",
    "subreddit_name_prefixed": "r/news",
    "body": "Or a fat British dude loading shells into his shotgun and saying that",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1509667088.0,
    "date_created": "2017-11-02",
    "time_created": "11:58:08",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8sapz",
    "parent_id": "t1_dp8reph",
    "subreddit_name_prefixed": "r/news",
    "body": "That only applies to U.S. citizens/residents since U.S. and Canada share a law enforcement database. U.S. likewise does not allow in Canadians with DUI's. But if you were coming from any other country in the world, theres no way they could view your criminal record and thus prohibit you from entering. ",
    "controversiality": 0,
    "ups": 99,
    "downs": 0,
    "score": 99,
    "created": 1509666824.0,
    "date_created": "2017-11-02",
    "time_created": "11:53:44",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8rvso",
    "parent_id": "t1_dp8reph",
    "subreddit_name_prefixed": "r/news",
    "body": "> Canada actually does not allow people to enter if they have a DUI.\n\n\nThe customs link says they may not, it looks like if you lawyer up and/or complete a rehabilitation program you have a good shot at getting in.\n\nhttp://www.temporaryresidentpermitcanada.com/felony.php",
    "controversiality": 0,
    "ups": 72,
    "downs": 0,
    "score": 72,
    "created": 1509666411.0,
    "date_created": "2017-11-02",
    "time_created": "11:46:51",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8sb13",
    "parent_id": "t1_dp8rwar",
    "subreddit_name_prefixed": "r/news",
    "body": "Pretty much. People don't travel to Thailand to go on driving while intoxicated tourism. ",
    "controversiality": 0,
    "ups": 183,
    "downs": 0,
    "score": 183,
    "created": 1509666833.0,
    "date_created": "2017-11-02",
    "time_created": "11:53:53",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp90tu8",
    "parent_id": "t1_dp8zt93",
    "subreddit_name_prefixed": "r/news",
    "body": "[Sex offenders who want to live in Miami are forced to live under a bridge.](http://www.npr.org/templates/story/story.php?storyId=104150499)\n\n[A sheriff in Polk County, Florida won't allow sex offenders in shelters to protect themselves from Hurricane Irma](http://time.com/4929740/hurricane-irma-florida-sex-offenders/)\n\n>Polk County Sheriff Grady Judd said in a series of tweets on Wednesday that sex offenders seeking refuge at hurricane shelters will be turned away and that those who have a warrant will be taken to jail. \n\nPeople who commit any crime are allowed to try to rehabilitate themselves in order to reintegrate into society. But in a lot of areas, sex offenders are marked for life, even if they are rehabilitated. They've done their time, served their punishment...just like any other person who has committed a crime. But now, if they want to get a friggen passport, they're marked for life. Every person they show the passport to will judge them accordingly. Everyone will know. But yet, this isn't done for anyone else who has ever committed a crime. Just ridiculous. \n\nGranted, there are countries that don't allow entry for DUIs or other crimes, but I don't think those things are actually imprinted on the passport. ",
    "controversiality": 0,
    "ups": 139,
    "downs": 0,
    "score": 139,
    "created": 1509675170.0,
    "date_created": "2017-11-02",
    "time_created": "14:12:50",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8q71d",
    "parent_id": "t1_dp8pjz1",
    "subreddit_name_prefixed": "r/news",
    "body": "Seriously. It would be like tagging \"murderer\" to all people who have killed someone, whether it is 1st degree, or negligent manslaughter. Doesn't make sense.",
    "controversiality": 0,
    "ups": 2378,
    "downs": 0,
    "score": 2378,
    "created": 1509664707.0,
    "date_created": "2017-11-02",
    "time_created": "11:18:27",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8s6p4",
    "parent_id": "t1_dp8pjz1",
    "subreddit_name_prefixed": "r/news",
    "body": "Yep, I'm in the minority, but the more people who are on the list for victimless crimes the more it dilutes the list.\n\nNobody should be on the list for taking nudes of themselves. Nobody should be on the list for pissing behind a dumpster. Nobody should be on the list for having consenting sex with their girlfriend or boyfriend when they are both in high school. ",
    "controversiality": 0,
    "ups": 1128,
    "downs": 0,
    "score": 1128,
    "created": 1509666712.0,
    "date_created": "2017-11-02",
    "time_created": "11:51:52",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8qalz",
    "parent_id": "t1_dp8pjz1",
    "subreddit_name_prefixed": "r/news",
    "body": "Can I have a source for those numbers as opposed to violent sex offenders?",
    "controversiality": 0,
    "ups": 94,
    "downs": 0,
    "score": 94,
    "created": 1509664806.0,
    "date_created": "2017-11-02",
    "time_created": "11:20:06",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8r8pv",
    "parent_id": "t1_dp8pjz1",
    "subreddit_name_prefixed": "r/news",
    "body": "I agree the registry in general needs to be revisited before this is implemented.\n\nI am all for warning other countries about possible child predators. I, however, am a bit skeptical about restricting a person's ability to move and travel for a statutory charge when he/she was 17 and the \"victim\" bf/gf was 16.",
    "controversiality": 0,
    "ups": 131,
    "downs": 0,
    "score": 131,
    "created": 1509665764.0,
    "date_created": "2017-11-02",
    "time_created": "11:36:04",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ta9r",
    "parent_id": "t1_dp8pjz1",
    "subreddit_name_prefixed": "r/news",
    "body": "Myths. Just browse the registry it lists the offenses. Cross reference that by doing a google search of the name and find the court documents. Read the awful details for yourself :( \n  \nWhat you describe are anomalies. You're saying is akin to \"don't lock up murdered, because sometimes they're innocent and rarely a murder is justified by a fluke situation.\" ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1509667825.0,
    "date_created": "2017-11-02",
    "time_created": "12:10:25",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8tzcn",
    "parent_id": "t1_dp8pjz1",
    "subreddit_name_prefixed": "r/news",
    "body": "Probation and Parole Officer here, out of 100 or so SO’s that are on my caseload, none of them are people that were caught urinating in public or were sharing nude photos with their boyfriend or girlfriend.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1509668524.0,
    "date_created": "2017-11-02",
    "time_created": "12:22:04",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ucc2",
    "parent_id": "t1_dp8pjz1",
    "subreddit_name_prefixed": "r/news",
    "body": "Go to your local sex offender registry list. \nLook at the offenders closest to your home.\nTell me how many of those offenders are on the list because they were an innocent teen who had pictures of his girlfriend one time.\n\nThere's this misconception that there's a disproportionate amount of low-level offenders on the sex offender registry list. It's a myth. Yes, our laws allow for people to be put on lists for relatively harmless sex crimes, but the vast majority of the list is made up of people who undoubtedly belong on it.\n",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1509668874.0,
    "date_created": "2017-11-02",
    "time_created": "12:27:54",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8s806",
    "parent_id": "t1_dp8pjz1",
    "subreddit_name_prefixed": "r/news",
    "body": "No one. And it’s actually kind of a problem.\n\nWhat you point out here also has issues involving treatment and sentencing. That 19 year old dating a 17 year old who sent him nudes can get the same treatment as a dude snatching kids off a playground. \n\nIn my opinion, that’s how you turn that otherwise normal 19 year old offender into someone with nothing to lose.",
    "controversiality": 0,
    "ups": 84,
    "downs": 0,
    "score": 84,
    "created": 1509666748.0,
    "date_created": "2017-11-02",
    "time_created": "11:52:28",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8w57f",
    "parent_id": "t1_dp8pjz1",
    "subreddit_name_prefixed": "r/news",
    "body": ">but a lot of \"sex offenders\" are people caught public pissing \n\nThis is not true. This is said a lot, but there is no proof of it actually happening, let alone it happening so often that there are a lot of sex offenders due to peeing.\n\nWhile there are 13 states where technically you could be listed as a sex offender for public urination (2 of which you must be peeing in front of a minor) there have been no actual cases of it actually happening that have ever been reported.\n\nPlease check your facts in the future before spreading more misinformation based off some anecdotal data you heard.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1509670624.0,
    "date_created": "2017-11-02",
    "time_created": "12:57:04",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8truq",
    "parent_id": "t1_dp8pjz1",
    "subreddit_name_prefixed": "r/news",
    "body": "Getting caught pissing doesn't make it so you have to register as a sex offender and have your picture at the post office. \nWhile there have been like 3 times that has happened (and honestly all instances seem to be racism/discrimination) it's not a big problem in general. \n\nThe photo thing?  I agree some cops/prosecutors are pushing the limits of what is considered child porn.  I don't know how often this happens. I know of a case where an 18 year old kid sent pornagraphic pictures  of his 16 year old girl friend to her whole family and the cops  busted him on child porn.  In a place like reddit, where a drunk kid accidentally wanders into a house and get shot and every one is like\" fuck him, he should have not gotten drunk\" -  I'd think people would be like - \"fuck that, you're 18, you should know better than to send pictures of a naked 16 year old to her extended family because she dumped you\".  ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1509668319.0,
    "date_created": "2017-11-02",
    "time_created": "12:18:39",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8um5e",
    "parent_id": "t1_dp8pjz1",
    "subreddit_name_prefixed": "r/news",
    "body": ">  but a lot of \"sex offenders\" are people caught public pissing\n\nas far as I can tell (and I did a fair bit of research), this *particular* example is an urban legend that never actually happened.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1509669139.0,
    "date_created": "2017-11-02",
    "time_created": "12:32:19",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp91ee2",
    "parent_id": "t1_dp8pjz1",
    "subreddit_name_prefixed": "r/news",
    "body": "I've heard a lot lately that this is mostly bullshit, and that the % of people on that list caught peeing in public one time is nonexistent.  In many cases its people who are caught multiple times exposing themselves and the peeing in public excuse is their go to, because who wants to admit to being an actual predator?",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1509675724.0,
    "date_created": "2017-11-02",
    "time_created": "14:22:04",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8q8yd",
    "parent_id": "t1_dp8pjz1",
    "subreddit_name_prefixed": "r/news",
    "body": "I think you need to re-read the title or article. This is about people who have committed sexual offenses against children. Its a little more than just taking a piss in public. All though the children sending nudes may get caught up in this.",
    "controversiality": 0,
    "ups": 311,
    "downs": 0,
    "score": 311,
    "created": 1509664761.0,
    "date_created": "2017-11-02",
    "time_created": "11:19:21",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8s5fk",
    "parent_id": "t1_dp8ojya",
    "subreddit_name_prefixed": "r/news",
    "body": "Makes sense. If you are some creepy old dude going alone to somewhere like Cambodia, they may take a dim view of you going there to see the sights and sample local cuisine. \n\nEdit - to clarify, if they have such a stamp in their passport of previous crimes, and they claim they are travelling to a known hotspot of child sex slavery, and there are other factors such as travelling alone, then that could be reason enough to block travel. Countries ban people for far more trivial matters. ",
    "controversiality": 0,
    "ups": 102,
    "downs": 0,
    "score": 102,
    "created": 1509666677.0,
    "date_created": "2017-11-02",
    "time_created": "11:51:17",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8tzrz",
    "parent_id": "t1_dp8ojya",
    "subreddit_name_prefixed": "r/news",
    "body": "In Europe burglary tourism is actually a pretty big thing. Super-well organized logistics. They tend to come from eastern european or south american countries - then they do house breakins, look for cash and jewelry and send it back home through their own networks. These are gangs involving hundreds of people.\n\n(In e.g. Sweden about 50% of house breakins are done by these kinds of \"tourists\". Sweden isn't equipped to deal with this kind of abuse - neither in terms of policing or laws/sentencing.)",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1509668536.0,
    "date_created": "2017-11-02",
    "time_created": "12:22:16",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8tcxy",
    "parent_id": "t1_dp8rnyn",
    "subreddit_name_prefixed": "r/news",
    "body": "No shit, what a terrible idea. It is already impossible for felons to make anything successful of their lives, lets also ensure they are as ostracised and isolated as possible the rest of their lives. Only good things can come of that!",
    "controversiality": 0,
    "ups": 200,
    "downs": 0,
    "score": 200,
    "created": 1509667900.0,
    "date_created": "2017-11-02",
    "time_created": "12:11:40",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8tyy3",
    "parent_id": "t1_dp8rnyn",
    "subreddit_name_prefixed": "r/news",
    "body": "You're missing OP's point. It was an: if we have one registry for a certain  bad past act we should be willing to have it for other bad past acts.\n\nIf you object to extending it to other bad past acts, you should evaluate your reasoning for having it for the original one.",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1509668513.0,
    "date_created": "2017-11-02",
    "time_created": "12:21:53",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8u48z",
    "parent_id": "t1_dp8s71q",
    "subreddit_name_prefixed": "r/news",
    "body": "Just the fact that you feel you need to add \"No, I'm not on the list\" underscores what is wrong with this. Too many people don't care about what agony it causes somebody who might have done something terrible early in their life, because it's not them. But these lists completely prevent a lot of these people from becoming part of society again. I don't understand this american position of \"doing the time\" and then being additionally punished for the rest of your life. You are a secondclass citizen forever, ad you wonder why you have high recidivism rates?",
    "controversiality": 0,
    "ups": 97,
    "downs": 0,
    "score": 97,
    "created": 1509668655.0,
    "date_created": "2017-11-02",
    "time_created": "12:24:15",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8vxgm",
    "parent_id": "t1_dp8s4yz",
    "subreddit_name_prefixed": "r/news",
    "body": "I was eating dinner with some friends of mine at a casino a few years ago, and got up to use the bathroom. When I walked into the men's room there were two women there using the sink. We gave each other the stink-eye and I went in to use the stall, did my business and when I came out these women were gone.\n\nI went and sat back down and started telling my friends this story about crazy women in the men's room, when somebody tapped me on the shoulder. Two burly security guards took me out into the lobby and asked me what I'd been doing in the women's restroom - seems the two women had reported me.\n\nIt was cleared up quickly once it was obvious that I was drunk and stupid, but it's kind of alarming to think something like that might have followed me.",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1509670416.0,
    "date_created": "2017-11-02",
    "time_created": "12:53:36",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8siuf",
    "parent_id": "t1_dp8s1dg",
    "subreddit_name_prefixed": "r/news",
    "body": "Now ~~imagine~~ consider being an 18 year-old guy with a 16 year-old girlfriend, and you decide to fool around with her. Then her parents get mad and file charges. Then you get snatched up, forced into a registry, marked as a gross pervert by the government. You've got a picture of yourself on the registry, your current home address, but no way to defend your charges. You're forced to go to group counseling and pay a fee each time you go. One time, 10 years later, you can't pay the fee, so you can't attend. That violates your probation. You get put in jail for 2 years for violating probation, then come out worse than you went in. Nobody will hire you because you're a registered sex offender and a con.\n\nThis is literally what happened to my buddy.\n\nEdit: consider vs. imagine. thanks /u/pupomin",
    "controversiality": 0,
    "ups": 88,
    "downs": 0,
    "score": 88,
    "created": 1509667049.0,
    "date_created": "2017-11-02",
    "time_created": "11:57:29",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8u9qq",
    "parent_id": "t1_dp8rxwm",
    "subreddit_name_prefixed": "r/news",
    "body": "I’m not into public registries, but I’m also not opposed to lifetime monitoring (or incarceration) for criminals with unusually high rates of both recidivism and harm.  The concept of a fixed term of incarceration in some sense “solving” or “dealing with” a mental illness makes no sense.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1509668804.0,
    "date_created": "2017-11-02",
    "time_created": "12:26:44",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8p4sc",
    "parent_id": "t1_dp8o4wl",
    "subreddit_name_prefixed": "r/news",
    "body": "I do; my wife does not. The situation in our household is... tense.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1509663593.0,
    "date_created": "2017-11-02",
    "time_created": "10:59:53",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8oqe3",
    "parent_id": "t1_dp8o4wl",
    "subreddit_name_prefixed": "r/news",
    "body": "you can add me to THAT delicious registry\n\nalso I like to put corn kernels too",
    "controversiality": 0,
    "ups": 219,
    "downs": 0,
    "score": 219,
    "created": 1509663175.0,
    "date_created": "2017-11-02",
    "time_created": "10:52:55",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8qaas",
    "parent_id": "t1_dp8p5bd",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 94,
    "downs": 0,
    "score": 94,
    "created": 1509664798.0,
    "date_created": "2017-11-02",
    "time_created": "11:19:58",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8sha1",
    "parent_id": "t1_dp8rvvk",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah, because it happened to a boy near my house. Sorry if too graphic, but I wanted to be clear how deranged some people are, yet they are painted with the same brush as a stupid teenager.",
    "controversiality": 0,
    "ups": 347,
    "downs": 0,
    "score": 347,
    "created": 1509667007.0,
    "date_created": "2017-11-02",
    "time_created": "11:56:47",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8tzxd",
    "parent_id": "t1_dp8rvvk",
    "subreddit_name_prefixed": "r/news",
    "body": "There's plenty of fuckep up scenarios where people are placed on the sex offender's list yet no sane person would think they deserve to, but that doesn't matter as people just notice you are on the sex offender list and you are branded that way even if all you did was exchange nudes with another minor, peed in public or even flashed your privates to your step-brother when you weren't even a teenager http://www.weeklystandard.com/a-senseless-policy/article/1020694.\n\nThat list, while in theory a good idea, is a huge pile of shit due to how small of an infraction can land you on it thus diluting it's purpose into singling out actual sexual predators.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1509668540.0,
    "date_created": "2017-11-02",
    "time_created": "12:22:20",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8qnbj",
    "parent_id": "t1_dp8q32g",
    "subreddit_name_prefixed": "r/news",
    "body": "Happens all across the globe, here too, it's something we need to get good at stopping but not something that will ever end.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1509665162.0,
    "date_created": "2017-11-02",
    "time_created": "11:26:02",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8zexd",
    "parent_id": "t1_dp8s1h3",
    "subreddit_name_prefixed": "r/news",
    "body": "> \"The children there are more mature...\"\n\nthat just sounds way too cartoonist, I guess I'm going to hell for laughing at this.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1509673771.0,
    "date_created": "2017-11-02",
    "time_created": "13:49:31",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8x8yq",
    "parent_id": "t1_dp8oece",
    "subreddit_name_prefixed": "r/news",
    "body": "Honestly, this really isn't a joke. I'm an expat living in Thailand. Every year - there are many new stories  about convicted Western pedophiles who come to Thailand and get elementary school teaching jobs due to the lack of access to background checks. And those are just the ones they catch. They have so much access to children - it's horrific. I for one think that labeling these scumbags is a great thing.\n\nHere's one from just a month and a half ago - http://bangkokjack.com/2017/09/24/american-pedophile-arrested-thailand-working-teacher/",
    "controversiality": 0,
    "ups": 61,
    "downs": 0,
    "score": 61,
    "created": 1509671694.0,
    "date_created": "2017-11-02",
    "time_created": "13:14:54",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8rp28",
    "parent_id": "t1_dp8oqtu",
    "subreddit_name_prefixed": "r/news",
    "body": "He means that you can only use the passport after serving the years of your sentence, if they already know that somebody is a sex offender (being in the list) he already \"payed\" his crimes and in theory should be reformed, in reality the American system doesn't reform people so I do not know how I feel about his comment – One side of me agrees, because the system should be reforming people, but my other side knows that most of the people that get out are gonna keep doing the same things they got in in the first place.",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1509666223.0,
    "date_created": "2017-11-02",
    "time_created": "11:43:43",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8vsq0",
    "parent_id": "t1_dp8sosy",
    "subreddit_name_prefixed": "r/news",
    "body": "A lot of that has to do with reactionary policies. We create too many policies as a visceral reaction to events. ",
    "controversiality": 0,
    "ups": 2740,
    "downs": 0,
    "score": 2740,
    "created": 1509670286.0,
    "date_created": "2017-11-02",
    "time_created": "12:51:26",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8vw39",
    "parent_id": "t1_dp8sosy",
    "subreddit_name_prefixed": "r/news",
    "body": "Unf. Even that wouldnt be enough if you're still going to get tagged with the sex offender tag. Most people dont look any farther than that label before treating them as the monsters and scum of society",
    "controversiality": 0,
    "ups": 83,
    "downs": 0,
    "score": 83,
    "created": 1509670378.0,
    "date_created": "2017-11-02",
    "time_created": "12:52:58",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wegx",
    "parent_id": "t1_dp8v51l",
    "subreddit_name_prefixed": "r/news",
    "body": "Young people don't vote. But you know who does? The parents who are angry that teenagers take these selfies. ",
    "controversiality": 0,
    "ups": 635,
    "downs": 0,
    "score": 635,
    "created": 1509670871.0,
    "date_created": "2017-11-02",
    "time_created": "13:01:11",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8x2bz",
    "parent_id": "t1_dp8v51l",
    "subreddit_name_prefixed": "r/news",
    "body": "Meanwhile, having all of these teens be labeled as a sex offender for something as harmless as taking nude selfies,  eventually, down the road, no one's going to take the label \"sex offender\" as seriously as they should because \"they just took nude selfies when they were 17\" will be a believable thing, which will get brushed off - allowing actual predators to have access they otherwise would never have.\n\nEdit: a word",
    "controversiality": 0,
    "ups": 172,
    "downs": 0,
    "score": 172,
    "created": 1509671512.0,
    "date_created": "2017-11-02",
    "time_created": "13:11:52",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wy06",
    "parent_id": "t1_dp8v51l",
    "subreddit_name_prefixed": "r/news",
    "body": "I'd just be happy if they lock up Verizon as a sex offender for having child nudes on their servers. Yes, lock up the company. Fuck you FIOS!",
    "controversiality": 0,
    "ups": 102,
    "downs": 0,
    "score": 102,
    "created": 1509671396.0,
    "date_created": "2017-11-02",
    "time_created": "13:09:56",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ww4b",
    "parent_id": "t1_dp8v51l",
    "subreddit_name_prefixed": "r/news",
    "body": "I am forever grateful that nobody had cell phones when I was young. I would either be in jail or, be a meme.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1509671346.0,
    "date_created": "2017-11-02",
    "time_created": "13:09:06",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8x6hy",
    "parent_id": "t1_dp8v51l",
    "subreddit_name_prefixed": "r/news",
    "body": "Because people, parents especially, see it as a slippery slope or loophole that can be exploited by predatory paedophiles. It doesn't really matter if someone is 17 or 7, it's still technically child pornography and making it 'legal' in some circumstances is a Pandora's Box no politcian would ever open unless they wanted to sacrifice their career and be branded a paedophile for even suggesting as much.\n\nAlso, shit like that spreads like wildfire at schools, universities and workplaces. A friend grabs a friend's phone, finds the nudes and sends it around; a guy sends nudes he got to his friends under the pretense of keeping it a secrett, but it spreads and so on. In the case of minors, shit like that is distribution of child porn and can end up wider.\n\nEdit:\n\n> It's part of society at this point due to smartphones and the internet. \n\nHeck, this type of stuff goes back to the early 00s. I remember some guy sending nudes to girls on MSN Messenger and they printed the images out and plastered it across school. I wouldn't be surprised if you told me people in the 80s/90s, who could afford polaroids, shared nude polaroid snaps. Of course, it's not like anyone would admit to it in this day and age.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1509671627.0,
    "date_created": "2017-11-02",
    "time_created": "13:13:47",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8w054",
    "parent_id": "t1_dp8v51l",
    "subreddit_name_prefixed": "r/news",
    "body": "> vast majority of sexually active young people\n\nSinners must be punished! /s\n\nIf you don't like these laws young uns... you have to vote OUT the types making them.\n\nRespondants:: You REALLY think I was referring to people that can't vote yet, getting out and voting?  \nPerhaps my 65+ yr old white co-worker was right? \"they should restrict voting further\"  \n^ That crowd and the evangelicals show up to the polls - that why you have this crap!",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1509670488.0,
    "date_created": "2017-11-02",
    "time_created": "12:54:48",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wthw",
    "parent_id": "t1_dp8vdvs",
    "subreddit_name_prefixed": "r/news",
    "body": "Well, many places punish attempted suicide, right? Just another limitation on our freedom.",
    "controversiality": 0,
    "ups": 58,
    "downs": 0,
    "score": 58,
    "created": 1509671275.0,
    "date_created": "2017-11-02",
    "time_created": "13:07:55",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8vhmv",
    "parent_id": "t1_dp8ua0n",
    "subreddit_name_prefixed": "r/news",
    "body": "It's not actually a misapplication of the current law. Under current US law, it's lawful and possible to charge someone with felony creating child pornography if they take nudes of themselves prior to being 18. If they send it to anyone, thats another felony distribution of child pornography charge.    \n   \nAnd children comitting crimes can be charged as adults, so you can end up in a situation where someone gets charged as an adult for that offense.    \n   \nSo a DA prosecuting that was doing his job to the letter.",
    "controversiality": 0,
    "ups": 233,
    "downs": 0,
    "score": 233,
    "created": 1509669990.0,
    "date_created": "2017-11-02",
    "time_created": "12:46:30",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ynla",
    "parent_id": "t1_dp8x9x5",
    "subreddit_name_prefixed": "r/news",
    "body": "Girls parents:  So whats new\n\nguy:  nothing.  I can't do anything since you got me registered as a sex offender\n\nGirls parents: ...",
    "controversiality": 0,
    "ups": 1181,
    "downs": 0,
    "score": 1181,
    "created": 1509673038.0,
    "date_created": "2017-11-02",
    "time_created": "13:37:18",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8zg0k",
    "parent_id": "t1_dp8x9x5",
    "subreddit_name_prefixed": "r/news",
    "body": "Like you wouldn't just cut parents like that out of your life entirely.",
    "controversiality": 0,
    "ups": 128,
    "downs": 0,
    "score": 128,
    "created": 1509673800.0,
    "date_created": "2017-11-02",
    "time_created": "13:50:00",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp93ht5",
    "parent_id": "t1_dp8yx6i",
    "subreddit_name_prefixed": "r/news",
    "body": "That is fucked up.",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1509677774.0,
    "date_created": "2017-11-02",
    "time_created": "14:56:14",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp90k68",
    "parent_id": "t1_dp8yx6i",
    "subreddit_name_prefixed": "r/news",
    "body": "That's sad because most police forces in the UK take a common sense approach and wouldn't bother chasing that for prosecution unless actual abuse was involved. ",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1509674904.0,
    "date_created": "2017-11-02",
    "time_created": "14:08:24",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dpay19l",
    "parent_id": "t1_dp9wd2f",
    "subreddit_name_prefixed": "r/news",
    "body": "my 18 year old nipples looked exactly like my 17 year old nipples it was crazy ",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1509766470.0,
    "date_created": "2017-11-03",
    "time_created": "15:34:30",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp97dmi",
    "parent_id": "t1_dp9798q",
    "subreddit_name_prefixed": "r/news",
    "body": "my “friend” sent them from my phone to boys in my class who talked about it enough that teachers found out and reported it....rough time in my life lol ",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1509681594.0,
    "date_created": "2017-11-02",
    "time_created": "15:59:54",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9bphv",
    "parent_id": "t1_dp91lzn",
    "subreddit_name_prefixed": "r/news",
    "body": "That's not true in any state that I know of. A person under the age of 21 can legally accept alcohol from a parent, legal guardian, or spouse, so long as the adult maintains supervision. Someone will correct me if I'm mistaken, but I believe this holds true for every state in the US. Outside the US it doesn't matter, because the drinking age is 18 or lower basically everywhere else.",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1509686025.0,
    "date_created": "2017-11-02",
    "time_created": "17:13:45",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8u1ml",
    "parent_id": "t1_dp8p88c",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 406,
    "downs": 0,
    "score": 406,
    "created": 1509668586.0,
    "date_created": "2017-11-02",
    "time_created": "12:23:06",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ssnl",
    "parent_id": "t1_dp8p88c",
    "subreddit_name_prefixed": "r/news",
    "body": "\"You have nothing to fear if you have nothing to hide\" is a terrifying popular sentiment. ",
    "controversiality": 0,
    "ups": 419,
    "downs": 0,
    "score": 419,
    "created": 1509667323.0,
    "date_created": "2017-11-02",
    "time_created": "12:02:03",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ts75",
    "parent_id": "t1_dp8p88c",
    "subreddit_name_prefixed": "r/news",
    "body": "Certain  drug offenses already make a person ineligible for a US passport.\n\nI'm not even American and I know this. If you want to stop the police state in your country you need to do something about it, and do it quickly. ",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1509668330.0,
    "date_created": "2017-11-02",
    "time_created": "12:18:50",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xrxo",
    "parent_id": "t1_dp8p88c",
    "subreddit_name_prefixed": "r/news",
    "body": "The key issue is \"extra-judicial\" punishment. It is cropping up all over the place with everything from sex-offenders to traffic violations. Fines, penalties and in this case branded for life, not by a judge or jury, but  by a mindless and indiscriminate law passed by politicians.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1509672200.0,
    "date_created": "2017-11-02",
    "time_created": "13:23:20",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8v8nx",
    "parent_id": "t1_dp8uo5g",
    "subreddit_name_prefixed": "r/news",
    "body": "Sorry -- International Megan's Law. It's the legislation that spawned the marking of passports.",
    "controversiality": 0,
    "ups": 58,
    "downs": 0,
    "score": 58,
    "created": 1509669750.0,
    "date_created": "2017-11-02",
    "time_created": "12:42:30",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp91apu",
    "parent_id": "t1_dp917hg",
    "subreddit_name_prefixed": "r/news",
    "body": "[Yup!](http://www.thestranger.com/slog/2017/09/14/25415386/state-supreme-court-ruling-means-washington-teens-who-sext-could-end-up-felons)\n\nBut, given the comments in this thread, this kind of casual overreach isn't really surprising. Say sex offender and most civil liberties types pipe down real fast.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1509675624.0,
    "date_created": "2017-11-02",
    "time_created": "14:20:24",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xg77",
    "parent_id": "t1_dp8wx42",
    "subreddit_name_prefixed": "r/news",
    "body": "That would definitely scare me straight lol ",
    "controversiality": 0,
    "ups": 131,
    "downs": 0,
    "score": 131,
    "created": 1509671891.0,
    "date_created": "2017-11-02",
    "time_created": "13:18:11",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xnif",
    "parent_id": "t1_dp8wx42",
    "subreddit_name_prefixed": "r/news",
    "body": "In my most recent (sophomore HS) religion class, they did say this. My hormonal glands completely shut down.",
    "controversiality": 0,
    "ups": 59,
    "downs": 0,
    "score": 59,
    "created": 1509672084.0,
    "date_created": "2017-11-02",
    "time_created": "13:21:24",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ygtr",
    "parent_id": "t1_dp8wx42",
    "subreddit_name_prefixed": "r/news",
    "body": "Or perhaps instead of modifying sex Ed, we modify this stupid fucking law ",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1509672857.0,
    "date_created": "2017-11-02",
    "time_created": "13:34:17",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8zder",
    "parent_id": "t1_dp8xznk",
    "subreddit_name_prefixed": "r/news",
    "body": "It's not the country primarily, mostly it's different state laws. But yes, fuck those ones. Some states are absolutely fine or as close as you can be in such a hard to negotiate area. Others are not.\n\nPersonally, I like the idea of different states being able to have different laws in general - although not applying them to federal documents like the passport, but the way it works out practically is often upsetting.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1509673730.0,
    "date_created": "2017-11-02",
    "time_created": "13:48:50",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xof8",
    "parent_id": "t1_dp8x480",
    "subreddit_name_prefixed": "r/news",
    "body": "The thing about that is when people become parents, or just adults in general, they start selectively remembering things or applying double standards.\n\nPeople that fucked around will suddenly look back on themselves being puritan angels that never stepped wrong, were super humble and didn't even get horny until the day they turned 18. They then apply those unrealistic standards to others and complain about how the world is going downhill nowadays because teenagers do what they do. Teenagers of today will do the same for the generation after them, and so on.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1509672108.0,
    "date_created": "2017-11-02",
    "time_created": "13:21:48",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp90aue",
    "parent_id": "t1_dp8y08o",
    "subreddit_name_prefixed": "r/news",
    "body": "Foreign governments could definitely benefit from the information.  \n\nThailand has been fighting a large child sex trade in their county for decades.  Pedophiles literally go over there to have sex with children.  Maybe their government would like to know when a child rapist is coming into their country to potentially abuse children?",
    "controversiality": 0,
    "ups": 1643,
    "downs": 0,
    "score": 1643,
    "created": 1509674642.0,
    "date_created": "2017-11-02",
    "time_created": "14:04:02",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp90i45",
    "parent_id": "t1_dp8y08o",
    "subreddit_name_prefixed": "r/news",
    "body": "This would make sex tourism more visible and use of English teaching positions to abuse children. There have been a couple of cases of convicted sex criminals outed in China teaching children. \n ",
    "controversiality": 0,
    "ups": 259,
    "downs": 0,
    "score": 259,
    "created": 1509674845.0,
    "date_created": "2017-11-02",
    "time_created": "14:07:25",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8yz64",
    "parent_id": "t1_dp8y08o",
    "subreddit_name_prefixed": "r/news",
    "body": "In the UK at least, passports are often used as ID for new jobs, mortgages, etc. so it would cause a lot more problems than just visiting abroad.",
    "controversiality": 0,
    "ups": 118,
    "downs": 0,
    "score": 118,
    "created": 1509673348.0,
    "date_created": "2017-11-02",
    "time_created": "13:42:28",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8y4bh",
    "parent_id": "t1_dp8y08o",
    "subreddit_name_prefixed": "r/news",
    "body": "It doesn't. It let's people feel like they are doing something.",
    "controversiality": 0,
    "ups": 763,
    "downs": 0,
    "score": 763,
    "created": 1509672526.0,
    "date_created": "2017-11-02",
    "time_created": "13:28:46",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp951nf",
    "parent_id": "t1_dp8y08o",
    "subreddit_name_prefixed": "r/news",
    "body": ">It's even more limited if you're a sex offender, what actual good does putting it on the passport do?\n\nWarning authorities in Third World countries of people like [**Gary Glitter** (wikipedia)](https://en.wikipedia.org/wiki/Gary_Glitter#Southeast_Asia).",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1509679280.0,
    "date_created": "2017-11-02",
    "time_created": "15:21:20",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8x83c",
    "parent_id": "t1_dp8wev2",
    "subreddit_name_prefixed": "r/news",
    "body": "> I have no problem with actual sex offenders ( people who abuse and assault actual kids) \n\n-- /u/leegilley87",
    "controversiality": 0,
    "ups": 1300,
    "downs": 0,
    "score": 1300,
    "created": 1509671670.0,
    "date_created": "2017-11-02",
    "time_created": "13:14:30",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ztxf",
    "parent_id": "t1_dp8wev2",
    "subreddit_name_prefixed": "r/news",
    "body": "This is why I like Iowa's age of consent law. Last I saw at least age of consent is 16 or 17, but if you're both that age or under its 14. Its not a perfect system, but prevents some high school kids from having their lives ruined for fooling around. ",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1509674178.0,
    "date_created": "2017-11-02",
    "time_created": "13:56:18",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp995ru",
    "parent_id": "t1_dp8wev2",
    "subreddit_name_prefixed": "r/news",
    "body": "My brother is one of these cases, he was 18, she was 16. He now has a cop come and check in on him and interview his 6-12 year old daughters once a year. He's had the same job for 20 years because of the stigma. \n\nWe go a little overboard sometimes in society.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1509683400.0,
    "date_created": "2017-11-02",
    "time_created": "16:30:00",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8uh4t",
    "parent_id": "t1_dp8toou",
    "subreddit_name_prefixed": "r/news",
    "body": "pfff get outta here, of course not",
    "controversiality": 0,
    "ups": 138,
    "downs": 0,
    "score": 138,
    "created": 1509669003.0,
    "date_created": "2017-11-02",
    "time_created": "12:30:03",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9hkp6",
    "parent_id": "t1_dp9btkq",
    "subreddit_name_prefixed": "r/news",
    "body": "Agreed. Suspend the streaker, let masturbation be (he was caught accidentally and really all of us could’ve caught a charge if it were us), and keep the teens from fucking in middle school. No need to punish them from 10 years to a lifetime. \n\nLifetime registration is akin to a life sentence served in the world. There is no way to repay the debt and live a life beyond that if we brand them this way. When these kids are 40, 50, 60 they will still be living the consequences from their teenage years and they hurt nobody. ",
    "controversiality": 0,
    "ups": 53,
    "downs": 0,
    "score": 53,
    "created": 1509692698.0,
    "date_created": "2017-11-02",
    "time_created": "19:04:58",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9kxic",
    "parent_id": "t1_dp9btkq",
    "subreddit_name_prefixed": "r/news",
    "body": ">Why was he required to register and she wasn't? If they both did it, and if he didn't force himself on her (I assume he didn't?), shouldn't they both be required to register?\n\nBecause the justice system is tilted against men and boys often and regularly. Systemic sexism.",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1509696682.0,
    "date_created": "2017-11-02",
    "time_created": "20:11:22",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9nxao",
    "parent_id": "t1_dp9btkq",
    "subreddit_name_prefixed": "r/news",
    "body": "> Why was he required to register and she wasn't? If they both did it, and if he didn't force himself on her (I assume he didn't?), shouldn't they both be required to register?\n\nThat's like asking why women aren't charged with rape when some guy sleeps with them when they're both drunk and unable to consent.  ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1509700236.0,
    "date_created": "2017-11-02",
    "time_created": "21:10:36",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8umq5",
    "parent_id": "t1_dp8smu8",
    "subreddit_name_prefixed": "r/news",
    "body": "Apparently you guys in Quebec aren't fucking nuts.",
    "controversiality": 0,
    "ups": 1194,
    "downs": 0,
    "score": 1194,
    "created": 1509669156.0,
    "date_created": "2017-11-02",
    "time_created": "12:32:36",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ub7t",
    "parent_id": "t1_dp8smu8",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1509668843.0,
    "date_created": "2017-11-02",
    "time_created": "12:27:23",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8v754",
    "parent_id": "t1_dp8taym",
    "subreddit_name_prefixed": "r/news",
    "body": "Did the guy plead guilty or did he go to trial? I don't see how a jury could find a guy guilty on this. \n\nIt is like you tricked someone into breaking into my house and I shot the person. Would I get in trouble for shooting a burglar? I don't think I would.",
    "controversiality": 0,
    "ups": 149,
    "downs": 0,
    "score": 149,
    "created": 1509669710.0,
    "date_created": "2017-11-02",
    "time_created": "12:41:50",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp927fh",
    "parent_id": "t1_dp8xtoy",
    "subreddit_name_prefixed": "r/news",
    "body": "The most likely answer is that either the commentor lied to some extent (fudging/fabricating details or just making the entire story up wholecloth) or their brother-in-law's lawyer tried to make that argument in court and it was simply knocked down due to lack of proof, the sister having her IDs on her at the time it happened, her obviously not looking like her sister, her obviously looking underaged, etc, and they simply chose to ignore the invalidity of the defense in favor of maintaining their belief of their brother-in-law's innocence.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1509676512.0,
    "date_created": "2017-11-02",
    "time_created": "14:35:12",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8v2q4",
    "parent_id": "t1_dp8rkzt",
    "subreddit_name_prefixed": "r/news",
    "body": "Make them a sex offender too. Knowingly ruining someones life should have the same repercussions ",
    "controversiality": 0,
    "ups": 146,
    "downs": 0,
    "score": 146,
    "created": 1509669592.0,
    "date_created": "2017-11-02",
    "time_created": "12:39:52",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8t52p",
    "parent_id": "t1_dp8ryoo",
    "subreddit_name_prefixed": "r/news",
    "body": "But there are some girls that look way younger than they are. Shouldnt punish ppl for trying to be sure ",
    "controversiality": 0,
    "ups": 233,
    "downs": 0,
    "score": 233,
    "created": 1509667677.0,
    "date_created": "2017-11-02",
    "time_created": "12:07:57",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8w4fa",
    "parent_id": "t1_dp8ryoo",
    "subreddit_name_prefixed": "r/news",
    "body": "I've ID'd my date before because I wasn't sure.  What class did you have on facial identification with age.  This was in my older teens, early twenties.  Our sergeants warned us to card our dates because the local girls liked to \"score points\" by dating soldiers.\n\nSaved my butt one time, the girl wasn't able to produce an ID, I walked away.  Found out later she was 14.",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1509670603.0,
    "date_created": "2017-11-02",
    "time_created": "12:56:43",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8tkfd",
    "parent_id": "t1_dp8ryoo",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm 24, yet often people think I'm a minor because I don't look like a 24 years old, not even an 18 year old. It's quite possible for certain people to look much younger/older thna they actually are.",
    "controversiality": 0,
    "ups": 110,
    "downs": 0,
    "score": 110,
    "created": 1509668113.0,
    "date_created": "2017-11-02",
    "time_created": "12:15:13",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8uchy",
    "parent_id": "t1_dp8ryoo",
    "subreddit_name_prefixed": "r/news",
    "body": "One of my old girlfriends when I was in my mid-20s looked like she was still in high school, and I got dirty looks and raised eyebrows constantly. Nevermind the fact that we graduated high school the same year\n\nI'd also get dirty looks helping out with her at her mom's school running activity tables; I'd sit there coloring with kids or playing with Mr Potato Heads until a timer went off. Eventually her mom told me I couldn't go help cause parents complained that I was a potential molester. It's really fucking depressing to be told parents think you're a child molester.\n\nOur system for sex offenders is fucked. I wouldn't wish this on anyone.",
    "controversiality": 0,
    "ups": 93,
    "downs": 0,
    "score": 93,
    "created": 1509668879.0,
    "date_created": "2017-11-02",
    "time_created": "12:27:59",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8tmak",
    "parent_id": "t1_dp8ryoo",
    "subreddit_name_prefixed": "r/news",
    "body": "On the other hand, should men and women that naturally look young not be allowed to have sex because of that?  ",
    "controversiality": 0,
    "ups": 75,
    "downs": 0,
    "score": 75,
    "created": 1509668164.0,
    "date_created": "2017-11-02",
    "time_created": "12:16:04",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ue57",
    "parent_id": "t1_dp8ryoo",
    "subreddit_name_prefixed": "r/news",
    "body": "Sounds like she proffered the ID to alleviate any unspoken doubts.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1509668923.0,
    "date_created": "2017-11-02",
    "time_created": "12:28:43",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8v1fw",
    "parent_id": "t1_dp8qii5",
    "subreddit_name_prefixed": "r/news",
    "body": "Yes. Any justice system that convicts the guilty will have a (hopefully) small chance of wrongful conviction. It's inherent in any imperfect decision-system that there are Type-I (false positive) and Type-II (false negative) results.\n\nWhat we do is stack it towards making false negative results (acquitting the guilty) rather than false positives (convicting the innocent). But it irks me when people say \"should we let people be wrongfully convicted\". It's like \"should we let people crash cars\".\n\nSee also [N Guilty Men](http://www2.law.ucla.edu/volokh/guilty.htm)",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1509669559.0,
    "date_created": "2017-11-02",
    "time_created": "12:39:19",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wyzj",
    "parent_id": "t1_dp8s92x",
    "subreddit_name_prefixed": "r/news",
    "body": "Shockingly, large amounts of people obviously do continue to support it.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1509671423.0,
    "date_created": "2017-11-02",
    "time_created": "13:10:23",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9f9po",
    "parent_id": "t1_dp8xnf2",
    "subreddit_name_prefixed": "r/news",
    "body": "It's political suicide not because ~~you're~~ your average person thinks that the 16 year old boy who sexted his 15 year old girlfriend should be considered a child rapist forever. It's because the moment a politician is like \"let's look at fixing these laws\" their opponents will plaster the TV with ads going \"MR POLITICAN WANTS TO SEND SEX OFFENDERS INTO YOUR CHILDREN'S SCHOOLS!\" And it doesn't *matter* if that's stupidly misleading - it will still have a negative impact on Mr Politican's chances of re-election.\n\nEdit: you're/your",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1509689988.0,
    "date_created": "2017-11-02",
    "time_created": "18:19:48",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp91x6r",
    "parent_id": "t1_dp8xnf2",
    "subreddit_name_prefixed": "r/news",
    "body": "On the flip side, we have people who want to end peoples careers over allegations. ",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1509676230.0,
    "date_created": "2017-11-02",
    "time_created": "14:30:30",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ssle",
    "parent_id": "t1_dp8s8yv",
    "subreddit_name_prefixed": "r/news",
    "body": "Hmmm that could work. I'm thinking a deep red color, perhaps...ruby? No..that's not right..",
    "controversiality": 0,
    "ups": 336,
    "downs": 0,
    "score": 336,
    "created": 1509667322.0,
    "date_created": "2017-11-02",
    "time_created": "12:02:02",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8v0et",
    "parent_id": "t1_dp8s8yv",
    "subreddit_name_prefixed": "r/news",
    "body": "But I think pedophiles already like a \"little a\"",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1509669530.0,
    "date_created": "2017-11-02",
    "time_created": "12:38:50",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8y8o8",
    "parent_id": "t1_dp8snoj",
    "subreddit_name_prefixed": "r/news",
    "body": "\"J\" for jaywalking, \"J\" for jumping on a baby, \"J\" for jizzing in a public place...",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1509672639.0,
    "date_created": "2017-11-02",
    "time_created": "13:30:39",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8r6eb",
    "parent_id": "t1_dp8qxt6",
    "subreddit_name_prefixed": "r/news",
    "body": "It probably has to do with trying to curb sex trafficking. If someone is traveling with a child they might not automatically guess it’s their son/daughter if they are labeled as a child sex offender. ",
    "controversiality": 0,
    "ups": 567,
    "downs": 0,
    "score": 567,
    "created": 1509665696.0,
    "date_created": "2017-11-02",
    "time_created": "11:34:56",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8rr2k",
    "parent_id": "t1_dp8qxt6",
    "subreddit_name_prefixed": "r/news",
    "body": "I was threatened with a spot on the sex offender registry for pissing in a bush, 500' from the road, with my back turned.",
    "controversiality": 0,
    "ups": 95,
    "downs": 0,
    "score": 95,
    "created": 1509666279.0,
    "date_created": "2017-11-02",
    "time_created": "11:44:39",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8slu6",
    "parent_id": "t1_dp8qxt6",
    "subreddit_name_prefixed": "r/news",
    "body": "So an 18 year old guy who had consensual sex with his 17 year old girl friend, but mom and dad hate his guts and press charges and he’s labeled as a sex offender should be treated differently when traveling abroad after being labeled as a sex offender?\n\nLet other countries determine the worth or lack of worth of people on their own. We don’t need our fucked up judicial system placing shame on people where it shouldn’t be.... we can’t even properly arrest people and you want us to warn other countries of their wrong doing? 45 year old gets 10 years for possession of marijuana for personal use. 25 year old gets a fine and 6 months or even just probation for embezzling thousands to millions & evading taxes... the answer is no, no crime should be on passports. \n\n(And before I get downvoted to oblivion, I don’t disagree that people charged with heinous crimes against society shouldn’t be put on a stake in front of the world for all to see their disgusting wrong doings... Mr 40 year old that molested that 12 year old should most certainly be shamed for his actions, but there’s too many “exceptions” to the rules to make it something practical without a complete restructuring of the judicial system.)",
    "controversiality": 0,
    "ups": 90,
    "downs": 0,
    "score": 90,
    "created": 1509667131.0,
    "date_created": "2017-11-02",
    "time_created": "11:58:51",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ravp",
    "parent_id": "t1_dp8qxt6",
    "subreddit_name_prefixed": "r/news",
    "body": "What about the 18 year old whose 16 year old girlfriend's parents turned his life into hell ",
    "controversiality": 0,
    "ups": 156,
    "downs": 0,
    "score": 156,
    "created": 1509665825.0,
    "date_created": "2017-11-02",
    "time_created": "11:37:05",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8yro4",
    "parent_id": "t1_dp8sapz",
    "subreddit_name_prefixed": "r/news",
    "body": "As a Canadian with multiple unpardoned DUIs, (not proud, was a dumb kid) this isn't true. I've crossed the border driving multiple times, including having a breathalyzer in the vehicle. I've also flown across repeatedly. The distinction is they MAY deny entry. Every time I've crossed into the US they ask if I have any criminal convictions. I've always been honest and they've always let me in. \n\nI'm still really anxious every time. They'd be perfectly within their rights to deny my entry. I've been lucky that I haven't run into an agent having a bad day.",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1509673145.0,
    "date_created": "2017-11-02",
    "time_created": "13:39:05",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8uu33",
    "parent_id": "t1_dp8rvso",
    "subreddit_name_prefixed": "r/news",
    "body": "\"rehabilitation\" just means you've been 10 years post-sentence and haven't reoffended",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1509669357.0,
    "date_created": "2017-11-02",
    "time_created": "12:35:57",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8tdhn",
    "parent_id": "t1_dp8sb13",
    "subreddit_name_prefixed": "r/news",
    "body": "Actually driving around on a mopad while intoxicated is a way more common reason to go there than being a pedo...",
    "controversiality": 0,
    "ups": 92,
    "downs": 0,
    "score": 92,
    "created": 1509667916.0,
    "date_created": "2017-11-02",
    "time_created": "12:11:56",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp91ahj",
    "parent_id": "t1_dp90tu8",
    "subreddit_name_prefixed": "r/news",
    "body": "Keep in mind Sheriff Grady Judd is Florida's version of Joe Arpaio.  But yes, Florida's distance requirements for sex offenders results in a situation where those released cannot lead productive lives and are far, far more likely to re-offend.",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1509675618.0,
    "date_created": "2017-11-02",
    "time_created": "14:20:18",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp93iw8",
    "parent_id": "t1_dp90tu8",
    "subreddit_name_prefixed": "r/news",
    "body": "i mean, constantly tracking them for life is just...some seriously dystopian shit to me though. limiting when they can leave their house and where to go, idk i just...it makes me very uneasy that we allow the gov't to legislate that. ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1509677803.0,
    "date_created": "2017-11-02",
    "time_created": "14:56:43",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8rc4i",
    "parent_id": "t1_dp8q71d",
    "subreddit_name_prefixed": "r/news",
    "body": "It is an emotional response because who does not want to keep kids safe? Politicians get a few brownie points, but it's business as usual for what they are actually trying to stop, aka child sex trafficking. \n\nThey have not made a dent in my opinion ",
    "controversiality": 0,
    "ups": 246,
    "downs": 0,
    "score": 246,
    "created": 1509665860.0,
    "date_created": "2017-11-02",
    "time_created": "11:37:40",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8qysw",
    "parent_id": "t1_dp8q71d",
    "subreddit_name_prefixed": "r/news",
    "body": "There should be a system to be able to clean your title, and the degree of offense should be taken into account, but they should definitely be openly registered otherwise. ",
    "controversiality": 0,
    "ups": 676,
    "downs": 0,
    "score": 676,
    "created": 1509665482.0,
    "date_created": "2017-11-02",
    "time_created": "11:31:22",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8t8b4",
    "parent_id": "t1_dp8s6p4",
    "subreddit_name_prefixed": "r/news",
    "body": "I really don't think you are in the minority on that ",
    "controversiality": 0,
    "ups": 493,
    "downs": 0,
    "score": 493,
    "created": 1509667768.0,
    "date_created": "2017-11-02",
    "time_created": "12:09:28",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8tnak",
    "parent_id": "t1_dp8s6p4",
    "subreddit_name_prefixed": "r/news",
    "body": "I always wondered if “sex offenders” that only got caught pissing do a whole spiel when they notify their neighbors. Like,   \n“Hi, I’m required to inform you that I am a registered sex offender-*waitwaitwaitwait,* not the “bad” kind, just pissing outside, not like “child rape” or anything. Just to be clear. So we’re cool, right?",
    "controversiality": 0,
    "ups": 87,
    "downs": 0,
    "score": 87,
    "created": 1509668192.0,
    "date_created": "2017-11-02",
    "time_created": "12:16:32",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8uc91",
    "parent_id": "t1_dp8s6p4",
    "subreddit_name_prefixed": "r/news",
    "body": "Don't forget arson.  Yes. Arsonists are listed as  290 registrants.  ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1509668872.0,
    "date_created": "2017-11-02",
    "time_created": "12:27:52",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8urbe",
    "parent_id": "t1_dp8s6p4",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm glad that in some states you don't get a sex offender charge for public urination and just a ticket. like sorry, if I'm about to pop I'm gonna find a secluded spot and take a piss, it's a basic human necessity. but, there is obviously a huge difference between going behind a dumpster or a tree and just wipping it out on a crowded sidewalk. the differences should be treated as such. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1509669281.0,
    "date_created": "2017-11-02",
    "time_created": "12:34:41",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8twcv",
    "parent_id": "t1_dp8qalz",
    "subreddit_name_prefixed": "r/news",
    "body": "I’d be interested as well. I’ve heard people mention this for decades, but it feels similar to the “what about false rape accusations?” argument. Yeah, it exists, but I’d like to see statistics suggesting it compromises a significant portion. ",
    "controversiality": 0,
    "ups": 75,
    "downs": 0,
    "score": 75,
    "created": 1509668443.0,
    "date_created": "2017-11-02",
    "time_created": "12:20:43",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8uu7v",
    "parent_id": "t1_dp8qalz",
    "subreddit_name_prefixed": "r/news",
    "body": "Totally anecdotal, but I was in charge of registering sex offenders in a small town in CO. We had 94 active sex offender *registrants. 0 registrations were due to public urination. 3 registrants were women. 2 registrants were African American. The remaining 89 registrants were straight white males. \n\nAnd not to beat a dead horse, but 0 registrants were transgendered.\n\n*edit",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1509669361.0,
    "date_created": "2017-11-02",
    "time_created": "12:36:01",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8tpgo",
    "parent_id": "t1_dp8s806",
    "subreddit_name_prefixed": "r/news",
    "body": "That's not just your opinion. It's well documented that harsher penalties for less severe crimes just creates more severe offenders",
    "controversiality": 0,
    "ups": 48,
    "downs": 0,
    "score": 48,
    "created": 1509668253.0,
    "date_created": "2017-11-02",
    "time_created": "12:17:33",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8tm6x",
    "parent_id": "t1_dp8s806",
    "subreddit_name_prefixed": "r/news",
    "body": "The American justice system in a nutshell.",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1509668161.0,
    "date_created": "2017-11-02",
    "time_created": "12:16:01",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8z6he",
    "parent_id": "t1_dp8vxgm",
    "subreddit_name_prefixed": "r/news",
    "body": "> two women there using the sink\n\nI read this like they were pissing in the sink.",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1509673545.0,
    "date_created": "2017-11-02",
    "time_created": "13:45:45",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8vwvf",
    "parent_id": "t1_dp8siuf",
    "subreddit_name_prefixed": "r/news",
    "body": "This wouldn't even be a possible scenario in almost any state that I can think of. There's like, nine states that have 18 as an age of consent and most of them still have Romeo and Juliet stuff on the books to prevent this exact scenario.\n\n\nIn my home state of Texas for example, you can't get in trouble if they're below age of consent (17) if you're within three years of their age.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1509670400.0,
    "date_created": "2017-11-02",
    "time_created": "12:53:20",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8p0lu",
    "parent_id": "t1_dp8oqe3",
    "subreddit_name_prefixed": "r/news",
    "body": "You monster.  \n\n",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1509663476.0,
    "date_created": "2017-11-02",
    "time_created": "10:57:56",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ove2",
    "parent_id": "t1_dp8oqe3",
    "subreddit_name_prefixed": "r/news",
    "body": "I see you are a man of culture.",
    "controversiality": 0,
    "ups": 61,
    "downs": 0,
    "score": 61,
    "created": 1509663322.0,
    "date_created": "2017-11-02",
    "time_created": "10:55:22",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8svjp",
    "parent_id": "t1_dp8oqe3",
    "subreddit_name_prefixed": "r/news",
    "body": "Corn on a Hawaiian pizza? You're a monster.\n\nNow, put some *jalapenos* on that Hawaiian, and now we're talkin'.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1509667405.0,
    "date_created": "2017-11-02",
    "time_created": "12:03:25",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8tsd1",
    "parent_id": "t1_dp8sha1",
    "subreddit_name_prefixed": "r/news",
    "body": ">because it happened to a boy near my house. \n\nwhat. the. fuck.",
    "controversiality": 0,
    "ups": 208,
    "downs": 0,
    "score": 208,
    "created": 1509668335.0,
    "date_created": "2017-11-02",
    "time_created": "12:18:55",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8tpdf",
    "parent_id": "t1_dp8sha1",
    "subreddit_name_prefixed": "r/news",
    "body": "That's so horrifying. I can't being to fathom the effects it must have had on the people involved. \n\nThank you for sharing, even though it was difficult to read. I think you made it very clear. ",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1509668251.0,
    "date_created": "2017-11-02",
    "time_created": "12:17:31",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8vp5u",
    "parent_id": "t1_dp8tzxd",
    "subreddit_name_prefixed": "r/news",
    "body": "Example: Guy who got put on the T1 (most serious) list for drunken public urination near a school. On the weekend. At night. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1509670191.0,
    "date_created": "2017-11-02",
    "time_created": "12:49:51",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ydoi",
    "parent_id": "t1_dp8x8yq",
    "subreddit_name_prefixed": "r/news",
    "body": "The same thing happens in rural Canada. They get away with horrible shit because they target the weakest kids, too. ",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1509672773.0,
    "date_created": "2017-11-02",
    "time_created": "13:32:53",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8slfb",
    "parent_id": "t1_dp8rp28",
    "subreddit_name_prefixed": "r/news",
    "body": "both valid thought processes.   I am a strong proponent of \"served your time, your debt is paid\".   But recidivism rates in certain types of crime contradict that, and its hard to argue with facts.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1509667120.0,
    "date_created": "2017-11-02",
    "time_created": "11:58:40",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8w9sm",
    "parent_id": "t1_dp8vsq0",
    "subreddit_name_prefixed": "r/news",
    "body": "This 100%. Lawmakers have no incentive to pass laws other than immediately after a tragedy. Otherwise, all they need is pork and to take the instructions of the party and they've got themselves a job for life. ",
    "controversiality": 0,
    "ups": 1530,
    "downs": 0,
    "score": 1530,
    "created": 1509670745.0,
    "date_created": "2017-11-02",
    "time_created": "12:59:05",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8w8i7",
    "parent_id": "t1_dp8vsq0",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 396,
    "downs": 0,
    "score": 396,
    "created": 1509670711.0,
    "date_created": "2017-11-02",
    "time_created": "12:58:31",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8w8nc",
    "parent_id": "t1_dp8vsq0",
    "subreddit_name_prefixed": "r/news",
    "body": "Some people are also elected as a visceral reaction to events.",
    "controversiality": 0,
    "ups": 108,
    "downs": 0,
    "score": 108,
    "created": 1509670714.0,
    "date_created": "2017-11-02",
    "time_created": "12:58:34",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wxc7",
    "parent_id": "t1_dp8vsq0",
    "subreddit_name_prefixed": "r/news",
    "body": "Yup. If they change the charges news headlines will read \"[lawmaker] wants to lighten penalties for child sex offenders.\" or some bullshit like that ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1509671379.0,
    "date_created": "2017-11-02",
    "time_created": "13:09:39",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp90tx5",
    "parent_id": "t1_dp8vw39",
    "subreddit_name_prefixed": "r/news",
    "body": "Yup. \n\n\"Sex offender? oh you must be some creepy old man who touched kids, fuck you!\" \n\n\n\"but I'm a 37 year old doctor who drunkenly urinated in public during college\"\n\n\n\nContext and shades of gray mean nothing to the court of public opinion ",
    "controversiality": 0,
    "ups": 110,
    "downs": 0,
    "score": 110,
    "created": 1509675172.0,
    "date_created": "2017-11-02",
    "time_created": "14:12:52",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8x8ep",
    "parent_id": "t1_dp8wegx",
    "subreddit_name_prefixed": "r/news",
    "body": "While that's true, I think if more and more cases happen like they have, even those families will be devastated when they're innocent little angel gets thrown in prison.\n\nWho knows.",
    "controversiality": 0,
    "ups": 157,
    "downs": 0,
    "score": 157,
    "created": 1509671678.0,
    "date_created": "2017-11-02",
    "time_created": "13:14:38",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9eqvc",
    "parent_id": "t1_dp8x2bz",
    "subreddit_name_prefixed": "r/news",
    "body": "It's the car alarm effect, no one cares about car alarms because they go off all the time for bogus reasons.",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1509689265.0,
    "date_created": "2017-11-02",
    "time_created": "18:07:45",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9g0df",
    "parent_id": "t1_dp8x2bz",
    "subreddit_name_prefixed": "r/news",
    "body": "Sort of a twisted version of Syndrome's point in The Incredibles?\n\nWhen everyone's a sex offender...no one is.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1509690861.0,
    "date_created": "2017-11-02",
    "time_created": "18:34:21",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wdbe",
    "parent_id": "t1_dp8w054",
    "subreddit_name_prefixed": "r/news",
    "body": "A snowball's chance in hell any politician will ever publicly campaign for loosening up sex offender laws. Most people want these to be _more_ strict and punishing, not less.",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1509670840.0,
    "date_created": "2017-11-02",
    "time_created": "13:00:40",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8yu05",
    "parent_id": "t1_dp8wthw",
    "subreddit_name_prefixed": "r/news",
    "body": "The way it's been explained to me, attempted suicide is only illegal so that the police can intervene.",
    "controversiality": 0,
    "ups": 55,
    "downs": 0,
    "score": 55,
    "created": 1509673208.0,
    "date_created": "2017-11-02",
    "time_created": "13:40:08",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ysjf",
    "parent_id": "t1_dp8wthw",
    "subreddit_name_prefixed": "r/news",
    "body": "Most places they don't actually punish people who are attempting suicide, but the law is made so that if it is called in that someone may kill themselves the police can break down the door and potentially save them with the justification of a \"crime in progress.\" Otherwise they open themselves up to being sued for unlawfully entering a person's home.",
    "controversiality": 0,
    "ups": 108,
    "downs": 0,
    "score": 108,
    "created": 1509673169.0,
    "date_created": "2017-11-02",
    "time_created": "13:39:29",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8vzfh",
    "parent_id": "t1_dp8vhmv",
    "subreddit_name_prefixed": "r/news",
    "body": "Charged as an adult for a crime that is only a crime because you're a minor, wtf?",
    "controversiality": 0,
    "ups": 374,
    "downs": 0,
    "score": 374,
    "created": 1509670469.0,
    "date_created": "2017-11-02",
    "time_created": "12:54:29",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8vp81",
    "parent_id": "t1_dp8vhmv",
    "subreddit_name_prefixed": "r/news",
    "body": "Prosecutorial discretion exists.\n\nSo, fuck the DA.",
    "controversiality": 0,
    "ups": 285,
    "downs": 0,
    "score": 285,
    "created": 1509670192.0,
    "date_created": "2017-11-02",
    "time_created": "12:49:52",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wqbl",
    "parent_id": "t1_dp8vhmv",
    "subreddit_name_prefixed": "r/news",
    "body": "'Your child-self did not have the capacity to consent to what your adult-self did.' Hilarious logic, especially if it's 17 versus 18.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1509671190.0,
    "date_created": "2017-11-02",
    "time_created": "13:06:30",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8w4d1",
    "parent_id": "t1_dp8vhmv",
    "subreddit_name_prefixed": "r/news",
    "body": "Doing your job to the letter can be evil.  In fact it's a *special kind* of evil.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1509670601.0,
    "date_created": "2017-11-02",
    "time_created": "12:56:41",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wigy",
    "parent_id": "t1_dp8vhmv",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm not the sharpest tool in the shed, so maybe I'm misunderstanding, but... the fact that the person taking the photo of themselves is a *child* makes it child pornography, so how can they be charged as an adult?  If you're an adult, it's not child pornography?  How can they have it both ways?",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1509670980.0,
    "date_created": "2017-11-02",
    "time_created": "13:03:00",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp90hoh",
    "parent_id": "t1_dp8ynla",
    "subreddit_name_prefixed": "r/news",
    "body": "Girl's Parents: Why don't you get a job and buy a house, you lazy millennial?",
    "controversiality": 0,
    "ups": 696,
    "downs": 0,
    "score": 696,
    "created": 1509674833.0,
    "date_created": "2017-11-02",
    "time_created": "14:07:13",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp90vxq",
    "parent_id": "t1_dp8zg0k",
    "subreddit_name_prefixed": "r/news",
    "body": "Even if they were guilty as hell and tried to make up for it, there's literally nothing they can do. There's zero recourse, zero sense at all when it comes to these laws.",
    "controversiality": 0,
    "ups": 100,
    "downs": 0,
    "score": 100,
    "created": 1509675227.0,
    "date_created": "2017-11-02",
    "time_created": "14:13:47",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp98to0",
    "parent_id": "t1_dp93ht5",
    "subreddit_name_prefixed": "r/news",
    "body": "I know right.\n\nImagine having to be upfront and tell pretty much everyone that you are on the sex offenders register purely because you're on there for a shitty reason, so they don't find out independently and assume the worst.\n\n\"So you don't think the worst of me, I've got to tell you that I'm on the ex offenders register...\"\n\nOn a totally unrelated note, they gave me a turtle.  He's great, I'll always like that couple for that.",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1509683057.0,
    "date_created": "2017-11-02",
    "time_created": "16:24:17",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp90xtc",
    "parent_id": "t1_dp90k68",
    "subreddit_name_prefixed": "r/news",
    "body": "I never dug deeper, but I get the impression that it was her parents that pushed the issue.\n\nThey don't hide it, mainly because I think they want the whole truth about it out there just in case someone comes across his conviction and suddenly thinks he's a danger to their kids.\n\nThey just don't want anyone stumbling across the fact without knowing the whole situation. ",
    "controversiality": 0,
    "ups": 58,
    "downs": 0,
    "score": 58,
    "created": 1509675276.0,
    "date_created": "2017-11-02",
    "time_created": "14:14:36",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp93fb7",
    "parent_id": "t1_dp90k68",
    "subreddit_name_prefixed": "r/news",
    "body": "Unfortunately \"common sense\" approach makes it really easy to intentionally and unintentionally pick and choose who to charge based on bigotry. It's far better if the laws themselves take these situations into account.",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1509677705.0,
    "date_created": "2017-11-02",
    "time_created": "14:55:05",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp97he4",
    "parent_id": "t1_dp97dmi",
    "subreddit_name_prefixed": "r/news",
    "body": "Wow that \"friend\" is an asshole",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1509681699.0,
    "date_created": "2017-11-02",
    "time_created": "16:01:39",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9lrhd",
    "parent_id": "t1_dp97dmi",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah, your friend should have been the one getting in trouble for distributing it.",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1509697672.0,
    "date_created": "2017-11-02",
    "time_created": "20:27:52",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8w3y1",
    "parent_id": "t1_dp8u1ml",
    "subreddit_name_prefixed": "r/news",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 192,
    "downs": 0,
    "score": 192,
    "created": 1509670591.0,
    "date_created": "2017-11-02",
    "time_created": "12:56:31",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8v68r",
    "parent_id": "t1_dp8ssnl",
    "subreddit_name_prefixed": "r/news",
    "body": "People who say this should be forced to remove the door from their shitter, and have all their mail sent in transparent envelopes.",
    "controversiality": 0,
    "ups": 267,
    "downs": 0,
    "score": 267,
    "created": 1509669686.0,
    "date_created": "2017-11-02",
    "time_created": "12:41:26",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8vjv4",
    "parent_id": "t1_dp8ssnl",
    "subreddit_name_prefixed": "r/news",
    "body": "\"If you never make mistakes, nobody can hold them against you 20 years later\"",
    "controversiality": 0,
    "ups": 74,
    "downs": 0,
    "score": 74,
    "created": 1509670050.0,
    "date_created": "2017-11-02",
    "time_created": "12:47:30",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp99qga",
    "parent_id": "t1_dp8xg77",
    "subreddit_name_prefixed": "r/news",
    "body": "That's the problem. Some super religious parents legitimately think this. I had a girlfriend with religious parents in highschool and I am sure they would have pulled something like that if we had ever hooked up.   ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1509683997.0,
    "date_created": "2017-11-02",
    "time_created": "16:39:57",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp96ky3",
    "parent_id": "t1_dp8ygtr",
    "subreddit_name_prefixed": "r/news",
    "body": "Yea, that’ll go over well for the re-election campaign of whatever politician is weakening sex offender laws. “Paul Murphy is soft on sex offenders!!!!!!!!!!!11111 Grab your pitchfork!!!!!!”\n\nPretty much it comes down to the majority of our voting population being complete morons whose opinions are easily swayed by a 30 second emotionally charged tv ad and that gets them into the voting booth.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1509680797.0,
    "date_created": "2017-11-02",
    "time_created": "15:46:37",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9831z",
    "parent_id": "t1_dp90aue",
    "subreddit_name_prefixed": "r/news",
    "body": "So I actually joked that Thailand would probably say oh yes more money when letting these pervs in... I just wrote a paper about this for my masters... it’s neoliberalism at its finest. Sex tourism makes up 11% of Thailand’s GDP and it shows no signs of slowing. The only way to fix this problem is to provide equitable options for young girls to get a good education and thus another line of work that is equally as profitable to the family as sex work. Oh also it’s not just our pervy westerners, in Thailand half of all Thai men pay to lose their virginity.  ",
    "controversiality": 0,
    "ups": 427,
    "downs": 0,
    "score": 427,
    "created": 1509682316.0,
    "date_created": "2017-11-02",
    "time_created": "16:11:56",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp90fmd",
    "parent_id": "t1_dp8y4bh",
    "subreddit_name_prefixed": "r/news",
    "body": "This is following what Australia has done, ensured that sex offenders can't travel to large areas of Asia where child prostitution/exploitation is common. It's actually prevented a lot of travel and saved many children from, at least some, exploitation. \n\nNote: Australia is not marking passports, but actively preventing the travel of those with child sex offenses and this is a collaboration with Asian governments/border agencies - particularly Thailand and Vietnam.\n\nLegislation found here: http://www.loc.gov/law/foreign-news/article/australia-legislation-preventing-child-sex-offenders-from-traveling-overseas-enacted/\n\nIt's a new piece of legislation and I do not know of any studies regarding it's impact/effectiveness as of yet. I hope it yields positive results. If you reduce demand of sex tourism then you hopefully reduce supply. \n",
    "controversiality": 0,
    "ups": 783,
    "downs": 0,
    "score": 783,
    "created": 1509674776.0,
    "date_created": "2017-11-02",
    "time_created": "14:06:16",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8zc6i",
    "parent_id": "t1_dp8x83c",
    "subreddit_name_prefixed": "r/news",
    "body": "> Hurt people who truly do nothing wrong.\n\n-- /u/leegilley87",
    "controversiality": 0,
    "ups": 448,
    "downs": 0,
    "score": 448,
    "created": 1509673698.0,
    "date_created": "2017-11-02",
    "time_created": "13:48:18",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xube",
    "parent_id": "t1_dp8x83c",
    "subreddit_name_prefixed": "r/news",
    "body": "Send this to BuzzFeed, they'll eat it up.",
    "controversiality": 0,
    "ups": 171,
    "downs": 0,
    "score": 171,
    "created": 1509672263.0,
    "date_created": "2017-11-02",
    "time_created": "13:24:23",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8yygd",
    "parent_id": "t1_dp8x83c",
    "subreddit_name_prefixed": "r/news",
    "body": "that is hilarious.",
    "controversiality": 0,
    "ups": 54,
    "downs": 0,
    "score": 54,
    "created": 1509673329.0,
    "date_created": "2017-11-02",
    "time_created": "13:42:09",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9268s",
    "parent_id": "t1_dp8ztxf",
    "subreddit_name_prefixed": "r/news",
    "body": "I wish the people who made laws weren't so tragically bad at math that they couldn't do things like create functions that didn't step up and down to make previously legal relationships suddenly illegal on somebody's birthday.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1509676479.0,
    "date_created": "2017-11-02",
    "time_created": "14:34:39",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8vx5s",
    "parent_id": "t1_dp8umq5",
    "subreddit_name_prefixed": "r/news",
    "body": "Eh.... I wouldn't be so sure about that. They also removed all of Karla Homolka's post-release conditions, and she is someone that should not be allowed near children.",
    "controversiality": 0,
    "ups": 260,
    "downs": 0,
    "score": 260,
    "created": 1509670408.0,
    "date_created": "2017-11-02",
    "time_created": "12:53:28",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wx8z",
    "parent_id": "t1_dp8umq5",
    "subreddit_name_prefixed": "r/news",
    "body": "There are so many things that bothers me with americans. How can a country that created so many beautiful things be so fucked up about some things. \n\nI remember the case of the judge that sold children to the local prison. Or the cop that put 8 bullets into the back of an unarmed man.",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1509671376.0,
    "date_created": "2017-11-02",
    "time_created": "13:09:36",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xh06",
    "parent_id": "t1_dp8umq5",
    "subreddit_name_prefixed": "r/news",
    "body": "What’s surprising to me is a guy actually carded a girl before having sex. ",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1509671913.0,
    "date_created": "2017-11-02",
    "time_created": "13:18:33",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8v38d",
    "parent_id": "t1_dp8ub7t",
    "subreddit_name_prefixed": "r/news",
    "body": "Quebec has that little dose of European legal pragmatism that boorish \"hang-draw-and-quarter\" Anglos often lack.",
    "controversiality": 0,
    "ups": 153,
    "downs": 0,
    "score": 153,
    "created": 1509669607.0,
    "date_created": "2017-11-02",
    "time_created": "12:40:07",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8w28x",
    "parent_id": "t1_dp8ub7t",
    "subreddit_name_prefixed": "r/news",
    "body": "think that's all of Canada ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1509670546.0,
    "date_created": "2017-11-02",
    "time_created": "12:55:46",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8w35r",
    "parent_id": "t1_dp8v754",
    "subreddit_name_prefixed": "r/news",
    "body": "afaik it's classed as a strict liability crime, which means all they have to do to convict you is to prove that you did it. whether or not you intended to do it doesn't matter. the jury refusing to convict in this case would be jury nullification.",
    "controversiality": 0,
    "ups": 172,
    "downs": 0,
    "score": 172,
    "created": 1509670571.0,
    "date_created": "2017-11-02",
    "time_created": "12:56:11",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp90qmk",
    "parent_id": "t1_dp8v2q4",
    "subreddit_name_prefixed": "r/news",
    "body": "I saw a story where a 16 year old girl sent pics of herself to her 17yr old BF and was charged with creating and distributing underage pornography. I believe she was put on a sex offender list as well.\n\nSo yeah, lol.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1509675081.0,
    "date_created": "2017-11-02",
    "time_created": "14:11:21",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8y1c6",
    "parent_id": "t1_dp8t52p",
    "subreddit_name_prefixed": "r/news",
    "body": "I know a 14 year old that looks 18 and an 18 year old that looks 14.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1509672447.0,
    "date_created": "2017-11-02",
    "time_created": "13:27:27",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xbs5",
    "parent_id": "t1_dp8t52p",
    "subreddit_name_prefixed": "r/news",
    "body": "And some that look way older. Google Kim Kardashian at 14.",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1509671770.0,
    "date_created": "2017-11-02",
    "time_created": "13:16:10",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wg8o",
    "parent_id": "t1_dp8tkfd",
    "subreddit_name_prefixed": "r/news",
    "body": "I have a coworker who routinely us offered child menus at lunch. Which is creepy when she is surrounded by older dudes in the middle of a work day/school day.\n\nI went to high school with her and she basically looks the same as she did then. We are over 30 now. ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1509670919.0,
    "date_created": "2017-11-02",
    "time_created": "13:01:59",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8x6pr",
    "parent_id": "t1_dp8tkfd",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm 31 in december and if I go cleanshaven I'll look like a college freshman or possibly a senior in high school.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1509671633.0,
    "date_created": "2017-11-02",
    "time_created": "13:13:53",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8x1mw",
    "parent_id": "t1_dp8uchy",
    "subreddit_name_prefixed": "r/news",
    "body": "The really sad part. When it comes to sexual offenses or murder of a child, it is statistically more probable that it will be a parent or a friend of the family that will do those things. It’s much less likely to be a stranger or a distant acquaintance. \n\nOur current political climate has us fearful and separated from our society when we should be working together to make it a better place. \n\n\n",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1509671493.0,
    "date_created": "2017-11-02",
    "time_created": "13:11:33",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xeay",
    "parent_id": "t1_dp8uchy",
    "subreddit_name_prefixed": "r/news",
    "body": "That's not even a sex offender or justice issue; that's a society issue where any man without the presence of a woman is deemed a likely child predator, and even if you're with another lady, you're still presented as a potential threat whenever you interact with children that are not your own.",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1509671838.0,
    "date_created": "2017-11-02",
    "time_created": "13:17:18",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8x5nf",
    "parent_id": "t1_dp8uchy",
    "subreddit_name_prefixed": "r/news",
    "body": "That's cause you're a dude. Taking my nieces to the park I get the rudest looks and have been confronted by police who received 'reports' from concerned passer-bys. Not much you can do... Thank God I don't have to deal with racial descrimination on top of it.  ",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1509671602.0,
    "date_created": "2017-11-02",
    "time_created": "13:13:22",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8x23k",
    "parent_id": "t1_dp8tmak",
    "subreddit_name_prefixed": "r/news",
    "body": "Yes. If you are a small person by nature our puritan laws must take priority over your happiness ",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1509671505.0,
    "date_created": "2017-11-02",
    "time_created": "13:11:45",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8vd4u",
    "parent_id": "t1_dp8v1fw",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah I agree with all of this. I understand it's impossible to root out, but the way the justice system should function is such that much fewer cases end up this way and that many more people who are wrongfully convicted are publicly exonerated. I've done work with an innocence project and they try to sandbag you at every step, offering all sorts of outs other than full exoneration, and forcing people to wait longer and longer hoping they will give in or give up. All to preserve a reputation. It's terrible. So many DAs I've talked to that treat it like a job when a man has been in jail because of them that shouldn't be there. It's maddening",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1509669871.0,
    "date_created": "2017-11-02",
    "time_created": "12:44:31",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8tv93",
    "parent_id": "t1_dp8ssle",
    "subreddit_name_prefixed": "r/news",
    "body": "Big red S right on the chest. And for extra attention grabbing, add a cape.",
    "controversiality": 0,
    "ups": 230,
    "downs": 0,
    "score": 230,
    "created": 1509668412.0,
    "date_created": "2017-11-02",
    "time_created": "12:20:12",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8rbd1",
    "parent_id": "t1_dp8r6eb",
    "subreddit_name_prefixed": "r/news",
    "body": "Wow, hadn't considered this, might actually be a good reasons. Are people in these trafficking rings typically people with prior convictions?",
    "controversiality": 0,
    "ups": 189,
    "downs": 0,
    "score": 189,
    "created": 1509665839.0,
    "date_created": "2017-11-02",
    "time_created": "11:37:19",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8scqy",
    "parent_id": "t1_dp8r6eb",
    "subreddit_name_prefixed": "r/news",
    "body": "> It probably has to do with trying to curb sex trafficking. If someone is traveling with a child they might not automatically guess it’s their son/daughter if they are labeled as a child sex offender.\n\nI 100% agree but you're kind of ignoring the fact that if someone is travelling with a trafficked child they're not going to use a legit passport.",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1509666880.0,
    "date_created": "2017-11-02",
    "time_created": "11:54:40",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8scjh",
    "parent_id": "t1_dp8rr2k",
    "subreddit_name_prefixed": "r/news",
    "body": "And that's what's wrong with this country. ",
    "controversiality": 0,
    "ups": 61,
    "downs": 0,
    "score": 61,
    "created": 1509666875.0,
    "date_created": "2017-11-02",
    "time_created": "11:54:35",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8vqxy",
    "parent_id": "t1_dp8slu6",
    "subreddit_name_prefixed": "r/news",
    "body": "I think the intent is less about shaming them for their actions and more about putting a halt to sex tourism by sex offenders from wealthier countries.\n\nThose countries that have problems with this sort of sexual tourism will then be able to use that information to deny visas. It's easier access to publicly available information. ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1509670239.0,
    "date_created": "2017-11-02",
    "time_created": "12:50:39",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8vxeo",
    "parent_id": "t1_dp8slu6",
    "subreddit_name_prefixed": "r/news",
    "body": "This is a misconception a lot of people seem to have, so I just wanna make this very clear.  Private citizens do not and can not press criminal charges.  District Attorneys and prosecutors press charges.  While the victim/their family's desires and willingness to cooperate influence the decision to press charges, ultimately it is still the state who does so.  It is quite common for a victim/their family to want charges brought in instances where charges are not brought, nor is it unheard of for charges to be brought when the victim or their families are uncooperative and do not wish for charges to be brought.  This applies for all criminal charges, not just sexual assault.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1509670415.0,
    "date_created": "2017-11-02",
    "time_created": "12:53:35",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8rm9g",
    "parent_id": "t1_dp8ravp",
    "subreddit_name_prefixed": "r/news",
    "body": "Which states still lack a Romeo and Juliet clause?",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1509666144.0,
    "date_created": "2017-11-02",
    "time_created": "11:42:24",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8rlag",
    "parent_id": "t1_dp8ravp",
    "subreddit_name_prefixed": "r/news",
    "body": "Or the dude who took a piss outside at 2am",
    "controversiality": 0,
    "ups": 145,
    "downs": 0,
    "score": 145,
    "created": 1509666118.0,
    "date_created": "2017-11-02",
    "time_created": "11:41:58",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xeig",
    "parent_id": "t1_dp8uu33",
    "subreddit_name_prefixed": "r/news",
    "body": "Seems like a reasonable measure of rehabilitation to me...",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1509671844.0,
    "date_created": "2017-11-02",
    "time_created": "13:17:24",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8vdh6",
    "parent_id": "t1_dp8tdhn",
    "subreddit_name_prefixed": "r/news",
    "body": "> driving around on a mopad while intoxicated is a way more common reason to go there \n\nI'm sure it happens a lot, but I doubt that's the reason a person plans a trip there. \n\n",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1509669880.0,
    "date_created": "2017-11-02",
    "time_created": "12:44:40",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8sp7c",
    "parent_id": "t1_dp8rc4i",
    "subreddit_name_prefixed": "r/news",
    "body": "ITs like our country was designed 200 years ago and our government has been avoiding meaningful changes to our system since them. ",
    "controversiality": 0,
    "ups": 159,
    "downs": 0,
    "score": 159,
    "created": 1509667226.0,
    "date_created": "2017-11-02",
    "time_created": "12:00:26",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8r3mr",
    "parent_id": "t1_dp8qysw",
    "subreddit_name_prefixed": "r/news",
    "body": "Well, you are only registered for a certain period of time for the crimes and I think it depends on the severity too. But I think the label of sex offender for all of them, with the connotation it implies should be rethought in the field of law.\n\nEdit: actually it is state-by-state",
    "controversiality": 0,
    "ups": 374,
    "downs": 0,
    "score": 374,
    "created": 1509665618.0,
    "date_created": "2017-11-02",
    "time_created": "11:33:38",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8v039",
    "parent_id": "t1_dp8qysw",
    "subreddit_name_prefixed": "r/news",
    "body": "Why?  I presume you want to protect children?  So two options for you:\n\n1) Someone is interested in kids, so they decide to go to see a therapist about it.  They haven't harmed a child but they have downloaded CP.  The therapist reports them to the police.  The police arrest them, jail them, and five years later they are released and put on an open register.  With job skills five years old, an unexplained hole on the resume, and a guaranteed failed criminal background check wherever they apply, they can't get work.  Because of the registry they can't find housing.  They are now unemployed, living on the street, and untreated - they have nothing to lose. \n\nvs.\n\n2)  Someone is interested in kids and they are either identified by the state, or go to a therapist on their own.  Either way they are not punished but rather they are helped.  Their therapy is paid for by the state, for as long as they need.  If they have a job working with kids, the state pays their salary until they can find a new job (which the state again asists them with).  Five year later they have five years of therapy under their belts, they have a job, a house, everything in the world to lose.\n\nWhich one of these people is more likely to snatch a kid who happens to cross their path?",
    "controversiality": 0,
    "ups": 56,
    "downs": 0,
    "score": 56,
    "created": 1509669521.0,
    "date_created": "2017-11-02",
    "time_created": "12:38:41",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8tzbj",
    "parent_id": "t1_dp8t8b4",
    "subreddit_name_prefixed": "r/news",
    "body": "He probably is. There are many people that would be ok with all kinds of draconian laws as long as it's \"to protect children\". Until it's their 18 y/o son that's on the sex offender list for hooking up and getting nudes from his 17 year old HS classmate, then the laws are unfair. ",
    "controversiality": 0,
    "ups": 441,
    "downs": 0,
    "score": 441,
    "created": 1509668523.0,
    "date_created": "2017-11-02",
    "time_created": "12:22:03",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8u16l",
    "parent_id": "t1_dp8t8b4",
    "subreddit_name_prefixed": "r/news",
    "body": "I think it's one of those things that people believe privately but are afraid to say publicly",
    "controversiality": 0,
    "ups": 89,
    "downs": 0,
    "score": 89,
    "created": 1509668575.0,
    "date_created": "2017-11-02",
    "time_created": "12:22:55",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8tyxz",
    "parent_id": "t1_dp8t8b4",
    "subreddit_name_prefixed": "r/news",
    "body": "Classic reddit formula: \"nobody is going to agree with this, but (states something totally reasonable that most people will agree with)\" ",
    "controversiality": 0,
    "ups": 202,
    "downs": 0,
    "score": 202,
    "created": 1509668513.0,
    "date_created": "2017-11-02",
    "time_created": "12:21:53",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8tokj",
    "parent_id": "t1_dp8t8b4",
    "subreddit_name_prefixed": "r/news",
    "body": "You'd be surprised. ",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1509668228.0,
    "date_created": "2017-11-02",
    "time_created": "12:17:08",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8uuz1",
    "parent_id": "t1_dp8tnak",
    "subreddit_name_prefixed": "r/news",
    "body": "A sex offender moved into my neighborhood and and a concerned resident emailed all of the other neighbors. The sex offender's mother emailed a defense of her son explaining that her had a consensual relationship with a 16-year-old when he was 18. The man was now 40 and had no other criminal record. ",
    "controversiality": 0,
    "ups": 141,
    "downs": 0,
    "score": 141,
    "created": 1509669383.0,
    "date_created": "2017-11-02",
    "time_created": "12:36:23",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8u3e0",
    "parent_id": "t1_dp8tnak",
    "subreddit_name_prefixed": "r/news",
    "body": "\"🎶Just to be clear. *Just to be clear!🎶*\"",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1509668632.0,
    "date_created": "2017-11-02",
    "time_created": "12:23:52",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8uivn",
    "parent_id": "t1_dp8tnak",
    "subreddit_name_prefixed": "r/news",
    "body": "> I’m required to inform you that I am a registered sex offender\n\nIs this a thing?",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1509669051.0,
    "date_created": "2017-11-02",
    "time_created": "12:30:51",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8toj9",
    "parent_id": "t1_dp8ove2",
    "subreddit_name_prefixed": "r/news",
    "body": "/r/KnightsOfPineapple",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1509668227.0,
    "date_created": "2017-11-02",
    "time_created": "12:17:07",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8w76q",
    "parent_id": "t1_dp8tsd1",
    "subreddit_name_prefixed": "r/news",
    "body": "Stepping outside of it, I think these sort of cases are interesting. Because obviously my first gut reaction is \"Monster! Murder that man!\" but like that behavior came from somewhere, right? There's no such thing as true random we just don't really understand it.\n\nSo your options as a civilization are 1.) kill them. 2.) lock them up in an asylum 3.) fix them. But because we don't really know how to do number 3, 1 and 2 seem like perfectly reasonable options.\n\n..but if we ever figured out number 3, which is in the realm of possibility way in the future (surgery, drugs, therapy, whatever... ) options 1 and 2 are going to seem like historically barbaric signs of our times. ",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1509670676.0,
    "date_created": "2017-11-02",
    "time_created": "12:57:56",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8u2lq",
    "parent_id": "t1_dp8slfb",
    "subreddit_name_prefixed": "r/news",
    "body": "recidivism rates are lower in countries where the justice system tries to rehabilitate and reintegrate criminals rather than punish them and make it impossible for them to reintegrate.\n\nIt's a false dichotomy between either have criminals reoffend or let them live a normal life on the outside. Letting them live a normal life is what will most likely to never re-offend. There are very few people indeed who are so fucked up that our treatment of them has no effect on how likely they are to commit crime.\n\nThe problem is voters don't know what they want. They want extremely harsh sentences to act as a \"deterrent\", but then they don't want to spend any money on prisoners so we keep having to release people to make room in our already over crowded prisoners.\n\nThey want prisoners to suffer and preferably be raped in prison as part of their punishment, but then they also want people who are released to someone how be able to fit right back into normal society.\n\nThey want ex-cons to go straight and become hard working taxpayers but they also want to make it almost impossible for them to get a job.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1509668611.0,
    "date_created": "2017-11-02",
    "time_created": "12:23:31",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xekn",
    "parent_id": "t1_dp8w9sm",
    "subreddit_name_prefixed": "r/news",
    "body": "You have nothing to be afraid of, as long as you are rich. Laws only apply to normal people silly",
    "controversiality": 0,
    "ups": 647,
    "downs": 0,
    "score": 647,
    "created": 1509671846.0,
    "date_created": "2017-11-02",
    "time_created": "13:17:26",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xa2c",
    "parent_id": "t1_dp8w9sm",
    "subreddit_name_prefixed": "r/news",
    "body": "I prefer there not be a mechanism available to pass laws based on isolated incidents like that. As horrible as it is what happened to victims you have to weigh the frequency of the issue versus the cost to enforce the new law and the unforeseen consequences of the new law being abused. That is something people frequently ignore when they have an emotional reaction to an isolated incident leading them to push an ever expanding set of laws.\n\nI would rather not live in a country where everyone is a criminal and the only thing that keeps you out of jail is selective enforcement.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1509671725.0,
    "date_created": "2017-11-02",
    "time_created": "13:15:25",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wii9",
    "parent_id": "t1_dp8w8i7",
    "subreddit_name_prefixed": "r/news",
    "body": "Im scared of the day I´ll get charged with something I´ve never done, because as soon as you´re handcuffed people will always assume that I am guilty even when every charge will eventually be dropped.",
    "controversiality": 0,
    "ups": 262,
    "downs": 0,
    "score": 262,
    "created": 1509670981.0,
    "date_created": "2017-11-02",
    "time_created": "13:03:01",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wms4",
    "parent_id": "t1_dp8w8i7",
    "subreddit_name_prefixed": "r/news",
    "body": "I don't know that we can *fix* it - the real solution is that people should act with rationality and kindness. That's something they take upon themselves if they decide to be a good version of a human. ",
    "controversiality": 0,
    "ups": 120,
    "downs": 0,
    "score": 120,
    "created": 1509671095.0,
    "date_created": "2017-11-02",
    "time_created": "13:04:55",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8y6nw",
    "parent_id": "t1_dp8w8i7",
    "subreddit_name_prefixed": "r/news",
    "body": "This happens on reddit every time there's someone being accused of sexual assault. Like jeez, I know if the person is guilty we should punish him, but how about a little bit of doubt until we have some facts instead of just nailing the guy on a cross right away.",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1509672588.0,
    "date_created": "2017-11-02",
    "time_created": "13:29:48",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9aen5",
    "parent_id": "t1_dp90tx5",
    "subreddit_name_prefixed": "r/news",
    "body": "Sex offender list and pedophilia are basically the modern day witch hunt. You dont even have to be on the list for people to pull the pitchforks. A journal photographer in my town did a peice on the public pool, someone basically just saw him taking pics and accused him of being a pedophile taking pictures of underaged little girls, before the police could even say \"ya no, this guy didnt do shit.\" The man had to fear for his and his families safety, he was getting death threats and everything, pretty sure he also lost his job but its been awhile so tht part is up in the air. When the paper came out saying he was completely innocent it basically held the unapologetic tone, \"well he *could* have been a pedophile.\"",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1509684695.0,
    "date_created": "2017-11-02",
    "time_created": "16:51:35",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9flff",
    "parent_id": "t1_dp90tx5",
    "subreddit_name_prefixed": "r/news",
    "body": "So I guess if you are relieving yourself against a tree and some stranger sees your wanker, that could potentially make you a sex offender now?",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1509690384.0,
    "date_created": "2017-11-02",
    "time_created": "18:26:24",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9353l",
    "parent_id": "t1_dp90tx5",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah, I know a guy, or rather, know OF a guy, who was charged with some sex offender charged because two 16 year-olds had sex in his house during his party. I won't say he wasn't a piece of shit. He was, like 26 and hanging out with high school kids, buying alcohol for 13 year-olds, etc. But as far as I know he never touched them. He was just a loser with no friends his age.\n\nThe cops just didn't like him and wanted to charge him with anything they possibly could.",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1509677431.0,
    "date_created": "2017-11-02",
    "time_created": "14:50:31",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9hxsn",
    "parent_id": "t1_dp90tx5",
    "subreddit_name_prefixed": "r/news",
    "body": "Horrible Bosses pointed this out, one of the blokes pissed in a park at night, got put on the sex offenders list, couldn't find a decent job aside from one with a maneater boss, and he keeps having to point out it was just for pissing in a park at night because anyone he knows he is on the list calls him a child molester \n",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1509693126.0,
    "date_created": "2017-11-02",
    "time_created": "19:12:06",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xvb5",
    "parent_id": "t1_dp8x8ep",
    "subreddit_name_prefixed": "r/news",
    "body": "The people calling for these laws never think they'll affect their own lives.",
    "controversiality": 0,
    "ups": 262,
    "downs": 0,
    "score": 262,
    "created": 1509672289.0,
    "date_created": "2017-11-02",
    "time_created": "13:24:49",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wo8c",
    "parent_id": "t1_dp8wdbe",
    "subreddit_name_prefixed": "r/news",
    "body": "*Back in my day we masturbated to Sears catalogues and we liked it.*",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1509671134.0,
    "date_created": "2017-11-02",
    "time_created": "13:05:34",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp90znm",
    "parent_id": "t1_dp8yu05",
    "subreddit_name_prefixed": "r/news",
    "body": "And also, as I understand, so that therapy/rehab/help/hospital observation/etc can be court mandated when relevant.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1509675326.0,
    "date_created": "2017-11-02",
    "time_created": "14:15:26",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8yl3m",
    "parent_id": "t1_dp8vzfh",
    "subreddit_name_prefixed": "r/news",
    "body": "And you are both the minor victim of the crime and the adult perpetrator. ",
    "controversiality": 0,
    "ups": 158,
    "downs": 0,
    "score": 158,
    "created": 1509672971.0,
    "date_created": "2017-11-02",
    "time_created": "13:36:11",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xm85",
    "parent_id": "t1_dp8vzfh",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah pick one ffs",
    "controversiality": 0,
    "ups": 72,
    "downs": 0,
    "score": 72,
    "created": 1509672051.0,
    "date_created": "2017-11-02",
    "time_created": "13:20:51",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ywsh",
    "parent_id": "t1_dp8vzfh",
    "subreddit_name_prefixed": "r/news",
    "body": "Dont worry its only 15 years to register , after that your free and clear and seal your records /s",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1509673284.0,
    "date_created": "2017-11-02",
    "time_created": "13:41:24",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp91szx",
    "parent_id": "t1_dp90hoh",
    "subreddit_name_prefixed": "r/news",
    "body": "Back in the day when I was your age after barely squeaking through high school, I got a job pulling a lever for $15 an hour in 1972... And you're telling me in 2017 you think you want to make $15 an hour for flipping burgers?! Pulling a lever required much more skill at the time. Just work harder. ",
    "controversiality": 0,
    "ups": 317,
    "downs": 0,
    "score": 317,
    "created": 1509676118.0,
    "date_created": "2017-11-02",
    "time_created": "14:28:38",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9orqj",
    "parent_id": "t1_dp90vxq",
    "subreddit_name_prefixed": "r/news",
    "body": "In superior countries like Saudi Arabia, a rape victim can forgive her rapist and get the charges dropped",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1509701242.0,
    "date_created": "2017-11-02",
    "time_created": "21:27:22",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp97oze",
    "parent_id": "t1_dp97he4",
    "subreddit_name_prefixed": "r/news",
    "body": "i literally haven’t talked to her since then ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1509681916.0,
    "date_created": "2017-11-02",
    "time_created": "16:05:16",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9vhta",
    "parent_id": "t1_dp9lrhd",
    "subreddit_name_prefixed": "r/news",
    "body": "the cops didn’t even talk to her and she was over 18 ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1509709401.0,
    "date_created": "2017-11-02",
    "time_created": "23:43:21",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xexe",
    "parent_id": "t1_dp8w3y1",
    "subreddit_name_prefixed": "r/news",
    "body": "Jesus Christ, I thought the whole, \"added to the registry for pissing in public\" was a joke/myth, but that really happens?",
    "controversiality": 0,
    "ups": 57,
    "downs": 0,
    "score": 57,
    "created": 1509671855.0,
    "date_created": "2017-11-02",
    "time_created": "13:17:35",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp91wxv",
    "parent_id": "t1_dp8w3y1",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah, you can diddle little boys and be a sex offender, or you can be 17 years old sending / receiving nudes with a consenting almost-adult girl and get the same charge. Fucked up",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1509676224.0,
    "date_created": "2017-11-02",
    "time_created": "14:30:24",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8w55w",
    "parent_id": "t1_dp8v68r",
    "subreddit_name_prefixed": "r/news",
    "body": "And have to publish their browsing history, phone call transcripts and other assorted information. \n\n*everyone* has something to hide. ",
    "controversiality": 0,
    "ups": 169,
    "downs": 0,
    "score": 169,
    "created": 1509670623.0,
    "date_created": "2017-11-02",
    "time_created": "12:57:03",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8vzky",
    "parent_id": "t1_dp8v68r",
    "subreddit_name_prefixed": "r/news",
    "body": "I always put out my hand and ask if I can go through their phones when people say that. It's funny seeing them realize what a shit line of reasoning it is.",
    "controversiality": 0,
    "ups": 125,
    "downs": 0,
    "score": 125,
    "created": 1509670473.0,
    "date_created": "2017-11-02",
    "time_created": "12:54:33",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xleb",
    "parent_id": "t1_dp8vjv4",
    "subreddit_name_prefixed": "r/news",
    "body": "This is the mindset my parents have. My husband was charged with felony drug possession or something similar when he was 17 or 18 (don’t remember which, just know he was charged as an adult, whichever it was). He’s 30 now and luckily we got it expunged years ago and I have voiced my frustration that young people (or anyone) who’s made a stupid choice might have their lives ruined over it, but my parents think “well they should think about that BEFORE they use drugs/do escorting/insert any other felony here”. Because everyone really evaluates every decision they make based on “will this effect me for the rest of my life”. The main difference between most people and people with a criminal record is a good lawyer/not getting caught. ",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1509672028.0,
    "date_created": "2017-11-02",
    "time_created": "13:20:28",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp98odd",
    "parent_id": "t1_dp9831z",
    "subreddit_name_prefixed": "r/news",
    "body": "> I just wrote a paper about this for my masters...\n\nIt sucks that you have masters, but at least they put you to work in research rather than prostitution.",
    "controversiality": 0,
    "ups": 683,
    "downs": 0,
    "score": 683,
    "created": 1509682909.0,
    "date_created": "2017-11-02",
    "time_created": "16:21:49",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp99pex",
    "parent_id": "t1_dp9831z",
    "subreddit_name_prefixed": "r/news",
    "body": "> Sex tourism makes up 11% of Thailand’s GDP and it shows no signs of slowing\n\nSex tourists looking for adult prostitutes or pedophiles looking for children? Combining the two seems disingenuous.",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1509683969.0,
    "date_created": "2017-11-02",
    "time_created": "16:39:29",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp95s9o",
    "parent_id": "t1_dp90fmd",
    "subreddit_name_prefixed": "r/news",
    "body": "I was mad at this thing until I read your post. It is rare, but your direct and no-nonsense post made me change my mind and agree with this.",
    "controversiality": 0,
    "ups": 112,
    "downs": 0,
    "score": 112,
    "created": 1509680009.0,
    "date_created": "2017-11-02",
    "time_created": "15:33:29",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp99rs6",
    "parent_id": "t1_dp90fmd",
    "subreddit_name_prefixed": "r/news",
    "body": "To be clear, Australia is not marking anyone as an offender in their passport. The new legislation (which won't be operationalised until December this yearat the earliest) provides for offenders with reporting responsibilities to have their passports cancelled. \n\nThe intention is to prevent them travelling internationally to offend elsewhere, not to mark them out in their primary identity document, which would be ineffective and inhumane.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1509684034.0,
    "date_created": "2017-11-02",
    "time_created": "16:40:34",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp97kq4",
    "parent_id": "t1_dp8zc6i",
    "subreddit_name_prefixed": "r/news",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1509681793.0,
    "date_created": "2017-11-02",
    "time_created": "16:03:13",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8y4ca",
    "parent_id": "t1_dp8vx5s",
    "subreddit_name_prefixed": "r/news",
    "body": "She has children of her own and volunteers at their school. Ick.",
    "controversiality": 0,
    "ups": 86,
    "downs": 0,
    "score": 86,
    "created": 1509672527.0,
    "date_created": "2017-11-02",
    "time_created": "13:28:47",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp90cmg",
    "parent_id": "t1_dp8wx8z",
    "subreddit_name_prefixed": "r/news",
    "body": "Puritanism is a disease of the mind, but I think all societies have a few blind spots.  What they are stupid about varies wildly though.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1509674692.0,
    "date_created": "2017-11-02",
    "time_created": "14:04:52",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8zy5w",
    "parent_id": "t1_dp8wx8z",
    "subreddit_name_prefixed": "r/news",
    "body": "Yep, the Mark Ciavarella (sp?) cash for kids scandal made me sick to my stomach. I think I'd be petrified of being arrested all the time if I was American and I never break any laws, I'm\nA goody two shoes. \n\n\n\nHere in the UK the police tend to let People off with a warning for minor things that you'd be arrested for in the US.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1509674295.0,
    "date_created": "2017-11-02",
    "time_created": "13:58:15",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8vyf0",
    "parent_id": "t1_dp8v38d",
    "subreddit_name_prefixed": "r/news",
    "body": "Can confirm that. It also has the best social protections and benefits in all the Americas. \nYou should note that there has been massive protests and teacher strikes in 2011-2012 due to a rise of university fees, which led to new elections.",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1509670442.0,
    "date_created": "2017-11-02",
    "time_created": "12:54:02",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xwhr",
    "parent_id": "t1_dp8v38d",
    "subreddit_name_prefixed": "r/news",
    "body": "Anglos are European though?\n\nBesides, that defense is valid in UK too.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1509672319.0,
    "date_created": "2017-11-02",
    "time_created": "13:25:19",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wgn0",
    "parent_id": "t1_dp8v38d",
    "subreddit_name_prefixed": "r/news",
    "body": "hey don't lump us brits in with puritan yanks",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1509670930.0,
    "date_created": "2017-11-02",
    "time_created": "13:02:10",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wws7",
    "parent_id": "t1_dp8w28x",
    "subreddit_name_prefixed": "r/news",
    "body": "According to the Department of Justice, 16 is the age of consent. 14 - 15 year olds can have sex with a person less than five years older, and 12 - 13 year olds with a person less than two years older.\n\nhttp://www.justice.gc.ca/eng/rp-pr/other-autre/clp/faq.html",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1509671365.0,
    "date_created": "2017-11-02",
    "time_created": "13:09:25",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wf7n",
    "parent_id": "t1_dp8w35r",
    "subreddit_name_prefixed": "r/news",
    "body": "And jury nullification is needed in situations like this.",
    "controversiality": 0,
    "ups": 205,
    "downs": 0,
    "score": 205,
    "created": 1509670892.0,
    "date_created": "2017-11-02",
    "time_created": "13:01:32",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp90gv5",
    "parent_id": "t1_dp8w35r",
    "subreddit_name_prefixed": "r/news",
    "body": "When you get called, study up on Jury Nullification and then never admit or allude to it.  Judges get oftly pissy when you do.  When judging my peers, I will vote my conscience regardless of what others tell me to. ",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1509674810.0,
    "date_created": "2017-11-02",
    "time_created": "14:06:50",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp978zi",
    "parent_id": "t1_dp90qmk",
    "subreddit_name_prefixed": "r/news",
    "body": "every single day i think more and more that our justice system is completely broken and doesn’t help fucking anyone. ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1509681463.0,
    "date_created": "2017-11-02",
    "time_created": "15:57:43",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ym0n",
    "parent_id": "t1_dp8x5nf",
    "subreddit_name_prefixed": "r/news",
    "body": "Yep. Several years ago I was feeding ducks with my daughter (about 3 at the time) and a woman kept hovering near us. She did not look happy about the situation. After a few minutes she approached my daughter, *with me right next to her* and began grilling her as to how she knew me. When it became clear I was her father she simply gave me a huffy \"fuck you\" look and walked away. I'd never been so furious in my life. Reality is that some women simply hate men. Period, end of statement.",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1509672996.0,
    "date_created": "2017-11-02",
    "time_created": "13:36:36",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8y5rd",
    "parent_id": "t1_dp8x5nf",
    "subreddit_name_prefixed": "r/news",
    "body": "I take my 10 year old sister out and I get the same.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1509672563.0,
    "date_created": "2017-11-02",
    "time_created": "13:29:23",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8uslp",
    "parent_id": "t1_dp8tv93",
    "subreddit_name_prefixed": "r/news",
    "body": "“What does the S stand for?”\n\n“Hope”",
    "controversiality": 0,
    "ups": 287,
    "downs": 0,
    "score": 287,
    "created": 1509669317.0,
    "date_created": "2017-11-02",
    "time_created": "12:35:17",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ro2b",
    "parent_id": "t1_dp8rbd1",
    "subreddit_name_prefixed": "r/news",
    "body": "~~The~~ [There] is also sex tourism. Sometimes people go to the places where they can have access to children, rather than bringing the children to them. ",
    "controversiality": 0,
    "ups": 258,
    "downs": 0,
    "score": 258,
    "created": 1509666194.0,
    "date_created": "2017-11-02",
    "time_created": "11:43:14",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8v5bv",
    "parent_id": "t1_dp8scqy",
    "subreddit_name_prefixed": "r/news",
    "body": "Especially if that passport tells people they're a child sex offender.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1509669662.0,
    "date_created": "2017-11-02",
    "time_created": "12:41:02",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8sjqo",
    "parent_id": "t1_dp8scjh",
    "subreddit_name_prefixed": "r/news",
    "body": "The worst part is they acted like they were doing me a favor by not arresting me. Gee, thanks for not being abusive.",
    "controversiality": 0,
    "ups": 56,
    "downs": 0,
    "score": 56,
    "created": 1509667074.0,
    "date_created": "2017-11-02",
    "time_created": "11:57:54",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8t0h0",
    "parent_id": "t1_dp8rm9g",
    "subreddit_name_prefixed": "r/news",
    "body": "California. And the age of consent is 18. And two minors can both be prosecuted for having sex with each other.",
    "controversiality": 0,
    "ups": 48,
    "downs": 0,
    "score": 48,
    "created": 1509667545.0,
    "date_created": "2017-11-02",
    "time_created": "12:05:45",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8t47x",
    "parent_id": "t1_dp8rm9g",
    "subreddit_name_prefixed": "r/news",
    "body": "Literally one is enough for that to still be a problem",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1509667653.0,
    "date_created": "2017-11-02",
    "time_created": "12:07:33",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8s1au",
    "parent_id": "t1_dp8rm9g",
    "subreddit_name_prefixed": "r/news",
    "body": "In my state, R&J laws only apply to very specific circumstances, i.e. \"heavy petting\", but not intercourse.",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1509666563.0,
    "date_created": "2017-11-02",
    "time_created": "11:49:23",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8tydj",
    "parent_id": "t1_dp8rlag",
    "subreddit_name_prefixed": "r/news",
    "body": "There are categories of sexual offenses and in some states non violent offenders can petition to be de-registered. Not sure about every state but most don’t lump sexually violent predators in with non violent predators. If someone you know has to register because they pissed in a public place have them contact a courthouse or an attorney to talk about deregistering.",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1509668497.0,
    "date_created": "2017-11-02",
    "time_created": "12:21:37",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8u88t",
    "parent_id": "t1_dp8sp7c",
    "subreddit_name_prefixed": "r/news",
    "body": "You realize that our government has gone under pretty radical shifts in the last 200 years considering it has maintained the same constitution.",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1509668764.0,
    "date_created": "2017-11-02",
    "time_created": "12:26:04",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8tryn",
    "parent_id": "t1_dp8sp7c",
    "subreddit_name_prefixed": "r/news",
    "body": "Changes are designed to be slow so the mass public opinion doesn’t fuck shit up",
    "controversiality": 0,
    "ups": 131,
    "downs": 0,
    "score": 131,
    "created": 1509668322.0,
    "date_created": "2017-11-02",
    "time_created": "12:18:42",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8rheq",
    "parent_id": "t1_dp8r3mr",
    "subreddit_name_prefixed": "r/news",
    "body": "The sex offender map is is nearly useless these days. You'd look at it and think everyone's an offender.",
    "controversiality": 0,
    "ups": 311,
    "downs": 0,
    "score": 311,
    "created": 1509666010.0,
    "date_created": "2017-11-02",
    "time_created": "11:40:10",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8s3et",
    "parent_id": "t1_dp8r3mr",
    "subreddit_name_prefixed": "r/news",
    "body": "It's definitely permanent.  And because it's public information there's private databases that wouldn't delete that information either.",
    "controversiality": 0,
    "ups": 70,
    "downs": 0,
    "score": 70,
    "created": 1509666621.0,
    "date_created": "2017-11-02",
    "time_created": "11:50:21",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8unz9",
    "parent_id": "t1_dp8tzbj",
    "subreddit_name_prefixed": "r/news",
    "body": "Here's the problem.  Shit always goes too far.  We don't do enough to protect kids and then we overcorrect to where we're arresting the guy who peed behind a dumpster and calling him a sex offender.\n\nIt happened with racism where we went from discriminating against black people to where a prominent person in the DNC just two days ago sent an email trying to fill tech positions and said \"please don't send to white males we already have too many\".\n\nAnd you'll see it soon happen with the Weinstein revelations where we went from not protecting people to where any woman who accuses any man we'll immediately rake the guy through the coals and call for him to be fired (you're already seeing this a little in the tech industry).\n\nIt's like we can never meet in a good spot.  We always have to be assholes on one side and then overcorrect to being assholes on the other side.",
    "controversiality": 0,
    "ups": 161,
    "downs": 0,
    "score": 161,
    "created": 1509669190.0,
    "date_created": "2017-11-02",
    "time_created": "12:33:10",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8uy8h",
    "parent_id": "t1_dp8u16l",
    "subreddit_name_prefixed": "r/news",
    "body": "It's because as soon as a lawyer or government official would make a suggestion to make it harder to be put on the sex offender list you'd have talking heads on the 24 hour news channels saying \"POLITICIAN SO AND SO WANTS TO PROTECT PERVERTS\" \n\nIt would be career suicide. ",
    "controversiality": 0,
    "ups": 55,
    "downs": 0,
    "score": 55,
    "created": 1509669471.0,
    "date_created": "2017-11-02",
    "time_created": "12:37:51",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8v1eu",
    "parent_id": "t1_dp8uuz1",
    "subreddit_name_prefixed": "r/news",
    "body": "That’s so fucked...",
    "controversiality": 0,
    "ups": 54,
    "downs": 0,
    "score": 54,
    "created": 1509669558.0,
    "date_created": "2017-11-02",
    "time_created": "12:39:18",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8uqnv",
    "parent_id": "t1_dp8uivn",
    "subreddit_name_prefixed": "r/news",
    "body": "Yes. I also think a police officer (or some state worker) must follow you to make sure you do it.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1509669264.0,
    "date_created": "2017-11-02",
    "time_created": "12:34:24",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9088c",
    "parent_id": "t1_dp8w76q",
    "subreddit_name_prefixed": "r/news",
    "body": "i agree with everything you've said, but unfortunately, for some, i think rehabilitation is not always going to work. for those extreme cases, prison for life is how they have to be dealt with (i'm not a supporter of the death penalty, personally). but put them in jail for life! don't put them back out in society but limit literally everything they can do. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1509674571.0,
    "date_created": "2017-11-02",
    "time_created": "14:02:51",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wkze",
    "parent_id": "t1_dp8u2lq",
    "subreddit_name_prefixed": "r/news",
    "body": "no argument with any of that.   Our CJ system is clearly based on punishment and isolation from society with no attempt to rehabilitate.\n\nIt shouldnt be.   ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1509671047.0,
    "date_created": "2017-11-02",
    "time_created": "13:04:07",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8zodo",
    "parent_id": "t1_dp8xekn",
    "subreddit_name_prefixed": "r/news",
    "body": "[Example 1](http://www.cnn.com/2014/04/02/justice/delaware-du-pont-rape-case/index.html) - Robert Richards was convicted of raping his own toddler daughter and never spent any time in jail because the judge said that he 'would not fare well'. Bitch! Nobody 'fares well' in prison.\n\n[Example 2](https://mic.com/articles/79039/the-untold-story-of-alice-walton-s-dwi-incident) - Alice Walton has repeatedly been caught drunk driving and has even killed someone while doing so and has never been been punished for it. The one time that she was actually charged, the officer was put on leave during her time in court so he wasn't allowed to testify and she walked. Usually, they just let the statute of limitations lapse without filing charges.",
    "controversiality": 0,
    "ups": 693,
    "downs": 0,
    "score": 693,
    "created": 1509674028.0,
    "date_created": "2017-11-02",
    "time_created": "13:53:48",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ze2s",
    "parent_id": "t1_dp8xekn",
    "subreddit_name_prefixed": "r/news",
    "body": "Well, sometimes rich people have consequences. Like when they lose their CEO position after financially destroying a company and its customers.. and they have to live out the rest of their days with only a few hundred million dollars from their golden parachute. How sad...",
    "controversiality": 0,
    "ups": 302,
    "downs": 0,
    "score": 302,
    "created": 1509673748.0,
    "date_created": "2017-11-02",
    "time_created": "13:49:08",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp903ah",
    "parent_id": "t1_dp8xekn",
    "subreddit_name_prefixed": "r/news",
    "body": "You're not wrong. [Here's a man found guilty of sexually assaulting his toddler age granddaughter -- judge said he shouldn't serve time because he wouldn't 'fair well' in jail](https://en.m.wikipedia.org/wiki/Trial_and_sentencing_of_Robert_H._Richards_IV)\n\n\n> In 2009, he entered a guilty plea and was convicted of raping his 3-year-old daughter,[2][6][7][8][9][10] after the girl reported the abuse to her grandmother.[5] Instead of serving out his eight-year prison sentence, the sentencing order signed by Delaware Superior Court Judge Jan R. Jurden said that the \"defendant will not fare well\" in prison and thus the eight-year sentence was suspended.[6][8][10][11] Delaware Public Defender Brendan J. O'Neill expressed surprise that Jurden would use such a rationale to avoid sending Richards to prison.[6][8]\n\nJustice isn't blind. She checks your race, gender and bank balance before most decisions are made.",
    "controversiality": 0,
    "ups": 350,
    "downs": 0,
    "score": 350,
    "created": 1509674434.0,
    "date_created": "2017-11-02",
    "time_created": "14:00:34",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8zfgg",
    "parent_id": "t1_dp8xekn",
    "subreddit_name_prefixed": "r/news",
    "body": "\"Oh thank God!\"\n\n*Checks bank account\n\n\"Oh fuck!\"",
    "controversiality": 0,
    "ups": 77,
    "downs": 0,
    "score": 77,
    "created": 1509673785.0,
    "date_created": "2017-11-02",
    "time_created": "13:49:45",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wypi",
    "parent_id": "t1_dp8wii9",
    "subreddit_name_prefixed": "r/news",
    "body": "I was arrested for something I didnt do (eventually was dismissed) but the worst part isn't when you're handcuffed (that part doesn't feel real)... its as soon as that jail door shuts and locks, and you know theres *nothing* you can do and you are truly innocent being held against your will... its an awakening experience. that sound will forever be with me\n\nedit: didn't realize I was being overdramatic... its a shitty feeling when you are looking at a minimum of 15 years for something you didn't do. i'm not complaining about it, just saying its a shitty feeling... actually made me smarter about many things ",
    "controversiality": 0,
    "ups": 316,
    "downs": 0,
    "score": 316,
    "created": 1509671415.0,
    "date_created": "2017-11-02",
    "time_created": "13:10:15",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9116j",
    "parent_id": "t1_dp8wii9",
    "subreddit_name_prefixed": "r/news",
    "body": "When I was 18 years old a police officer came to my door because I walked toward my neighbor doing strange hand motions, scaring him into calling the police. I was falling into psychosis at the time due to being Schizoaffective. When the officer came to my house I couldn't utter any words. I just kept opening the door, staring at him for a minute, then closing it several times. Finally he said \"[my last name] (between 15-19 yrs old I frequently was taken to the psych ward by the police, so a lot of the officers know me and my address), we're not going to play these games today, and he tackled me into my own home. I was so confused. I just went limp with my mom screaming in the background, \"STOP! He's mentally ill! He needs help!\".\n\nHe took me to jail and charged me with Battery on a LEO, Resistance W/ Violence, Obstruction of an Officer's Communication Device and a couple other minor things, even though I didn't even fight back. He literally dragged me from the foyer of my mother's home down the concrete driveway with me being shirtless while I lied motionless on the floor consumed with shock and utter confusion. \n\nI spent the next 31 days in 24 hour lockdown solitary confinement at the county jail, hallucinating severely and entrencehed in delusion. Such as believing I was trapped in purgatory, my body melting into a puddle with my cell consumed with flames thinking I'm leaving purgatory and descending to hell. I remained in psychosis for 3 months after my release where I experienced the Messiah Complex and God Complex. I wrote a Bible. I was so out of it.\n\nI'd like to say I've recovered rather well from everything. But I wish police knew what could happen if you press false charges on a person. I was in jail so long because they wouldn't let me out until my attorney did everything required to present an Insanity Plea to the prosecution. My attorney said that once she presented the Insanity Plea the State Attorney dropped the case and it was no filed. I have no criminal record today thankfully, but I still have a mugshot posted online that doesn't look so good.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1509675366.0,
    "date_created": "2017-11-02",
    "time_created": "14:16:06",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xs6b",
    "parent_id": "t1_dp8wii9",
    "subreddit_name_prefixed": "r/news",
    "body": "and yet anytime anyone mentions \"innocent until proven guilty\"  Some tard posts \"Blah, thats only in the court, they weren't FOUND innocent\"",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1509672207.0,
    "date_created": "2017-11-02",
    "time_created": "13:23:27",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xwiq",
    "parent_id": "t1_dp8wms4",
    "subreddit_name_prefixed": "r/news",
    "body": "People can be manipulated and engineered.",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1509672320.0,
    "date_created": "2017-11-02",
    "time_created": "13:25:20",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9gt69",
    "parent_id": "t1_dp9flff",
    "subreddit_name_prefixed": "r/news",
    "body": "it's been that way for years",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1509691796.0,
    "date_created": "2017-11-02",
    "time_created": "18:49:56",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8y83q",
    "parent_id": "t1_dp8xvb5",
    "subreddit_name_prefixed": "r/news",
    "body": "Not only that, but it will just make a culture of \"don't send nudes\", not \"let's try and change this law\". ",
    "controversiality": 0,
    "ups": 117,
    "downs": 0,
    "score": 117,
    "created": 1509672625.0,
    "date_created": "2017-11-02",
    "time_created": "13:30:25",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp99hcb",
    "parent_id": "t1_dp8xvb5",
    "subreddit_name_prefixed": "r/news",
    "body": "\"I never thought they would eat MY face!\"\n\n- woman whose face was eaten after voting in the Leopards Eating Peoples Faces Party",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1509683741.0,
    "date_created": "2017-11-02",
    "time_created": "16:35:41",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp933mz",
    "parent_id": "t1_dp8yl3m",
    "subreddit_name_prefixed": "r/news",
    "body": "So if I was masturbating at night during the exact time I turned 18, was that also some sort of sexual misconduct violation with a minor or something? Or do Romeo/Juliet laws cover that?",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1509677390.0,
    "date_created": "2017-11-02",
    "time_created": "14:49:50",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9228t",
    "parent_id": "t1_dp91szx",
    "subreddit_name_prefixed": "r/news",
    "body": "Sounds like my Lever-Pulling Union uncle. He retired with 100% salary pension and benefits.",
    "controversiality": 0,
    "ups": 152,
    "downs": 0,
    "score": 152,
    "created": 1509676368.0,
    "date_created": "2017-11-02",
    "time_created": "14:32:48",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xkr2",
    "parent_id": "t1_dp8xexe",
    "subreddit_name_prefixed": "r/news",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 81,
    "downs": 0,
    "score": 81,
    "created": 1509672012.0,
    "date_created": "2017-11-02",
    "time_created": "13:20:12",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xukj",
    "parent_id": "t1_dp8w55w",
    "subreddit_name_prefixed": "r/news",
    "body": "It's not having something to hide, it's simply keeping your private life private as it should be. ",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1509672269.0,
    "date_created": "2017-11-02",
    "time_created": "13:24:29",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wy1n",
    "parent_id": "t1_dp8vzky",
    "subreddit_name_prefixed": "r/news",
    "body": "Nice, I'm gonna start using that",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1509671397.0,
    "date_created": "2017-11-02",
    "time_created": "13:09:57",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8x0d6",
    "parent_id": "t1_dp8wws7",
    "subreddit_name_prefixed": "r/news",
    "body": "seems fair. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1509671459.0,
    "date_created": "2017-11-02",
    "time_created": "13:10:59",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xgoh",
    "parent_id": "t1_dp8wf7n",
    "subreddit_name_prefixed": "r/news",
    "body": "Usually wont even get a chance to happen because the defendant will more than likely plea out instead of going to trial.",
    "controversiality": 0,
    "ups": 59,
    "downs": 0,
    "score": 59,
    "created": 1509671904.0,
    "date_created": "2017-11-02",
    "time_created": "13:18:24",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp924qm",
    "parent_id": "t1_dp8wf7n",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1509676436.0,
    "date_created": "2017-11-02",
    "time_created": "14:33:56",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp94fye",
    "parent_id": "t1_dp90gv5",
    "subreddit_name_prefixed": "r/news",
    "body": "Agreed, the idea that you should cast aside your conscience at any time is a sign of fascism/totalitarianism.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1509678689.0,
    "date_created": "2017-11-02",
    "time_created": "15:11:29",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8yz5i",
    "parent_id": "t1_dp8ym0n",
    "subreddit_name_prefixed": "r/news",
    "body": "Your daughter didn't yell \"Dun bully daddy, meanie!\" afterwards? I would be furious too.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1509673348.0,
    "date_created": "2017-11-02",
    "time_created": "13:42:28",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8vhb2",
    "parent_id": "t1_dp8uslp",
    "subreddit_name_prefixed": "r/news",
    "body": "\nHope starts with an H [Stupid!](https://youtu.be/-G4Y8JtT1j0)",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1509669981.0,
    "date_created": "2017-11-02",
    "time_created": "12:46:21",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8voni",
    "parent_id": "t1_dp8uslp",
    "subreddit_name_prefixed": "r/news",
    "body": "As in \"I hope these kids don't tell on me\"?",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1509670178.0,
    "date_created": "2017-11-02",
    "time_created": "12:49:38",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ru14",
    "parent_id": "t1_dp8ro2b",
    "subreddit_name_prefixed": "r/news",
    "body": "Oh damn that's another good point that's useful. ",
    "controversiality": 0,
    "ups": 76,
    "downs": 0,
    "score": 76,
    "created": 1509666361.0,
    "date_created": "2017-11-02",
    "time_created": "11:46:01",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ved7",
    "parent_id": "t1_dp8tydj",
    "subreddit_name_prefixed": "r/news",
    "body": "Good point. But it would be nice if there was a little common sense and they weren’t required to register in the first place.",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1509669903.0,
    "date_created": "2017-11-02",
    "time_created": "12:45:03",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8sw65",
    "parent_id": "t1_dp8rheq",
    "subreddit_name_prefixed": "r/news",
    "body": "It's true, there's like 100 sex offenders in my neighborhood and I live right by a school. They're all level 1 though which the website doesn't clarify what that means",
    "controversiality": 0,
    "ups": 246,
    "downs": 0,
    "score": 246,
    "created": 1509667423.0,
    "date_created": "2017-11-02",
    "time_created": "12:03:43",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8vsk5",
    "parent_id": "t1_dp8unz9",
    "subreddit_name_prefixed": "r/news",
    "body": "That is because most people lack the cognitive ability to rationalize non binary stances. \n\n* So a food either is good for your or bad for you, not as is correct neither good nor bad except in excess. \n* A person is either a good person or an evil person, so a guy wearing a swastika armband is literally Hitler. \n* The Most common one on reddit - You either agree with me or you're wrong, stupid, greedy and intentionally trying to ruin others lives",
    "controversiality": 0,
    "ups": 56,
    "downs": 0,
    "score": 56,
    "created": 1509670282.0,
    "date_created": "2017-11-02",
    "time_created": "12:51:22",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wlst",
    "parent_id": "t1_dp8unz9",
    "subreddit_name_prefixed": "r/news",
    "body": "Hmm. I'd be careful about that Weinstein comment. I said pretty much the exact thing yesterday and was promptly accused of defending him and the others, and I, myself, MUST have assaulted a woman and I just have a guilty conscience.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1509671069.0,
    "date_created": "2017-11-02",
    "time_created": "13:04:29",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8wv68",
    "parent_id": "t1_dp8v1eu",
    "subreddit_name_prefixed": "r/news",
    "body": "The ~~ACLU~~ Human Rights Watch I believe put out a 100-something page analysis of the sex offender registration called \"No Easy Answers.\" It's a fascinating read. Stuff like that is disturbingly common. A guy in, I wanna say Maine, got murdered because he was on the registry for assaulting a minor. He was 18 or 19 and it was his, like, 16 year old girlfriend. \n\nThere are myriad problems with the registry. Too many to go into here. But the vagueness of it is one of the biggest factors. Or, in some cases, its selective specificity: it'll name the age of the victim but not the age of the person who committed the crime. So the registry will say \"so and so had sex with a fifteen year old\" but won't clarify that this occurred when the perpetrator was 18, it will then stay that way forever. So if someone looks up the offender when he's in his mid-30s it still says it. ",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1509671320.0,
    "date_created": "2017-11-02",
    "time_created": "13:08:40",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp90qcs",
    "parent_id": "t1_dp9088c",
    "subreddit_name_prefixed": "r/news",
    "body": "Sure but I mean, they didn't choose to be that way. I don't think anyone would choose to want to only be able to get off at the visual sight of torture. \n\nAnd while I agree, yeah, we don't have any other solutions right now, I think it's a bit unfortunate that the *emphasis* right now never seems to be on trying to solve for the third option. The gut feeling, as I said myself, is \"get rid of them!\" But in an ideal world, the first reaction we'd have would be to try to understand whats broken inside of them.\n\nMy comment wasn't so much about what makes the most sense to do right now, but on the sad state of affairs it is that mental health isn't a forefront science. We just lock up our deplorables and throw away the key. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1509675074.0,
    "date_created": "2017-11-02",
    "time_created": "14:11:14",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp92hep",
    "parent_id": "t1_dp8zodo",
    "subreddit_name_prefixed": "r/news",
    "body": "Then there's Doris Duke's nephew, the sole heir of her billions, [who treated his twin children like animals, living in a basement of filth](http://abcnews.go.com/Health/billionaire-twins-abused-slaves-doris-duke-heir-father/story?id=19853671), He had been given custody and never even had to let CPS on his property though they were called repeatedly. Now that the children are old enough to speak up about the abuse, the heroin addict father is fortunately *dead.",
    "controversiality": 0,
    "ups": 356,
    "downs": 0,
    "score": 356,
    "created": 1509676784.0,
    "date_created": "2017-11-02",
    "time_created": "14:39:44",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp95tl2",
    "parent_id": "t1_dp8zodo",
    "subreddit_name_prefixed": "r/news",
    "body": "No, instead Alice Walton built an entire Museum in honor of the person she ran over. Goddamn Crystal Bridges art Museum. Apparently if you're rich enough you just gotta donate an entire facility for one death. 1 death = 1 Museum. lmao",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1509680045.0,
    "date_created": "2017-11-02",
    "time_created": "15:34:05",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp92h4y",
    "parent_id": "t1_dp8zodo",
    "subreddit_name_prefixed": "r/news",
    "body": "Holy shit. You know can fare back and forth to the bar is a lot of money for me. So I just don’t go out drinking usually. There’s no excuse. She can get a limo back and forth and it’s nothing. Sheesh. ",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1509676777.0,
    "date_created": "2017-11-02",
    "time_created": "14:39:37",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp95np2",
    "parent_id": "t1_dp8zodo",
    "subreddit_name_prefixed": "r/news",
    "body": "We seriously need a massive change. The rich get away with too much. They have too much power. ",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1509679883.0,
    "date_created": "2017-11-02",
    "time_created": "15:31:23",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9ha9i",
    "parent_id": "t1_dp8zodo",
    "subreddit_name_prefixed": "r/news",
    "body": "Ethan Couch.  Brock Turner.  The list goes on, with trust fund babies so coddled that they can literally get away with murder.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1509692356.0,
    "date_created": "2017-11-02",
    "time_created": "18:59:16",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp97ugi",
    "parent_id": "t1_dp8zodo",
    "subreddit_name_prefixed": "r/news",
    "body": "Dude Alice Walton is a bitch I tell anyone about when the subject of money getting you out of trouble comes up.\n\nShe's seriously dangerous. A known alcoholic cruising around wrecking property and lives.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1509682072.0,
    "date_created": "2017-11-02",
    "time_created": "16:07:52",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9114q",
    "parent_id": "t1_dp8ze2s",
    "subreddit_name_prefixed": "r/news",
    "body": "Nah, they usually just get hired as CEO of another company.",
    "controversiality": 0,
    "ups": 81,
    "downs": 0,
    "score": 81,
    "created": 1509675365.0,
    "date_created": "2017-11-02",
    "time_created": "14:16:05",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp90xgj",
    "parent_id": "t1_dp8ze2s",
    "subreddit_name_prefixed": "r/news",
    "body": "Or your hit Netflix show gets cancelled. ",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1509675266.0,
    "date_created": "2017-11-02",
    "time_created": "14:14:26",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp91kvh",
    "parent_id": "t1_dp8ze2s",
    "subreddit_name_prefixed": "r/news",
    "body": "Dont worry, they still get a measly couple million in severance for their troubles.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1509675899.0,
    "date_created": "2017-11-02",
    "time_created": "14:24:59",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp923sn",
    "parent_id": "t1_dp8ze2s",
    "subreddit_name_prefixed": "r/news",
    "body": "lik this if you cray everytiem",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1509676411.0,
    "date_created": "2017-11-02",
    "time_created": "14:33:31",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp92nr6",
    "parent_id": "t1_dp903ah",
    "subreddit_name_prefixed": "r/news",
    "body": "And nothing ever came of this? The girl has to be coming on her teens now, and in this day and age shed have overwhelming support. I hope something happens ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1509676956.0,
    "date_created": "2017-11-02",
    "time_created": "14:42:36",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp956ke",
    "parent_id": "t1_dp903ah",
    "subreddit_name_prefixed": "r/news",
    "body": "That judge is probably a pedophile as well.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1509679413.0,
    "date_created": "2017-11-02",
    "time_created": "15:23:33",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp92mo4",
    "parent_id": "t1_dp903ah",
    "subreddit_name_prefixed": "r/news",
    "body": "The US is a joke and has been for years now.",
    "controversiality": 0,
    "ups": 70,
    "downs": 0,
    "score": 70,
    "created": 1509676928.0,
    "date_created": "2017-11-02",
    "time_created": "14:42:08",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp95ols",
    "parent_id": "t1_dp903ah",
    "subreddit_name_prefixed": "r/news",
    "body": "makes me think if a jury should be blindfolded... & only get stuff written on paper to them (to make sure they can't be partial)",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1509679908.0,
    "date_created": "2017-11-02",
    "time_created": "15:31:48",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp93fm4",
    "parent_id": "t1_dp903ah",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1509677713.0,
    "date_created": "2017-11-02",
    "time_created": "14:55:13",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8yc2l",
    "parent_id": "t1_dp8wypi",
    "subreddit_name_prefixed": "r/news",
    "body": "I was falsely charged and I was unemployable for a year while I waited for a friggin trial date. By the time trial came, I'd already lost more potential work due to the pending charge than if I had just pled guilty. A pending charge is way worse on the background check than a guilty plea. ",
    "controversiality": 0,
    "ups": 143,
    "downs": 0,
    "score": 143,
    "created": 1509672730.0,
    "date_created": "2017-11-02",
    "time_created": "13:32:10",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8yg3r",
    "parent_id": "t1_dp8wypi",
    "subreddit_name_prefixed": "r/news",
    "body": "It's important for you to tell people not to trust the government to protect them. Most people seem blissfully unaware that this can happen to them.",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1509672839.0,
    "date_created": "2017-11-02",
    "time_created": "13:33:59",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8yicf",
    "parent_id": "t1_dp8wypi",
    "subreddit_name_prefixed": "r/news",
    "body": "Also arrested for something I didn't do. Got sentenced 10 years deferred probation. Finished it in 3 and now i have to wait 5 years to get it sealed in my records. So ive got a first degree felony arrest chillin on my record. Until that gets sealed it sucks trying to explain to people what happened because unless they know you 99% of the time they just assume you're full of shit.",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1509672898.0,
    "date_created": "2017-11-02",
    "time_created": "13:34:58",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp92nd7",
    "parent_id": "t1_dp8y83q",
    "subreddit_name_prefixed": "r/news",
    "body": "As of right now don't send nudes might be the better policy. Not because it's wrong or anything, because some people have their nudes spread after breaking up and end up self harming or even killing themselves for it. ",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1509676946.0,
    "date_created": "2017-11-02",
    "time_created": "14:42:26",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8z57l",
    "parent_id": "t1_dp8y83q",
    "subreddit_name_prefixed": "r/news",
    "body": "Abstinence only works so well though!",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1509673511.0,
    "date_created": "2017-11-02",
    "time_created": "13:45:11",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8z1ku",
    "parent_id": "t1_dp8y83q",
    "subreddit_name_prefixed": "r/news",
    "body": "Yep my nude sending has gone up exponentially in the last 5 years, because it doesn't get worse than when my parents stumbled into them them, thanks Windows Media Library for uploading all my pc photos to my local network as default. Who cares if you send a nude, we all look the same, what I care about is stopping abuse and blackmail in its tracks. If we had a pro-selfie nude culture, we would rightly put the blame on those who abuse others' freedoms.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1509673413.0,
    "date_created": "2017-11-02",
    "time_created": "13:43:33",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp92lk3",
    "parent_id": "t1_dp9228t",
    "subreddit_name_prefixed": "r/news",
    "body": "My dad barely passed high school, he was just mercy passed to get him out of there. He got the first job he could find bringing home $400 a week after tax in **1982**. It's now 2017 and I make 600 a week after tax when I'm working full time for a job that requires much more special knowledge. '\n\nNow he makes $110,000 a year, about half of his night shifts he has no work so he just watches netflix, and he had 17 weeks off last year. ",
    "controversiality": 0,
    "ups": 183,
    "downs": 0,
    "score": 183,
    "created": 1509676898.0,
    "date_created": "2017-11-02",
    "time_created": "14:41:38",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp91fny",
    "parent_id": "t1_dp8xukj",
    "subreddit_name_prefixed": "r/news",
    "body": "I would rather hide my porn habits from my employer.  They may or may not appreciate them.  I have no problem telling people at work about some of the crazy crap I see and most of them have as well.  The issue is the threat of a higher up person not liking it and blacklisting against promotions as so on.  ",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1509675760.0,
    "date_created": "2017-11-02",
    "time_created": "14:22:40",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xg2m",
    "parent_id": "t1_dp8wy1n",
    "subreddit_name_prefixed": "r/news",
    "body": "\"Ah but you see, it's the government. You can trust them. And why would they care about my information in particular?\" etc, etc",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1509671887.0,
    "date_created": "2017-11-02",
    "time_created": "13:18:07",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9dzqf",
    "parent_id": "t1_dp8xgoh",
    "subreddit_name_prefixed": "r/news",
    "body": "Which is why our system is screwed up, prosecutors are insentivized to charge people when they know that the person is not guilty or there are extenuating circumstances.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1509688431.0,
    "date_created": "2017-11-02",
    "time_created": "17:53:51",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp93v0g",
    "parent_id": "t1_dp924qm",
    "subreddit_name_prefixed": "r/news",
    "body": "Hell, just knowing what it is will get you out of jury duty. ",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1509678138.0,
    "date_created": "2017-11-02",
    "time_created": "15:02:18",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8sju4",
    "parent_id": "t1_dp8ru14",
    "subreddit_name_prefixed": "r/news",
    "body": "Kenny Logns over here having epiphanies left and right. ",
    "controversiality": 0,
    "ups": 138,
    "downs": 0,
    "score": 138,
    "created": 1509667077.0,
    "date_created": "2017-11-02",
    "time_created": "11:57:57",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8t4h0",
    "parent_id": "t1_dp8sw65",
    "subreddit_name_prefixed": "r/news",
    "body": "They can only cast magic missile",
    "controversiality": 0,
    "ups": 1433,
    "downs": 0,
    "score": 1433,
    "created": 1509667660.0,
    "date_created": "2017-11-02",
    "time_created": "12:07:40",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8tuoz",
    "parent_id": "t1_dp8sw65",
    "subreddit_name_prefixed": "r/news",
    "body": "It's risk level for reoffense. There are only 3 levels. 1 is low risk, 2 is medium risk and 3 is high risk.\n\n\nKeep I mind that these are set at the day of their sentencing and can stick with them for decades after they are out of prison.\n\n\n\n",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1509668398.0,
    "date_created": "2017-11-02",
    "time_created": "12:19:58",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8tn5k",
    "parent_id": "t1_dp8sw65",
    "subreddit_name_prefixed": "r/news",
    "body": "I was looking at my neighborhood the other day and you could filter by tier. I'm not sure if they use the same system everywhere but in my state there's three tiers. 1 being least likely to re-offend and 3 being most likely. It also dictates how long they have the register and how frequently they have to update their address. I could dig up the site for you later if you want but it was actually pretty informative. I filtered by Tier 2 and 3 and it cut the list down to 10 guys and listed all their offenses.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1509668189.0,
    "date_created": "2017-11-02",
    "time_created": "12:16:29",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8x6ar",
    "parent_id": "t1_dp8vsk5",
    "subreddit_name_prefixed": "r/news",
    "body": "It's funny to read things like \"you lack the critical thinking and cognitive ability to see that I am correct and you are an idiot\" (in so many words) on reddit. One of my favorite quotes on the topic is John Stuart Mill on knowing both sides:\n\n>He who knows only his own side of the case knows little of that.  His reasons may be good, and no one may have been able to refute them. \n\n>But if he is equally unable to refute the reasons on the opposite side, if he does not so much as know what they are, he has no ground for preferring either opinion … \n\n>Nor is it enough that he should hear the opinions of adversaries from his own teachers, presented as they state them, and accompanied by what they offer as refutations.  \n\n>He must be able to hear them from persons who actually believe them … he must know them in their most plausible and persuasive form.",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1509671621.0,
    "date_created": "2017-11-02",
    "time_created": "13:13:41",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ymtj",
    "parent_id": "t1_dp8wlst",
    "subreddit_name_prefixed": "r/news",
    "body": "People love accruing virtue points on this site by taking the easy politically correct route of implicating someone of being a perpetrator of something that they are simply stating an opposing opinion about. Attacking the character of the person you disagree instead of actually responding to the point is the hallmark of being addicted to 'internet Political Correctness points'. ",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1509673017.0,
    "date_created": "2017-11-02",
    "time_created": "13:36:57",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp95o5d",
    "parent_id": "t1_dp92hep",
    "subreddit_name_prefixed": "r/news",
    "body": "holy shit. doris duke foundation pays for my research. didn't know about this. ",
    "controversiality": 0,
    "ups": 120,
    "downs": 0,
    "score": 120,
    "created": 1509679896.0,
    "date_created": "2017-11-02",
    "time_created": "15:31:36",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9c6jy",
    "parent_id": "t1_dp95np2",
    "subreddit_name_prefixed": "r/news",
    "body": "When capitalism allows people to collect thousands of lifetimes of wealth, or *more,* they only need to give up a few of those to pay themselves out of a lifetime or two of jail time. I mean, money literally represents time for people. If we respect capitalism, why *shouldn't* we allow people to just buy their freedom? That's how logical this system is from the very start.",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1509686520.0,
    "date_created": "2017-11-02",
    "time_created": "17:22:00",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp935gv",
    "parent_id": "t1_dp92mo4",
    "subreddit_name_prefixed": "r/news",
    "body": "I realised this after Brock Turner",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1509677441.0,
    "date_created": "2017-11-02",
    "time_created": "14:50:41",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp98rxy",
    "parent_id": "t1_dp95ols",
    "subreddit_name_prefixed": "r/news",
    "body": "Y'know? That isn't a half bad idea. Would solve a lot of problems I should think.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1509683010.0,
    "date_created": "2017-11-02",
    "time_created": "16:23:30",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp90aw3",
    "parent_id": "t1_dp8yc2l",
    "subreddit_name_prefixed": "r/news",
    "body": "Hence the guarantee of a *speedy* trial in the Constitution. But we live in the internet age now not the 18th century and a year is too slow.",
    "controversiality": 0,
    "ups": 71,
    "downs": 0,
    "score": 71,
    "created": 1509674644.0,
    "date_created": "2017-11-02",
    "time_created": "14:04:04",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp96q87",
    "parent_id": "t1_dp8yc2l",
    "subreddit_name_prefixed": "r/news",
    "body": "I caught a false rape claim (it became non-consentual weeks later, the moment her dad found out) that lost me a sweet government job. She recanted. I didn't get rehired.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1509680943.0,
    "date_created": "2017-11-02",
    "time_created": "15:49:03",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8znkn",
    "parent_id": "t1_dp8yg3r",
    "subreddit_name_prefixed": "r/news",
    "body": "And when we tell people not to trust it, they go into denial mode and just label you a conspiracy nut etc. \n\nSociety needs to stop being so blindly trusting of any asshole in an authority position. ",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1509674006.0,
    "date_created": "2017-11-02",
    "time_created": "13:53:26",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp91kvz",
    "parent_id": "t1_dp8yg3r",
    "subreddit_name_prefixed": "r/news",
    "body": "And god forbid you try to point this out to them. It's as if you were accusing them of actually being criminals. It's like a personal affront that the system could ever be flawed. I think it's for the same reason some women blame victims of sexual assault: if it's the victims fault, it can never happen to them.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1509675900.0,
    "date_created": "2017-11-02",
    "time_created": "14:25:00",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8zh07",
    "parent_id": "t1_dp8yicf",
    "subreddit_name_prefixed": "r/news",
    "body": "Trying being in Alabama where your record is never sealed it is on there for life. Oh and violent felonies don't apply to 7 year background check. I found that out the hard way when I applied for 2 jobs and had them until background checks came back. They said it was because of the violent felony and i replied that it was 9 years ago. Then it was explained that violent charges are excluded. This felony was 9 years ago but I will forever be stuck doing dead end jobs with no hope. ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1509673826.0,
    "date_created": "2017-11-02",
    "time_created": "13:50:26",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp93g6y",
    "parent_id": "t1_dp8z57l",
    "subreddit_name_prefixed": "r/news",
    "body": "Get your FACTS out of here! We're trying to practice out right to ruin a person's perception of sex for their entire lives!",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1509677729.0,
    "date_created": "2017-11-02",
    "time_created": "14:55:29",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp957lh",
    "parent_id": "t1_dp92lk3",
    "subreddit_name_prefixed": "r/news",
    "body": "For anyone wondering, $400 in 1982 is worth about [$1,008.45](https://data.bls.gov/cgi-bin/cpicalc.pl?cost1=400&year1=198209&year2=201709) today.",
    "controversiality": 0,
    "ups": 109,
    "downs": 0,
    "score": 109,
    "created": 1509679441.0,
    "date_created": "2017-11-02",
    "time_created": "15:24:01",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp92t0d",
    "parent_id": "t1_dp92lk3",
    "subreddit_name_prefixed": "r/news",
    "body": "does he use the phrase \"lazy millennials\"? because that would be swell. or is he insightful of how good of a deal he got?",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1509677099.0,
    "date_created": "2017-11-02",
    "time_created": "14:44:59",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp93fol",
    "parent_id": "t1_dp91fny",
    "subreddit_name_prefixed": "r/news",
    "body": "A perfect example of why your private life should remain private",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1509677715.0,
    "date_created": "2017-11-02",
    "time_created": "14:55:15",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8xw5l",
    "parent_id": "t1_dp8xg2m",
    "subreddit_name_prefixed": "r/news",
    "body": "\"Lucky for your I work for the government. As a janitor, per se, but government no less. Hand over that phone.\"",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1509672311.0,
    "date_created": "2017-11-02",
    "time_created": "13:25:11",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp94din",
    "parent_id": "t1_dp93v0g",
    "subreddit_name_prefixed": "r/news",
    "body": "Don't let them know",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1509678622.0,
    "date_created": "2017-11-02",
    "time_created": "15:10:22",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ue10",
    "parent_id": "t1_dp8sju4",
    "subreddit_name_prefixed": "r/news",
    "body": "Well, at least we will get a great song out of it ",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1509668920.0,
    "date_created": "2017-11-02",
    "time_created": "12:28:40",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8v3gs",
    "parent_id": "t1_dp8sju4",
    "subreddit_name_prefixed": "r/news",
    "body": "That's because he's on the footloose highway to the danger zone.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1509669613.0,
    "date_created": "2017-11-02",
    "time_created": "12:40:13",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8ta7f",
    "parent_id": "t1_dp8t4h0",
    "subreddit_name_prefixed": "r/news",
    "body": "How could they have known it doesn't require material components and they didn't have to take their wands out? They only just learned the spell!",
    "controversiality": 0,
    "ups": 81,
    "downs": 0,
    "score": 81,
    "created": 1509667823.0,
    "date_created": "2017-11-02",
    "time_created": "12:10:23",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8tkrx",
    "parent_id": "t1_dp8t4h0",
    "subreddit_name_prefixed": "r/news",
    "body": "Why would you cast Magic Missile?!? There's nothing to attack!",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1509668122.0,
    "date_created": "2017-11-02",
    "time_created": "12:15:22",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9b44k",
    "parent_id": "t1_dp95o5d",
    "subreddit_name_prefixed": "r/news",
    "body": "Keep taking the money. The dude who committed the crime is dead, maybe some good science can come of that money, at least.",
    "controversiality": 0,
    "ups": 169,
    "downs": 0,
    "score": 169,
    "created": 1509685403.0,
    "date_created": "2017-11-02",
    "time_created": "17:03:23",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp9fesl",
    "parent_id": "t1_dp98rxy",
    "subreddit_name_prefixed": "r/news",
    "body": "IDK about blindfolded,  but its a good idea to conceal the identities of everyone involved.  Cover the faces, origins, ethnicities, career,  etc., with black bars.  The only thing that should really matter in a trial is what the person allegedly did and to whom.  I've never been a juror, but I participated in mock trials in school and one of the things that was required in the opening statements was identities, including income and place of residence.  Why??",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1509690172.0,
    "date_created": "2017-11-02",
    "time_created": "18:22:52",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp965g1",
    "parent_id": "t1_dp90aw3",
    "subreddit_name_prefixed": "r/news",
    "body": "The reality is that our court system is severely overloaded in all respects. But too few people care about the \"criminals\" who end up in court, and of course Republicans think only they should get to appoint anyone, so it remains severely understaffed.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1509680370.0,
    "date_created": "2017-11-02",
    "time_created": "15:39:30",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp98gh0",
    "parent_id": "t1_dp90aw3",
    "subreddit_name_prefixed": "r/news",
    "body": "I know from experience, there is no time frame on a speedy trial. I was arrested Nov 2013 and didn't have my final court date till Jan 2016. My lawyers told me I got in pretty quick. They told me they had a case that had been waiting on trial for nearly 8 years. ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1509682687.0,
    "date_created": "2017-11-02",
    "time_created": "16:18:07",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp97jbi",
    "parent_id": "t1_dp96q87",
    "subreddit_name_prefixed": "r/news",
    "body": "And that charge will prob still show up in a private background check. A friend had an assault arrest dropped before arraignment. Like, the DA said it was a screw up and they never even charged him. He can't work for Uber bc it came up on the background check.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1509681753.0,
    "date_created": "2017-11-02",
    "time_created": "16:02:33",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp93a8p",
    "parent_id": "t1_dp92t0d",
    "subreddit_name_prefixed": "r/news",
    "body": "No, he doesn't say things like that and actually realises the job market is fucked up, surprisingly. He doesn't realise he has a good deal though. The median income for a **family** in Canada is around 50-60k. So he makes twice as much as the average **family** and he thinks he's about average. Doesn't ever go on holiday \"Because it's expensive and I can't afford it\" lol. He just sits at home and watches youtube on his ipad on his days off. ",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1509677569.0,
    "date_created": "2017-11-02",
    "time_created": "14:52:49",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp92jjd",
    "parent_id": "t1_dp8xw5l",
    "subreddit_name_prefixed": "r/news",
    "body": "Hmm, I'm technically a VA employee (home health aid for a disabled veteran), therefore a government employee, so now I'm gonna start using a variation of this line all the time!",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1509676842.0,
    "date_created": "2017-11-02",
    "time_created": "14:40:42",
    "submission_id": "news-7abp34"
  },
  {
    "id": "dp8uv60",
    "parent_id": "t1_dp8tkrx",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm attacking THE DARKNESS!",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1509669388.0,
    "date_created": "2017-11-02",
    "time_created": "12:36:28",
    "submission_id": "news-7abp34"
  }
]