[
  {
    "id": "do6rsyf",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "Holy shit. Props to Terry for coming out and saying this. I wonder who else is going to come forward and admit that they were molested by some shady Hollywood exec.",
    "controversiality": 0,
    "ups": 12172,
    "downs": 0,
    "score": 12172,
    "created": 1507698122.0,
    "date_created": "2017-10-10",
    "time_created": "17:02:02",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71cxk",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "About 2004, I was about to pay for a parking spot in Hollywood lot.  It was the kind of lot where you park and then go punch in your spot number and pay at a machine.  Just as I'm about to pay, a large black SUV with blacked out windows pulled up next to me and the driver side window slid down.  Driver called me over and had a ticket in hand.  He said, go park in spot #12, I already paid for that one and it has 2 more hours to go.  I thanked him and offered to pay him back, but he wouldn't accept anything.  The window rolled up and he drove away.  As a poor college kid at the time, I moved my car to the pre-paid spot and chalked it up as a win. \n\nThe dude in the car was Terry Crews.  He did me a small favor just because it was the cool thing to do.\n\nEven more respect for him after today.  ",
    "controversiality": 0,
    "ups": 1351,
    "downs": 0,
    "score": 1351,
    "created": 1507709622.0,
    "date_created": "2017-10-10",
    "time_created": "20:13:42",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6sq8e",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 3371,
    "downs": 0,
    "score": 3371,
    "created": 1507699157.0,
    "date_created": "2017-10-10",
    "time_created": "17:19:17",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6vky1",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "Terry Crews has so much of my respect.  \n\nActor, comedian, artist, musician, bodybuilder, and above all, both and incredible dad and humble.\n\nThe fact that someone so talented still has to check himself in social situations like being sexually assaulted, and having the confidence to come out and express that fact is another layer of incredible.\n\nI'm never going to be cool enough to be in a room with him, but he's such a cool guy that he'd go out of his way to make me feel comfortable, even if I'm a nobody.",
    "controversiality": 0,
    "ups": 6285,
    "downs": 0,
    "score": 6285,
    "created": 1507702433.0,
    "date_created": "2017-10-10",
    "time_created": "18:13:53",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6rqmk",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "If it happens to adult, in-shape Terry fucking Crews at a party, it could happen to anyone ",
    "controversiality": 0,
    "ups": 11511,
    "downs": 0,
    "score": 11511,
    "created": 1507698048.0,
    "date_created": "2017-10-10",
    "time_created": "17:00:48",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6st4i",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "*Crews revealed that he was groped by an unnamed male executive at an industry party last year. Crews says he almost lashed out at the man, but stopped himself once he realized how it would be portrayed: “240 lbs. Black Man stomps out Hollywood Honcho.” After telling the man’s co-workers about what happened, he received an apology the next day; he let it go after that, out of fear of being ostracized in the industry. Now, Crews says he can empathize with what Weinstein’s alleged victims, as well as many others, went through: “Hollywood is not the only business where this happens, and to the casualties of this behavior — you are not alone.” said Crews.*\n\nTerry Crews is the last person you would think anyone would sexually assault. Glad he's speaking out about this.",
    "controversiality": 0,
    "ups": 33737,
    "downs": 0,
    "score": 33737,
    "created": 1507699246.0,
    "date_created": "2017-10-10",
    "time_created": "17:20:46",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6t4b4",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "Good on Terry for standing up and speaking out.  Even the biggest, strongest guy in the room faces the same awful thoughts when attacked.  \"They won't believe me.\"  \"They'll try to blame me if I fight back.\"  \"I'll be ruined professionally.\"\n\nAssault is never the victim's fault.  There's no such thing as not fighting back enough.  The attacker is 100% to blame for being a despicable piece of human filth.  With every voice that speaks up, the collective voice becomes stronger and abusers get closer and closer to their days of judgment.",
    "controversiality": 0,
    "ups": 1287,
    "downs": 0,
    "score": 1287,
    "created": 1507699591.0,
    "date_created": "2017-10-10",
    "time_created": "17:26:31",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6t2jg",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "My guess is that the floodgates are starting to open, and we are in for a lot of firsthand accounts of how Hollywood is largely run by some of the worst living people. A guy like Weinstein doesn't pull the shit he did for *decades* in a cultural vacuum. ",
    "controversiality": 0,
    "ups": 3765,
    "downs": 0,
    "score": 3765,
    "created": 1507699538.0,
    "date_created": "2017-10-10",
    "time_created": "17:25:38",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6tei5",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "Man, Terry Crews is such an amazing person. I love this guy more and more.",
    "controversiality": 0,
    "ups": 1201,
    "downs": 0,
    "score": 1201,
    "created": 1507699909.0,
    "date_created": "2017-10-10",
    "time_created": "17:31:49",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71f1g",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "I remember reading an article once about Elijah Wood, talking about how child sexual harassment/assault was rampant in Hollywood. He claimed his mother somehow managed to save him from all of it, and he came out unscathed, but according to him a large number of child actors are sort of \"passed around\" certain circles in Hollywood. I'm glad this shit is finally getting exposed.\n\nEdit: According to [this](https://www.nytimes.com/2016/05/25/movies/elijah-wood-hollywood-child-star-pedophilia.html) he clarified that he never actually witnessed anything first hand. But he still seems pretty confident that that kind of stuff is going on.",
    "controversiality": 0,
    "ups": 272,
    "downs": 0,
    "score": 272,
    "created": 1507709693.0,
    "date_created": "2017-10-10",
    "time_created": "20:14:53",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6sndt",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "People have known that Hollywood execs have been sexually assaulting actresses and actor for years and they didn't say a thing. It seems it's not just Weinstein, but many others. ",
    "controversiality": 0,
    "ups": 589,
    "downs": 0,
    "score": 589,
    "created": 1507699069.0,
    "date_created": "2017-10-10",
    "time_created": "17:17:49",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6sko9",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "Think what they must do to kids if a large imposing man like Terry Crews gets groped without repercussion.",
    "controversiality": 0,
    "ups": 298,
    "downs": 0,
    "score": 298,
    "created": 1507698986.0,
    "date_created": "2017-10-10",
    "time_created": "17:16:26",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6vbqj",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "Brett Ratner and Brian Singer better be the next abusers on the chopping block...",
    "controversiality": 0,
    "ups": 251,
    "downs": 0,
    "score": 251,
    "created": 1507702129.0,
    "date_created": "2017-10-10",
    "time_created": "18:08:49",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7192s",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "So not only is this man incredibly strong physically. But he's exceptionally brave and strong mentally. I knew a little bit about his upbringing. It mirrors my own in shittyness somewhat. But me being molested at a young age kinda fucked me up for ages and I'm still battling a lot of demons. This man is truly an inspiration and I love a large portion of his work.  Can't wait for Brooklyn Nine Nine to come back. And I love ya Terry!!!!",
    "controversiality": 0,
    "ups": 54,
    "downs": 0,
    "score": 54,
    "created": 1507709493.0,
    "date_created": "2017-10-10",
    "time_created": "20:11:33",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6skrg",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "You gotta have some serious cajones to grab President Camacho by the dick.",
    "controversiality": 0,
    "ups": 326,
    "downs": 0,
    "score": 326,
    "created": 1507698989.0,
    "date_created": "2017-10-10",
    "time_created": "17:16:29",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6rmrw",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "the floodgates may have just been broken",
    "controversiality": 0,
    "ups": 340,
    "downs": 0,
    "score": 340,
    "created": 1507697932.0,
    "date_created": "2017-10-10",
    "time_created": "16:58:52",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71nwk",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "Terry Crews just rendered the process of sexual assault perfectly comprehensible to anyone previously unwilling to imagine it. Seriously. Just point 'em to that thread... Hurray!",
    "controversiality": 0,
    "ups": 79,
    "downs": 0,
    "score": 79,
    "created": 1507709974.0,
    "date_created": "2017-10-10",
    "time_created": "20:19:34",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6tvco",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "Name him Terry.\n\nEveryone is on your side. The power rests with you, not that fucker creep.",
    "controversiality": 0,
    "ups": 347,
    "downs": 0,
    "score": 347,
    "created": 1507700438.0,
    "date_created": "2017-10-10",
    "time_created": "17:40:38",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6xh0z",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "This is what they do to the adults, just think about the kids. ",
    "controversiality": 0,
    "ups": 71,
    "downs": 0,
    "score": 71,
    "created": 1507704752.0,
    "date_created": "2017-10-10",
    "time_created": "18:52:32",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zwx8",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "It is fucking rampant here. I have heard of multiple stories of showrunners flaunting their power too. This will probably disappear in the sands of reddit, but having been inappropriately touched in a workplace by another male, I am greeted with contempt and revulsion by people I tell. So, good on Terry for sharing.",
    "controversiality": 0,
    "ups": 67,
    "downs": 0,
    "score": 67,
    "created": 1507707840.0,
    "date_created": "2017-10-10",
    "time_created": "19:44:00",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6tupo",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "Who do you have to be to molest Terry fucking Crews and *know* you won't get your ass kicked?",
    "controversiality": 0,
    "ups": 157,
    "downs": 0,
    "score": 157,
    "created": 1507700417.0,
    "date_created": "2017-10-10",
    "time_created": "17:40:17",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6tied",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "Good on him. He has constantly been such a person to look up to in my eyes. This proves that to me further. He seems to have such air of genuine nature that people (not even just famous people) lack. Mad props to him for being so brave. Coming out with something like that isn't easy, especially with the cultural stigma we can have that this sort of thing doesn't happen to men. ",
    "controversiality": 0,
    "ups": 76,
    "downs": 0,
    "score": 76,
    "created": 1507700032.0,
    "date_created": "2017-10-10",
    "time_created": "17:33:52",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6ryhw",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "Yea, this is not just a Hollywood issue like everyone wants to claim. It’s a systemic issue of how victims are portrayed and how money controls everything and everyone \n\nEdit: Spelling \n\nEdit: Yes, it’s also a Hollywood issue, my point is that it isn’t JUST a Hollywood issue.",
    "controversiality": 0,
    "ups": 434,
    "downs": 0,
    "score": 434,
    "created": 1507698296.0,
    "date_created": "2017-10-10",
    "time_created": "17:04:56",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71lr0",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm a dude, and I lost my job because I reported sexual harassment. It was a female manager. \n\nTrust me, none of you dudes would've slept with her. She was a creepy, fucked up woman... mentioned crushing animals and shit like that. Her husband looked scared out of his mind in their Facebook profile picture. \n\nThere's not a damn thing you can do about it. Employees have no rights, no power, nothing. \n\nThat's the American way.",
    "controversiality": 0,
    "ups": 100,
    "downs": 0,
    "score": 100,
    "created": 1507709908.0,
    "date_created": "2017-10-10",
    "time_created": "20:18:28",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70i1n",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "I am...more than a little frustrated by two types of comments I'm seeing *a lot* of.\n\n1. \"Crews could beat the shit out of the guy!\"\n\n2. \"Hollywood is corrupt!\"\n\nThis ignores two very important facts.\n\nFirst, people who do things like grope or assault other people generally do not target people that they know can respond. Their targets are usually people who, by reason of physical build, professional concern, or anonymity, cannot respond to the attack (and make no mistake it *is* an attack) or defend themselves without great potential risk.\n\nAbusers rely on that threat of risk to keep the people they target silent. \n\nSecond, and perhaps more importantly, *this is not just Hollywood.* This is everywhere. This happens on a daily basis, probably to someone you know or see regularly. Anywhere there is a disparity in power, there is home for abuse. \n\nMy boss pulled a similar move to the executive. She's 85. We were alone in her car driving to pick up supplies for a party at work. No one else saw. No one else was there. \n\nI am 6'1'' and 220 lbs. Physically, there's no contest. But I knew if I responded I would risk my job and there's no way I would have been believed. So I stayed quiet and said nothing. That was five years ago and I still work at the same non-profit with the same boss.\n\nThis is a problem *everywhere.* ",
    "controversiality": 0,
    "ups": 81,
    "downs": 0,
    "score": 81,
    "created": 1507708563.0,
    "date_created": "2017-10-10",
    "time_created": "19:56:03",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6rzz0",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "how disconnected do you have to be from reality to think groping terry crews would be a good idea?  he could rip your arms off your body and beat you with them. \n\nmy father dabbles in forensic accounting/fraud investigations/etc...  he would tell me that there are lots of reasons people start to steal from their company, but they almost always start small.  eventually, it becomes so common to them they start to actually normalize it.  the longer they go, and the longer they don't get caught, they things and numbers get bigger and bigger.  it stops being \"holy shit i can't believe i got away with that\" to \"this is just what i do on thursday\".  \n\nand eventually - that's what gets them busted. \n\nthat's hollywood, except with perverts. ",
    "controversiality": 0,
    "ups": 280,
    "downs": 0,
    "score": 280,
    "created": 1507698343.0,
    "date_created": "2017-10-10",
    "time_created": "17:05:43",
    "submission_id": "news-75k317"
  },
  {
    "id": "do72o98",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "Can you even imagine how arrogantly, confidently secure in your own safety you would have to feel to look at Terry Fucking Crews and think \"I'm gonna grab that guy's genitals without his permission\". \n\nI wouldn't do that from INSIDE OF A LOCKED CAR. I wouldn't shake Terry Crew's HAND if he wasn't feeling it 100%. The dude is fucking huge. He's like the \"after\" shot of someone who just received the super soldier serum. \n\nKinda goes to show that the \"why didn't you fight him off\" bullshit women always get is exactly that. Bullshit. Because unless this dude was The Rock, I'm assuming Crews could have broken him in half without breaking a sweat. And yet, he was unable to do so. Because power dynamics.\n\nShit is fucked up.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1507711186.0,
    "date_created": "2017-10-10",
    "time_created": "20:39:46",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6xeet",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "And ignorant people are wondering why Hollywood Stars such as Corey Feldman, Amanda Bynes, Miley Cyrus, Britney Spears, Justin Timberlake, Tom Cruise, Pamela Anderson etc. had their episodes of \"mental breakdown\".\n\nPeople tend to just perceive that sexual assault is mainly for women, while ignoring that men also suffer from these kinds of sexual abuse.\n\nMen are also human beings. Men also feel humiliated inside, when they have to lower their \"pride\" to give sexual gratification to either other men or women. And i'm not just talking about Gay men having to please women. But also straight men who were force to cheat on their significant other, in other to land or stay on a good acting career.\n\nThat is why a lot of these \"Hollywood Celebrities\" have their bouts with alcoholism, drug and cigarette addiction. ",
    "controversiality": 0,
    "ups": 163,
    "downs": 0,
    "score": 163,
    "created": 1507704661.0,
    "date_created": "2017-10-10",
    "time_created": "18:51:01",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7ahuu",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm a mid-level actor in Los Angeles.  Sexual harassment is but one of several forms of \"weeding out\" actors from opportunities.  It's done also by favoring family ties and discriminating against actors based upon what agency represents them for television and film (so-called \"theatrical\" representation).  Many casting directors disregard submissions from mid to low-level talent agencies for Guest Star parts on television, for example.  They claim the reason is to save time, but the more likely reason is that when they give business to the higher level talent agencies, they get more work referred to them by the directors and producers also represented by those agencies.  But sexual harassment gets the most news.  The fact is that if an actor is iced out of the industry and his or her career is suppressed, the bottom line is the same: the actor has great difficulty progressing to better and more lucrative roles.  Many actors have experienced sexual harassment and probably it occurs more at the lower echelons of the professional actor community.  This is because once an actor has reached a certain high level and is in demand, that demand tends to be widespread and saying \"no\" to any given director, producer or casting director tends to have lesser consequences.  20 years ago or so I had worked for a particular film company on two films and the notoriously gay casting director asked me to go to dinner and a movie with him.  I knew this person on a superficial basis and only in the context of him being a casting director.  After I thanked him for the compliment but said no thank you, I was never brought into that office again for any other film or acting project.  Was this sexual harassment?  Who knows for sure, but probably.  I never reported it as such since it was so nebulous, but that's how it often works.  You're asked on what amounts to a date.  If you go along, then things might work out for you down the line for an acting role.  If you don't go along, then, if it's sexual discrimination, you are never again brought in for any appropriate role.  This process has happened this way in Hollywood literally for decades.  How to stop this in the future?  Heavy punitive damages award if it is proven in a court of law, and enactment of laws that prohibit settlements of these kinds of dispute from being confidential.  You cannot put the onus all on the actor to say \"no\" since it is like many other employment situations--the duress is too great, considering the stakes, for an actor to be expected to say no when so much is on the line.  I did, but not every actor has the same will power and principles.  One final point: there are many actors, both male and female, who use sex to their advantage and they also can be considered predators.  They give sexual advances in exchange for promises and they are on the offering side.  So, this sexual exchange system does operate in reverse as well in Hollywood.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1507720411.0,
    "date_created": "2017-10-10",
    "time_created": "23:13:31",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7ct9s",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "A family friend moved to Hollywood and tried to make it big after starring in some popular small local shows. She came home saying she'd never get work there because the producers just invited her over while the wife and kids were out and asked her to strip as a job interview. Occurred more than once with more than one producer/studio exec. She had morals and declined...thus no work. ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1507723739.0,
    "date_created": "2017-10-11",
    "time_created": "00:08:59",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6y11p",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "The sad thing is that were this a story about \"just\" another *woman* telling a story about sexual harassment, /r/new's inexplicably large Shitlord population would be festering all over the thread, talking about how all women are lying whores.\n\nAnd if you don't believe me, you've clearly never seen *any* other /r/news thread involving women, sexual harassment, or Ellen Pao.",
    "controversiality": 0,
    "ups": 274,
    "downs": 0,
    "score": 274,
    "created": 1507705443.0,
    "date_created": "2017-10-10",
    "time_created": "19:04:03",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7006d",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "Hollywood makes such a big deal out of being PC and inclusive, but in reality they’re the kind of business where people can be ostracized out of work... makes you wonder what hope people who live in “reality” have.",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1507707952.0,
    "date_created": "2017-10-10",
    "time_created": "19:45:52",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zso8",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "THats just a terrifying situation. Someone honking your weiner and you having the choice of delivering a beatdown and going to jail/losing everything or just forgetting about it\n\nNow imagine what women have to go through",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1507707691.0,
    "date_created": "2017-10-10",
    "time_created": "19:41:31",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6w1yk",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "> I was going to kick his ass right then— but I thought twice about how the whole thing would appear.... *\"240 lbs. Black Man stomps out Hollywood Honcho” would be the headline the next day. Only I probably wouldn’t have been able to read it because* **I WOULD HAVE BEEN IN JAIL.**\n\nPowerful meta statement there, not just about sexual abuse, but about **racism** at the highest levels.",
    "controversiality": 0,
    "ups": 346,
    "downs": 0,
    "score": 346,
    "created": 1507703004.0,
    "date_created": "2017-10-10",
    "time_created": "18:23:24",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6wynz",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "Imagine if you weren't just dependent on your assaulter for a job, but your physical safety as well. Imagine if you were assaulted by someone who wasn't afraid of the story coming out because of all the high fives he would receive.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1507704119.0,
    "date_created": "2017-10-10",
    "time_created": "18:41:59",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7blse",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "Somewhere between the Catholic priest scandal, the Penn State scandal, the rash of white female teachers molesting kids and Bill Zeller killing himself, it dawned on me that a lot of white guys out there have been molested or raped. I'm well aware of molestation issues in the black community, but honestly I just never realized how much this happens to white men and I can't help but think it has a lot to do with the hatred in this country right now.\n\nWe have to make it easier for men to come forward and tell their stories without being ostracized and there must be tougher consequences for this type of violation. A slap on the wrist is just not good enough, regardless of the gender of the victim.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1507721942.0,
    "date_created": "2017-10-10",
    "time_created": "23:39:02",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6tazv",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "I can't believe he's only 240 pounds. \n\nWould have thought he was easily 290 how big he is. \n\nLove the man. He's someone who I appreciate more because if his actions off the screen. Can't say that too often. ",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1507699798.0,
    "date_created": "2017-10-10",
    "time_created": "17:29:58",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6rwi2",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "God I love this man, Hector Camacho 2020!",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1507698233.0,
    "date_created": "2017-10-10",
    "time_created": "17:03:53",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6unuj",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "Hollywood, for a long time, has had this reputation. Anyone who has worked and lived there knows about it. A lot of it is true. It is prevalent there. Many are too afraid to speak out. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1507701344.0,
    "date_created": "2017-10-10",
    "time_created": "17:55:44",
    "submission_id": "news-75k317"
  },
  {
    "id": "do709z0",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "i'm convinced they make all actresses give them nude photos. how else does every actress you've heard of have nudes on iCloud? \n\nThere's definitely some coercion/casting couch shit going on. ",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1507708290.0,
    "date_created": "2017-10-10",
    "time_created": "19:51:30",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6y62u",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1507705624.0,
    "date_created": "2017-10-10",
    "time_created": "19:07:04",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6vmx0",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "It seems everyone is fair game for these shady Hollywood fucks. Huge respect to Terry for coming out an publicising his experiences. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507702499.0,
    "date_created": "2017-10-10",
    "time_created": "18:14:59",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6vuco",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "Goddamn I love Terry Crews.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1507702753.0,
    "date_created": "2017-10-10",
    "time_created": "18:19:13",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6x0fg",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "Fucking terry crews...What a boss.  \nIs there anything this guy doesn't rule at??",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507704181.0,
    "date_created": "2017-10-10",
    "time_created": "18:43:01",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71vu8",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "I recommend watching the documentary \"[Open Secret](https://youtu.be/4eeGX4SlF1s)\". You won't find it anywhere but Youtube. The industry is rampant with sexual predators, many of whom are still working today.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507710237.0,
    "date_created": "2017-10-10",
    "time_created": "20:23:57",
    "submission_id": "news-75k317"
  },
  {
    "id": "do75ffx",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "Terry Crews is such a great guy. He's also talked about overcoming his porn addiction. It takes a special kind of bravery to open up about stuff like this, even for an ex-lineman. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1507714396.0,
    "date_created": "2017-10-10",
    "time_created": "21:33:16",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7a5sj",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "This is what one would refer to as a “can of worms “. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507719980.0,
    "date_created": "2017-10-10",
    "time_created": "23:06:20",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6yii6",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1507706063.0,
    "date_created": "2017-10-10",
    "time_created": "19:14:23",
    "submission_id": "news-75k317"
  },
  {
    "id": "do74us6",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "I used to be a long-haired death metal dude.On more than one occasion I had some drunk idiot grab my ass or try to other-wise grope me thinking I was a chick from behind. Dudes are gross, don't come anywhere near us. ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1507713732.0,
    "date_created": "2017-10-10",
    "time_created": "21:22:12",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6yu2b",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "Terry Crews is, by all accounts, a stand up guy. Good on him for speaking out. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1507706471.0,
    "date_created": "2017-10-10",
    "time_created": "19:21:11",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70gwx",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "I love Terry Crews, and I'm sad that he was the victim of assault.  Props to him for speaking out about it!",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1507708523.0,
    "date_created": "2017-10-10",
    "time_created": "19:55:23",
    "submission_id": "news-75k317"
  },
  {
    "id": "do78smx",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "Happened to me too. I was a young editor, just starting my freelance career and a producer and executive producer both said some fucked up things to me. The executive producer would have long 'status' calls where he would mostly ask me about if I'd ever get naked with other men or jerk off in the same room as them. He offered to pay me for it once. All the while he would dangle all of these projects he said he was working on. And I don't think I can explain how broke and in need of work I was, not to mention the projects would propel my career enormously.\n\nI posted about it annonomously on a filmmaking board to see what I should do about it and almost no one was sympathetic. Most people thought I made it up, others insisted that I was a latent homosexual if a man would sexually harrass me. I was baffled at how they could victim blame and really sympathized with all of the women who have gone through what I've went through and much, much worse.\n\nI decided to finish out my project with them and never work on these other projects (which, looking back, were almost certainly fictional). The kicker was they are, to this day, the only client that never paid me. I sued them and got some of it, but it makes my blood boil to this day.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507718306.0,
    "date_created": "2017-10-10",
    "time_created": "22:38:26",
    "submission_id": "news-75k317"
  },
  {
    "id": "do79pez",
    "parent_id": "t3_75k317",
    "subreddit_name_prefixed": "r/news",
    "body": "Reading all the Actor responses here: http://toofab.com/2017/10/10/all-hollywoods-reactions-to-harvey-weinstein-sexual-harassment-scandal-updating/ \n\nI'm just left with my head shaking.  The nutshell version of this is \n\n**Insert Actor Name Here:** \n> This is inexcusable. Disgusting behavior. While I have never encountered this behavior myself, nor anyone I have talked to or worked with, these ladies are brave for coming out and it is heartbreaking to learn what they have gone through \n\n**Fuck you all.**  \n\n> Most well known open secret in Hollywood for the last 20 years...that apparently nobody has heard of....",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1507719417.0,
    "date_created": "2017-10-10",
    "time_created": "22:56:57",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6tkjm",
    "parent_id": "t1_do6rsyf",
    "subreddit_name_prefixed": "r/news",
    "body": "I hope this wave of attention isn't limited to just Hollywood, it's anywhere someone can abuse their power over others.",
    "controversiality": 0,
    "ups": 3794,
    "downs": 0,
    "score": 3794,
    "created": 1507700097.0,
    "date_created": "2017-10-10",
    "time_created": "17:34:57",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6vo0x",
    "parent_id": "t1_do6rsyf",
    "subreddit_name_prefixed": "r/news",
    "body": "> I wonder who else is going to come forward and admit that they were molested by some shady Hollywood exec.\n\n[Rob Schneider just came out](http://www.tmz.com/2017/10/10/rob-schneider-sexual-harassment-director-harvey-weinstein/)",
    "controversiality": 0,
    "ups": 1086,
    "downs": 0,
    "score": 1086,
    "created": 1507702538.0,
    "date_created": "2017-10-10",
    "time_created": "18:15:38",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6u5h4",
    "parent_id": "t1_do6rsyf",
    "subreddit_name_prefixed": "r/news",
    "body": "> Holy shit. Props to Terry for coming out and saying this.\n\nWhat I'd like to know is how big are the balls on the guy who groped *Terry Crews*?  Why doesn't he just rub his own balls, they hang to the fucking floor they are so massive. Crews is a big scary, *ripped* dude. I don't care how powerful you are, grabbing that dudes junk is risky business, at threat of serious bodily harm.\n\nIf people are groping *him*, imagine their impunity at groping some young actress (or actor). These are people with absolutely no fear, or compunction whatsoever at doing this.\n",
    "controversiality": 0,
    "ups": 1263,
    "downs": 0,
    "score": 1263,
    "created": 1507700762.0,
    "date_created": "2017-10-10",
    "time_created": "17:46:02",
    "submission_id": "news-75k317"
  },
  {
    "id": "do76mzk",
    "parent_id": "t1_do6rsyf",
    "subreddit_name_prefixed": "r/news",
    "body": ">I wonder who else is going to come forward\n\nSo...did you miss all the *women* saying it?",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1507715787.0,
    "date_created": "2017-10-10",
    "time_created": "21:56:27",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zev8",
    "parent_id": "t1_do6rsyf",
    "subreddit_name_prefixed": "r/news",
    "body": "Hopefully, every child star ever...\n\nLike seriously, ALL OF THEM. It's long been something everybody knows, nobody talks about.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1507707208.0,
    "date_created": "2017-10-10",
    "time_created": "19:33:28",
    "submission_id": "news-75k317"
  },
  {
    "id": "do740zl",
    "parent_id": "t1_do6rsyf",
    "subreddit_name_prefixed": "r/news",
    "body": "Some people have been saying this shit for years (e.g. Lindsey Lohan). The problem is that nobody was listening until now. I'm really glad this is happening. Finally.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1507712750.0,
    "date_created": "2017-10-10",
    "time_created": "21:05:50",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7bp2w",
    "parent_id": "t1_do6rsyf",
    "subreddit_name_prefixed": "r/news",
    "body": "I mean, women have been coming out with this info for years... ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507722074.0,
    "date_created": "2017-10-10",
    "time_created": "23:41:14",
    "submission_id": "news-75k317"
  },
  {
    "id": "do74n2b",
    "parent_id": "t1_do6rsyf",
    "subreddit_name_prefixed": "r/news",
    "body": "Didn't the Coreys (can't remember their last names, but they were in The Lost Boys) come forward talking about the sexual abuse they faced as teens in the industry and people dismissed them? \n\nThis isn't new and frankly I'm not surprised. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507713479.0,
    "date_created": "2017-10-10",
    "time_created": "21:17:59",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7b82d",
    "parent_id": "t1_do6rsyf",
    "subreddit_name_prefixed": "r/news",
    "body": "Hasn't Robert Downy Jr. and Carrie Fisher been saying it their whole careers?",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507721406.0,
    "date_created": "2017-10-10",
    "time_created": "23:30:06",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7c37n",
    "parent_id": "t1_do6rsyf",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm glad that he came out with his story but I really think you may be undermining the message here. It is not about shady Hollywood exec.'s, it's about disuse of power to sexually abuse someone, which is rampant in every industry and pay level.\n\n This gets a lot of attention because it is a famous person speaking out on an institution, but the issue is so much bigger. One in three women experiences sexual harassment at work. I cannot tell you how many of those experience groping but I will tell you that in 15 years in the service industry I have had 17 men touch me inappropriately at work. Everywhere from boob grabs to grabbing me by the hips and dry humping me. It is scary when it comes from someone with power, but much more terrifying when those in power defend the perpetrators and/or threaten your livelihood for mentioning the \"transgression\".\n\nThis is an issue that has been around for both men AND women since the beginning of civilization. Maybe we can be the generation to fix it if we talk about it enough. Maybe not. Who knows.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507722646.0,
    "date_created": "2017-10-10",
    "time_created": "23:50:46",
    "submission_id": "news-75k317"
  },
  {
    "id": "do745e5",
    "parent_id": "t1_do71cxk",
    "subreddit_name_prefixed": "r/news",
    "body": "Thank god, I thought it was going to be a hollywood exec about to use that against you for sexual assault purposes.",
    "controversiality": 0,
    "ups": 812,
    "downs": 0,
    "score": 812,
    "created": 1507712892.0,
    "date_created": "2017-10-10",
    "time_created": "21:08:12",
    "submission_id": "news-75k317"
  },
  {
    "id": "do75bku",
    "parent_id": "t1_do71cxk",
    "subreddit_name_prefixed": "r/news",
    "body": "> Just as I'm about to pay, a large black SUV with blacked out windows pulled up next to me and the driver side window slid down. \n\nConsidering the the theme of this post (Hollywood Sexual Abuse), I saw this comment being WAYYY different than what it ended up being.",
    "controversiality": 0,
    "ups": 236,
    "downs": 0,
    "score": 236,
    "created": 1507714273.0,
    "date_created": "2017-10-10",
    "time_created": "21:31:13",
    "submission_id": "news-75k317"
  },
  {
    "id": "do73314",
    "parent_id": "t1_do71cxk",
    "subreddit_name_prefixed": "r/news",
    "body": "Terry crews is a stand up guy. I’ve heard nothing but positive things about him in the industry. He gave great advice also during a speech I listened to. ",
    "controversiality": 0,
    "ups": 70,
    "downs": 0,
    "score": 70,
    "created": 1507711666.0,
    "date_created": "2017-10-10",
    "time_created": "20:47:46",
    "submission_id": "news-75k317"
  },
  {
    "id": "do76v2e",
    "parent_id": "t1_do71cxk",
    "subreddit_name_prefixed": "r/news",
    "body": "I scanned your comment for jumper cables and the Undertaker.  Reddit may have ruined me.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1507716025.0,
    "date_created": "2017-10-10",
    "time_created": "22:00:25",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6wb35",
    "parent_id": "t1_do6sq8e",
    "subreddit_name_prefixed": "r/news",
    "body": "The reality is that he *didn't* talk about it. He kept his mouth shut at the time.\n\nPeople always ask why a ton of people come forward with accusations at once. This is why. Terry Crews didn't have the confidence to talk about this until he saw Weinstein go down. Knowing that you aren't alone, that your voice isn't going to be the only one, is a massive confidence booster.\n\nNotice that he still didn't say who. By being vague he can be one voice in many, but if he were specific he would be back to being alone.",
    "controversiality": 0,
    "ups": 2029,
    "downs": 0,
    "score": 2029,
    "created": 1507703315.0,
    "date_created": "2017-10-10",
    "time_created": "18:28:35",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71i2l",
    "parent_id": "t1_do6sq8e",
    "subreddit_name_prefixed": "r/news",
    "body": "This is *THE* point he wanted to make.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1507709794.0,
    "date_created": "2017-10-10",
    "time_created": "20:16:34",
    "submission_id": "news-75k317"
  },
  {
    "id": "do74105",
    "parent_id": "t1_do6vky1",
    "subreddit_name_prefixed": "r/news",
    "body": "I was a stand-in on Expendables. Terry was less famous then, but still a name. I was doing my job on set, when he started telling the other famous actors jokes. The thing that floored me, was that he made eye contact with everyone, including little old me sitting in the back. When he laughed and joked, he looked to everyone as equals. This man deserves every bit of goodwill, fame and respect coming to him. You are most definitely correct. In a room with Terry, he'd more than make you feel at home, he'd have you in stitches. ",
    "controversiality": 0,
    "ups": 2453,
    "downs": 0,
    "score": 2453,
    "created": 1507712751.0,
    "date_created": "2017-10-10",
    "time_created": "21:05:51",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zri4",
    "parent_id": "t1_do6vky1",
    "subreddit_name_prefixed": "r/news",
    "body": "He's an athlete too. [He played in the NFL ~~for the Vikings~~ ](https://www.pro-football-reference.com/players/C/CrewTe20.htm)",
    "controversiality": 0,
    "ups": 829,
    "downs": 0,
    "score": 829,
    "created": 1507707652.0,
    "date_created": "2017-10-10",
    "time_created": "19:40:52",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71ffc",
    "parent_id": "t1_do6vky1",
    "subreddit_name_prefixed": "r/news",
    "body": "I agree that Terry Crews is an amazing person! But don't forget that you're amazing too! You're not a nobody and I'm sure that Terry would be thrilled to hang out with you, internet friend. :)",
    "controversiality": 0,
    "ups": 561,
    "downs": 0,
    "score": 561,
    "created": 1507709706.0,
    "date_created": "2017-10-10",
    "time_created": "20:15:06",
    "submission_id": "news-75k317"
  },
  {
    "id": "do736n1",
    "parent_id": "t1_do6vky1",
    "subreddit_name_prefixed": "r/news",
    "body": "I think the reason we like Terry is because he makes us all feel cool enough to hang out with him. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507711781.0,
    "date_created": "2017-10-10",
    "time_created": "20:49:41",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6s9lv",
    "parent_id": "t1_do6rqmk",
    "subreddit_name_prefixed": "r/news",
    "body": "That's kind of the key thing to keep in mind. It's not about physical strength. It's about power. These people have power over other people in this business and they exploit it.",
    "controversiality": 0,
    "ups": 6297,
    "downs": 0,
    "score": 6297,
    "created": 1507698642.0,
    "date_created": "2017-10-10",
    "time_created": "17:10:42",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6vf7l",
    "parent_id": "t1_do6rqmk",
    "subreddit_name_prefixed": "r/news",
    "body": "6'3 190 lb straight male here. In good shape, kickboxed for awhile.\n\nI got drugged by short pudgy gay dude back in college and had to fight him and the downers off at the same time. Sober I could have tossed him through a wall, but it was all I could do to push away his hands and keep my eyes open at the same time.\n\nKid had the fucking nerve to ask \"How the fuck are you still awake?\" while trying to undo my pants.\n\nJokes on you, wannabe rapist, I had a massive drug problem in highschool and my body still has a massive tolerance to basically all downers.\n\nBut yeah.. it can happen to anyone.\n\n\nAnd had I been sober enough to beat the kid senseless, I'd be a straight white fit dude who beat a small chubby black gay kid for hitting on him, when that story hit the media.",
    "controversiality": 0,
    "ups": 1860,
    "downs": 0,
    "score": 1860,
    "created": 1507702247.0,
    "date_created": "2017-10-10",
    "time_created": "18:10:47",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zpg2",
    "parent_id": "t1_do6rqmk",
    "subreddit_name_prefixed": "r/news",
    "body": "It goes to show you just how much an assault can mess with your head. Could Terry Crews kick the guys ass? I would say yes. I doubt many people would want to have a physical fight with such a person. However the person obviously had power and Terry has spent his life making a career and his whole life could be ruined not just by beating the shit out of the guy but by even reporting it. It took for all this stuff with Harvey to come out for Terry to find the strength to talk about it publicly. Imagine how an average person would feel in a similar position without millions in the bank and being built like a tank. As a victim of abuse myself I can say from personal experience how it is the mental aspect that is what holds you a prisoner. I think it is excellent that Terry has been able to share that this happened to him. Hopefully it gives others strength as well. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507707581.0,
    "date_created": "2017-10-10",
    "time_created": "19:39:41",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6wquo",
    "parent_id": "t1_do6st4i",
    "subreddit_name_prefixed": "r/news",
    "body": "Crews also got bullied when he played in the NFL. Someone needs to link, but he has spoken about that. ",
    "controversiality": 0,
    "ups": 298,
    "downs": 0,
    "score": 298,
    "created": 1507703845.0,
    "date_created": "2017-10-10",
    "time_created": "18:37:25",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6vbcd",
    "parent_id": "t1_do6st4i",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah, if it can happen to him, it can happen to anyone.  \n\nNot that we didn't know that already, but his example brings it back to light.",
    "controversiality": 0,
    "ups": 10410,
    "downs": 0,
    "score": 10410,
    "created": 1507702117.0,
    "date_created": "2017-10-10",
    "time_created": "18:08:37",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6wp3a",
    "parent_id": "t1_do6st4i",
    "subreddit_name_prefixed": "r/news",
    "body": "Hope this will show more victims particularly men that it isn't about physical strength. That it isn't your fault. That it's not ok. ",
    "controversiality": 0,
    "ups": 706,
    "downs": 0,
    "score": 706,
    "created": 1507703786.0,
    "date_created": "2017-10-10",
    "time_created": "18:36:26",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6wleh",
    "parent_id": "t1_do6st4i",
    "subreddit_name_prefixed": "r/news",
    "body": "Seriously. Crews is the guy you get to beat up the guy who just assaulted you. Whoever that person was that went for him, that was a risky grope.",
    "controversiality": 0,
    "ups": 860,
    "downs": 0,
    "score": 860,
    "created": 1507703660.0,
    "date_created": "2017-10-10",
    "time_created": "18:34:20",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6x121",
    "parent_id": "t1_do6st4i",
    "subreddit_name_prefixed": "r/news",
    "body": "Because it doesn't even have to be sexually motivated - it's a power thing. It's \"look, I can do this to you and there's not a damn thing you can do about it\".  \nExcept now there is.",
    "controversiality": 0,
    "ups": 315,
    "downs": 0,
    "score": 315,
    "created": 1507704202.0,
    "date_created": "2017-10-10",
    "time_created": "18:43:22",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zsiy",
    "parent_id": "t1_do6st4i",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm 6'5\" and 230 lbs.  I've been both groped and raped.  Predators don't see people, they see meat.  Keep your drinks safe at parties.",
    "controversiality": 0,
    "ups": 169,
    "downs": 0,
    "score": 169,
    "created": 1507707686.0,
    "date_created": "2017-10-10",
    "time_created": "19:41:26",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6x6rc",
    "parent_id": "t1_do6st4i",
    "subreddit_name_prefixed": "r/news",
    "body": "Crews only weighs 240? The dude looks giant.",
    "controversiality": 0,
    "ups": 141,
    "downs": 0,
    "score": 141,
    "created": 1507704397.0,
    "date_created": "2017-10-10",
    "time_created": "18:46:37",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zhdn",
    "parent_id": "t1_do6st4i",
    "subreddit_name_prefixed": "r/news",
    "body": "Terry Crews is only 240 lb?... I'm.. I'm fat.",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1507707294.0,
    "date_created": "2017-10-10",
    "time_created": "19:34:54",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6wdrs",
    "parent_id": "t1_do6st4i",
    "subreddit_name_prefixed": "r/news",
    "body": "That seems like a brazenly idiotic move. I feel quite confident saying that I would lose a fight with Terry...",
    "controversiality": 0,
    "ups": 93,
    "downs": 0,
    "score": 93,
    "created": 1507703404.0,
    "date_created": "2017-10-10",
    "time_created": "18:30:04",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zzdc",
    "parent_id": "t1_do6st4i",
    "subreddit_name_prefixed": "r/news",
    "body": "Money is power, physical strength is not power. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507707924.0,
    "date_created": "2017-10-10",
    "time_created": "19:45:24",
    "submission_id": "news-75k317"
  },
  {
    "id": "do73xxq",
    "parent_id": "t1_do6t4b4",
    "subreddit_name_prefixed": "r/news",
    "body": ">Even the biggest, strongest guy in the room faces the same awful thoughts when attacked.  \"They won't believe me.\"  \"They'll try to blame me if I fight back.\"  \"I'll be ruined professionally.\"\n\n\nThis really put it in perspective for me. I don't think I really understood this side of it before. I mean, conceptually I understood that it could happen like this. But to hear someone like Terry Crews talk about this happening and feeling powerless in that situation... I honestly feel a bit shaken right now. ",
    "controversiality": 0,
    "ups": 145,
    "downs": 0,
    "score": 145,
    "created": 1507712655.0,
    "date_created": "2017-10-10",
    "time_created": "21:04:15",
    "submission_id": "news-75k317"
  },
  {
    "id": "do72n3g",
    "parent_id": "t1_do6t4b4",
    "subreddit_name_prefixed": "r/news",
    "body": "The woman who recently recounted her experience with James Woods when she was 16 years old was met with a chorus of Trump supporters who not only didn’t believe her, but said some vile things to her. \n\nThe internet can be a mean place and having to face this stuff online is undoubtedly difficult. ",
    "controversiality": 0,
    "ups": 108,
    "downs": 0,
    "score": 108,
    "created": 1507711150.0,
    "date_created": "2017-10-10",
    "time_created": "20:39:10",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6x27w",
    "parent_id": "t1_do6t2jg",
    "subreddit_name_prefixed": "r/news",
    "body": "If this starts to balloon the police/FBI/whoever are gonna have to set up specific task forces to deal with all the allegations. \n\nIt's happening in the UK and the police are completely overwhelmed. ",
    "controversiality": 0,
    "ups": 943,
    "downs": 0,
    "score": 943,
    "created": 1507704241.0,
    "date_created": "2017-10-10",
    "time_created": "18:44:01",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6xupa",
    "parent_id": "t1_do6t2jg",
    "subreddit_name_prefixed": "r/news",
    "body": "> of how Hollywood is largely run by some of the worst living people\n\nUnfortunately it is not just Hollywood that this is a problem in. I hope people don't focus on that so much that they lose sight of the fact that this happens across all industries. \n\nThe difference with Hollywood is that you know the names involved.",
    "controversiality": 0,
    "ups": 391,
    "downs": 0,
    "score": 391,
    "created": 1507705220.0,
    "date_created": "2017-10-10",
    "time_created": "19:00:20",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70n37",
    "parent_id": "t1_do6t2jg",
    "subreddit_name_prefixed": "r/news",
    "body": "Didn't Brian singer get busted for being a pediphile and literally nothing happened to him- aside from his career taking a break. ",
    "controversiality": 0,
    "ups": 45,
    "downs": 0,
    "score": 45,
    "created": 1507708739.0,
    "date_created": "2017-10-10",
    "time_created": "19:58:59",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70pqr",
    "parent_id": "t1_do6t2jg",
    "subreddit_name_prefixed": "r/news",
    "body": "Chappelle insinuated Hollywood made Martin Lawrence sick:  https://youtu.be/J7-s0rCvXFk",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1507708827.0,
    "date_created": "2017-10-10",
    "time_created": "20:00:27",
    "submission_id": "news-75k317"
  },
  {
    "id": "do716qa",
    "parent_id": "t1_do6t2jg",
    "subreddit_name_prefixed": "r/news",
    "body": "People know this, they just ignore it. For example Woody Allen. He's awful, but we still celebrate him. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1507709415.0,
    "date_created": "2017-10-10",
    "time_created": "20:10:15",
    "submission_id": "news-75k317"
  },
  {
    "id": "do73i32",
    "parent_id": "t1_do6t2jg",
    "subreddit_name_prefixed": "r/news",
    "body": "People are going to blame it on jews.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1507712141.0,
    "date_created": "2017-10-10",
    "time_created": "20:55:41",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zqqh",
    "parent_id": "t1_do6t2jg",
    "subreddit_name_prefixed": "r/news",
    "body": "Hollywood is due for a reckoning. I can't watch their movies w/o being reminded of the human trash who will profit from them.  It feel like I've donated to NAMBLA.  I've been stop going to Hollywood movies for years. ",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1507707626.0,
    "date_created": "2017-10-10",
    "time_created": "19:40:26",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6yodr",
    "parent_id": "t1_do6tei5",
    "subreddit_name_prefixed": "r/news",
    "body": "Did you see the youtube vids he posted where he was learning how to build a gaming PC so that he and his son could share an interest and activity together?\n\nIt's a whole self-shot series, but here's an interview where he sums it up:\n\nhttps://youtu.be/Pda_JiX3_JE",
    "controversiality": 0,
    "ups": 562,
    "downs": 0,
    "score": 562,
    "created": 1507706270.0,
    "date_created": "2017-10-10",
    "time_created": "19:17:50",
    "submission_id": "news-75k317"
  },
  {
    "id": "do700yk",
    "parent_id": "t1_do6tei5",
    "subreddit_name_prefixed": "r/news",
    "body": "He truly seems like the kind of guy that we should all aspire to be. ",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1507707978.0,
    "date_created": "2017-10-10",
    "time_created": "19:46:18",
    "submission_id": "news-75k317"
  },
  {
    "id": "do725fr",
    "parent_id": "t1_do71f1g",
    "subreddit_name_prefixed": "r/news",
    "body": "When a lot of people say that they don't see this stuff first hand, I tend to believe them. Of course people aren't going to do that stuff right out in the open. They're going to do it where no one can see them. ",
    "controversiality": 0,
    "ups": 63,
    "downs": 0,
    "score": 63,
    "created": 1507710560.0,
    "date_created": "2017-10-10",
    "time_created": "20:29:20",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7eqoh",
    "parent_id": "t1_do71f1g",
    "subreddit_name_prefixed": "r/news",
    "body": "Also be sure to notice how we haven't seen him in any noteworthy roles since LOTR except Eternal Sunshine of the Spotless Mind and Wilfred",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1507726855.0,
    "date_created": "2017-10-11",
    "time_created": "01:00:55",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7gzen",
    "parent_id": "t1_do71f1g",
    "subreddit_name_prefixed": "r/news",
    "body": "You can add Corey Feldman's [interview](https://www.youtube.com/watch?v=roW238dfUUk) to your comment. He even mentions Elijah Wood there. He claims that he was passed around as a child star and that he saw it happening to many others.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1507731265.0,
    "date_created": "2017-10-11",
    "time_created": "02:14:25",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6u7cn",
    "parent_id": "t1_do6sndt",
    "subreddit_name_prefixed": "r/news",
    "body": "Corey Feldman has been warning about worse for years now.  ",
    "controversiality": 0,
    "ups": 561,
    "downs": 0,
    "score": 561,
    "created": 1507700823.0,
    "date_created": "2017-10-10",
    "time_created": "17:47:03",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70499",
    "parent_id": "t1_do6sndt",
    "subreddit_name_prefixed": "r/news",
    "body": "Music industry executives also. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1507708090.0,
    "date_created": "2017-10-10",
    "time_created": "19:48:10",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zfu3",
    "parent_id": "t1_do6sko9",
    "subreddit_name_prefixed": "r/news",
    "body": "Enough to give them [PTSD along with drug abuse that ultimately  leads to death.](http://www.nydailynews.com/entertainment/gossip/corey-feldman-book-details-sexual-abuse-coreys-article-1.1490863)",
    "controversiality": 0,
    "ups": 139,
    "downs": 0,
    "score": 139,
    "created": 1507707241.0,
    "date_created": "2017-10-10",
    "time_created": "19:34:01",
    "submission_id": "news-75k317"
  },
  {
    "id": "do73vt7",
    "parent_id": "t1_do6sko9",
    "subreddit_name_prefixed": "r/news",
    "body": "Remember Amanda Bynes and her bipolar/psychotic tendencies? I read up some info on her, seems like she was molested and used as an object as a child (by her own father and an exec/producer from Nickalodeon).",
    "controversiality": 0,
    "ups": 107,
    "downs": 0,
    "score": 107,
    "created": 1507712587.0,
    "date_created": "2017-10-10",
    "time_created": "21:03:07",
    "submission_id": "news-75k317"
  },
  {
    "id": "do75zis",
    "parent_id": "t1_do6sko9",
    "subreddit_name_prefixed": "r/news",
    "body": "When I hear about a child actor or actress that goes off the deep end when they're older, I wonder if something happened to them. ",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1507715049.0,
    "date_created": "2017-10-10",
    "time_created": "21:44:09",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70zko",
    "parent_id": "t1_do6vbqj",
    "subreddit_name_prefixed": "r/news",
    "body": "I can't fucking wait until the day that Bryan singer gets taken down a la Harvey weinstein.\n\nThat man is a sexual predator of the worst caliber. ",
    "controversiality": 0,
    "ups": 120,
    "downs": 0,
    "score": 120,
    "created": 1507709168.0,
    "date_created": "2017-10-10",
    "time_created": "20:06:08",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6xilk",
    "parent_id": "t1_do6vbqj",
    "subreddit_name_prefixed": "r/news",
    "body": "Hopefully dan Schneider too ",
    "controversiality": 0,
    "ups": 93,
    "downs": 0,
    "score": 93,
    "created": 1507704805.0,
    "date_created": "2017-10-10",
    "time_created": "18:53:25",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70t6b",
    "parent_id": "t1_do6vbqj",
    "subreddit_name_prefixed": "r/news",
    "body": "Check out the out-of-context headline on [this article](http://www.ifc.com/2010/03/ratner) from March 2010!",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507708947.0,
    "date_created": "2017-10-10",
    "time_created": "20:02:27",
    "submission_id": "news-75k317"
  },
  {
    "id": "do74sme",
    "parent_id": "t1_do7192s",
    "subreddit_name_prefixed": "r/news",
    "body": "Terry Crews also suffered a very abusive childhood. Amazing how someone who was dealt such a shitty hand in life became such a beacon of positivity ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1507713663.0,
    "date_created": "2017-10-10",
    "time_created": "21:21:03",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6z2yj",
    "parent_id": "t1_do6skrg",
    "subreddit_name_prefixed": "r/news",
    "body": "Shit.  I know shit is bad right now with all this sexual misconduct and shit.",
    "controversiality": 0,
    "ups": 99,
    "downs": 0,
    "score": 99,
    "created": 1507706786.0,
    "date_created": "2017-10-10",
    "time_created": "19:26:26",
    "submission_id": "news-75k317"
  },
  {
    "id": "do72vfy",
    "parent_id": "t1_do6skrg",
    "subreddit_name_prefixed": "r/news",
    "body": "*President Dwayne Elizondo Mountain Dew Herbert Camacho ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1507711420.0,
    "date_created": "2017-10-10",
    "time_created": "20:43:40",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6udit",
    "parent_id": "t1_do6rmrw",
    "subreddit_name_prefixed": "r/news",
    "body": "Let's hope. I would love to hear of more powerful executives going down. ",
    "controversiality": 0,
    "ups": 161,
    "downs": 0,
    "score": 161,
    "created": 1507701019.0,
    "date_created": "2017-10-10",
    "time_created": "17:50:19",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6wsc7",
    "parent_id": "t1_do6rmrw",
    "subreddit_name_prefixed": "r/news",
    "body": "Let's not just Hollywood. Any and every industry whether it be tech companies, sports industry. Where ever abuse is happening it must be aired out. The victims need justice. ",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1507703898.0,
    "date_created": "2017-10-10",
    "time_created": "18:38:18",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6vpmf",
    "parent_id": "t1_do6rmrw",
    "subreddit_name_prefixed": "r/news",
    "body": "Only if Terry names the person in question.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1507702593.0,
    "date_created": "2017-10-10",
    "time_created": "18:16:33",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6tp57",
    "parent_id": "t1_do6rmrw",
    "subreddit_name_prefixed": "r/news",
    "body": "For Weinstein to get buried under the jail, or to run for office in 2020?",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1507700240.0,
    "date_created": "2017-10-10",
    "time_created": "17:37:20",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zw3v",
    "parent_id": "t1_do6tvco",
    "subreddit_name_prefixed": "r/news",
    "body": "By California's laws Terry would get sued by this guy (and obviously black listed by Hollywood). They have these laws for a reason....",
    "controversiality": 0,
    "ups": 152,
    "downs": 0,
    "score": 152,
    "created": 1507707813.0,
    "date_created": "2017-10-10",
    "time_created": "19:43:33",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70cbm",
    "parent_id": "t1_do6tvco",
    "subreddit_name_prefixed": "r/news",
    "body": "Terry Crews might be one of the few people that could do this without facing a huge backlash from people shouting about false rape accusations",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1507708366.0,
    "date_created": "2017-10-10",
    "time_created": "19:52:46",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71vcl",
    "parent_id": "t1_do6xh0z",
    "subreddit_name_prefixed": "r/news",
    "body": "man I don't want to think about that. bloody depressing",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1507710221.0,
    "date_created": "2017-10-10",
    "time_created": "20:23:41",
    "submission_id": "news-75k317"
  },
  {
    "id": "do72nqy",
    "parent_id": "t1_do6xh0z",
    "subreddit_name_prefixed": "r/news",
    "body": "The music industry also has some pretty well known cases - Lou Pearlman and his boy bands spring to mind. ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1507711171.0,
    "date_created": "2017-10-10",
    "time_created": "20:39:31",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zk57",
    "parent_id": "t1_do6tupo",
    "subreddit_name_prefixed": "r/news",
    "body": "Someone who can decide whether or not he works again.  There's probably a number of people who hold that power.  Hell, it could be someone that just steers projects away from him, not going out and saying Terry did X Y and Z.",
    "controversiality": 0,
    "ups": 133,
    "downs": 0,
    "score": 133,
    "created": 1507707392.0,
    "date_created": "2017-10-10",
    "time_created": "19:36:32",
    "submission_id": "news-75k317"
  },
  {
    "id": "do714cv",
    "parent_id": "t1_do6tupo",
    "subreddit_name_prefixed": "r/news",
    "body": "Why are people assuming that Crews would be more likely to react violently than other people?\n\nI mean he's known for being a fairly gentle man",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1507709334.0,
    "date_created": "2017-10-10",
    "time_created": "20:08:54",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6s9mo",
    "parent_id": "t1_do6ryhw",
    "subreddit_name_prefixed": "r/news",
    "body": "yeah its just perverts getting into power. just happens in a medium we are all familiar with.",
    "controversiality": 0,
    "ups": 71,
    "downs": 0,
    "score": 71,
    "created": 1507698643.0,
    "date_created": "2017-10-10",
    "time_created": "17:10:43",
    "submission_id": "news-75k317"
  },
  {
    "id": "do74ti6",
    "parent_id": "t1_do71lr0",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm a woman who reported being sexually harassed when I was 18 by a male coworker, and everyone (male and female bosses alike told me \"he just talks that way sometimes\". He repeatedly asked me if I was a virgin, what kind of sex me and my boyfriend had, if I masturbated, all of that stuff. Nothing happened. When he got fired, it was months later for stealing from the cash register, but what I said was never brought up to my knowledge. ",
    "controversiality": 0,
    "ups": 58,
    "downs": 0,
    "score": 58,
    "created": 1507713691.0,
    "date_created": "2017-10-10",
    "time_created": "21:21:31",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6tf6a",
    "parent_id": "t1_do6rzz0",
    "subreddit_name_prefixed": "r/news",
    "body": "Whoever it was got away with it, so they calculated pretty damn well.",
    "controversiality": 0,
    "ups": 238,
    "downs": 0,
    "score": 238,
    "created": 1507699930.0,
    "date_created": "2017-10-10",
    "time_created": "17:32:10",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6upi2",
    "parent_id": "t1_do6rzz0",
    "subreddit_name_prefixed": "r/news",
    "body": "Terry Crews is physically built, but power comes in different forms. Terry Crews obviously didn't rip that guy's arms off his body and beat him because of how high up the guy was.",
    "controversiality": 0,
    "ups": 84,
    "downs": 0,
    "score": 84,
    "created": 1507701397.0,
    "date_created": "2017-10-10",
    "time_created": "17:56:37",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6traq",
    "parent_id": "t1_do6rzz0",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 79,
    "downs": 0,
    "score": 79,
    "created": 1507700308.0,
    "date_created": "2017-10-10",
    "time_created": "17:38:28",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6v2sg",
    "parent_id": "t1_do6rzz0",
    "subreddit_name_prefixed": "r/news",
    "body": "That’s sexual predators period. They start with disrespecting your personal space when talking, then a forced hug, then a kiss on a cheek, then a forced kiss on the mouth, then groping, etc. And a lot of times it’s in social situations where the guise of alcohol can help generate excuses. \n\nIt’s blows my mind how people don’t understand how to respect other people’s space. ",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1507701829.0,
    "date_created": "2017-10-10",
    "time_created": "18:03:49",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zo67",
    "parent_id": "t1_do6xeet",
    "subreddit_name_prefixed": "r/news",
    "body": "Not to derail your point, but when did Timberlake have a breakdown?",
    "controversiality": 0,
    "ups": 106,
    "downs": 0,
    "score": 106,
    "created": 1507707535.0,
    "date_created": "2017-10-10",
    "time_created": "19:38:55",
    "submission_id": "news-75k317"
  },
  {
    "id": "do726pm",
    "parent_id": "t1_do6xeet",
    "subreddit_name_prefixed": "r/news",
    "body": "Learning about the dark and tragic side of Judy Garland's life at the hands of movie studios is a quick way to start giving stars the benefit of the doubt when they have their \"mental breaks\".",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1507710603.0,
    "date_created": "2017-10-10",
    "time_created": "20:30:03",
    "submission_id": "news-75k317"
  },
  {
    "id": "do72hrr",
    "parent_id": "t1_do6xeet",
    "subreddit_name_prefixed": "r/news",
    "body": "I always wondered if bynes was molested, Drake bell as well. After that documentary about child abuse in hollywood. I know there was one offender who was arrested but I could've sworn they mentioned an unnamed offender who was accused by someone from nick. (and i dont think anything came of it so for all we know they could still be working there)",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1507710980.0,
    "date_created": "2017-10-10",
    "time_created": "20:36:20",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7gaum",
    "parent_id": "t1_do6y11p",
    "subreddit_name_prefixed": "r/news",
    "body": "Fucking *thank you*. It's so frustrating. Whenever women come out about these kinds of things, there is always a community pressure to view it under a skeptical lens. \"We can never know what truly happened, best not to crucify someone who could be innocent.\" It's uncomfortably apparent that such a climate is entirely absent here.",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1507729816.0,
    "date_created": "2017-10-11",
    "time_created": "01:50:16",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70ync",
    "parent_id": "t1_do6y11p",
    "subreddit_name_prefixed": "r/news",
    "body": "This is like uncomfortably true\n\n\n\n\nI'm just really happy that people can at least see how diverse this issue is. It's not a woman thing, it's a people thing",
    "controversiality": 0,
    "ups": 102,
    "downs": 0,
    "score": 102,
    "created": 1507709136.0,
    "date_created": "2017-10-10",
    "time_created": "20:05:36",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7k1k8",
    "parent_id": "t1_do6y11p",
    "subreddit_name_prefixed": "r/news",
    "body": "Sad, but true. I just heard about Paltrow coming out with her story, and decided to search for discussion on Reddit, and guess what? Almost all the threads are from altright  subreddits, calling her and Jolie hypocrites. At this stage, these people are not even hiding their misogyny.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1507739102.0,
    "date_created": "2017-10-11",
    "time_created": "04:25:02",
    "submission_id": "news-75k317"
  },
  {
    "id": "do72i4r",
    "parent_id": "t1_do6y11p",
    "subreddit_name_prefixed": "r/news",
    "body": "I saw Ellen Pao speak a little while ago. She mentioned that she was hopeful after the Ailes/O'Reilly/Uber stuff, that she saw the way the press treated women was beginning to change fundamentally.\n\nShe also had some outrageous stories. Like, she knew a senior female executive who would have a (more) senior male executive stand outsider her office and slooooowly lick an ice cream cone while staring at her. In the office. Daily. \n\nWhen she reported the stuff she reported at Kleiner-Perkins, part of it was dismissed by the media (I think she cited an article in the NYT) due to KP's high-profile PR campaign against her, in part because the details were so outrageous people simply didn't believe it could happen in a respected firm without people speaking out.",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1507710992.0,
    "date_created": "2017-10-10",
    "time_created": "20:36:32",
    "submission_id": "news-75k317"
  },
  {
    "id": "do77d4i",
    "parent_id": "t1_do6y11p",
    "subreddit_name_prefixed": "r/news",
    "body": "What this place did to Ellen Pao was a fucking disgrace.  ",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1507716598.0,
    "date_created": "2017-10-10",
    "time_created": "22:09:58",
    "submission_id": "news-75k317"
  },
  {
    "id": "do72tqd",
    "parent_id": "t1_do7006d",
    "subreddit_name_prefixed": "r/news",
    "body": "Well a lot of actors don't hold the actual power in hollywood. Many of them are indeed the victims. ",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1507711365.0,
    "date_created": "2017-10-10",
    "time_created": "20:42:45",
    "submission_id": "news-75k317"
  },
  {
    "id": "do73mva",
    "parent_id": "t1_do7006d",
    "subreddit_name_prefixed": "r/news",
    "body": "I think we have it easier in reality. Most other industries aren't closed in such a way that pissing one person off can end your career, and most industries don't have a few godfathers with all the power. \n\nI'm a woman in tech and everyone keeps going on about how terrible we have it. Well, worst case so far, I've quit my job and moved to a competitor because of harassment, and I ended up with a bigger paycheck. That I think is way way way better than the average case of a female employee at the Weinstein company.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1507712298.0,
    "date_created": "2017-10-10",
    "time_created": "20:58:18",
    "submission_id": "news-75k317"
  },
  {
    "id": "do73hqa",
    "parent_id": "t1_do6tazv",
    "subreddit_name_prefixed": "r/news",
    "body": "Arnold won Mr. Universe at 240 lbs, and he's 6'2\"",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1507712130.0,
    "date_created": "2017-10-10",
    "time_created": "20:55:30",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70l7e",
    "parent_id": "t1_do6rwi2",
    "subreddit_name_prefixed": "r/news",
    "body": "Uh that's Dwayne Elizondo Mountain Dew Herbert Camacho!",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1507708673.0,
    "date_created": "2017-10-10",
    "time_created": "19:57:53",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6to01",
    "parent_id": "t1_do6tkjm",
    "subreddit_name_prefixed": "r/news",
    "body": "Certainly it is not limited to Hollywood, but Hollywood is arguably the best known of all the shady placeds where things like this occur.",
    "controversiality": 0,
    "ups": 1373,
    "downs": 0,
    "score": 1373,
    "created": 1507700204.0,
    "date_created": "2017-10-10",
    "time_created": "17:36:44",
    "submission_id": "news-75k317"
  },
  {
    "id": "do789i2",
    "parent_id": "t1_do6tkjm",
    "subreddit_name_prefixed": "r/news",
    "body": "IMO, people in a position of power should be held to a higher standard than regular people. If someone chooses to take a role which gives them more power, they should be punished far more harshly than the average person for violating laws. Cops, politicians, titans of industry etc. should not be able to skate by with a slap on the wrist for things like this. IMO, we should make any misdemeanor a felony for these people, and any felony a potential life sentence. If they don't like it, they can choose not to take on more responsibility in their career.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507717655.0,
    "date_created": "2017-10-10",
    "time_created": "22:27:35",
    "submission_id": "news-75k317"
  },
  {
    "id": "do78d1v",
    "parent_id": "t1_do6vo0x",
    "subreddit_name_prefixed": "r/news",
    "body": "It's time for people to start naming names. Clear out the fucking cesspool.\n\nI get why no individual in Hollywood wants to do it alone, but if there was ever a time to get the ball rolling, it's now.",
    "controversiality": 0,
    "ups": 575,
    "downs": 0,
    "score": 575,
    "created": 1507717776.0,
    "date_created": "2017-10-10",
    "time_created": "22:29:36",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6x7z7",
    "parent_id": "t1_do6vo0x",
    "subreddit_name_prefixed": "r/news",
    "body": "So which director that he's worked with died?",
    "controversiality": 0,
    "ups": 224,
    "downs": 0,
    "score": 224,
    "created": 1507704439.0,
    "date_created": "2017-10-10",
    "time_created": "18:47:19",
    "submission_id": "news-75k317"
  },
  {
    "id": "do74k2w",
    "parent_id": "t1_do6vo0x",
    "subreddit_name_prefixed": "r/news",
    "body": "Damn, who gropes a stapler",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1507713378.0,
    "date_created": "2017-10-10",
    "time_created": "21:16:18",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71nwe",
    "parent_id": "t1_do6vo0x",
    "subreddit_name_prefixed": "r/news",
    "body": "‘Because he’s passed’ \n\nFuuuuuuck that! Maybe he has more victims? Maybe his memory is kept in high regards? This is basically failure to report a crime… \n\nWho the fuck worries about a dead mans reputation when they were a predator who could have multitudes of other closeted victims? Fuck all this secrecy that others are coming forward to reveal",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1507709974.0,
    "date_created": "2017-10-10",
    "time_created": "20:19:34",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6vqo4",
    "parent_id": "t1_do6vo0x",
    "subreddit_name_prefixed": "r/news",
    "body": "Rob Schneider is...\n\n...a victim of sexual harassment!",
    "controversiality": 0,
    "ups": 267,
    "downs": 0,
    "score": 267,
    "created": 1507702629.0,
    "date_created": "2017-10-10",
    "time_created": "18:17:09",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6vqpa",
    "parent_id": "t1_do6u5h4",
    "subreddit_name_prefixed": "r/news",
    "body": "To a person who relishes using power over others, Crews would be a tantalizing target *because* he's so physically strong and yet would be rendered powerless in such a situation.  These people don't just walk up and grab people.  First they set the situation and the power dynamic so that the other person knows they can't object.  The point is to make the person feel absolutely powerless - the assault is just a means to drive that point home.  I seriously doubt this guy who assaulted Crews really just wanted to grab his dick so badly that he would risk getting the shit kicked out of him.",
    "controversiality": 0,
    "ups": 2740,
    "downs": 0,
    "score": 2740,
    "created": 1507702630.0,
    "date_created": "2017-10-10",
    "time_created": "18:17:10",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6x6e1",
    "parent_id": "t1_do6u5h4",
    "subreddit_name_prefixed": "r/news",
    "body": "Doubt it. Whoever did it probably knew Crews has a reputation of being a gentle giant. Not to mention, this was at an upscale Hollywood shindig, not the fucking ghetto. The man knew \"violence\" is not tolerated at such events.\n\nWould the same man do it with some hood thug downtown who A. is probably extremely homophobic B. doesn't give a shit in the slightest about his influence or C. jail time and would almost guaranteed beat his head in?\n\nYeah. Balls my ass.",
    "controversiality": 0,
    "ups": 237,
    "downs": 0,
    "score": 237,
    "created": 1507704384.0,
    "date_created": "2017-10-10",
    "time_created": "18:46:24",
    "submission_id": "news-75k317"
  },
  {
    "id": "do701cw",
    "parent_id": "t1_do6u5h4",
    "subreddit_name_prefixed": "r/news",
    "body": "its not too surprising crews would be a victim.  besides the fact hes a good looking guy anybody who knows his background would know he's fairly vulnerable.  He was abused quite badly by his father and had some pretty disgusting things happen to him when he was an NFL player.   Hes a gentle giant who no doubt isn't a big fan of being the center of any sort of negative attention.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1507707991.0,
    "date_created": "2017-10-10",
    "time_created": "19:46:31",
    "submission_id": "news-75k317"
  },
  {
    "id": "do77xlw",
    "parent_id": "t1_do6u5h4",
    "subreddit_name_prefixed": "r/news",
    "body": "It doesn't matter. I could have easily fought off the person molesting me.  You're just too scared word will get out and you won't get any work.  Or no one will believe you and say you're after $.  Or people will make fun of you for refusing the advances of a famous rich man. Or that they'll fight back.  thet know they can 100% get away with it.  Look at Cosby. Nothing happened and he raped dozens of underage women. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1507717258.0,
    "date_created": "2017-10-10",
    "time_created": "22:20:58",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70mz6",
    "parent_id": "t1_do6u5h4",
    "subreddit_name_prefixed": "r/news",
    "body": "Oh, yeah, the massive balls of a rapist are big. Wtf dude. They're anything but brave. They're  disgusting cowards who go for those who can't speak up. Terry said he didn't speak up because he knew he wouldn't be believed, he didn't want trouble and bc it would look bad if a black huge dude fought an elite Hollywood person. ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1507708735.0,
    "date_created": "2017-10-10",
    "time_created": "19:58:55",
    "submission_id": "news-75k317"
  },
  {
    "id": "do78gx0",
    "parent_id": "t1_do76mzk",
    "subreddit_name_prefixed": "r/news",
    "body": "They were obviously all making it up for attention, like women *always* do. Notice how they only came out *after* somebody else did? Why didn't they just report it at the time?\n\nBut these men, though. This is serious! Thank God they were brave enough to come forward after Terry did.\n\n/s",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1507717905.0,
    "date_created": "2017-10-10",
    "time_created": "22:31:45",
    "submission_id": "news-75k317"
  },
  {
    "id": "do75g1o",
    "parent_id": "t1_do745e5",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 265,
    "downs": 0,
    "score": 265,
    "created": 1507714415.0,
    "date_created": "2017-10-10",
    "time_created": "21:33:35",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7cc9z",
    "parent_id": "t1_do745e5",
    "subreddit_name_prefixed": "r/news",
    "body": "That was my perspective as well until the very end. Excellent twist ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1507723023.0,
    "date_created": "2017-10-10",
    "time_created": "23:57:03",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6yw1a",
    "parent_id": "t1_do6wb35",
    "subreddit_name_prefixed": "r/news",
    "body": "It's helpful to look at these waves of accusations in this way and not view them as people just trying to jump the bandwagon.",
    "controversiality": 0,
    "ups": 537,
    "downs": 0,
    "score": 537,
    "created": 1507706540.0,
    "date_created": "2017-10-10",
    "time_created": "19:22:20",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7fdjx",
    "parent_id": "t1_do6wb35",
    "subreddit_name_prefixed": "r/news",
    "body": "Now imagine that this happened, the floodgates opened up and you shared your story of abuse along with a dozen others. Then your abuser was elected president. ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1507727996.0,
    "date_created": "2017-10-11",
    "time_created": "01:19:56",
    "submission_id": "news-75k317"
  },
  {
    "id": "do701ac",
    "parent_id": "t1_do6wb35",
    "subreddit_name_prefixed": "r/news",
    "body": "I mean, I wouldn't say he didn't have the confidence to talk about it after it happened because he spoke about it the following day to all his coworkers and the perpetrator \"apologized\" after word was spread. So he got it out there pretty quick and didn't keep his mouth shut, he just didn't put it out there in a super public eye, right?",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1507707989.0,
    "date_created": "2017-10-10",
    "time_created": "19:46:29",
    "submission_id": "news-75k317"
  },
  {
    "id": "do723jt",
    "parent_id": "t1_do6wb35",
    "subreddit_name_prefixed": "r/news",
    "body": "Keep in mind that Weinstein hasn't \"gone down\". He's still a nine-figure millionaire with access and connections. Hell, he'll probably resume working after the heat dies down.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1507710497.0,
    "date_created": "2017-10-10",
    "time_created": "20:28:17",
    "submission_id": "news-75k317"
  },
  {
    "id": "do75bri",
    "parent_id": "t1_do74105",
    "subreddit_name_prefixed": "r/news",
    "body": "I always appreciate whenever someone looks you in the eyes for more than being stern. It really helps those that have anxiety or even shy people.",
    "controversiality": 0,
    "ups": 456,
    "downs": 0,
    "score": 456,
    "created": 1507714278.0,
    "date_created": "2017-10-10",
    "time_created": "21:31:18",
    "submission_id": "news-75k317"
  },
  {
    "id": "do75k5d",
    "parent_id": "t1_do74105",
    "subreddit_name_prefixed": "r/news",
    "body": "These comments are all so uplifting. I love Terry Crews as an actor, and only recently learned of his abusive past and how he overcame it. It's awesome to hear that he's such a nice dude irl. I have so much respect for this guy. I would love to meet him. ",
    "controversiality": 0,
    "ups": 209,
    "downs": 0,
    "score": 209,
    "created": 1507714544.0,
    "date_created": "2017-10-10",
    "time_created": "21:35:44",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7cptp",
    "parent_id": "t1_do74105",
    "subreddit_name_prefixed": "r/news",
    "body": "I hope he gets one of these molesters in stitches too.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1507723593.0,
    "date_created": "2017-10-11",
    "time_created": "00:06:33",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71kxc",
    "parent_id": "t1_do6zri4",
    "subreddit_name_prefixed": "r/news",
    "body": "He quit from the team after an abusive coach dislocated his finger in a rant.\n\nHe is VERY humble for sure.",
    "controversiality": 0,
    "ups": 815,
    "downs": 0,
    "score": 815,
    "created": 1507709884.0,
    "date_created": "2017-10-10",
    "time_created": "20:18:04",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71o81",
    "parent_id": "t1_do71ffc",
    "subreddit_name_prefixed": "r/news",
    "body": "Internet friend to internet friend it's fantastic to know people that post positive things like that are around. ",
    "controversiality": 0,
    "ups": 193,
    "downs": 0,
    "score": 193,
    "created": 1507709986.0,
    "date_created": "2017-10-10",
    "time_created": "20:19:46",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6t41b",
    "parent_id": "t1_do6s9lv",
    "subreddit_name_prefixed": "r/news",
    "body": "Which is probably why said guy groped Terry Crews. \n\nBecause he could and get away with it. Crews risked public humiliation, loss of work, and even legal ramifications if he did something about this. And the guy who groped him knew it.",
    "controversiality": 0,
    "ups": 2756,
    "downs": 0,
    "score": 2756,
    "created": 1507699584.0,
    "date_created": "2017-10-10",
    "time_created": "17:26:24",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6vtxu",
    "parent_id": "t1_do6s9lv",
    "subreddit_name_prefixed": "r/news",
    "body": "This is also why you see so many latent accusations.\n\nPeople may be very dependent on their attacker for financial security or their careers.  Coming forward as a victim of a crime may be the right thing to do, but the victim may have a lot more to lose than to gain by doing so.",
    "controversiality": 0,
    "ups": 270,
    "downs": 0,
    "score": 270,
    "created": 1507702739.0,
    "date_created": "2017-10-10",
    "time_created": "18:18:59",
    "submission_id": "news-75k317"
  },
  {
    "id": "do73ip7",
    "parent_id": "t1_do6s9lv",
    "subreddit_name_prefixed": "r/news",
    "body": "I mean fuck. I was molested (technically raped?) at a party and I definitely had the power in all regards. But in the moment you are so shocked, you literally freeze. Especially when heavily inebriated. You also play out every possible outcome of every response you could make and judge if it's worth it. All the while the moment ends and you are left with a memory you just try to shove down until it emerges it's head sometime in the middle of college. ",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1507712161.0,
    "date_created": "2017-10-10",
    "time_created": "20:56:01",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70dkj",
    "parent_id": "t1_do6s9lv",
    "subreddit_name_prefixed": "r/news",
    "body": "It makes you wonder what other things have happened to certain \"left the scene\" stars.\n\nI expected Wesley Snipes to make a comeback after his stint of tax evasion. \n\nA couple of years in high-class jail, get out--not a violent case, nor drug related--should be simple enough to make a comeback.\n\nAnd silence.\n\nI'm using him as a broad example of how \"easy\" it should be to get back on top. But if Snipes has trouble, imagine how hard it would be for someone who was directly sexually assaulted or harrased by a big Hollywood producer.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1507708408.0,
    "date_created": "2017-10-10",
    "time_created": "19:53:28",
    "submission_id": "news-75k317"
  },
  {
    "id": "do785fs",
    "parent_id": "t1_do6s9lv",
    "subreddit_name_prefixed": "r/news",
    "body": "These stars are famous, yet the executives hold the power. This kind of thing is a way in which they enforce that notion.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1507717519.0,
    "date_created": "2017-10-10",
    "time_created": "22:25:19",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6vy1j",
    "parent_id": "t1_do6vf7l",
    "subreddit_name_prefixed": "r/news",
    "body": ".... So not to be Debbie Downer here, but your story ended locked in a forever battle. I need to know the ending.\n\nAnd none of this Director's cut, Bullshit.",
    "controversiality": 0,
    "ups": 533,
    "downs": 0,
    "score": 533,
    "created": 1507702877.0,
    "date_created": "2017-10-10",
    "time_created": "18:21:17",
    "submission_id": "news-75k317"
  },
  {
    "id": "do72by1",
    "parent_id": "t1_do6vf7l",
    "subreddit_name_prefixed": "r/news",
    "body": "I had a similarish story when I was in Ibiza. \n\nWas in a club with a really pretty girl and this local started being really friendly to us both. He supplied me with free weed, coke, and booze while in the club. We did lines off the bar top in front of the bartenders he was that in the know.\n\nHe then started hitting hard on my girl. \n\nThen he smirked, looked at me and said something like \"I'll see you in 20 minutes\" and laughed. \n\nFunny thing is I had a super high tolerance so I ended up having an awesome night, the girl told him we were secretly engaged, and we ditched him an hour or so later when he was at the bar getting us another drink.\n\nWent back to the apartment and had the best all night sex ever. \n\nThanks dodgy Spanish guy who tried to steal my girl by drugging the fuck out of me!!!! \n\n\n\n",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1507710782.0,
    "date_created": "2017-10-10",
    "time_created": "20:33:02",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70k9p",
    "parent_id": "t1_do6vf7l",
    "subreddit_name_prefixed": "r/news",
    "body": "This is why, as corny as it sounds, always keep an eye on your drink when you're solo at parties.\n\nAnd always be wary of open container drinks.  \n\nIf someone pours you something from a \"Common Pool\" like a bowl of punch, see that they also drink from the same exact source and they didn't spike your stuff with unknown things.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1507708641.0,
    "date_created": "2017-10-10",
    "time_created": "19:57:21",
    "submission_id": "news-75k317"
  },
  {
    "id": "do77jjy",
    "parent_id": "t1_do6vf7l",
    "subreddit_name_prefixed": "r/news",
    "body": "in college there was a gay guy that started rubbing my leg and when I asked him to stop and removed his hand he got aggressive and forceful.  So I became very aggressive and grabbed him and threw him out of my dorm room.  His close friends started calling me a gay basher.\n\nEveryone wants to be a a victim.\n",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1507716804.0,
    "date_created": "2017-10-10",
    "time_created": "22:13:24",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6y5e0",
    "parent_id": "t1_do6wquo",
    "subreddit_name_prefixed": "r/news",
    "body": "notably one of the coaches threw a ball at him fast from really close and hurt Terrys finger, he was like hell naw, he speaks of it on this hot ones spicy wings episode https://www.youtube.com/watch?v=7TN09IP5JuI",
    "controversiality": 0,
    "ups": 240,
    "downs": 0,
    "score": 240,
    "created": 1507705600.0,
    "date_created": "2017-10-10",
    "time_created": "19:06:40",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6z4hv",
    "parent_id": "t1_do6vbcd",
    "subreddit_name_prefixed": "r/news",
    "body": "If someone as physically intimidating as Terry crews doesn’t deter them, then that just shows how bad this culture problem is among Hollywood elites. \n\nEdit: I know it’s not just Hollywood elites. But I specified them in this comment because this is a very brazen assault on a well-known actor. ",
    "controversiality": 0,
    "ups": 5385,
    "downs": 0,
    "score": 5385,
    "created": 1507706842.0,
    "date_created": "2017-10-10",
    "time_created": "19:27:22",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6x2di",
    "parent_id": "t1_do6vbcd",
    "subreddit_name_prefixed": "r/news",
    "body": "Really seems like Hollywood is falling apart.\n",
    "controversiality": 0,
    "ups": 322,
    "downs": 0,
    "score": 322,
    "created": 1507704246.0,
    "date_created": "2017-10-10",
    "time_created": "18:44:06",
    "submission_id": "news-75k317"
  },
  {
    "id": "do717ep",
    "parent_id": "t1_do6wp3a",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm a 6'3\" dude and once on a mostly empty metro bus in Seattle when I was about 25 I had a 60 year old drunk bum that had shit himself and pissed himself sit down RIGHT next to me drinking beer out of a burger king coffee cup, and toothlessly said loudly and almost incomprehensibly \"burger king coffee\" over and over and then grabbed my crotch.  I shoved him out of the seat and ran to the front of the bus, entirely afraid something horrible was going to happen to me because I touched him.  There is all kinds of insanity that can happen to you.",
    "controversiality": 0,
    "ups": 131,
    "downs": 0,
    "score": 131,
    "created": 1507709437.0,
    "date_created": "2017-10-10",
    "time_created": "20:10:37",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6xazb",
    "parent_id": "t1_do6wleh",
    "subreddit_name_prefixed": "r/news",
    "body": "From that story it sounds like the perpetrator felt there was no risk at all, and was proven right. His only consequence was an emailed apology. \"Grab em by the pussy\" wasn't invented by Donald, it has long been standard practice by people rich and established enough to live without consequence.",
    "controversiality": 0,
    "ups": 1360,
    "downs": 0,
    "score": 1360,
    "created": 1507704542.0,
    "date_created": "2017-10-10",
    "time_created": "18:49:02",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6ynrw",
    "parent_id": "t1_do6wleh",
    "subreddit_name_prefixed": "r/news",
    "body": "It just goes to show how invincible they feel they are (the assaulters).",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1507706250.0,
    "date_created": "2017-10-10",
    "time_created": "19:17:30",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zwt0",
    "parent_id": "t1_do6x121",
    "subreddit_name_prefixed": "r/news",
    "body": "> Except now there is.\n\nIs there, really? Like, mad props to every victim who files a police report, but it is really really hard to prove these things and people treat accusers like garbage out to maliciously ruin reputations.",
    "controversiality": 0,
    "ups": 147,
    "downs": 0,
    "score": 147,
    "created": 1507707836.0,
    "date_created": "2017-10-10",
    "time_created": "19:43:56",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6xqbl",
    "parent_id": "t1_do6x6rc",
    "subreddit_name_prefixed": "r/news",
    "body": "240 is big when you carry it high",
    "controversiality": 0,
    "ups": 216,
    "downs": 0,
    "score": 216,
    "created": 1507705072.0,
    "date_created": "2017-10-10",
    "time_created": "18:57:52",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6y7j3",
    "parent_id": "t1_do6x6rc",
    "subreddit_name_prefixed": "r/news",
    "body": "He's 6'3\", and not a lot of fat on him. He's pretty big. He might've had 5-10 lbs more muscle during his football years, but in terms of the position he was playing he's right about average to slightly below average (defensive end and linebacker) for today's stats.\n\nHe's just not a defensive tackle. Those guys are like the Mountain That Rides.",
    "controversiality": 0,
    "ups": 145,
    "downs": 0,
    "score": 145,
    "created": 1507705675.0,
    "date_created": "2017-10-10",
    "time_created": "19:07:55",
    "submission_id": "news-75k317"
  },
  {
    "id": "do738wk",
    "parent_id": "t1_do6x6rc",
    "subreddit_name_prefixed": "r/news",
    "body": "Only 240? wtf that's massive.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1507711853.0,
    "date_created": "2017-10-10",
    "time_created": "20:50:53",
    "submission_id": "news-75k317"
  },
  {
    "id": "do79dkb",
    "parent_id": "t1_do6zhdn",
    "subreddit_name_prefixed": "r/news",
    "body": "Me too brother.\n\nBut I'll tell you what: I'm down from 460+ to 335. I'm not saying it ain't a bitch, but weight loss is a product of your kitchen. Hitting the gym won't hurt, but ain't a requirement.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1507719025.0,
    "date_created": "2017-10-10",
    "time_created": "22:50:25",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6x3lz",
    "parent_id": "t1_do6wdrs",
    "subreddit_name_prefixed": "r/news",
    "body": "I also feel quite confident saying you would lose a fight with Terry.",
    "controversiality": 0,
    "ups": 154,
    "downs": 0,
    "score": 154,
    "created": 1507704288.0,
    "date_created": "2017-10-10",
    "time_created": "18:44:48",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6x9ln",
    "parent_id": "t1_do6wdrs",
    "subreddit_name_prefixed": "r/news",
    "body": "That's the fucked up part. The guy who did it KNEW that there wasn't anything Crews was going to do about it. It's a calculated risk, but the numbers have been on these people sides for most of their lives. \n\nIt's as our glorious leader said \"If you're a star, they'll let you do it\".\n\nThis same principle, apparently, applies to the people who pay stars as well.",
    "controversiality": 0,
    "ups": 264,
    "downs": 0,
    "score": 264,
    "created": 1507704494.0,
    "date_created": "2017-10-10",
    "time_created": "18:48:14",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7e9eb",
    "parent_id": "t1_do73xxq",
    "subreddit_name_prefixed": "r/news",
    "body": "You should feel shaken. If it happens to you (and I sincerely hope it never does), you'll feel it even more. It is really impossible to fully understand something like this until it happens to you, but Terry's words about this make it so much more accessible to people who have never been in this position, and arguably even more so for guys who may not have even thought that this is a possibility for them. I really hope his account makes it click for some people - this shit is not isolated. It is super fucking common and so unacceptable.    ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1507726037.0,
    "date_created": "2017-10-11",
    "time_created": "00:47:17",
    "submission_id": "news-75k317"
  },
  {
    "id": "do743qf",
    "parent_id": "t1_do72n3g",
    "subreddit_name_prefixed": "r/news",
    "body": "Who would've guessed this would happen after every  women he's been accused of harassing or assaulting was immediately dogpiled on online to try to discredit them?",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1507712837.0,
    "date_created": "2017-10-10",
    "time_created": "21:07:17",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6y0dh",
    "parent_id": "t1_do6x27w",
    "subreddit_name_prefixed": "r/news",
    "body": "Eh, I doubt that the consequences will be much to care about. These people are the ones with the money and money holds all the power.",
    "controversiality": 0,
    "ups": 345,
    "downs": 0,
    "score": 345,
    "created": 1507705418.0,
    "date_created": "2017-10-10",
    "time_created": "19:03:38",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zsnn",
    "parent_id": "t1_do6x27w",
    "subreddit_name_prefixed": "r/news",
    "body": ">It's happening in the UK and the police are completely overwhelmed.\n\nOnly because they're scratching their heads trying to figure out how to prosecute without admitting that they provided covers for the rapists.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1507707691.0,
    "date_created": "2017-10-10",
    "time_created": "19:41:31",
    "submission_id": "news-75k317"
  },
  {
    "id": "do73b72",
    "parent_id": "t1_do6xupa",
    "subreddit_name_prefixed": "r/news",
    "body": "Corporate America is polluted with guys like this. Hollywood, Silicon Valley, and the Catholic Church are only the most visible examples.",
    "controversiality": 0,
    "ups": 73,
    "downs": 0,
    "score": 73,
    "created": 1507711926.0,
    "date_created": "2017-10-10",
    "time_created": "20:52:06",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zm60",
    "parent_id": "t1_do6xupa",
    "subreddit_name_prefixed": "r/news",
    "body": "It's also much more make-or-break. ",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1507707463.0,
    "date_created": "2017-10-10",
    "time_created": "19:37:43",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7185k",
    "parent_id": "t1_do6xupa",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah, anywhere there's a power dynamic embedded in organizational structure you'll find people working their way to the top to exploit the people beneath them. Sports, business, churches, schools, politics, entertainment. As has been said, sex crimes are power crimes. Not all people who seek out power want to use it to harm, but my working theory is that a lot of the people who want to use power to prey on others are going to be drawn to pursue it in areas where there's a clear dynamic.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1507709462.0,
    "date_created": "2017-10-10",
    "time_created": "20:11:02",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70onv",
    "parent_id": "t1_do6xupa",
    "subreddit_name_prefixed": "r/news",
    "body": "Agreed, we need to not lose sight. These abuse of power stories exist in every industry. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1507708791.0,
    "date_created": "2017-10-10",
    "time_created": "19:59:51",
    "submission_id": "news-75k317"
  },
  {
    "id": "do750bq",
    "parent_id": "t1_do70n37",
    "subreddit_name_prefixed": "r/news",
    "body": "> Didn't Brian singer get busted for being a pediphile and literally nothing happened to him- aside from his career taking a break.\n\nI don't know why people keep saying this. Bryan Singer is still doing amazing. He's been involved in numerous movies even the upcoming X Men movie. Go on r/movies and there are tons of people looking forward to him and X-Men. \n\nI also don't know why people think Hollywood is going down from these allegations. Within the next month, this would have all blew over like all the other ones. From R Kelly to Polanski, from Allen to Salva who is coming out with Jeepers Creepers 3. Nope, Hollywood is going to be just fine, sorry y'all.\n",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1507713908.0,
    "date_created": "2017-10-10",
    "time_created": "21:25:08",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70uwf",
    "parent_id": "t1_do6yodr",
    "subreddit_name_prefixed": "r/news",
    "body": "Have you seen his *Hot Ones* challenge? \n\nOne of my favorite guests.\n\nhttps://www.youtube.com/watch?v=7TN09IP5JuI&t=7s",
    "controversiality": 0,
    "ups": 197,
    "downs": 0,
    "score": 197,
    "created": 1507709007.0,
    "date_created": "2017-10-10",
    "time_created": "20:03:27",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7201k",
    "parent_id": "t1_do700yk",
    "subreddit_name_prefixed": "r/news",
    "body": "He's the Renaissance Man of the modern era. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1507710378.0,
    "date_created": "2017-10-10",
    "time_created": "20:26:18",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6z70o",
    "parent_id": "t1_do6u7cn",
    "subreddit_name_prefixed": "r/news",
    "body": "Corey Feldman's gonna turn into Jose Canseco.  People laughed him off, brought all his dirt to the forefront, and ostracized him from the industry.  But it turned out he was right all along.  ",
    "controversiality": 0,
    "ups": 282,
    "downs": 0,
    "score": 282,
    "created": 1507706933.0,
    "date_created": "2017-10-10",
    "time_created": "19:28:53",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zsnl",
    "parent_id": "t1_do6u7cn",
    "subreddit_name_prefixed": "r/news",
    "body": "Genuinely for so long now that it's becoming ridiculous. The guy has been saying it since the 90s. Then they brought it up again on the Two Coreys show, where they both discussed dealing with trauma from abuse (Haim literally says \"where were you when I was \"raped,\" so to speak?), and the when Haim died Feldman spoke out about it _again._\n\nAnd _still_ no one has done anything.",
    "controversiality": 0,
    "ups": 271,
    "downs": 0,
    "score": 271,
    "created": 1507707691.0,
    "date_created": "2017-10-10",
    "time_created": "19:41:31",
    "submission_id": "news-75k317"
  },
  {
    "id": "do72cuv",
    "parent_id": "t1_do6u7cn",
    "subreddit_name_prefixed": "r/news",
    "body": "I always believed Corey, and it was sad to see him try and tell people and not really get anywhere.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1507710813.0,
    "date_created": "2017-10-10",
    "time_created": "20:33:33",
    "submission_id": "news-75k317"
  },
  {
    "id": "do78j5d",
    "parent_id": "t1_do75zis",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah same. Literally anyone who was on disney/nickelodeon etc. has probably had something happen to them. It's heartbreaking. ",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1507717981.0,
    "date_created": "2017-10-10",
    "time_created": "22:33:01",
    "submission_id": "news-75k317"
  },
  {
    "id": "do73jfe",
    "parent_id": "t1_do70zko",
    "subreddit_name_prefixed": "r/news",
    "body": "You look at Bryan Singer's eyes and then there's a realization that there's nothing behind them.\n",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1507712185.0,
    "date_created": "2017-10-10",
    "time_created": "20:56:25",
    "submission_id": "news-75k317"
  },
  {
    "id": "do73jrv",
    "parent_id": "t1_do70zko",
    "subreddit_name_prefixed": "r/news",
    "body": "Wow really? What's the story there?",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1507712196.0,
    "date_created": "2017-10-10",
    "time_created": "20:56:36",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zvxz",
    "parent_id": "t1_do6xilk",
    "subreddit_name_prefixed": "r/news",
    "body": "I mean Dan Schneider has to be one of the worst out there from all the gossip. Like how many teen girl stars went through his office",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1507707807.0,
    "date_created": "2017-10-10",
    "time_created": "19:43:27",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70332",
    "parent_id": "t1_do6xilk",
    "subreddit_name_prefixed": "r/news",
    "body": "Have there ever been legitimate stories about him? I thought it was just a meme.",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1507708050.0,
    "date_created": "2017-10-10",
    "time_created": "19:47:30",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zq9h",
    "parent_id": "t1_do6xilk",
    "subreddit_name_prefixed": "r/news",
    "body": "Half of me doesn't want Dan Schneider to be a child abuser. The other half just fucking knows he is with all the children shows he does.",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1507707610.0,
    "date_created": "2017-10-10",
    "time_created": "19:40:10",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6vjwo",
    "parent_id": "t1_do6udit",
    "subreddit_name_prefixed": "r/news",
    "body": "Don't make the mistake of assuming that this only happens in Hollywood. Remember Trump's comments? The disgusting practice of sexual coercion is undoubtably rampant wherever huge amounts of power and money reside. ",
    "controversiality": 0,
    "ups": 224,
    "downs": 0,
    "score": 224,
    "created": 1507702400.0,
    "date_created": "2017-10-10",
    "time_created": "18:13:20",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6ztyj",
    "parent_id": "t1_do6vpmf",
    "subreddit_name_prefixed": "r/news",
    "body": "Which he won't because it will only bring bad things for him, and he knows it.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1507707738.0,
    "date_created": "2017-10-10",
    "time_created": "19:42:18",
    "submission_id": "news-75k317"
  },
  {
    "id": "do72cg6",
    "parent_id": "t1_do6zw3v",
    "subreddit_name_prefixed": "r/news",
    "body": "Which laws?",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1507710799.0,
    "date_created": "2017-10-10",
    "time_created": "20:33:19",
    "submission_id": "news-75k317"
  },
  {
    "id": "do74yq8",
    "parent_id": "t1_do6zw3v",
    "subreddit_name_prefixed": "r/news",
    "body": "Literally nothing to do with California as a special case. You can be sued in any state for defamation. Look at John Oliver's case in W Virginia. The suit is absolutely absurd, but there it is still going to court. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1507713860.0,
    "date_created": "2017-10-10",
    "time_created": "21:24:20",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71onh",
    "parent_id": "t1_do714cv",
    "subreddit_name_prefixed": "r/news",
    "body": "Maybe because Crews is a large man known for his muscular physique and the rest of the victims we've heard about are petite women. ",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1507710000.0,
    "date_created": "2017-10-10",
    "time_created": "20:20:00",
    "submission_id": "news-75k317"
  },
  {
    "id": "do750t5",
    "parent_id": "t1_do714cv",
    "subreddit_name_prefixed": "r/news",
    "body": "Because Terry Crews isn't a 5'2\" 110lb woman",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1507713925.0,
    "date_created": "2017-10-10",
    "time_created": "21:25:25",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6sjln",
    "parent_id": "t1_do6s9mo",
    "subreddit_name_prefixed": "r/news",
    "body": "I agree and it’s unacceptable. It’s good to know that at least it’s coming into the light now and maybe little by little with more people coming forward this will be taken seriously by everyone. Maybe someday the rich won’t feel like they won’t get punished for their actions.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1507698953.0,
    "date_created": "2017-10-10",
    "time_created": "17:15:53",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6x4r4",
    "parent_id": "t1_do6tf6a",
    "subreddit_name_prefixed": "r/news",
    "body": "They got away with it because they've got away with it before. ",
    "controversiality": 0,
    "ups": 67,
    "downs": 0,
    "score": 67,
    "created": 1507704328.0,
    "date_created": "2017-10-10",
    "time_created": "18:45:28",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6ulif",
    "parent_id": "t1_do6traq",
    "subreddit_name_prefixed": "r/news",
    "body": "wow.  crazy story.  he lucked out...\n\ncrazy in two ways actually...  that club was making so much money hand over fist they lost 80 grand and it didn't even show up on their radar. ",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1507701271.0,
    "date_created": "2017-10-10",
    "time_created": "17:54:31",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6u0q8",
    "parent_id": "t1_do6traq",
    "subreddit_name_prefixed": "r/news",
    "body": "I should’ve been a bartender. ",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1507700610.0,
    "date_created": "2017-10-10",
    "time_created": "17:43:30",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71h17",
    "parent_id": "t1_do6zo67",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm wondering this too. \n\nI'm not a huge fan of the guy, but he's always seemed pretty level-headed, taking breaks from the public as needed, and never going on extremes of reclusiveness nor outlandish behavior. ",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1507709757.0,
    "date_created": "2017-10-10",
    "time_created": "20:15:57",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71unj",
    "parent_id": "t1_do6zo67",
    "subreddit_name_prefixed": "r/news",
    "body": "When he decided to break up *NSYNC 😭",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1507710200.0,
    "date_created": "2017-10-10",
    "time_created": "20:23:20",
    "submission_id": "news-75k317"
  },
  {
    "id": "do721dg",
    "parent_id": "t1_do6zo67",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah, that never happened. I wouldn't say Miley  had a breakdown either. She made some very questionable career choices, but if you go and listen to some of her interviews from that time, she still seemed perfectly fine. I think she just wanted to  separate herself from the Hannah Montana stuff once and for all, and did in the flashiest way possible. ",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1507710422.0,
    "date_created": "2017-10-10",
    "time_created": "20:27:02",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7366w",
    "parent_id": "t1_do6zo67",
    "subreddit_name_prefixed": "r/news",
    "body": "He didn't. JT has always been a very straight-laced pop star.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1507711767.0,
    "date_created": "2017-10-10",
    "time_created": "20:49:27",
    "submission_id": "news-75k317"
  },
  {
    "id": "do712pl",
    "parent_id": "t1_do70ync",
    "subreddit_name_prefixed": "r/news",
    "body": "It's super important to be supportive of male victims when they come forward, especially traditionally masculine ones, but we definitely need a societal analysis of how we treat female victims vs male ones because they get hella different responses.",
    "controversiality": 0,
    "ups": 117,
    "downs": 0,
    "score": 117,
    "created": 1507709280.0,
    "date_created": "2017-10-10",
    "time_created": "20:08:00",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71bsu",
    "parent_id": "t1_do70ync",
    "subreddit_name_prefixed": "r/news",
    "body": "Gwyneth Paltrow just came out about being sexually harassed and the Terry Crews tweets are at the top of Reddit. There you go.",
    "controversiality": 0,
    "ups": 53,
    "downs": 0,
    "score": 53,
    "created": 1507709585.0,
    "date_created": "2017-10-10",
    "time_created": "20:13:05",
    "submission_id": "news-75k317"
  },
  {
    "id": "do784ta",
    "parent_id": "t1_do70ync",
    "subreddit_name_prefixed": "r/news",
    "body": "but it's especially a woman thing, and we should be supportive of both instead of praising the men for coming out while sending death threats to the women.",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1507717498.0,
    "date_created": "2017-10-10",
    "time_created": "22:24:58",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zg44",
    "parent_id": "t1_do6to01",
    "subreddit_name_prefixed": "r/news",
    "body": "Daniel Tosh did a skit on his show and afterwards commented, \"That's what I love about Hollywood. There's no shortage of parents willing to let you do whatever with their children to get them on television.\"\n\nI know his joke was all in good fun, as was the skit, but it's sad that it's true at a much darker level.",
    "controversiality": 0,
    "ups": 226,
    "downs": 0,
    "score": 226,
    "created": 1507707251.0,
    "date_created": "2017-10-10",
    "time_created": "19:34:11",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6u8yn",
    "parent_id": "t1_do6to01",
    "subreddit_name_prefixed": "r/news",
    "body": "From Terry's feed\n\n> ***Hollywood is not the only business we’re this happens***, and to the casualties of this behavior— you are not alone. \n\nDon't those that have been victims in jobs that don't have any media spotlight deserve this made an issue for them as well? ",
    "controversiality": 0,
    "ups": 1238,
    "downs": 0,
    "score": 1238,
    "created": 1507700874.0,
    "date_created": "2017-10-10",
    "time_created": "17:47:54",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6u7uu",
    "parent_id": "t1_do6to01",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 140,
    "downs": 0,
    "score": 140,
    "created": 1507700840.0,
    "date_created": "2017-10-10",
    "time_created": "17:47:20",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6vm8p",
    "parent_id": "t1_do6to01",
    "subreddit_name_prefixed": "r/news",
    "body": "Let's not ignore New York billionaires!",
    "controversiality": 0,
    "ups": 103,
    "downs": 0,
    "score": 103,
    "created": 1507702476.0,
    "date_created": "2017-10-10",
    "time_created": "18:14:36",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70la4",
    "parent_id": "t1_do6x7z7",
    "subreddit_name_prefixed": "r/news",
    "body": "He's just covering for Adam Sandler.",
    "controversiality": 0,
    "ups": 302,
    "downs": 0,
    "score": 302,
    "created": 1507708676.0,
    "date_created": "2017-10-10",
    "time_created": "19:57:56",
    "submission_id": "news-75k317"
  },
  {
    "id": "do74is8",
    "parent_id": "t1_do71nwe",
    "subreddit_name_prefixed": "r/news",
    "body": "He and Crews still want work in Hollywood....",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1507713334.0,
    "date_created": "2017-10-10",
    "time_created": "21:15:34",
    "submission_id": "news-75k317"
  },
  {
    "id": "do76wt9",
    "parent_id": "t1_do71nwe",
    "subreddit_name_prefixed": "r/news",
    "body": "It's not exactly an easy decision, mate. There's a lot of shame and embarrassment, not to mention potential repercussions.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1507716078.0,
    "date_created": "2017-10-10",
    "time_created": "22:01:18",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6x53l",
    "parent_id": "t1_do6vqo4",
    "subreddit_name_prefixed": "r/news",
    "body": "That's not a cool reference in this situation, dude.  I smirked because I'm a bad person though.",
    "controversiality": 0,
    "ups": 221,
    "downs": 0,
    "score": 221,
    "created": 1507704339.0,
    "date_created": "2017-10-10",
    "time_created": "18:45:39",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70g2n",
    "parent_id": "t1_do6vqo4",
    "subreddit_name_prefixed": "r/news",
    "body": "Rob Scheider thought he had it all, but he's about to find out that stardom isn't all what it's cracked up to be...",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1507708494.0,
    "date_created": "2017-10-10",
    "time_created": "19:54:54",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zcy2",
    "parent_id": "t1_do6vqo4",
    "subreddit_name_prefixed": "r/news",
    "body": "And he's about to find out...",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1507707144.0,
    "date_created": "2017-10-10",
    "time_created": "19:32:24",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6wie4",
    "parent_id": "t1_do6vqpa",
    "subreddit_name_prefixed": "r/news",
    "body": "This.\n\nThe stronger the victim the stronger the feeling of power and conquest is\n\nThe attacker clearly maneuvered in a manner knowing the outcome and that Terry isn't truly an unchained dog but a nice average man with above average physique.",
    "controversiality": 0,
    "ups": 911,
    "downs": 0,
    "score": 911,
    "created": 1507703557.0,
    "date_created": "2017-10-10",
    "time_created": "18:32:37",
    "submission_id": "news-75k317"
  },
  {
    "id": "do78umg",
    "parent_id": "t1_do6vqpa",
    "subreddit_name_prefixed": "r/news",
    "body": "Exactly. I feel like I need to save this as an example for when people can't wrap their head around the fact that sexual abuse and predators is often about exerting power, not about sexual attraction. Hence why there's no such thing as \"asking for it\" by dressing a certain way. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507718372.0,
    "date_created": "2017-10-10",
    "time_created": "22:39:32",
    "submission_id": "news-75k317"
  },
  {
    "id": "do76k8o",
    "parent_id": "t1_do6x6e1",
    "subreddit_name_prefixed": "r/news",
    "body": "Not even that. It's not violence isn't tolerated, it's something crews said,\n\n>“240 lbs. Black Man stomps out Hollywood Honcho” would be the headline the next day,Only I probably wouldn’t have been able to read it because I WOULD HAVE BEEN IN JAIL. So we left.\n(6/cont.)\n\nEven if he did put hands on him, he would have lost. And no one at the party would have defended him because they would have been scared to get blacklisted, and no one would come out say it happened to them because they don't want to get blacklisted. \n\n",
    "controversiality": 0,
    "ups": 191,
    "downs": 0,
    "score": 191,
    "created": 1507715705.0,
    "date_created": "2017-10-10",
    "time_created": "21:55:05",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7axfx",
    "parent_id": "t1_do75g1o",
    "subreddit_name_prefixed": "r/news",
    "body": "How badly do you want that spot? ",
    "controversiality": 0,
    "ups": 146,
    "downs": 0,
    "score": 146,
    "created": 1507720993.0,
    "date_created": "2017-10-10",
    "time_created": "23:23:13",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7au9x",
    "parent_id": "t1_do75g1o",
    "subreddit_name_prefixed": "r/news",
    "body": "In NY, it is.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1507720878.0,
    "date_created": "2017-10-10",
    "time_created": "23:21:18",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70ik7",
    "parent_id": "t1_do6yw1a",
    "subreddit_name_prefixed": "r/news",
    "body": "It is helpful, I agree. You must know how these threads normally go, though -- the nth woman comes forward and people say she's just in it for the paycheck. People see that treatment happen over and over, and if/when they are themselves in a position of needing to decide whether to come forward or heal privately, they're more likely to decide to heal privately. The way we all talk about these situations needs to improve drastically.",
    "controversiality": 0,
    "ups": 179,
    "downs": 0,
    "score": 179,
    "created": 1507708581.0,
    "date_created": "2017-10-10",
    "time_created": "19:56:21",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7h1zj",
    "parent_id": "t1_do75k5d",
    "subreddit_name_prefixed": "r/news",
    "body": "He is always so genuine too, and has the nicest eyes. If he was into queer white 20 somethings he could be my daddy 😳",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1507731427.0,
    "date_created": "2017-10-11",
    "time_created": "02:17:07",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7ls5v",
    "parent_id": "t1_do75k5d",
    "subreddit_name_prefixed": "r/news",
    "body": "Plus he got into gaming to connect with his son. Rather than see gaming as this thing he builds a PC with his son.\n\n There’s footage from E3 where EA got a bunch of celebrities to play Battlefield 1z Snoop Dogg, Jamie Foxx and Zac Efron all turn up high. Snoop is standing playing with a massive spliff. It’s an absolute trainwreck in terms of marketing and PR. The funniest bit however is when Terry Crews comes up his normal Terry self and insists he’ll play with mouse and keyboard. Next shot he’s there on mouse and keyboard. Legend. ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1507744363.0,
    "date_created": "2017-10-11",
    "time_created": "05:52:43",
    "submission_id": "news-75k317"
  },
  {
    "id": "do74i01",
    "parent_id": "t1_do71kxc",
    "subreddit_name_prefixed": "r/news",
    "body": "He quit from the 49ers",
    "controversiality": 0,
    "ups": 276,
    "downs": 0,
    "score": 276,
    "created": 1507713307.0,
    "date_created": "2017-10-10",
    "time_created": "21:15:07",
    "submission_id": "news-75k317"
  },
  {
    "id": "do74r1y",
    "parent_id": "t1_do71kxc",
    "subreddit_name_prefixed": "r/news",
    "body": "That was the 49ers",
    "controversiality": 0,
    "ups": 79,
    "downs": 0,
    "score": 79,
    "created": 1507713613.0,
    "date_created": "2017-10-10",
    "time_created": "21:20:13",
    "submission_id": "news-75k317"
  },
  {
    "id": "do795gs",
    "parent_id": "t1_do71kxc",
    "subreddit_name_prefixed": "r/news",
    "body": "Jeez, why are people so mean to Terry Crews?",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1507718745.0,
    "date_created": "2017-10-10",
    "time_created": "22:45:45",
    "submission_id": "news-75k317"
  },
  {
    "id": "do75ppj",
    "parent_id": "t1_do71o81",
    "subreddit_name_prefixed": "r/news",
    "body": "/r/wholesomereddit \n\nBut seriously, never count yourself out. Everyone is amazing and interesting in their own way. \n\n",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1507714722.0,
    "date_created": "2017-10-10",
    "time_created": "21:38:42",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6uv5p",
    "parent_id": "t1_do6t41b",
    "subreddit_name_prefixed": "r/news",
    "body": "Crews could've probably punched a Kung-Pow style hole in their torso and get away with it as long as he shouted \"OLD SPICE!\" when he did so.",
    "controversiality": 0,
    "ups": 1012,
    "downs": 0,
    "score": 1012,
    "created": 1507701576.0,
    "date_created": "2017-10-10",
    "time_created": "17:59:36",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7aocw",
    "parent_id": "t1_do6t41b",
    "subreddit_name_prefixed": "r/news",
    "body": "In Hollywood you get blacklisted if you speak out about the sexual harassment. Most actors and actresses have been raped or sexually exploited by powerful execs but would never dare accuse them, unless they don't mind destroying their careers. Crews is brace for this. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1507720655.0,
    "date_created": "2017-10-10",
    "time_created": "23:17:35",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7408h",
    "parent_id": "t1_do6vtxu",
    "subreddit_name_prefixed": "r/news",
    "body": "Exactly. My grandfather raped me at 15, and my mother and grandmother didn't get cops involved because they both rely on him financially. It's fucking disgusting.",
    "controversiality": 0,
    "ups": 138,
    "downs": 0,
    "score": 138,
    "created": 1507712728.0,
    "date_created": "2017-10-10",
    "time_created": "21:05:28",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70ii1",
    "parent_id": "t1_do70dkj",
    "subreddit_name_prefixed": "r/news",
    "body": "Well, to be fair, his dip back into Hollywood films was Expendables 3, which is easily the worst of the three by a large margin so that didn't do him any favors. I do get what you're saying though.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1507708579.0,
    "date_created": "2017-10-10",
    "time_created": "19:56:19",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6w9m6",
    "parent_id": "t1_do6vy1j",
    "subreddit_name_prefixed": "r/news",
    "body": "There had been a bunch of people at my place after a night drinking. Gay kid was the last one of the group there. Me and him bullshitting. I get handed shot by him. Take it. Weird syrupy mixture. Not sure what the hell I just drank, wasn't my liquor, no clue where it came from. The warm fuzzy hug of sedatives mixed with liquor sets in. I'm barely functional and push off aggresive advances for like an hour+. Sun starts to come up and we can hear one of my roommates stirring. He leaves very quickly. I wake up the next day horrified and he sends me a flirty message on Facebook. I let him know if hes ever within arm's reach of me in public I woild leave him permanently disfigured. He kept a wide berth whenever we ran into eachother at clubs and bars from then on.\n\nNow when I see people that look like him I get irrationally uneasy and angry, then feel like a prejudiced asshole.\n\nI was so embarrassed I let my guard down enough to even let it get that far, that at the time I just told no one. Just sort of wanted to shove it down and let it pass. Years later now, not a big deal, just a hard learned lesson. People are unpredictable, be careful.",
    "controversiality": 0,
    "ups": 1039,
    "downs": 0,
    "score": 1039,
    "created": 1507703263.0,
    "date_created": "2017-10-10",
    "time_created": "18:27:43",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7bf8n",
    "parent_id": "t1_do70k9p",
    "subreddit_name_prefixed": "r/news",
    "body": "Thats how legendary blues player Robert Johnson died.\n\n\"When Johnson took the bottle, Williamson knocked it out of his hand, admonishing him to never drink from a bottle that he had not personally seen opened. Johnson replied, \"Don't ever knock a bottle out of my hand.\" \n\n \"Over the next three days his condition steadily worsened. Witnesses reported that he died in a convulsive state of severe pain.\"\n\nHe was poisoned",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507721682.0,
    "date_created": "2017-10-10",
    "time_created": "23:34:42",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70mxj",
    "parent_id": "t1_do6y5e0",
    "subreddit_name_prefixed": "r/news",
    "body": "will everyone lay the fuck off my Terry Crews :(",
    "controversiality": 0,
    "ups": 174,
    "downs": 0,
    "score": 174,
    "created": 1507708733.0,
    "date_created": "2017-10-10",
    "time_created": "19:58:53",
    "submission_id": "news-75k317"
  },
  {
    "id": "do705ql",
    "parent_id": "t1_do6z4hv",
    "subreddit_name_prefixed": "r/news",
    "body": "It's not about the physical stature. It's all about the power. Crews, to them, is no different than any other actor or actress. They know that if they fight against it, there is a good chance nothing will happen, and then the sexual predator just uses their connections to make sure they are blacklisted. Maybe just for a bit, maybe forever.\n\nAnd when it's a young person, or an up and coming star... they don't have anything to fall back on. No fans to appeal to, no big names to stand with them, no money to fall back on if the jobs dry up, etc. And by the time some of these men and women get older, they have been through it. They may not even think of working against the system until something like this happens where it finally clicks that they can do shit. And of course there are others who have been talking about this crap forever who will say, \"see? what the fuck have I been saying?\".",
    "controversiality": 0,
    "ups": 2069,
    "downs": 0,
    "score": 2069,
    "created": 1507708143.0,
    "date_created": "2017-10-10",
    "time_created": "19:49:03",
    "submission_id": "news-75k317"
  },
  {
    "id": "do701bo",
    "parent_id": "t1_do6z4hv",
    "subreddit_name_prefixed": "r/news",
    "body": "I have to imagine his personality would really make up for any physical intimidation.  He seems like he'd be one of the nicest people you would ever meet.",
    "controversiality": 0,
    "ups": 846,
    "downs": 0,
    "score": 846,
    "created": 1507707990.0,
    "date_created": "2017-10-10",
    "time_created": "19:46:30",
    "submission_id": "news-75k317"
  },
  {
    "id": "do709sl",
    "parent_id": "t1_do6z4hv",
    "subreddit_name_prefixed": "r/news",
    "body": "You can blame Hollywood all you want but I know many people who have experienced harassment and they are not in Hollywood. This is an issue more prevalent to our every day lives than anyone would like to admit.",
    "controversiality": 0,
    "ups": 248,
    "downs": 0,
    "score": 248,
    "created": 1507708284.0,
    "date_created": "2017-10-10",
    "time_created": "19:51:24",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71535",
    "parent_id": "t1_do6z4hv",
    "subreddit_name_prefixed": "r/news",
    "body": "Also someone's body has nothing to do with sexual assault. I think there's a misconception that sexual assault only happens to people who aren't \"strong enough\" to stop it: I've heard people dismiss a sexual assault that happened to a tall, 'big' girl because the male was short and scrawny. \n\nSexual assault doesn't just happen in dark alleyways with a strong male against a fragile woman. It is friends and co-workers and family members, where being physically strong doesn't work as a defence",
    "controversiality": 0,
    "ups": 94,
    "downs": 0,
    "score": 94,
    "created": 1507709359.0,
    "date_created": "2017-10-10",
    "time_created": "20:09:19",
    "submission_id": "news-75k317"
  },
  {
    "id": "do706rw",
    "parent_id": "t1_do6z4hv",
    "subreddit_name_prefixed": "r/news",
    "body": "That is the real scary part of this. Terry crews is a huge dude. You would expect him to lash out physically but this guy was so sure he wouldn't, and that he could get away with it, that he groped him anyway. I mean damn that is brazen. ",
    "controversiality": 0,
    "ups": 207,
    "downs": 0,
    "score": 207,
    "created": 1507708178.0,
    "date_created": "2017-10-10",
    "time_created": "19:49:38",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70jso",
    "parent_id": "t1_do6z4hv",
    "subreddit_name_prefixed": "r/news",
    "body": "No.\nIt's not a Hollywood problem.  \nThe abuser can be anyone with workforce power.  ",
    "controversiality": 0,
    "ups": 148,
    "downs": 0,
    "score": 148,
    "created": 1507708625.0,
    "date_created": "2017-10-10",
    "time_created": "19:57:05",
    "submission_id": "news-75k317"
  },
  {
    "id": "do708mn",
    "parent_id": "t1_do6z4hv",
    "subreddit_name_prefixed": "r/news",
    "body": "While this problem is clearly not limited to this one guy in Hollywood, you're painting with a narrow brush to say this is a problem of \"Hollywood elites.\" There are guys like this all over, usually found in a position of power over those they harass, holding a perceived threat of harm to that person's social, occupational, legal, or financial situation. But there are ethical guys in power positions too, in Hollywood and everywhere else, and it's important they don't stay quiet about these things.",
    "controversiality": 0,
    "ups": 115,
    "downs": 0,
    "score": 115,
    "created": 1507708245.0,
    "date_created": "2017-10-10",
    "time_created": "19:50:45",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70972",
    "parent_id": "t1_do6z4hv",
    "subreddit_name_prefixed": "r/news",
    "body": "“I’m automatically attracted to beautiful women — I just start kissing them, it’s like a magnet. Just kiss. I don’t even wait. And when you’re a star, they let you do it. You can do anything. Grab 'em by the pussy.\"\n\n-Donald J Trump (2005)\n\n\nThis came to light exactly one year and 3 days ago.",
    "controversiality": 0,
    "ups": 533,
    "downs": 0,
    "score": 533,
    "created": 1507708265.0,
    "date_created": "2017-10-10",
    "time_created": "19:51:05",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70opm",
    "parent_id": "t1_do6z4hv",
    "subreddit_name_prefixed": "r/news",
    "body": "Hollywood elites? Damn near every workplace in the world.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1507708792.0,
    "date_created": "2017-10-10",
    "time_created": "19:59:52",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6xfvt",
    "parent_id": "t1_do6x2di",
    "subreddit_name_prefixed": "r/news",
    "body": "Hollywood has always been broken. Corey Feldman spoke out about how they were passed around at parties back in the 80's ",
    "controversiality": 0,
    "ups": 1179,
    "downs": 0,
    "score": 1179,
    "created": 1507704712.0,
    "date_created": "2017-10-10",
    "time_created": "18:51:52",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6ye26",
    "parent_id": "t1_do6x2di",
    "subreddit_name_prefixed": "r/news",
    "body": "Things are actually getting better cause in the past victims have not had to platform or ability to speak out. Alfred Hitchcock harassed his leading ladies and ruined their careers when they rejected him.",
    "controversiality": 0,
    "ups": 150,
    "downs": 0,
    "score": 150,
    "created": 1507705905.0,
    "date_created": "2017-10-10",
    "time_created": "19:11:45",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6yo0w",
    "parent_id": "t1_do6x2di",
    "subreddit_name_prefixed": "r/news",
    "body": "did you guys miss how Hollywood has been defending a pedophile child rapist and continuing to work with him since 1977? Like what? Or the mass exploitation of child actors including sexual abuse like the two Coreys?",
    "controversiality": 0,
    "ups": 210,
    "downs": 0,
    "score": 210,
    "created": 1507706258.0,
    "date_created": "2017-10-10",
    "time_created": "19:17:38",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6xgm0",
    "parent_id": "t1_do6x2di",
    "subreddit_name_prefixed": "r/news",
    "body": "I highly doubt this is anything new.  It's been going on in Hollywood for forever.",
    "controversiality": 0,
    "ups": 83,
    "downs": 0,
    "score": 83,
    "created": 1507704737.0,
    "date_created": "2017-10-10",
    "time_created": "18:52:17",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zvd3",
    "parent_id": "t1_do6x2di",
    "subreddit_name_prefixed": "r/news",
    "body": "I've worked in business and government, and this is NOT about Hollywood. It's about money and power and that if you have enough then it will be the victim who faces repercussions.",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1507707788.0,
    "date_created": "2017-10-10",
    "time_created": "19:43:08",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6yxp3",
    "parent_id": "t1_do6x2di",
    "subreddit_name_prefixed": "r/news",
    "body": "It ain't just Hollywood. Anytime there's greedy, powerful people they have a tendency to let it go to their heads.\n\nCatholic Church comes to mind.",
    "controversiality": 0,
    "ups": 81,
    "downs": 0,
    "score": 81,
    "created": 1507706601.0,
    "date_created": "2017-10-10",
    "time_created": "19:23:21",
    "submission_id": "news-75k317"
  },
  {
    "id": "do72448",
    "parent_id": "t1_do717ep",
    "subreddit_name_prefixed": "r/news",
    "body": "It's amazing the looks I get whenever I share that I've been a victim, as a male, from a female. It's never a look of empathy, it's looks of disbelief, derision, and/or pity.",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1507710516.0,
    "date_created": "2017-10-10",
    "time_created": "20:28:36",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6xvpq",
    "parent_id": "t1_do6xazb",
    "subreddit_name_prefixed": "r/news",
    "body": "Oh, I have the feeling we're going to find out who did this to Crews within a few short weeks.  That or Crews wins the Academy Award for Best Actor for his bit part in Sandy Wexler.",
    "controversiality": 0,
    "ups": 273,
    "downs": 0,
    "score": 273,
    "created": 1507705254.0,
    "date_created": "2017-10-10",
    "time_created": "19:00:54",
    "submission_id": "news-75k317"
  },
  {
    "id": "do721s7",
    "parent_id": "t1_do6xazb",
    "subreddit_name_prefixed": "r/news",
    "body": "Think about the child stars. If it's been happening on this level to women and big men like crews, id hate to think of the power Trip these sick people have with children.\n\nIm honestly starting to think this happens a lot more than we are led to believe.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1507710437.0,
    "date_created": "2017-10-10",
    "time_created": "20:27:17",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zorj",
    "parent_id": "t1_do6y7j3",
    "subreddit_name_prefixed": "r/news",
    "body": "Also, he usually the other actors around him are tiny.",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1507707557.0,
    "date_created": "2017-10-10",
    "time_created": "19:39:17",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6y2uq",
    "parent_id": "t1_do6x3lz",
    "subreddit_name_prefixed": "r/news",
    "body": "I feel confident that we'd all lose a fight to Terry.\n\nEven if we all went at him at once like 100 duck-sized horses.",
    "controversiality": 0,
    "ups": 69,
    "downs": 0,
    "score": 69,
    "created": 1507705508.0,
    "date_created": "2017-10-10",
    "time_created": "19:05:08",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zxv7",
    "parent_id": "t1_do6x9ln",
    "subreddit_name_prefixed": "r/news",
    "body": "> \"If you're a star, they'll let you do it\".\n\nI hate this phrase so much because people have used it to defend him.  \"See, they LET him, it was totally consensual!\"\n\nIt's like they missed the fact that letting someone do something doesn't mean you WANT them to do it.  It's crazy that they think  sexual assault has to to involve physicaly forcing yourself on someone  or it doesn't count",
    "controversiality": 0,
    "ups": 97,
    "downs": 0,
    "score": 97,
    "created": 1507707871.0,
    "date_created": "2017-10-10",
    "time_created": "19:44:31",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7d1w2",
    "parent_id": "t1_do743qf",
    "subreddit_name_prefixed": "r/news",
    "body": "It's not like James Woods has sued people until they committed suicide and then gleefully tweeted about \"following them to the gates of hell\", right? Oh, fuck, really?",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1507724099.0,
    "date_created": "2017-10-11",
    "time_created": "00:14:59",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6y4za",
    "parent_id": "t1_do6y0dh",
    "subreddit_name_prefixed": "r/news",
    "body": "Don't be too sure, grooming gangs in the UK are only just getting sentenced now after years of investigation. \n\nThe wheels turn slow.  ",
    "controversiality": 0,
    "ups": 260,
    "downs": 0,
    "score": 260,
    "created": 1507705585.0,
    "date_created": "2017-10-10",
    "time_created": "19:06:25",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71h9r",
    "parent_id": "t1_do70uwf",
    "subreddit_name_prefixed": "r/news",
    "body": "I was just about to reply with this. He seems like such an incredibly humble guy. I loved his insight into the world of a practice squad/ low level NFL player. It was pretty shocking and disgusting to hear",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1507709766.0,
    "date_created": "2017-10-10",
    "time_created": "20:16:06",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71quz",
    "parent_id": "t1_do70uwf",
    "subreddit_name_prefixed": "r/news",
    "body": "Now I have! Man, he's one cool dude.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507710074.0,
    "date_created": "2017-10-10",
    "time_created": "20:21:14",
    "submission_id": "news-75k317"
  },
  {
    "id": "do72jj2",
    "parent_id": "t1_do6z70o",
    "subreddit_name_prefixed": "r/news",
    "body": "How about Sinead O'Connor - when she tore up the picture of the Pope on SNL to protest the Magdalene Laundries and Church sex abuse, she was vilified and the next week's SNL host spent his entire monologue talking about he'd like to beat her up (to thunderous applause). \n\nA couple decades later, her protest doesn't seem so unreasonable. ",
    "controversiality": 0,
    "ups": 249,
    "downs": 0,
    "score": 249,
    "created": 1507711038.0,
    "date_created": "2017-10-10",
    "time_created": "20:37:18",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70z79",
    "parent_id": "t1_do6zsnl",
    "subreddit_name_prefixed": "r/news",
    "body": "There's one guy who pled guilty to at least one count of child molestation or something similar and is still a producer on the tween shows on Nick or Disney.  The entire industry is complicit. ",
    "controversiality": 0,
    "ups": 106,
    "downs": 0,
    "score": 106,
    "created": 1507709154.0,
    "date_created": "2017-10-10",
    "time_created": "20:05:54",
    "submission_id": "news-75k317"
  },
  {
    "id": "do744bj",
    "parent_id": "t1_do73jrv",
    "subreddit_name_prefixed": "r/news",
    "body": "It's heavily rumoured that he's in the industry as a means to fuel his CP-related interests.",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1507712857.0,
    "date_created": "2017-10-10",
    "time_created": "21:07:37",
    "submission_id": "news-75k317"
  },
  {
    "id": "do72in1",
    "parent_id": "t1_do70332",
    "subreddit_name_prefixed": "r/news",
    "body": "There was pictures of him with a young Ariana grande. He has her lipstick on his lips. ",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1507711009.0,
    "date_created": "2017-10-10",
    "time_created": "20:36:49",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71b7h",
    "parent_id": "t1_do6zq9h",
    "subreddit_name_prefixed": "r/news",
    "body": "I get all the jokes, but is there a real stigma against him?\n\nI don't like kids, I can't imagine working with them.\n\nBut I've seen other dudes who love kids in a non-creepy way, they just love making kids happy because it makes them happy.\n\nIf Schneider is really a creep based on the fact that he produces kids shows, we have to throw anyone who has a long-term career in kids' anything productions.\n\nWelp, guess that Mr. Rogers is a creep.",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1507709566.0,
    "date_created": "2017-10-10",
    "time_created": "20:12:46",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6xl7c",
    "parent_id": "t1_do6vjwo",
    "subreddit_name_prefixed": "r/news",
    "body": "Yes I know, it happens anywhere someone has the power. Celebrities would just help to bring it to the forefront. ",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1507704897.0,
    "date_created": "2017-10-10",
    "time_created": "18:54:57",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6xspg",
    "parent_id": "t1_do6vjwo",
    "subreddit_name_prefixed": "r/news",
    "body": "> wherever huge amounts of power and money reside.\n\n100% agree. And I think adding alcohol to the mix makes it even worse. So industries where there are a lot of \"industry events\" that involve a lot of drinking makes it even worse. ",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1507705154.0,
    "date_created": "2017-10-10",
    "time_created": "18:59:14",
    "submission_id": "news-75k317"
  },
  {
    "id": "do73hny",
    "parent_id": "t1_do72cg6",
    "subreddit_name_prefixed": "r/news",
    "body": "I don't know about specific laws, but the accused can sue over defamation. Even if they can't win, it forces the accuser to spend a ton of money. ",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1507712127.0,
    "date_created": "2017-10-10",
    "time_created": "20:55:27",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6usra",
    "parent_id": "t1_do6ulif",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1507701498.0,
    "date_created": "2017-10-10",
    "time_created": "17:58:18",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6u604",
    "parent_id": "t1_do6u0q8",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1507700779.0,
    "date_created": "2017-10-10",
    "time_created": "17:46:19",
    "submission_id": "news-75k317"
  },
  {
    "id": "do74y33",
    "parent_id": "t1_do712pl",
    "subreddit_name_prefixed": "r/news",
    "body": "You articulated exactly what I was thinking but couldn't manage to put into words. ",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1507713839.0,
    "date_created": "2017-10-10",
    "time_created": "21:23:59",
    "submission_id": "news-75k317"
  },
  {
    "id": "do719n0",
    "parent_id": "t1_do712pl",
    "subreddit_name_prefixed": "r/news",
    "body": "Well said :) \n\n\n",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1507709512.0,
    "date_created": "2017-10-10",
    "time_created": "20:11:52",
    "submission_id": "news-75k317"
  },
  {
    "id": "do78pud",
    "parent_id": "t1_do71bsu",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah and Gwyneth and that other woman have gotten so much shit about it already. It makes me a little angry on the inside, now that it's a man speaking it's suddenly more important or more believable or the story has more interest. \n\nI'm HAPPY at least someone bad is about to get beat down but Jesus nothing ever changes and it's almost so depressing.",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1507718213.0,
    "date_created": "2017-10-10",
    "time_created": "22:36:53",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7ntdj",
    "parent_id": "t1_do6zg44",
    "subreddit_name_prefixed": "r/news",
    "body": "\"All in good fun,\" isn't necessarily what he was aiming for.  He has some pretty dark stuff.  Dark humor isn't funny because it's fun.  Honestly, this is a point in his favor as a good comedian to me.  Good comedians aren't afraid of making us laugh at horrible shit.",
    "controversiality": 0,
    "ups": 60,
    "downs": 0,
    "score": 60,
    "created": 1507749761.0,
    "date_created": "2017-10-11",
    "time_created": "07:22:41",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7a642",
    "parent_id": "t1_do6u8yn",
    "subreddit_name_prefixed": "r/news",
    "body": "Most victims appreciate knowing they're not alone. People splitting hairs over who gets recongition maybe have misplaced desire to help victims. Never met a victim who said anything about people having it easier than them. They only talk about the folks who have it worse. \nEdit: clarified.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1507719990.0,
    "date_created": "2017-10-10",
    "time_created": "23:06:30",
    "submission_id": "news-75k317"
  },
  {
    "id": "do718pr",
    "parent_id": "t1_do6u7uu",
    "subreddit_name_prefixed": "r/news",
    "body": "And politics.",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1507709481.0,
    "date_created": "2017-10-10",
    "time_created": "20:11:21",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7044u",
    "parent_id": "t1_do6vm8p",
    "subreddit_name_prefixed": "r/news",
    "body": "I think it’s safe to say many people with power and influence will use it to take advantage of others and get what the want. Former presidents even. ",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1507708086.0,
    "date_created": "2017-10-10",
    "time_created": "19:48:06",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7bicd",
    "parent_id": "t1_do70la4",
    "subreddit_name_prefixed": "r/news",
    "body": "Sandler died inside years ago.",
    "controversiality": 0,
    "ups": 250,
    "downs": 0,
    "score": 250,
    "created": 1507721804.0,
    "date_created": "2017-10-10",
    "time_created": "23:36:44",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71s1l",
    "parent_id": "t1_do70la4",
    "subreddit_name_prefixed": "r/news",
    "body": "Adam Sandler did die in Deuce Bigalow: European Gigolo.",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1507710112.0,
    "date_created": "2017-10-10",
    "time_created": "20:21:52",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70fnw",
    "parent_id": "t1_do6x53l",
    "subreddit_name_prefixed": "r/news",
    "body": "Its never a bad time for a joke if its funny",
    "controversiality": 0,
    "ups": 63,
    "downs": 0,
    "score": 63,
    "created": 1507708479.0,
    "date_created": "2017-10-10",
    "time_created": "19:54:39",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zsbs",
    "parent_id": "t1_do6zcy2",
    "subreddit_name_prefixed": "r/news",
    "body": "That his real dad is....",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1507707679.0,
    "date_created": "2017-10-10",
    "time_created": "19:41:19",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6x8v7",
    "parent_id": "t1_do6wie4",
    "subreddit_name_prefixed": "r/news",
    "body": "Also, when you're much bigger than the person assaulting you... fighting back still sends you to jail.\n\nA big size advantage means you cant fight back and have the public as a whole say it was justified.",
    "controversiality": 0,
    "ups": 448,
    "downs": 0,
    "score": 448,
    "created": 1507704469.0,
    "date_created": "2017-10-10",
    "time_created": "18:47:49",
    "submission_id": "news-75k317"
  },
  {
    "id": "do79s1d",
    "parent_id": "t1_do78umg",
    "subreddit_name_prefixed": "r/news",
    "body": "Well, and the \"asking for it\" thing is part of the false belief that consent for one act is automatically consent for the next.  So, they dressed sexy so they consent to being looked at, which means they consent to flirting, which means they consent to touching, which means they consent to sex.  If consent is withdrawn at any point it is \"teasing\" or \"playing hard to get,\" because the assumption is that consent was already given by the clothes they were wearing.  When you think about it, it makes absolutely no sense, but it's not really meant to.  It's one of those arguments that is meant as a vaguely-reasonable cover for the actual reason which would be obviously vile to say out loud.  The real argument is that women don't have the agency to decide where their personal boundaries are (and let's face it, this particular argument is usually targeted at women).",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1507719505.0,
    "date_created": "2017-10-10",
    "time_created": "22:58:25",
    "submission_id": "news-75k317"
  },
  {
    "id": "do72eh0",
    "parent_id": "t1_do70ik7",
    "subreddit_name_prefixed": "r/news",
    "body": "> The way we all talk about these situations needs to improve drastically.\n\nI am cautiously optimistic that more people like Terry speaking up will change how the conversation goes. It sucks that some people will only listen to people of their own gender (and often race), but if that's what it takes then I'm glad there is a diversity of voices speaking up. ",
    "controversiality": 0,
    "ups": 86,
    "downs": 0,
    "score": 86,
    "created": 1507710868.0,
    "date_created": "2017-10-10",
    "time_created": "20:34:28",
    "submission_id": "news-75k317"
  },
  {
    "id": "do76qls",
    "parent_id": "t1_do74i01",
    "subreddit_name_prefixed": "r/news",
    "body": "He tried out for the 49ers and said fuck that.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1507715892.0,
    "date_created": "2017-10-10",
    "time_created": "21:58:12",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6x3b6",
    "parent_id": "t1_do6uv5p",
    "subreddit_name_prefixed": "r/news",
    "body": "Like he said the next day headline would of been 240lb Black man attacks Hollywood executive and he would of never worked again.\n\nhttps://twitter.com/terrycrews/status/917838611159986176\n\nhttps://twitter.com/terrycrews/status/917838656500506625\n\n",
    "controversiality": 0,
    "ups": 1128,
    "downs": 0,
    "score": 1128,
    "created": 1507704278.0,
    "date_created": "2017-10-10",
    "time_created": "18:44:38",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7ag8j",
    "parent_id": "t1_do7408h",
    "subreddit_name_prefixed": "r/news",
    "body": "Omg, that's insane! I'm so sorry that happened to you.",
    "controversiality": 0,
    "ups": 48,
    "downs": 0,
    "score": 48,
    "created": 1507720353.0,
    "date_created": "2017-10-10",
    "time_created": "23:12:33",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7bbx1",
    "parent_id": "t1_do7408h",
    "subreddit_name_prefixed": "r/news",
    "body": "Holy shit dude that must've been... I don't even think there's a word in the dictionary to cover it. I'm really sorry you had to go through that",
    "controversiality": 0,
    "ups": 37,
    "downs": 0,
    "score": 37,
    "created": 1507721554.0,
    "date_created": "2017-10-10",
    "time_created": "23:32:34",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6xzbz",
    "parent_id": "t1_do6w9m6",
    "subreddit_name_prefixed": "r/news",
    "body": "Bro, you may want to go get counseling. I had traumatic sexual experiences and it stays with you forever. Counseling probably saved my life, definitely my sanity.",
    "controversiality": 0,
    "ups": 702,
    "downs": 0,
    "score": 702,
    "created": 1507705381.0,
    "date_created": "2017-10-10",
    "time_created": "19:03:01",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6yfq8",
    "parent_id": "t1_do6w9m6",
    "subreddit_name_prefixed": "r/news",
    "body": "As a gay guy i hope you don't hold it against all of us, you seem like a really good guy. Sorry that happened.  ",
    "controversiality": 0,
    "ups": 424,
    "downs": 0,
    "score": 424,
    "created": 1507705964.0,
    "date_created": "2017-10-10",
    "time_created": "19:12:44",
    "submission_id": "news-75k317"
  },
  {
    "id": "do721e9",
    "parent_id": "t1_do6w9m6",
    "subreddit_name_prefixed": "r/news",
    "body": "You're not a prejudiced asshole. The brain evolved to be a pattern recognition machine. You would only be a prejudiced asshole if you actually beat up anyone who looked like him.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1507710423.0,
    "date_created": "2017-10-10",
    "time_created": "20:27:03",
    "submission_id": "news-75k317"
  },
  {
    "id": "do74m8o",
    "parent_id": "t1_do6w9m6",
    "subreddit_name_prefixed": "r/news",
    "body": "> Now when I see people that look like him I get irrationally uneasy and angry, then feel like a prejudiced asshole.\n\nSo people make fun of triggers but this is what they often actually look like. An irrational/autonomic reaction that forms to a random part of a traumatic memory. If you haven't, you should get checked out for PTSD. Sorry that happened to you, dude.  ",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1507713452.0,
    "date_created": "2017-10-10",
    "time_created": "21:17:32",
    "submission_id": "news-75k317"
  },
  {
    "id": "do75f2w",
    "parent_id": "t1_do70mxj",
    "subreddit_name_prefixed": "r/news",
    "body": "Does Terry Crews need to fuck someone up?",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1507714384.0,
    "date_created": "2017-10-10",
    "time_created": "21:33:04",
    "submission_id": "news-75k317"
  },
  {
    "id": "do722nz",
    "parent_id": "t1_do705ql",
    "subreddit_name_prefixed": "r/news",
    "body": "Regarding your point about the younger stars....yep, that's it exactly.  It's about the power dynamic and the fact that they know they are the ones on the higher level.  Just like with Terry Richardson. He specifically targeted (and likely still does) the fresh faces, the newer talent who are incredibly young and have almost zero connections, many of whom not even from the USA to begin with.  That's why so many celebs came to his defense when the allegations came out, saying stuff like \"I never saw him do this\" or \"he didn't act that way with me\"....like, of course he didn't do it to you Miley Cyrus.  You're the big star who can actually do something to him, but some 16 year old Estonian model who was flown in to NYC the day before can't.  Guys like him know what they are doing and who to do it to.  ",
    "controversiality": 0,
    "ups": 284,
    "downs": 0,
    "score": 284,
    "created": 1507710466.0,
    "date_created": "2017-10-10",
    "time_created": "20:27:46",
    "submission_id": "news-75k317"
  },
  {
    "id": "do714zj",
    "parent_id": "t1_do705ql",
    "subreddit_name_prefixed": "r/news",
    "body": "> It's not about the physical stature. It's all about the power. Crews, to them, **is no different than any other actor or actress.** They know that if they fight against it, there is a good chance nothing will happen, and then the sexual predator just uses their connections to make sure they are blacklisted. Maybe just for a bit, maybe forever.\n\nCrews is also black. And in Hollywood, that also brings with it additional career risks in speaking out. In addition to exacerbating the power differential, the intersection of objectification and commodification of the black body makes this less surprising.\n\n",
    "controversiality": 0,
    "ups": 1026,
    "downs": 0,
    "score": 1026,
    "created": 1507709356.0,
    "date_created": "2017-10-10",
    "time_created": "20:09:16",
    "submission_id": "news-75k317"
  },
  {
    "id": "do706sz",
    "parent_id": "t1_do701bo",
    "subreddit_name_prefixed": "r/news",
    "body": "He is. He’s been at a few different events I’ve worked over he years, didn’t personally interact with him, but my staff has said multiple times how pleasant he is. Like above and beyond. ",
    "controversiality": 0,
    "ups": 673,
    "downs": 0,
    "score": 673,
    "created": 1507708179.0,
    "date_created": "2017-10-10",
    "time_created": "19:49:39",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70e2p",
    "parent_id": "t1_do701bo",
    "subreddit_name_prefixed": "r/news",
    "body": "I knew his mom. She was a nurse at my doctor's office before she died. He really is an extremely nice person.",
    "controversiality": 0,
    "ups": 85,
    "downs": 0,
    "score": 85,
    "created": 1507708425.0,
    "date_created": "2017-10-10",
    "time_created": "19:53:45",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71sw1",
    "parent_id": "t1_do701bo",
    "subreddit_name_prefixed": "r/news",
    "body": "Met the guy one time in my life. Easily tops as one of the if not the most pleasantly nice celeb I have ever met in my life. The guy genuinely loves people, is super fun to be around, and honestly is incredibly down to earth.  ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1507710141.0,
    "date_created": "2017-10-10",
    "time_created": "20:22:21",
    "submission_id": "news-75k317"
  },
  {
    "id": "do714d5",
    "parent_id": "t1_do709sl",
    "subreddit_name_prefixed": "r/news",
    "body": "Yep, can confirm. Then you get some women who believe that gay guys aren't like that because they are so gentle and friendly (to women). Gay guys are just as creepy as hetero guys.",
    "controversiality": 0,
    "ups": 89,
    "downs": 0,
    "score": 89,
    "created": 1507709334.0,
    "date_created": "2017-10-10",
    "time_created": "20:08:54",
    "submission_id": "news-75k317"
  },
  {
    "id": "do72vd7",
    "parent_id": "t1_do709sl",
    "subreddit_name_prefixed": "r/news",
    "body": "Terry Crews specifically mentions this:\n\n[Hollywood is not the only business we’re this happens, and to the casualties of this behavior— you are not alone. (15/cont.)](https://twitter.com/terrycrews/status/917839036366045184)\n\nThough u/Superkeys pointing out that Hollywood elites have this problem doesn't necessarily indicate he/she thinks other elites don't. Just that in Hollywood they definitely do.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1507711417.0,
    "date_created": "2017-10-10",
    "time_created": "20:43:37",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7c0ol",
    "parent_id": "t1_do71535",
    "subreddit_name_prefixed": "r/news",
    "body": "This happened to me. I was overweight and my abuser vocally despised fat people, yet he still did what he did. Hearing about this from Terry Crews is really heartbreaking, and he's incredibly strong to speak out about it, especially because it was recent.\n\nLet people remember that Terry Crews was afraid to come out about abuse when others point fingers at \"all those anonymous women suddenly coming out who are just lying about it for money/fame/attention\" when someone accuses a famous face of assault. \n\n\nI feel like members of my family didn't believe me when I told them what my brother did, and that kind of pain is something that I can't describe. I've always been the weird kid growing up, but my biggest fear was that I would have what happened held over me. And, to an extent, it came true. But at least I felt a little more free, and honest with myself. To carry that around for so many years was too much for me, and I paid for it with my mental health. Thank God for my dog. ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1507722545.0,
    "date_created": "2017-10-10",
    "time_created": "23:49:05",
    "submission_id": "news-75k317"
  },
  {
    "id": "do72zij",
    "parent_id": "t1_do706rw",
    "subreddit_name_prefixed": "r/news",
    "body": "He *still* will not name the person who did it.\n\nThat's a scary culture they've got there.",
    "controversiality": 0,
    "ups": 167,
    "downs": 0,
    "score": 167,
    "created": 1507711551.0,
    "date_created": "2017-10-10",
    "time_created": "20:45:51",
    "submission_id": "news-75k317"
  },
  {
    "id": "do74v0b",
    "parent_id": "t1_do706rw",
    "subreddit_name_prefixed": "r/news",
    "body": "A lot of big guys (myself included) are very slow to violence for the same reason Terry said he didn't beat the guy that groped him, if I get in a fight with an average sized guy everyone is going to think I was the aggressor.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1507713740.0,
    "date_created": "2017-10-10",
    "time_created": "21:22:20",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70mwh",
    "parent_id": "t1_do708mn",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah, Hollywood Elites, and academia, and private-sector business, and politicians, and the music industry, and...",
    "controversiality": 0,
    "ups": 77,
    "downs": 0,
    "score": 77,
    "created": 1507708732.0,
    "date_created": "2017-10-10",
    "time_created": "19:58:52",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71lwu",
    "parent_id": "t1_do70972",
    "subreddit_name_prefixed": "r/news",
    "body": "I like Trump went after Weinstein then had a reporter ask how what Weinstein did was different than what trump described himself doing. He just waved it off and moved on. ",
    "controversiality": 0,
    "ups": 143,
    "downs": 0,
    "score": 143,
    "created": 1507709913.0,
    "date_created": "2017-10-10",
    "time_created": "20:18:33",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6yfhh",
    "parent_id": "t1_do6xfvt",
    "subreddit_name_prefixed": "r/news",
    "body": "Drew barrymore :(",
    "controversiality": 0,
    "ups": 439,
    "downs": 0,
    "score": 439,
    "created": 1507705956.0,
    "date_created": "2017-10-10",
    "time_created": "19:12:36",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zjy4",
    "parent_id": "t1_do6xfvt",
    "subreddit_name_prefixed": "r/news",
    "body": "Anyone who wants to know how Hollywood cyclically falls apart should start with the introduction of the Hays Code. That was pretty much implemented after several scandals (including a few murders) rocked the industry.\n\nThen you have Charles Manson. And then new Hollywood coke heads. And then child stars in the 80s. Etc. Etc. This kind of thing is always lurking under the surface waiting to be uncovered.",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1507707385.0,
    "date_created": "2017-10-10",
    "time_created": "19:36:25",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6xow0",
    "parent_id": "t1_do6xfvt",
    "subreddit_name_prefixed": "r/news",
    "body": "That was kind of swept under the rug, with this though it seems like a lot of actors and actresses are coming out about all the sexual abuse",
    "controversiality": 0,
    "ups": 96,
    "downs": 0,
    "score": 96,
    "created": 1507705023.0,
    "date_created": "2017-10-10",
    "time_created": "18:57:03",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6z3gt",
    "parent_id": "t1_do6xfvt",
    "subreddit_name_prefixed": "r/news",
    "body": "And the bastards got him hooked on crack.  That's an easy way to discredit a potential whistle blower. ",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1507706804.0,
    "date_created": "2017-10-10",
    "time_created": "19:26:44",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zcy8",
    "parent_id": "t1_do6xfvt",
    "subreddit_name_prefixed": "r/news",
    "body": "It’s sick. I remember that documentary called An Open Secret about Hollywood pedos... Ben Savage was in it for a few seconds where his ass was being groped.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507707144.0,
    "date_created": "2017-10-10",
    "time_created": "19:32:24",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70cj2",
    "parent_id": "t1_do6ye26",
    "subreddit_name_prefixed": "r/news",
    "body": "This is why I am so passionate about an open Internet and such. It's allowed people to speak. The reality is everything **is** getting better every day and things have never been better than they are now -- but we're only just now being made aware of how bad things are/were that it only appears *worse* because we had no true scale before. By that I mean we *knew* but didn't have an effective means to communicate it around or for people to understand.\n\nSadly, we're on the opposite end of the spectrum where people believe anything and everything they see and hear that coincides with their beliefs and toss out things that they don't agree with. 24/7 news, such as Reddit, FOX, and CNN, has made things better and worse in so many ways.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1507708373.0,
    "date_created": "2017-10-10",
    "time_created": "19:52:53",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6z5ax",
    "parent_id": "t1_do6ye26",
    "subreddit_name_prefixed": "r/news",
    "body": "Would you terribly mind linking to an article or something on that last bit?",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1507706872.0,
    "date_created": "2017-10-10",
    "time_created": "19:27:52",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zv1y",
    "parent_id": "t1_do6yo0w",
    "subreddit_name_prefixed": "r/news",
    "body": "Roman Polanski.Raped a 13 year old after he drugged her.  He fled to France, where he wouldn't be extradited when he found out he would face time in prison. ",
    "controversiality": 0,
    "ups": 152,
    "downs": 0,
    "score": 152,
    "created": 1507707777.0,
    "date_created": "2017-10-10",
    "time_created": "19:42:57",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zjpf",
    "parent_id": "t1_do6yo0w",
    "subreddit_name_prefixed": "r/news",
    "body": "But Bryan Singer hasn't been working since 1977... Ohhhh you mean Woody Allen.",
    "controversiality": 0,
    "ups": 63,
    "downs": 0,
    "score": 63,
    "created": 1507707376.0,
    "date_created": "2017-10-10",
    "time_created": "19:36:16",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6y54h",
    "parent_id": "t1_do6xgm0",
    "subreddit_name_prefixed": "r/news",
    "body": "This has been going on EVERYWHERE.",
    "controversiality": 0,
    "ups": 96,
    "downs": 0,
    "score": 96,
    "created": 1507705590.0,
    "date_created": "2017-10-10",
    "time_created": "19:06:30",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6xzey",
    "parent_id": "t1_do6xgm0",
    "subreddit_name_prefixed": "r/news",
    "body": "Sexual abuse in hollywood is not something new, it's been talked about for decades just never on this scale or with this many high profile actors and actresses coming out about it. ",
    "controversiality": 0,
    "ups": 87,
    "downs": 0,
    "score": 87,
    "created": 1507705384.0,
    "date_created": "2017-10-10",
    "time_created": "19:03:04",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zgcz",
    "parent_id": "t1_do6yxp3",
    "subreddit_name_prefixed": "r/news",
    "body": "Says a lot about us as humans",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1507707259.0,
    "date_created": "2017-10-10",
    "time_created": "19:34:19",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70lmq",
    "parent_id": "t1_do6yxp3",
    "subreddit_name_prefixed": "r/news",
    "body": "The Catholic Church isn't the only denomination where leaders engage in sexual misconduct/assault.\n\nA church local to where I live now had a pastor wreck his family over his affair with a secretary. His daughter taught in a local elementary school & his teen son was a high school football star. All that blew up after his infidelity was made public. He's now back in town leading a non-denominational church. The last church is very denominational with all sorts of hierarchical leaders.\n\nThen there are the independent fundamental Baptists....\n\nhttp://www.chicagomag.com/Chicago-Magazine/January-2013/Let-Us-Prey-Big-Trouble-at-First-Baptist-Church/",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1507708687.0,
    "date_created": "2017-10-10",
    "time_created": "19:58:07",
    "submission_id": "news-75k317"
  },
  {
    "id": "do73plq",
    "parent_id": "t1_do72448",
    "subreddit_name_prefixed": "r/news",
    "body": "A sketch group I was in, in college made this based on experiences I had my freshman year. The weirdest part about it for me was going to a support group and being treated by the women there like I was part of the problem. \nSorry for the bad acting. \n\n\nhttps://youtu.be/TP8Rl1-bl9Q",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1507712389.0,
    "date_created": "2017-10-10",
    "time_created": "20:59:49",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6y5sf",
    "parent_id": "t1_do6xvpq",
    "subreddit_name_prefixed": "r/news",
    "body": "Maybe. Crews likely won't say. See the other threads about California slander laws.",
    "controversiality": 0,
    "ups": 123,
    "downs": 0,
    "score": 123,
    "created": 1507705614.0,
    "date_created": "2017-10-10",
    "time_created": "19:06:54",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7059o",
    "parent_id": "t1_do6xvpq",
    "subreddit_name_prefixed": "r/news",
    "body": ">Crews wins the Academy Award for Best Actor for his part in Sandy Wexler\n\nThis would have to be a make-good after snubbing him in 2006 despite his stirring portrayal of President Camacho in Idiocracy.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507708127.0,
    "date_created": "2017-10-10",
    "time_created": "19:48:47",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71t9l",
    "parent_id": "t1_do6zorj",
    "subreddit_name_prefixed": "r/news",
    "body": " Now I want to see Terry Crews and Tom Cruise next to each other",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1507710152.0,
    "date_created": "2017-10-10",
    "time_created": "20:22:32",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6y7wo",
    "parent_id": "t1_do6y2uq",
    "subreddit_name_prefixed": "r/news",
    "body": "No, this situation calls for the horse-sized duck. Those fuckers are descended from dinosaurs.",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1507705689.0,
    "date_created": "2017-10-10",
    "time_created": "19:08:09",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zj3t",
    "parent_id": "t1_do6y4za",
    "subreddit_name_prefixed": "r/news",
    "body": "they toss out a few rotten eggs to calm the masses, but the circus continues always.",
    "controversiality": 0,
    "ups": 95,
    "downs": 0,
    "score": 95,
    "created": 1507707355.0,
    "date_created": "2017-10-10",
    "time_created": "19:35:55",
    "submission_id": "news-75k317"
  },
  {
    "id": "do751zp",
    "parent_id": "t1_do6y4za",
    "subreddit_name_prefixed": "r/news",
    "body": "They also had a known pedo who was rich as hell and was known to throw orgies and gangbangs with children indicate tons of elites and rich people only to have the case dismissed and stopped. The people at the top with power and influence don’t get in trouble. The people who get in trouble are the fall boys. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507713963.0,
    "date_created": "2017-10-10",
    "time_created": "21:26:03",
    "submission_id": "news-75k317"
  },
  {
    "id": "do73u13",
    "parent_id": "t1_do6y4za",
    "subreddit_name_prefixed": "r/news",
    "body": "What are grooming gangs?",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1507712529.0,
    "date_created": "2017-10-10",
    "time_created": "21:02:09",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71qnv",
    "parent_id": "t1_do71h9r",
    "subreddit_name_prefixed": "r/news",
    "body": "I think it has to with \"low level\" management.\n\nYou know how managers are restaurants can turn into assholes because, \"I'm a manager now!\"\n\nI think the lower levels of NFL recruitment are filled with these types of people: they get mad at the recruits for not doing better because they suck as coaches.\n\nAlso, they never wanted to be lower-ring coaches, they wanted to be BIG TIME NFL legends, and when those dreams start to fade, it's easy to get stuck on lower levels being a bitter asshole with a good-enough paycheck.\n\nIt happens in all careers, people who take their fears and frustrations on others.",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1507710067.0,
    "date_created": "2017-10-10",
    "time_created": "20:21:07",
    "submission_id": "news-75k317"
  },
  {
    "id": "do757kd",
    "parent_id": "t1_do72jj2",
    "subreddit_name_prefixed": "r/news",
    "body": "Corey will become Sinead Canseco. ",
    "controversiality": 0,
    "ups": 77,
    "downs": 0,
    "score": 77,
    "created": 1507714143.0,
    "date_created": "2017-10-10",
    "time_created": "21:29:03",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7b0cu",
    "parent_id": "t1_do72jj2",
    "subreddit_name_prefixed": "r/news",
    "body": "I remember that.  The public turned on her immediately. Her career was over for standing up against child abuse. So what was the backlash about? It's almost as if the public WANTs to be the puppets of these corrupt \"higher ups\". The ones in power don't really have to lift a finger, although, if they want to ice someone out of the industry, they can. The public really does it for them. Turn the one speaking out into a joke. I've seen it over and over again. ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1507721105.0,
    "date_created": "2017-10-10",
    "time_created": "23:25:05",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71cdw",
    "parent_id": "t1_do70z79",
    "subreddit_name_prefixed": "r/news",
    "body": "As someone with young extended family members trying to break into that part of the industry, every time I think about that possibility it turns my stomach.",
    "controversiality": 0,
    "ups": 54,
    "downs": 0,
    "score": 54,
    "created": 1507709604.0,
    "date_created": "2017-10-10",
    "time_created": "20:13:24",
    "submission_id": "news-75k317"
  },
  {
    "id": "do75ss0",
    "parent_id": "t1_do744bj",
    "subreddit_name_prefixed": "r/news",
    "body": "Also rumors of him sleeping with younger guys then locking them out of this hollywood mansion after stealing their clothes so they have to walk down to sunset Blvd naked",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1507714821.0,
    "date_created": "2017-10-10",
    "time_created": "21:40:21",
    "submission_id": "news-75k317"
  },
  {
    "id": "do73a8a",
    "parent_id": "t1_do72in1",
    "subreddit_name_prefixed": "r/news",
    "body": "Gotta a source for that? Because I feel like that would be a big deal ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1507711895.0,
    "date_created": "2017-10-10",
    "time_created": "20:51:35",
    "submission_id": "news-75k317"
  },
  {
    "id": "do72shf",
    "parent_id": "t1_do71b7h",
    "subreddit_name_prefixed": "r/news",
    "body": "Oi, you leave Mr. Rogers out of this.",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1507711325.0,
    "date_created": "2017-10-10",
    "time_created": "20:42:05",
    "submission_id": "news-75k317"
  },
  {
    "id": "do710dg",
    "parent_id": "t1_do6xl7c",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah it doesn't even have to be a lot of power, it just has to be MORE power. It's fucking tragic, honestly. The risk of sexual abuse to *disabled adults* is fucking appalling.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507709198.0,
    "date_created": "2017-10-10",
    "time_created": "20:06:38",
    "submission_id": "news-75k317"
  },
  {
    "id": "do73m24",
    "parent_id": "t1_do73hny",
    "subreddit_name_prefixed": "r/news",
    "body": "If he had proof including emails and witnesses, he would be just fine and spend very little money.",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1507712271.0,
    "date_created": "2017-10-10",
    "time_created": "20:57:51",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6vtqu",
    "parent_id": "t1_do6usra",
    "subreddit_name_prefixed": "r/news",
    "body": "> the manager called him to tell him that since he left the till was a lot heavier on weekends, and if he'd care to comment on that.\n\nSchoolboy error. He should have stopped doing it near the end of his employment.\n",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1507702733.0,
    "date_created": "2017-10-10",
    "time_created": "18:18:53",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6wqwm",
    "parent_id": "t1_do6usra",
    "subreddit_name_prefixed": "r/news",
    "body": "My mother got fired for theft once. They determined that it was her because the numbers were off starting when she was hired. After she was fired they went back to normal.\n\nThe problem was that she wasn't the first one they had used that form of evidence to fire, and she wasn't the last. There was a long-time employee doing what your friend did, she would start stealing as soon as someone was hired. When her target left or was fired, she would stop for a few months, then start back up with a new target. She got away with this for *years* and the company just thought that it had terrible luck with new hires.\n\nThey finally caught the lady in the act and once they knew it was her they were able to trace it all back (she was embezzling, not pocketing the till). They ended up apologizing to the whole string of people that they had accused of theft and fired.",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1507703847.0,
    "date_created": "2017-10-10",
    "time_created": "18:37:27",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6utl4",
    "parent_id": "t1_do6u604",
    "subreddit_name_prefixed": "r/news",
    "body": "Well it is theft and at that much he could of have gotten a felony. ",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1507701526.0,
    "date_created": "2017-10-10",
    "time_created": "17:58:46",
    "submission_id": "news-75k317"
  },
  {
    "id": "do75kvy",
    "parent_id": "t1_do74y33",
    "subreddit_name_prefixed": "r/news",
    "body": "Thanks!!! I'm trying to raise my issue with Reddit's dismissiveness of female victims without myself being dismissive of the fact that male victims face their own, unique challenges.",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1507714567.0,
    "date_created": "2017-10-10",
    "time_created": "21:36:07",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7923a",
    "parent_id": "t1_do78pud",
    "subreddit_name_prefixed": "r/news",
    "body": "It's super frustrating. :/ Sometimes it feels like reddit's incapable of empathizing with women. Only when these bad things happen to men they respect, they suddenly change their tune and claim that they supported the victims all along...",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1507718629.0,
    "date_created": "2017-10-10",
    "time_created": "22:43:49",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7snd2",
    "parent_id": "t1_do7ntdj",
    "subreddit_name_prefixed": "r/news",
    "body": "Exactly. It's totally not in good fun. It's throwing shade at the reality, and making us laugh at something horrible, because it's so ridiculous it's funny. That's a good comedian right there",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1507757872.0,
    "date_created": "2017-10-11",
    "time_created": "09:37:52",
    "submission_id": "news-75k317"
  },
  {
    "id": "do788pg",
    "parent_id": "t1_do718pr",
    "subreddit_name_prefixed": "r/news",
    "body": "Really, anywhere that there is a big disparity in power. What does that say about humanity? There must be so many people who would do the same if they had the power to get away with it. So many people who fully believe they'd never do such a thing simply because they don't think they'll ever have the chance. There's some truth to the old adage that absolute power corrupts absolutely.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1507717628.0,
    "date_created": "2017-10-10",
    "time_created": "22:27:08",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70ehh",
    "parent_id": "t1_do6zsbs",
    "subreddit_name_prefixed": "r/news",
    "body": "Molesting him.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1507708438.0,
    "date_created": "2017-10-10",
    "time_created": "19:53:58",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zqe1",
    "parent_id": "t1_do6x8v7",
    "subreddit_name_prefixed": "r/news",
    "body": " Yup. I do a lot of DV work with both male and female victims.  Both have different sets of disadvantages - the men, particularly straight men, who were being physically abused often talk about the worst part being not being able to even restrain their attacker because they were terrified of getting arrested for the very thing that was happening to them.  ",
    "controversiality": 0,
    "ups": 431,
    "downs": 0,
    "score": 431,
    "created": 1507707615.0,
    "date_created": "2017-10-10",
    "time_created": "19:40:15",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6xq4c",
    "parent_id": "t1_do6x8v7",
    "subreddit_name_prefixed": "r/news",
    "body": "Yes I was going to post this too. As a bigger guy I don't get to check the pervs and assholes anymore for fear of their cousins in badges from taking offense.\n\nI won't compare myself to Mr Crews but the tweets definitely seemed like he chose to be a rehabilitated person, or \"bigger man\". Unfortunately this sometimes allows bully or assault like behavior to perpatuate. I'm sure this was all precalculated by the attacker. \n\nOh society why you so complex? This is just a one sided story for now\n\nObvious answer is for every human to be born with a device that records everything you see, hear and do every day. So we can have TMZ fact check  it.",
    "controversiality": 0,
    "ups": 79,
    "downs": 0,
    "score": 79,
    "created": 1507705064.0,
    "date_created": "2017-10-10",
    "time_created": "18:57:44",
    "submission_id": "news-75k317"
  },
  {
    "id": "do725b2",
    "parent_id": "t1_do6x8v7",
    "subreddit_name_prefixed": "r/news",
    "body": "And, in an environment which normalizes aggressive sexual behavior (which is a lot of professional environments, sadly), reacting strongly will be seen as grossly disproportional as the initial assault is dismissed as not that big of a deal.  Women get hit with this one a lot if they speak up about verbal sexual harassment or other sexually aggressive behaviors.  This is part of what people mean when they talk about \"rape culture\" - aggressive sexual behaviors are normalized, which lowers the perceived severity of more direct assaults.  It's \"just joking around\" or \"just paying them a compliment.\"",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1507710555.0,
    "date_created": "2017-10-10",
    "time_created": "20:29:15",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7auk2",
    "parent_id": "t1_do6x8v7",
    "subreddit_name_prefixed": "r/news",
    "body": "This has been my experience.  I was the biggest kid in school and got bullied constantly.  The worst part was knowing I could have stopped it but any time I tried I got in trouble cause \"they were just playing\" and \"I might hurt them\".  ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507720888.0,
    "date_created": "2017-10-10",
    "time_created": "23:21:28",
    "submission_id": "news-75k317"
  },
  {
    "id": "do72l9x",
    "parent_id": "t1_do6x3b6",
    "subreddit_name_prefixed": "r/news",
    "body": "That fucking reply\n\n\"take it as a compliment unless he groped you too hard, then sock em'. Otherwise grow up.\"\n\nWhat the fuck is wrong with some people.",
    "controversiality": 0,
    "ups": 461,
    "downs": 0,
    "score": 461,
    "created": 1507711094.0,
    "date_created": "2017-10-10",
    "time_created": "20:38:14",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7683s",
    "parent_id": "t1_do6x3b6",
    "subreddit_name_prefixed": "r/news",
    "body": "\"reports say Crews was drinking at the time\" wouldn't matter if he had 1 drink or 20 it would still sound bad",
    "controversiality": 0,
    "ups": 71,
    "downs": 0,
    "score": 71,
    "created": 1507715325.0,
    "date_created": "2017-10-10",
    "time_created": "21:48:45",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71l5k",
    "parent_id": "t1_do6x3b6",
    "subreddit_name_prefixed": "r/news",
    "body": "And news articles about homophobia in black culture ",
    "controversiality": 0,
    "ups": 372,
    "downs": 0,
    "score": 372,
    "created": 1507709891.0,
    "date_created": "2017-10-10",
    "time_created": "20:18:11",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6ywqm",
    "parent_id": "t1_do6yfq8",
    "subreddit_name_prefixed": "r/news",
    "body": "Hell nah. I've done too much dumb shit and been in too many dumb situations. If I wrote off categories of people based on my own isolated events I'd have no groups left lol\n\nShitty people exist in every flavor, but the majority of folks are always just looking out for themselves and trying to be happy... and theres nothing wrong with that.",
    "controversiality": 0,
    "ups": 666,
    "downs": 0,
    "score": 666,
    "created": 1507706566.0,
    "date_created": "2017-10-10",
    "time_created": "19:22:46",
    "submission_id": "news-75k317"
  },
  {
    "id": "do74rh7",
    "parent_id": "t1_do6yfq8",
    "subreddit_name_prefixed": "r/news",
    "body": "fuck dude you dont have to apologise just because youre gay too.\n\nits like me apologising for weinstein raping women just because im male",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1507713627.0,
    "date_created": "2017-10-10",
    "time_created": "21:20:27",
    "submission_id": "news-75k317"
  },
  {
    "id": "do77ukg",
    "parent_id": "t1_do6yfq8",
    "subreddit_name_prefixed": "r/news",
    "body": "Semi same story here from a different guy, but no drugging, just a huge amount of booze and then physically molested pretty heavily when I was 18. I can't speak for OP, but I don't hold anything against gay dudes whatsoever. There would be no point. There's shitty people no matter what corner of the world/society you go into. Some of my favorite people in the world now are gay and I'm so glad that I didn't take the incident to heart and let it scar me deeply, bc I'd have missed out on some of the best friends and people I've ever come across.\n\nDon't feel like you need to apologize for the actions of others just bc you have one tiny little thing in common! And for what it's worth from an internet stranger, you seem like a total fucking sweetheart and the world needs more people with kind souls like you. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1507717162.0,
    "date_created": "2017-10-10",
    "time_created": "22:19:22",
    "submission_id": "news-75k317"
  },
  {
    "id": "do786k6",
    "parent_id": "t1_do75f2w",
    "subreddit_name_prefixed": "r/news",
    "body": "\"Is Wayne Brady gonna have to choke a bitch?\"",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1507717556.0,
    "date_created": "2017-10-10",
    "time_created": "22:25:56",
    "submission_id": "news-75k317"
  },
  {
    "id": "do72leh",
    "parent_id": "t1_do722nz",
    "subreddit_name_prefixed": "r/news",
    "body": "How about Bryan Singer? He's got a brand new tv show he's directing. The whole industry just lets it happen and innocent people pay the price of their perversion. ",
    "controversiality": 0,
    "ups": 131,
    "downs": 0,
    "score": 131,
    "created": 1507711098.0,
    "date_created": "2017-10-10",
    "time_created": "20:38:18",
    "submission_id": "news-75k317"
  },
  {
    "id": "do74638",
    "parent_id": "t1_do714zj",
    "subreddit_name_prefixed": "r/news",
    "body": "Blacklisting is a real thing. I worked as a CG artist for about 16 years, 11 in Hollywood movie production.  \n\nThere was recently a class action lawsuit that established that Disney, pixar, Blue Sky, Dreamworks, all conspired among each other to exchange employee pay information and agree not to hire from one another.  This means that artists could not get jobs outside their current one from these companies unless the execs agreed to let the hire happen.  You were a complete pawn.  \n\nDisney settled for $100Million, Dreamworks for $50Million, Blue Sky and others settled for another $18 Million.  It’s a big settlement but it still represents a small amount compared to the savings that Ed Catmull and others in the indian achieved by successfully creating a hiring cartel that depressed wages and limited worker mobility.  \n\nSo yeah - entertainment biz execs are real scumbags.  \n\nEdit: background information on the animation workers wage theft class action lawsuit here:\n\nhttp://www.cartoonbrew.com/artist-rights/artists-win-disney-pixar-lucasfilm-pay-100-million-wage-theft-lawsuit-148195.html",
    "controversiality": 0,
    "ups": 370,
    "downs": 0,
    "score": 370,
    "created": 1507712915.0,
    "date_created": "2017-10-10",
    "time_created": "21:08:35",
    "submission_id": "news-75k317"
  },
  {
    "id": "do73o4t",
    "parent_id": "t1_do714zj",
    "subreddit_name_prefixed": "r/news",
    "body": "This pisses me off. I'm in Hollywood, I work as an assistant and have worked for two different big six studios. It pisses me off, because you can't fuck up with these people or you get abolished from the entire industry. You don't have a goddamn job ever again. I've questioned just quitting and restarting over with life because this industry is a bunch of assholes stroking their own egos.\n\nI hope this leads to some serious fucking changes in the industry. Terry Crews seems like the SWEETEST guy in the world and this happens...all those women with Weinstein. Fuck this industry dude. ",
    "controversiality": 0,
    "ups": 192,
    "downs": 0,
    "score": 192,
    "created": 1507712342.0,
    "date_created": "2017-10-10",
    "time_created": "20:59:02",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71i8d",
    "parent_id": "t1_do714zj",
    "subreddit_name_prefixed": "r/news",
    "body": "Oh no doubt. It's just another weakness for them to exploit. A man like Crews in Hollywood is vulnerable in a very different set of ways than say, Channing Tatum. People talk about Crews popularity and such. But if he went toe to toe with whoever this guy was... how many other actors and actresses would risk blowing their career to hell to support him? And even of those who would, how many would be seriously willing to go the distance, and not just show a token level of support for him?\n\nIt's hard to judge such a thing, it really is. Sure, maybe the guy will get outed like sleaze and the industry will be that much better for it. Or maybe some careers evaporate overnight and he keeps on doing what he was doing.",
    "controversiality": 0,
    "ups": 331,
    "downs": 0,
    "score": 331,
    "created": 1507709799.0,
    "date_created": "2017-10-10",
    "time_created": "20:16:39",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71zfx",
    "parent_id": "t1_do714zj",
    "subreddit_name_prefixed": "r/news",
    "body": "Gonna be some(a lot of?) speculation in this comment, but if you remember the Donald Sterling controversy in the NBA a lot of his comments framed athletic/large black men as a sort of spectacle, and I could totally see Crews having that kind of gaze within the sections of Hollywood that this sexual assault is happening. Even if the executives aren't gay, he's still 'the other' to them, an outlier even amongst the some of the most attractive men on the planet.",
    "controversiality": 0,
    "ups": 161,
    "downs": 0,
    "score": 161,
    "created": 1507710359.0,
    "date_created": "2017-10-10",
    "time_created": "20:25:59",
    "submission_id": "news-75k317"
  },
  {
    "id": "do72eyf",
    "parent_id": "t1_do714zj",
    "subreddit_name_prefixed": "r/news",
    "body": "Cattle is cattle when you're elite enough.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1507710884.0,
    "date_created": "2017-10-10",
    "time_created": "20:34:44",
    "submission_id": "news-75k317"
  },
  {
    "id": "do75q2n",
    "parent_id": "t1_do714zj",
    "subreddit_name_prefixed": "r/news",
    "body": "And he’s a man. As hard as it is for women to speak out about being a victim of sexual assault, it is sometimes even more difficult for men. I’m a woman, and I have been assaulted more than once.  I’m not trying to diminish my own pain. I believe that it is often much harder for men to report sexual assault because there are additional layers of emasculation and the social perception is very different. Women tend to get a lot more support when they come out as victims whereas male victims are more likely to be met with suspicion and ridicule. Though obviously in celebrity cases the victim shaming is pretty rampant against both genders. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1507714733.0,
    "date_created": "2017-10-10",
    "time_created": "21:38:53",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70bsp",
    "parent_id": "t1_do706sz",
    "subreddit_name_prefixed": "r/news",
    "body": "This means that before Terry got buff and jacked, he was already a really nice guy. Nice guys who get buff and jacked don't cease to be kind.\n\n[Here is skinny Crews](https://pbs.twimg.com/media/AdFT5EiCQAIQ2eW.jpg)",
    "controversiality": 0,
    "ups": 517,
    "downs": 0,
    "score": 517,
    "created": 1507708349.0,
    "date_created": "2017-10-10",
    "time_created": "19:52:29",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70bku",
    "parent_id": "t1_do706sz",
    "subreddit_name_prefixed": "r/news",
    "body": "Doesn't change the fact that he could crush my skull with his pinky if he wanted to",
    "controversiality": 0,
    "ups": 245,
    "downs": 0,
    "score": 245,
    "created": 1507708342.0,
    "date_created": "2017-10-10",
    "time_created": "19:52:22",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71m62",
    "parent_id": "t1_do714d5",
    "subreddit_name_prefixed": "r/news",
    "body": "This is true, I had not encountered any form of sexual assault until I came out and starting meeting guys. My personal story is irrelevant and upsetting but really anyone who is in a vulnerable position risks abuse in our society. There are bad people in all walks of life. As a gay guy it can at times be even scarier because you aren't afforded the presumption of innocence that most women who are victimized are. As a guy you are expected to be able to fight back, or are at least met with minimal compassion by the primarily heterosexual males that tend to be the ones in the position to help ie: police officers, etc.\n\nMany parts of the world have things far worse but we could absolutely do better.",
    "controversiality": 0,
    "ups": 61,
    "downs": 0,
    "score": 61,
    "created": 1507709921.0,
    "date_created": "2017-10-10",
    "time_created": "20:18:41",
    "submission_id": "news-75k317"
  },
  {
    "id": "do74jok",
    "parent_id": "t1_do72zij",
    "subreddit_name_prefixed": "r/news",
    "body": "Suitcase. Not enough proof. Case dismissed. Lost a bunch of money for nothing.\n\nYou'd be surprised by how many harassment cases end up in nothing by lack of proof. In this case, he says his wife saw it all, but still...",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1507713364.0,
    "date_created": "2017-10-10",
    "time_created": "21:16:04",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71vps",
    "parent_id": "t1_do70mwh",
    "subreddit_name_prefixed": "r/news",
    "body": "Prisons. And yet so many people joke about it, saying certain types of criminals deserve it. If the 'corrections' system is indeed supposed to improve ones' character, I don't think sexual assault is going to prevent recidivism. ",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1507710234.0,
    "date_created": "2017-10-10",
    "time_created": "20:23:54",
    "submission_id": "news-75k317"
  },
  {
    "id": "do723u0",
    "parent_id": "t1_do71lwu",
    "subreddit_name_prefixed": "r/news",
    "body": "Its kind of hilarious (in a deeply sad way) how a many so caught up in the sexual  assault debate can be so hand-waivey about it, even as president. \n\nSexual Assault? I am very familiar with Harvey, sounds like him. I should know. ",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1507710506.0,
    "date_created": "2017-10-10",
    "time_created": "20:28:26",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6yzn8",
    "parent_id": "t1_do6yfhh",
    "subreddit_name_prefixed": "r/news",
    "body": "What happened to drew?",
    "controversiality": 0,
    "ups": 150,
    "downs": 0,
    "score": 150,
    "created": 1507706670.0,
    "date_created": "2017-10-10",
    "time_created": "19:24:30",
    "submission_id": "news-75k317"
  },
  {
    "id": "do705b4",
    "parent_id": "t1_do6yfhh",
    "subreddit_name_prefixed": "r/news",
    "body": "Judy Garland...",
    "controversiality": 0,
    "ups": 81,
    "downs": 0,
    "score": 81,
    "created": 1507708128.0,
    "date_created": "2017-10-10",
    "time_created": "19:48:48",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6ymhp",
    "parent_id": "t1_do6xow0",
    "subreddit_name_prefixed": "r/news",
    "body": "because on the internet it's free to espouse your thoughts to a wide audience.  In the '80's it was much easier to sweep this shit under the rug.  \n\nMomentum and a huge billboard are motherfuckers.  Not just for noble pedos, but also those who've been groping kids and getting jollies for years.  ",
    "controversiality": 0,
    "ups": 147,
    "downs": 0,
    "score": 147,
    "created": 1507706204.0,
    "date_created": "2017-10-10",
    "time_created": "19:16:44",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zitf",
    "parent_id": "t1_do6z5ax",
    "subreddit_name_prefixed": "r/news",
    "body": "Tippi Hedren from The Birds wrote in her autobiography that he sexually assaulted her. It's well-known that he verbally and physically abused her on-set (in front of other people) and then ruined her acting career by having her blacklisted (he was that powerful.)  He acted very controlling towards other leading ladies like Grace Kelly, Kim Novak, Janet Leigh, etc. ",
    "controversiality": 0,
    "ups": 74,
    "downs": 0,
    "score": 74,
    "created": 1507707344.0,
    "date_created": "2017-10-10",
    "time_created": "19:35:44",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zlfl",
    "parent_id": "t1_do6z5ax",
    "subreddit_name_prefixed": "r/news",
    "body": "[The movies are still good, Hitchcock's just a POS in my mind now](http://www.bbc.com/news/entertainment-arts-37821400)",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1507707438.0,
    "date_created": "2017-10-10",
    "time_created": "19:37:18",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zsoh",
    "parent_id": "t1_do6z5ax",
    "subreddit_name_prefixed": "r/news",
    "body": "http://www.independent.co.uk/arts-entertainment/films/features/obsession-the-dark-side-of-alfred-hitchcock-8431033.html\n\nNot OP, and just a cursory Google so if it's trash let me know. My poo time has ended tho",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1507707692.0,
    "date_created": "2017-10-10",
    "time_created": "19:41:32",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zt0r",
    "parent_id": "t1_do6z5ax",
    "subreddit_name_prefixed": "r/news",
    "body": "Almost a direct quote from his [wikipedia article](https://en.wikipedia.org/wiki/Alfred_Hitchcock#After_1961_to_death:_1961.E2.80.931980)",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1507707706.0,
    "date_created": "2017-10-10",
    "time_created": "19:41:46",
    "submission_id": "news-75k317"
  },
  {
    "id": "do745q5",
    "parent_id": "t1_do6zv1y",
    "subreddit_name_prefixed": "r/news",
    "body": "A german actress has just come forward claiming Polanski raped her when she was a 15 year old model.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1507712902.0,
    "date_created": "2017-10-10",
    "time_created": "21:08:22",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6yl6e",
    "parent_id": "t1_do6xzey",
    "subreddit_name_prefixed": "r/news",
    "body": "People in power have taken sexual advantage of those over whom they hold power for pretty much all of written history.  Very much nothing new.",
    "controversiality": 0,
    "ups": 80,
    "downs": 0,
    "score": 80,
    "created": 1507706158.0,
    "date_created": "2017-10-10",
    "time_created": "19:15:58",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6yo5g",
    "parent_id": "t1_do6y5sf",
    "subreddit_name_prefixed": "r/news",
    "body": "> California slander laws.\n\n>Defamation, which consists of both libel and slander, is defined by case law and statute in California. See Cal. Civ. Code §§ 44, 45a, and 46.\n\n> The elements of a defamation claim are:\n\n1 publication of a statement of fact\n\n2 that is false,*\n\n3 unprivileged,\n\n4 has a natural tendency to injure or which causes \"special damage,\" and\n\n5 the defendant's fault in publishing the statement amounted to at least negligence.\n\n> As a matter of law, in cases involving public figures or matters of public concern, the **burden is on the plaintiff to prove falsity** in a defamation action.",
    "controversiality": 0,
    "ups": 123,
    "downs": 0,
    "score": 123,
    "created": 1507706262.0,
    "date_created": "2017-10-10",
    "time_created": "19:17:42",
    "submission_id": "news-75k317"
  },
  {
    "id": "do767km",
    "parent_id": "t1_do71t9l",
    "subreddit_name_prefixed": "r/news",
    "body": "[Twins](http://www.imdb.com/title/tt0096320/) the Sequel - it practically writes itself.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507715308.0,
    "date_created": "2017-10-10",
    "time_created": "21:48:28",
    "submission_id": "news-75k317"
  },
  {
    "id": "do72byd",
    "parent_id": "t1_do6zj3t",
    "subreddit_name_prefixed": "r/news",
    "body": "So just do nothing then huh? Well that was easy! ",
    "controversiality": 0,
    "ups": 37,
    "downs": 0,
    "score": 37,
    "created": 1507710782.0,
    "date_created": "2017-10-10",
    "time_created": "20:33:02",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71jgv",
    "parent_id": "t1_do6zj3t",
    "subreddit_name_prefixed": "r/news",
    "body": "3 different views, I'm so conflicted now.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1507709839.0,
    "date_created": "2017-10-10",
    "time_created": "20:17:19",
    "submission_id": "news-75k317"
  },
  {
    "id": "do77cex",
    "parent_id": "t1_do757kd",
    "subreddit_name_prefixed": "r/news",
    "body": "Nothing Compares 2 Juice.",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1507716575.0,
    "date_created": "2017-10-10",
    "time_created": "22:09:35",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7jv9k",
    "parent_id": "t1_do7b0cu",
    "subreddit_name_prefixed": "r/news",
    "body": "> I remember that. The public turned on her immediately. Her career was over for standing up against child abuse. So what was the backlash about?\n\nNobody had any idea what she was protesting about, to the public she was just a crazy woman who tore a picture of pope in live TV. I think it was months after when she got to explain herself in an interview (still a lot of people didn't take what she said seriously, but at least it let people knew why she did it)\n",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1507738582.0,
    "date_created": "2017-10-11",
    "time_created": "04:16:22",
    "submission_id": "news-75k317"
  },
  {
    "id": "do79vke",
    "parent_id": "t1_do75ss0",
    "subreddit_name_prefixed": "r/news",
    "body": "He also has a thing for twins.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507719622.0,
    "date_created": "2017-10-10",
    "time_created": "23:00:22",
    "submission_id": "news-75k317"
  },
  {
    "id": "do75z47",
    "parent_id": "t1_do73a8a",
    "subreddit_name_prefixed": "r/news",
    "body": "[let's see if this works](https://www.google.com/search?q=dan+schneider+ariana+grande&client=safari&channel=iphone_bm&prmd=niv&source=lnms&tbm=isch&sa=X&ved=0ahUKEwjQ-O_WuOfWAhUo4YMKHQKCA9UQ_AUIEygC&biw=414&bih=628#imgrc=AxhyQlWnDb4oQM:) ",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1507715034.0,
    "date_created": "2017-10-10",
    "time_created": "21:43:54",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7749q",
    "parent_id": "t1_do73m24",
    "subreddit_name_prefixed": "r/news",
    "body": "doesn't matter if he can prove it\n\n\nhe'd never work in Hollywood again\n\nhe'd be known as a guy that rocks the boat. \n\nMovie financiers come from all walks of life. In Hollywood you don't judge where the money comes from or the people providing it.  You make the movie once you have the money. \n\nAnd if the financier is kinda pervy, or more likely such a cretin he's cupping dicks to tell people who's got the biggest dick at the party, you don't continue to work in Hollywood by hating on the money source.\n\nThink snobby heir: not a person raised to hold themselves back with inhibitions. snobby heir on coke? probably the guy cupping dicks at the party \n\nit's likely a person with all the connections to financiers\n\n",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1507716311.0,
    "date_created": "2017-10-10",
    "time_created": "22:05:11",
    "submission_id": "news-75k317"
  },
  {
    "id": "do79dsx",
    "parent_id": "t1_do6wqwm",
    "subreddit_name_prefixed": "r/news",
    "body": "That fucking sneaky bitch. I'm glad karma finally caught up with her in life. For some assholes it never does but at least this one was caught and cleared the people's names she framed. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507719033.0,
    "date_created": "2017-10-10",
    "time_created": "22:50:33",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6v0an",
    "parent_id": "t1_do6utl4",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1507701744.0,
    "date_created": "2017-10-10",
    "time_created": "18:02:24",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7bsd4",
    "parent_id": "t1_do7923a",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah it breaks my heart to be on Reddit as a girl. Sometimes I wonder why I even bother with it. But, I would rather know the truth about how these guys feel. It's important to understand the world we live in, even if it is sad and wrong.",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1507722205.0,
    "date_created": "2017-10-10",
    "time_created": "23:43:25",
    "submission_id": "news-75k317"
  },
  {
    "id": "do797cw",
    "parent_id": "t1_do7923a",
    "subreddit_name_prefixed": "r/news",
    "body": "I don't really BLAME anyone. I'm sure it's easy to think \"if I were ever in this situation, I'd fight it tooth and nail... I'd tell someone... I wouldn't let it stand... if do this I'd do that\" without really considering too deeply what it's like to have to think about future consequences or backlash or fear. I'm sure it's even harder to put yourself in a place of absolute helplessness when it comes to strength too. It's hard, but from this whole thread it's almost like people never even stopped to consider it. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1507718811.0,
    "date_created": "2017-10-10",
    "time_created": "22:46:51",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70g22",
    "parent_id": "t1_do70ehh",
    "subreddit_name_prefixed": "r/news",
    "body": "Rated PG-13",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1507708493.0,
    "date_created": "2017-10-10",
    "time_created": "19:54:53",
    "submission_id": "news-75k317"
  },
  {
    "id": "do79anw",
    "parent_id": "t1_do6zqe1",
    "subreddit_name_prefixed": "r/news",
    "body": "Some guy was getting swatted and smacked by his drunk girlfriend outside my window (I live above a bar) and every time he would grab her hands to defend himself, somebody would walk by and intervene. I had to pop my head out and yell at two dudes who almost pounded the guy when this bitch started screaming \"let Go! Help!\" She even yelled \"call 911\" so someone did. Guy got cuffed so I ran down and told them what I saw and a lady in the next building did the same. Cops were super pissed and ended up arresting her, but that easily could have been him.",
    "controversiality": 0,
    "ups": 769,
    "downs": 0,
    "score": 769,
    "created": 1507718925.0,
    "date_created": "2017-10-10",
    "time_created": "22:48:45",
    "submission_id": "news-75k317"
  },
  {
    "id": "do79gbo",
    "parent_id": "t1_do6zqe1",
    "subreddit_name_prefixed": "r/news",
    "body": "not the same at all but i work with high needs kids and if i restrain them at all there is a lengthy investigation to ensure the safety of the child. last weekend i was punched over 100 times and i couldnt just leave and get to safety because i was keeping him out of an area where there were lots of tjings he could use to hurt himself and others.  just had to let him punch me and try to dodge what i could or fear losing my ability to work with children at all.",
    "controversiality": 0,
    "ups": 108,
    "downs": 0,
    "score": 108,
    "created": 1507719114.0,
    "date_created": "2017-10-10",
    "time_created": "22:51:54",
    "submission_id": "news-75k317"
  },
  {
    "id": "do79hcf",
    "parent_id": "t1_do6zqe1",
    "subreddit_name_prefixed": "r/news",
    "body": "There was a story shared on reddit just a day or two ago about a male suffering DV where the woman would beat him with her *forearms* so that if he ever said anything *the bruises on her forearms would make it look like he was the abuser*.\n\nI am incredibly glad I have never had to think about that before.",
    "controversiality": 0,
    "ups": 188,
    "downs": 0,
    "score": 188,
    "created": 1507719147.0,
    "date_created": "2017-10-10",
    "time_created": "22:52:27",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71uvz",
    "parent_id": "t1_do6xq4c",
    "subreddit_name_prefixed": "r/news",
    "body": "That's a Black Mirror episode. Minus TMZ.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1507710207.0,
    "date_created": "2017-10-10",
    "time_created": "20:23:27",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71krl",
    "parent_id": "t1_do6xq4c",
    "subreddit_name_prefixed": "r/news",
    "body": "Or people could stop being awful, especially to each other. Less realistic maybe but I would prefer that to constant surveillance.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1507709879.0,
    "date_created": "2017-10-10",
    "time_created": "20:17:59",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7a1iz",
    "parent_id": "t1_do6xq4c",
    "subreddit_name_prefixed": "r/news",
    "body": "Boy it got all 1984 in here real fast.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1507719828.0,
    "date_created": "2017-10-10",
    "time_created": "23:03:48",
    "submission_id": "news-75k317"
  },
  {
    "id": "do73sn2",
    "parent_id": "t1_do72l9x",
    "subreddit_name_prefixed": "r/news",
    "body": "Those are the words of someone who has never been sexually assaulted ",
    "controversiality": 0,
    "ups": 350,
    "downs": 0,
    "score": 350,
    "created": 1507712484.0,
    "date_created": "2017-10-10",
    "time_created": "21:01:24",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7drjp",
    "parent_id": "t1_do72l9x",
    "subreddit_name_prefixed": "r/news",
    "body": "I had a friend who was sexually assaulted (fucker at the club forcefully fingered her), she tried killing herself and the doctor at the CSU said \"it was just fingers, get over yourself\"\n\nPeople just don't give a shit about this kind of stuff unless you get full on raped it seems.... It's fucked up.",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1507725214.0,
    "date_created": "2017-10-11",
    "time_created": "00:33:34",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7emee",
    "parent_id": "t1_do7683s",
    "subreddit_name_prefixed": "r/news",
    "body": "The worst is when they use that as a,\"well you shouldn't have drank, you put yourself in that situation\". Fucking rape culture bullshit",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1507726650.0,
    "date_created": "2017-10-11",
    "time_created": "00:57:30",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71azv",
    "parent_id": "t1_do6ywqm",
    "subreddit_name_prefixed": "r/news",
    "body": "I wish more people had this point of view. You don't hear it too often anymore because being gay is much more accepted than it was even 10-15 years ago, but I've heard too many times people say that they don't trust gay guys because they were hit on *once*. Makes me wonder how many people silently still hold these views.",
    "controversiality": 0,
    "ups": 59,
    "downs": 0,
    "score": 59,
    "created": 1507709558.0,
    "date_created": "2017-10-10",
    "time_created": "20:12:38",
    "submission_id": "news-75k317"
  },
  {
    "id": "do711xe",
    "parent_id": "t1_do6ywqm",
    "subreddit_name_prefixed": "r/news",
    "body": "Do you ever think you should've pressed charges? I'm concerned that this guy is still 'at large'",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1507709253.0,
    "date_created": "2017-10-10",
    "time_created": "20:07:33",
    "submission_id": "news-75k317"
  },
  {
    "id": "do72a6j",
    "parent_id": "t1_do6ywqm",
    "subreddit_name_prefixed": "r/news",
    "body": "Tell this to my fundie FIL, who thinks that people become gay on account of being \"recruited\" by older gays.\n\nWhen he told me this, I just said, \"We'll just have to agree to disagree....\" ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1507710721.0,
    "date_created": "2017-10-10",
    "time_created": "20:32:01",
    "submission_id": "news-75k317"
  },
  {
    "id": "do738in",
    "parent_id": "t1_do72leh",
    "subreddit_name_prefixed": "r/news",
    "body": "Totally true.  Singers case involved underage boys too, which is so much grosser when it involves children.  ",
    "controversiality": 0,
    "ups": 86,
    "downs": 0,
    "score": 86,
    "created": 1507711841.0,
    "date_created": "2017-10-10",
    "time_created": "20:50:41",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7exjn",
    "parent_id": "t1_do72leh",
    "subreddit_name_prefixed": "r/news",
    "body": "After watching that \"Open Secret\" doc, I remain baffled by everything to do with Singer. The dude was heavily affiliated with pedophiles who were literally fleeing the country to escape conviction. Singer created an entire media venture with these people. A venture whose sole purpose was to lure in more young boy actors. Absolutely insane how much work he's **still** getting.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507727190.0,
    "date_created": "2017-10-11",
    "time_created": "01:06:30",
    "submission_id": "news-75k317"
  },
  {
    "id": "do76c0z",
    "parent_id": "t1_do74638",
    "subreddit_name_prefixed": "r/news",
    "body": "> There was recently a class action lawsuit that established that Disney, pixar, Blue Sky, Dreamworks, all conspired among each other to exchange employee pay information and agree not to hire from one another.\n\nThere was [similar collusion in Silicon Valley a few years ago](http://www.telegraph.co.uk/finance/newsbysector/mediatechnologyandtelecoms/digital-media/11023038/Apple-and-Googles-300m-settlement-over-poaching-staff-rejected-by-judge.html). I don't recall if salaries were shared/locked, but there were agreements to not poach from each other which would prevent the \"change jobs to get a salary increase\" scenario.\n\nOh, and [Pixar (who is now owned by Disney) was involved with that one too](https://en.wikipedia.org/wiki/High-Tech_Employee_Antitrust_Litigation).",
    "controversiality": 0,
    "ups": 129,
    "downs": 0,
    "score": 129,
    "created": 1507715450.0,
    "date_created": "2017-10-10",
    "time_created": "21:50:50",
    "submission_id": "news-75k317"
  },
  {
    "id": "do76pj7",
    "parent_id": "t1_do74638",
    "subreddit_name_prefixed": "r/news",
    "body": "Isn't that pretty much the definition of cartel? see airlines, foods, oil, etc. and imagine what those cartels are doing.\n\n",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1507715861.0,
    "date_created": "2017-10-10",
    "time_created": "21:57:41",
    "submission_id": "news-75k317"
  },
  {
    "id": "do78x7a",
    "parent_id": "t1_do74638",
    "subreddit_name_prefixed": "r/news",
    "body": "Holy shit, I'm a pretty aware guy and I've never heard this story. \n\n\nThis makes you realize how fucking skewed capitalism is right now. Even *if* pure capitalism was the perfect system. This shit is not working by design. \n\n\nThere's no way were not looking at a staggeringly monopolized industry at this point. Nobody cares because *it's only entertainment* but your story proves the points that perhaps, millions of Americans are affected by the power that a handful of studios hold over a billion dollar industry and one of maybe 5 industries that the US has hegemonic power and control over today. \n\n\nThings like this make you want to take your ball and go home or go burn something down.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1507718462.0,
    "date_created": "2017-10-10",
    "time_created": "22:41:02",
    "submission_id": "news-75k317"
  },
  {
    "id": "do77s1b",
    "parent_id": "t1_do73o4t",
    "subreddit_name_prefixed": "r/news",
    "body": "I was an assistant half a lifetime ago, once for a big-3 agency and then for some on-lot production companies at big-6 studios.  We all have our \"What, and quit show business?\" moment.  From my experience, leaving was the best thing to happen to me.\n\nI used to joke that they referred to us as Off-The-Bussers to remind themselves where to throw us.",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1507717081.0,
    "date_created": "2017-10-10",
    "time_created": "22:18:01",
    "submission_id": "news-75k317"
  },
  {
    "id": "do78qgx",
    "parent_id": "t1_do71i8d",
    "subreddit_name_prefixed": "r/news",
    "body": "You know, you're absolutely right about the race dynamic but dropping the name Channing Tatum made me realize that he may have a similar story.\n\n\nImagine how many borderline stars can easily be outcasted. \n\n\nI think there's probably a list of maybe 10 *male* actors who have enough power to overcome a blackballing.\n\n\nFor women, it's gotta be *dramatically* fewer.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1507718233.0,
    "date_created": "2017-10-10",
    "time_created": "22:37:13",
    "submission_id": "news-75k317"
  },
  {
    "id": "do727uk",
    "parent_id": "t1_do71zfx",
    "subreddit_name_prefixed": "r/news",
    "body": "Plantation ethics are still present. Tempered greatly, but where have we heard, \"They should be grateful,\" \"Shut up and play,\" etc. recently?",
    "controversiality": 0,
    "ups": 163,
    "downs": 0,
    "score": 163,
    "created": 1507710642.0,
    "date_created": "2017-10-10",
    "time_created": "20:30:42",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70u9b",
    "parent_id": "t1_do70bsp",
    "subreddit_name_prefixed": "r/news",
    "body": "Saw an interview with Terry where he explained that he got buff and jacked so he could defend himself from physically abusive father and so - in his words - he could \"fight his way into school.\"\n\nThe way he explained it was - kids in his neighborhood would actively dissuade kids from attending school on school grounds - presumably to go gangbang instead - so he had to get jacked enough so they'd leave him alone.\n\nDoes seem like a pretty good dude.  \n",
    "controversiality": 0,
    "ups": 590,
    "downs": 0,
    "score": 590,
    "created": 1507708985.0,
    "date_created": "2017-10-10",
    "time_created": "20:03:05",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70gng",
    "parent_id": "t1_do70bsp",
    "subreddit_name_prefixed": "r/news",
    "body": "Holy cultivating mass Batman! ",
    "controversiality": 0,
    "ups": 109,
    "downs": 0,
    "score": 109,
    "created": 1507708514.0,
    "date_created": "2017-10-10",
    "time_created": "19:55:14",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70t3o",
    "parent_id": "t1_do70bsp",
    "subreddit_name_prefixed": "r/news",
    "body": "Skinny or not, he’s got that “I’m gonna fuck you up” stare locked down.",
    "controversiality": 0,
    "ups": 69,
    "downs": 0,
    "score": 69,
    "created": 1507708944.0,
    "date_created": "2017-10-10",
    "time_created": "20:02:24",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70ptd",
    "parent_id": "t1_do70bsp",
    "subreddit_name_prefixed": "r/news",
    "body": "He played in the NFL so it wasnt just for the hell for it getting jacked.",
    "controversiality": 0,
    "ups": 45,
    "downs": 0,
    "score": 45,
    "created": 1507708830.0,
    "date_created": "2017-10-10",
    "time_created": "20:00:30",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70j7v",
    "parent_id": "t1_do70bsp",
    "subreddit_name_prefixed": "r/news",
    "body": "Even skinny Crews could beat my ass..  not saying much but still",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1507708604.0,
    "date_created": "2017-10-10",
    "time_created": "19:56:44",
    "submission_id": "news-75k317"
  },
  {
    "id": "do710tm",
    "parent_id": "t1_do70bsp",
    "subreddit_name_prefixed": "r/news",
    "body": "Terry saw abuse from his father when he was a kid, I feel like that may be why he's such a sweetheart now. It's just weird, you'd expect the opposite reaction from abuse.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507709214.0,
    "date_created": "2017-10-10",
    "time_created": "20:06:54",
    "submission_id": "news-75k317"
  },
  {
    "id": "do713yq",
    "parent_id": "t1_do70bku",
    "subreddit_name_prefixed": "r/news",
    "body": "Pretty sure he'd knock me over with a disappointed stare, and I've built up an immunity to them because Asian parents",
    "controversiality": 0,
    "ups": 339,
    "downs": 0,
    "score": 339,
    "created": 1507709320.0,
    "date_created": "2017-10-10",
    "time_created": "20:08:40",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7a9jq",
    "parent_id": "t1_do74jok",
    "subreddit_name_prefixed": "r/news",
    "body": "And maybe a judge who thinks it's\"just\" getting groped. I know some guys who think that's okay behavior at a party. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1507720110.0,
    "date_created": "2017-10-10",
    "time_created": "23:08:30",
    "submission_id": "news-75k317"
  },
  {
    "id": "do72zyz",
    "parent_id": "t1_do71vps",
    "subreddit_name_prefixed": "r/news",
    "body": "Our whole prison system doesn't really make sense as a tool to improve character or create productive members of society, it only makes sense if you think if it as a tool for vindictive punishment. And it's super fucked up that prison rape is so often used as a punchline.",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1507711566.0,
    "date_created": "2017-10-10",
    "time_created": "20:46:06",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6z3j5",
    "parent_id": "t1_do6yzn8",
    "subreddit_name_prefixed": "r/news",
    "body": "Exactly what the comment I replied to said happened to Corey Feldman and Corey Haim in the 80s :/ Children passed around at parties, and placated w/ drugs. Drew Barrymore was on cocaine at like, age 11. ",
    "controversiality": 0,
    "ups": 560,
    "downs": 0,
    "score": 560,
    "created": 1507706806.0,
    "date_created": "2017-10-10",
    "time_created": "19:26:46",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zeo8",
    "parent_id": "t1_do6yzn8",
    "subreddit_name_prefixed": "r/news",
    "body": "Well, I'll put it like this: she's about my age. I saw her in E.T. and developed a crush on her when I was a little kid. Before I started growing any hair on my balls, she already had a coke habit. For a long time, she was the poster child of how Hollywood fucks up child actors. It's really pretty amazing she lived through it all and came out on top TBH.",
    "controversiality": 0,
    "ups": 213,
    "downs": 0,
    "score": 213,
    "created": 1507707202.0,
    "date_created": "2017-10-10",
    "time_created": "19:33:22",
    "submission_id": "news-75k317"
  },
  {
    "id": "do714nt",
    "parent_id": "t1_do6yzn8",
    "subreddit_name_prefixed": "r/news",
    "body": "Here's an interview from when she was a teen: https://instagram.com/p/BWAFP9qloYZ/ alcohol and drugs before age 10. ",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1507709345.0,
    "date_created": "2017-10-10",
    "time_created": "20:09:05",
    "submission_id": "news-75k317"
  },
  {
    "id": "do73cxu",
    "parent_id": "t1_do705b4",
    "subreddit_name_prefixed": "r/news",
    "body": "Judy Garland's situation is so sad. It breaks my heart every time I hear about it and makes me wish I was alive then to be her friend and help her :(",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1507711980.0,
    "date_created": "2017-10-10",
    "time_created": "20:53:00",
    "submission_id": "news-75k317"
  },
  {
    "id": "do72vnz",
    "parent_id": "t1_do705b4",
    "subreddit_name_prefixed": "r/news",
    "body": "Sadly The Wizard of Oz ruined her life.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1507711427.0,
    "date_created": "2017-10-10",
    "time_created": "20:43:47",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6z0do",
    "parent_id": "t1_do6ymhp",
    "subreddit_name_prefixed": "r/news",
    "body": "I think there are just more avenues for these people to make a living.  Product endorsements, broadway, internet videos, party promotion, etc.  \n\nWith their work on more platforms, it also provides increased royalties from their work.  Makes it easier to stand up against people who no longer have as much control over your career.",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1507706695.0,
    "date_created": "2017-10-10",
    "time_created": "19:24:55",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71429",
    "parent_id": "t1_do6yo5g",
    "subreddit_name_prefixed": "r/news",
    "body": "Well, that's pretty much the law in every state.",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1507709324.0,
    "date_created": "2017-10-10",
    "time_created": "20:08:44",
    "submission_id": "news-75k317"
  },
  {
    "id": "do776k4",
    "parent_id": "t1_do75z47",
    "subreddit_name_prefixed": "r/news",
    "body": "Fucking creep.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1507716385.0,
    "date_created": "2017-10-10",
    "time_created": "22:06:25",
    "submission_id": "news-75k317"
  },
  {
    "id": "do79v6d",
    "parent_id": "t1_do79anw",
    "subreddit_name_prefixed": "r/news",
    "body": "Dude, good on you (edit: and the lady in the next building) for doing the right thing. I'm sure there are plenty of people who wouldn't have done the same thing had they been in your shoes. Props to the cops for listening to you, too.",
    "controversiality": 0,
    "ups": 379,
    "downs": 0,
    "score": 379,
    "created": 1507719609.0,
    "date_created": "2017-10-10",
    "time_created": "23:00:09",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7by4d",
    "parent_id": "t1_do79anw",
    "subreddit_name_prefixed": "r/news",
    "body": "Glad you were willing to speak up.  Don't get me wrong, I'm glad people are less terrified to intervene these days (almost got assaulted in public about a decade ago because people didn't want to get involved) but assumptions can be harmful.  Assess the situation before passing judgement ",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1507722439.0,
    "date_created": "2017-10-10",
    "time_created": "23:47:19",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7brar",
    "parent_id": "t1_do79gbo",
    "subreddit_name_prefixed": "r/news",
    "body": "Been there.  Used to work inpatient with adults.  Never knew how hard it is to suppress the automatic response to hit back until I got popped in the face for the first time.  Sorry you had to deal with that and thank you for keeping the kiddo safe at your own risk.  ",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1507722162.0,
    "date_created": "2017-10-10",
    "time_created": "23:42:42",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7d8xh",
    "parent_id": "t1_do79gbo",
    "subreddit_name_prefixed": "r/news",
    "body": "As a mother of a child with autism, thank you for what you do. I read a lot of stories giving flack to the professionals that work with our kids and it's like they forget what our kids are capable of. My son so far hasn't been violent with anyone besides me, he's three and I'm hoping to get that shit under control before he tries it with anyone else. ",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1507724396.0,
    "date_created": "2017-10-11",
    "time_created": "00:19:56",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7f087",
    "parent_id": "t1_do79gbo",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1507727323.0,
    "date_created": "2017-10-11",
    "time_created": "01:08:43",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7bb3i",
    "parent_id": "t1_do79hcf",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm a man and my ex was abusive. She would often be in tears just from anger, and I knew that if anybody came they would just see a screaming crying woman with a larger man. That, combined with how our society *still* thinks \"domestic violence\" is just about violence against *women*, meant I never bothered trying to get help.\n\nIt's great to see somebody like Terry Crews speaking out and hopefully someday society can realize that bigger people can be abused by smaller people.",
    "controversiality": 0,
    "ups": 163,
    "downs": 0,
    "score": 163,
    "created": 1507721523.0,
    "date_created": "2017-10-10",
    "time_created": "23:32:03",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7bl34",
    "parent_id": "t1_do79hcf",
    "subreddit_name_prefixed": "r/news",
    "body": "This is (at least with the men I've worked with) an incredibly common technique.  Pair that with the notion that men can't be physically abused by women and it puts the male partner in a no win situation",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1507721914.0,
    "date_created": "2017-10-10",
    "time_created": "23:38:34",
    "submission_id": "news-75k317"
  },
  {
    "id": "do74ds6",
    "parent_id": "t1_do73sn2",
    "subreddit_name_prefixed": "r/news",
    "body": "Or someone who sexually assaults others.",
    "controversiality": 0,
    "ups": 507,
    "downs": 0,
    "score": 507,
    "created": 1507713167.0,
    "date_created": "2017-10-10",
    "time_created": "21:12:47",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7cszd",
    "parent_id": "t1_do73sn2",
    "subreddit_name_prefixed": "r/news",
    "body": "This 100% \n\nI was assaulted by a guy in San Diego last year when he grabbed me on the street, held me in a headlock and kissed me, pretty much shoving his tongue down my throat before I could get out of his grasp. \n\nTo a lot of people that may not seem like a big deal, but when you are reminded how fragile your safety and control is its earth shattering. I don't think EVERY man is a rapist or wants to hurt me, but I am very aware that ANY man could. And I would be powerless to stop it. \n\nA lot of men hear this sort of thing and feel victimized. They think women generalize and blame all men for the actions of few, but until you truly experience what its like to completely lose your power like that you can't begin to understand the lifelong ramifications of it. ",
    "controversiality": 0,
    "ups": 269,
    "downs": 0,
    "score": 269,
    "created": 1507723727.0,
    "date_created": "2017-10-11",
    "time_created": "00:08:47",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7e2kg",
    "parent_id": "t1_do73sn2",
    "subreddit_name_prefixed": "r/news",
    "body": "I mean it's not even that, it's being an indecent human being. You shouldn't have to be sexually assaulted to sympathize with someone who was. I was sexually assaulted and wouldn't wish it on anyone.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1507725721.0,
    "date_created": "2017-10-11",
    "time_created": "00:42:01",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7e5gd",
    "parent_id": "t1_do7drjp",
    "subreddit_name_prefixed": "r/news",
    "body": " Sounds like that Doctor has some serious problems in his head. Fucking asshole.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1507725857.0,
    "date_created": "2017-10-11",
    "time_created": "00:44:17",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7iiwf",
    "parent_id": "t1_do7drjp",
    "subreddit_name_prefixed": "r/news",
    "body": "That's fucked up what the doctor said. Society really needs to get out of this mindset that talking to someone (therapist, psychologist, nurse... Anyone) is bad or makes you crazy. Therapy and talking to someone should be encouraged and shouldn't be billed at the expense and prices that it is. making it so that only rich people can afford it on a regular basis",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507734909.0,
    "date_created": "2017-10-11",
    "time_created": "03:15:09",
    "submission_id": "news-75k317"
  },
  {
    "id": "do79g92",
    "parent_id": "t1_do71azv",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm a 20 year old straight male. If I got hit on by a gay guy, it wouldn't affect my opinion of gay guys. I'd just think that guy had pretty low standards.\nActually, midly interesting, and semi related story. Yesterday I put on a new pair of pants, my mom bought me on ebay. They were a pair of skinny jeans, almost jegging like. I'm 6'2\" and quite thin, and I usually end up wearing quite baggy pants because of it. But these were form fitting. My sister saw them, told me I looked gay, and said my legs disgusted her. She loves gay guys, but just really hates my thinnish legs. Anyway, it sticks with me, because last night I dreamt that a black dude hit on me. And my only feeling about it was a slight sadness for having to reject the guy. ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1507719112.0,
    "date_created": "2017-10-10",
    "time_created": "22:51:52",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7c22r",
    "parent_id": "t1_do76c0z",
    "subreddit_name_prefixed": "r/news",
    "body": "Ain't capitalism grand?",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1507722600.0,
    "date_created": "2017-10-10",
    "time_created": "23:50:00",
    "submission_id": "news-75k317"
  },
  {
    "id": "do79d35",
    "parent_id": "t1_do76c0z",
    "subreddit_name_prefixed": "r/news",
    "body": "Yes i fact the two lawsuits are connected.  The Silicon Valley workers lawsuit settlement was almost half a billion dollars split among 66,000 workers.\n\nThe animation class action lawsuit settled on the heels of the Silicon Valley lawsuit.  \n\nhttp://www.cartoonbrew.com/artist-rights/artists-win-disney-pixar-lucasfilm-pay-100-million-wage-theft-lawsuit-148195.html",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1507719008.0,
    "date_created": "2017-10-10",
    "time_created": "22:50:08",
    "submission_id": "news-75k317"
  },
  {
    "id": "do79hbs",
    "parent_id": "t1_do78x7a",
    "subreddit_name_prefixed": "r/news",
    "body": "http://www.cartoonbrew.com/artist-rights/artists-win-disney-pixar-lucasfilm-pay-100-million-wage-theft-lawsuit-148195.html\n\nI think that the corporations came out ahead if you were to total up the savings they achieved by keeping wages and worker mobility suppressed for more than a decade.  Totally worth it in the eyes of the CEO to pay some fuck off settlement money when the profit is still there.  ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1507719146.0,
    "date_created": "2017-10-10",
    "time_created": "22:52:26",
    "submission_id": "news-75k317"
  },
  {
    "id": "do78ckk",
    "parent_id": "t1_do77s1b",
    "subreddit_name_prefixed": "r/news",
    "body": "if you don't mind, what was your AH-HA! moment you quit and what did you decide to pursue? \n\nI've been in the assistant realm for over three years and I'm just so goddamn tired of it. It's not for me, but I'm not really sure how to get away from it.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1507717760.0,
    "date_created": "2017-10-10",
    "time_created": "22:29:20",
    "submission_id": "news-75k317"
  },
  {
    "id": "do711or",
    "parent_id": "t1_do70u9b",
    "subreddit_name_prefixed": "r/news",
    "body": "Hot Ones?\n\nTerry was one of my favorite episodes and I did not expect it to be so good.",
    "controversiality": 0,
    "ups": 215,
    "downs": 0,
    "score": 215,
    "created": 1507709244.0,
    "date_created": "2017-10-10",
    "time_created": "20:07:24",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71p30",
    "parent_id": "t1_do70u9b",
    "subreddit_name_prefixed": "r/news",
    "body": "Hot ones! he handled his wings like he seems to handle every situation..",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1507710014.0,
    "date_created": "2017-10-10",
    "time_created": "20:20:14",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71ucx",
    "parent_id": "t1_do710tm",
    "subreddit_name_prefixed": "r/news",
    "body": "Abused children can go to either extreme. Nothing is set in stone.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1507710189.0,
    "date_created": "2017-10-10",
    "time_created": "20:23:09",
    "submission_id": "news-75k317"
  },
  {
    "id": "do73u2p",
    "parent_id": "t1_do713yq",
    "subreddit_name_prefixed": "r/news",
    "body": "Victorian English parents would do this too. I got stares when I was a kid. Right through me. A culture of staring through your soul that was passed down to my parents.\n\nIt's supposed to make you feel worthless. Guess what? It works!",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1507712530.0,
    "date_created": "2017-10-10",
    "time_created": "21:02:10",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7b4fa",
    "parent_id": "t1_do7a9jq",
    "subreddit_name_prefixed": "r/news",
    "body": "That's a major component often overlooked. People think that by virtue of being a judge that person is removed from the general faults of society. \n\n",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1507721264.0,
    "date_created": "2017-10-10",
    "time_created": "23:27:44",
    "submission_id": "news-75k317"
  },
  {
    "id": "do6zlw1",
    "parent_id": "t1_do6z3j5",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 623,
    "downs": 0,
    "score": 623,
    "created": 1507707453.0,
    "date_created": "2017-10-10",
    "time_created": "19:37:33",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70z17",
    "parent_id": "t1_do6z3j5",
    "subreddit_name_prefixed": "r/news",
    "body": "the fact that Drew Barrymore is a) alive at all, and b) has had at least some shreds of normalcy in her adulthood, such as getting married and having children and working steadily, is remarkable, considering her childhood.",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1507709148.0,
    "date_created": "2017-10-10",
    "time_created": "20:05:48",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7436v",
    "parent_id": "t1_do73cxu",
    "subreddit_name_prefixed": "r/news",
    "body": "Her singing in the last episode of her show is just heartbreaking. She finally got something she wanted for herself and it got taken away so quickly.",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1507712820.0,
    "date_created": "2017-10-10",
    "time_created": "21:07:00",
    "submission_id": "news-75k317"
  },
  {
    "id": "do78xyq",
    "parent_id": "t1_do73cxu",
    "subreddit_name_prefixed": "r/news",
    "body": "Tragically beautiful that one of her few friends throughout that filming was the actress that played the witch.  ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1507718488.0,
    "date_created": "2017-10-10",
    "time_created": "22:41:28",
    "submission_id": "news-75k317"
  },
  {
    "id": "do73za8",
    "parent_id": "t1_do73cxu",
    "subreddit_name_prefixed": "r/news",
    "body": "i want to reach through time and strangle the MGM boys",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507712699.0,
    "date_created": "2017-10-10",
    "time_created": "21:04:59",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7cfen",
    "parent_id": "t1_do79v6d",
    "subreddit_name_prefixed": "r/news",
    "body": "Thanks! I was just being nosy lol. One thing that did crack me up was that when I was walking toward the cop I heard the lady yelling at the cop for arresting him and he flipped out and yelled \"well if you yell 'call the cops' guess what, somebody is gonna call the cops!\" It wasnt hard to convince them she was at fault",
    "controversiality": 0,
    "ups": 176,
    "downs": 0,
    "score": 176,
    "created": 1507723153.0,
    "date_created": "2017-10-10",
    "time_created": "23:59:13",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7cwre",
    "parent_id": "t1_do7by4d",
    "subreddit_name_prefixed": "r/news",
    "body": "Totally agree and I'm sorry you had to go through that. I live in NYC and id say 1/2 the time someone jumps in, but more often than not I'm the first to do it. I'm usually pretty scared but I had an incident in Miami as a teenager where 4 guys tried to jump me and a couple of guys jumped in and got the shit kicked out of me trying to defend me. So i feel like i have to pay that forward. The worst thats happened to me is a time i got sucker-punched in the ear, so it's worth the anxiety.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1507723884.0,
    "date_created": "2017-10-11",
    "time_created": "00:11:24",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7bjm6",
    "parent_id": "t1_do7bb3i",
    "subreddit_name_prefixed": "r/news",
    "body": "Totally agreed.  Society as a whole has failed DV victims and we've failed men in a really horrible way - we don't even acknowledge it.  The more men who tell their stories the more that idea dies the death it needs to",
    "controversiality": 0,
    "ups": 68,
    "downs": 0,
    "score": 68,
    "created": 1507721855.0,
    "date_created": "2017-10-10",
    "time_created": "23:37:35",
    "submission_id": "news-75k317"
  },
  {
    "id": "do78086",
    "parent_id": "t1_do74ds6",
    "subreddit_name_prefixed": "r/news",
    "body": "Potentially both!",
    "controversiality": 0,
    "ups": 79,
    "downs": 0,
    "score": 79,
    "created": 1507717344.0,
    "date_created": "2017-10-10",
    "time_created": "22:22:24",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7ger0",
    "parent_id": "t1_do7cszd",
    "subreddit_name_prefixed": "r/news",
    "body": "Same thing happened to me once, in TJ. We were acquaintances, and one night, I didn't want to go to his place, so he kept grabbing me, blocking me on the street. This was a busy night on Calle Revolucion, too. And nobody did anything.",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1507730040.0,
    "date_created": "2017-10-11",
    "time_created": "01:54:00",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7fcwz",
    "parent_id": "t1_do7c22r",
    "subreddit_name_prefixed": "r/news",
    "body": "They make movies about love and kindness, with wage slaves...",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1507727963.0,
    "date_created": "2017-10-11",
    "time_created": "01:19:23",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7a3r3",
    "parent_id": "t1_do78ckk",
    "subreddit_name_prefixed": "r/news",
    "body": "The Ah-Ha moment: I was a lit/dev guy.  One of my suggested changes to the core arc of a pilot script became my bosses' chief note.  That pilot got picked up by a major network after a year of unsuccessful shopping.  When the WGA strike hit, I was laid-off.  I didn't get so much as an \"Assistant to Mr ____\" credit when the pilot debuted at Upfronts, or when it was ordered to series.\n\nI moved back to my home city, went into a different industry, have done well, and never looked back\n\nEDIT: If I was still in LA, chances are I'd be ruined after a few more \"rolodex-expanding\" shuffles between companies.  By age 28 at most.\n\nEDIT 2: Removed part of the story that could potentially be used to dox me.  I'm not a lawyer so I have no clue what could be covered in an NDA and I'm not risking identification.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1507719907.0,
    "date_created": "2017-10-10",
    "time_created": "23:05:07",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71vdy",
    "parent_id": "t1_do711or",
    "subreddit_name_prefixed": "r/news",
    "body": "Lol poor guy was dying in that episode. You can totally tell he reached the half-awake euphoric-from-the-pain state by the time he hit that Da Bomb hot sauce. Seriously though I tried that sauce. That shit is straight evil.",
    "controversiality": 0,
    "ups": 104,
    "downs": 0,
    "score": 104,
    "created": 1507710223.0,
    "date_created": "2017-10-10",
    "time_created": "20:23:43",
    "submission_id": "news-75k317"
  },
  {
    "id": "do721mb",
    "parent_id": "t1_do711or",
    "subreddit_name_prefixed": "r/news",
    "body": "Thank you, now I now what episode of Hot Ones I'm watching right now.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1507710431.0,
    "date_created": "2017-10-10",
    "time_created": "20:27:11",
    "submission_id": "news-75k317"
  },
  {
    "id": "do71om8",
    "parent_id": "t1_do711or",
    "subreddit_name_prefixed": "r/news",
    "body": "I think I saw Terry say this in an interview on the Desus & Mero talk show on viceland. Pretty funny show if you haven’t seen it.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1507709999.0,
    "date_created": "2017-10-10",
    "time_created": "20:19:59",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7003m",
    "parent_id": "t1_do6zlw1",
    "subreddit_name_prefixed": "r/news",
    "body": "Username fucking checks out.",
    "controversiality": 0,
    "ups": 193,
    "downs": 0,
    "score": 193,
    "created": 1507707949.0,
    "date_created": "2017-10-10",
    "time_created": "19:45:49",
    "submission_id": "news-75k317"
  },
  {
    "id": "do705k5",
    "parent_id": "t1_do6zlw1",
    "subreddit_name_prefixed": "r/news",
    "body": "thank you for sharing this info. there is always so damn much going on in this world but this is an often overlooked issue. ",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1507708137.0,
    "date_created": "2017-10-10",
    "time_created": "19:48:57",
    "submission_id": "news-75k317"
  },
  {
    "id": "do70esm",
    "parent_id": "t1_do6zlw1",
    "subreddit_name_prefixed": "r/news",
    "body": "The stuff in England got a fair bit of of media traction, but it seems most fallaciously seemed to think it was isolated there. And of course the story didn't blow up nearly as much as it should have.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1507708449.0,
    "date_created": "2017-10-10",
    "time_created": "19:54:09",
    "submission_id": "news-75k317"
  },
  {
    "id": "do73m7m",
    "parent_id": "t1_do6zlw1",
    "subreddit_name_prefixed": "r/news",
    "body": "Is it just me or does this seem to illustrate that pedophilia may be far more common than we care to admit? Surely pedophiles just don't become politicians and Hollywood bigwigs whenever they get their first erection from a child?\n\nFor so many examples, its the power play letting them get away with what so many more people can't.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507712276.0,
    "date_created": "2017-10-10",
    "time_created": "20:57:56",
    "submission_id": "news-75k317"
  },
  {
    "id": "do742xb",
    "parent_id": "t1_do6zlw1",
    "subreddit_name_prefixed": "r/news",
    "body": "I hope people understand that this isn't just happening among powerful people. A similar thing happened to me with my stepdad and his shitty fucking friends. And they weren't anything special in life. A group I'm in follows missing persons cases now, especially involving children. We have had a few cases where families are full of this. Children getting passed from cousins, uncles, fathers, etc. \n\nThis is a **huge** problem. I don't know why, and I don't know how to fix it. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1507712812.0,
    "date_created": "2017-10-10",
    "time_created": "21:06:52",
    "submission_id": "news-75k317"
  },
  {
    "id": "do75zfw",
    "parent_id": "t1_do7436v",
    "subreddit_name_prefixed": "r/news",
    "body": "What happened? (Google is focused on the munchkins) ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1507715046.0,
    "date_created": "2017-10-10",
    "time_created": "21:44:06",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7do5h",
    "parent_id": "t1_do7cwre",
    "subreddit_name_prefixed": "r/news",
    "body": "Plus typically if even just one person intervenes it can get a lot more people involved in a meaningful way.   You're paying it forward big time 😀",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1507725062.0,
    "date_created": "2017-10-11",
    "time_created": "00:31:02",
    "submission_id": "news-75k317"
  },
  {
    "id": "do7dl4o",
    "parent_id": "t1_do7bjm6",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1507724923.0,
    "date_created": "2017-10-11",
    "time_created": "00:28:43",
    "submission_id": "news-75k317"
  },
  {
    "id": "do73fqv",
    "parent_id": "t1_do71vdy",
    "subreddit_name_prefixed": "r/news",
    "body": "He also rubbed his eyes with his hands halfway through, that probably contributed to him yelling like a Terry Crews.",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1507712067.0,
    "date_created": "2017-10-10",
    "time_created": "20:54:27",
    "submission_id": "news-75k317"
  },
  {
    "id": "do73srd",
    "parent_id": "t1_do71vdy",
    "subreddit_name_prefixed": "r/news",
    "body": "Da Bomb is the best for achieving that delirious euphoria state. I have a bottle of every sauce on the show except for the newest one, and Da Bomb is actually my favorite. It doesn't kick as hard as mega death initially, but it lingers for like 45 min whereas the others are done doing damage after 15 min or so. That sauce is just awesome.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1507712488.0,
    "date_created": "2017-10-10",
    "time_created": "21:01:28",
    "submission_id": "news-75k317"
  },
  {
    "id": "do73twp",
    "parent_id": "t1_do73m7m",
    "subreddit_name_prefixed": "r/news",
    "body": "1 in 5 girls and 1 in 20 boys is a victim of child sexual abuse. Culprits are almost always family members, neighbors, or adults who supervise them.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1507712524.0,
    "date_created": "2017-10-10",
    "time_created": "21:02:04",
    "submission_id": "news-75k317"
  }
]