[
  {
    "id": "dkhipo6",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "Just read his wiki page and his childhood was pretty dark. His father was a police detective that specialized in child sex abuse cases and Chester was abused from age 7 to 13 by an older male. RIP Chester. May you finally find peace. ",
    "controversiality": 0,
    "ups": 12743,
    "downs": 0,
    "score": 12743,
    "created": 1500604390.0,
    "date_created": "2017-07-20",
    "time_created": "14:33:10",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhp8fi",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "Learning about this really hit me in the gut. \n\nI'm 30 years old now and I got into Linkin Park when I was just a freshman back in highschool in 2000. I had a very rough childhood because I have a scar that disfigures part of my face, I was teased for much of my life and I was always the 'odd' kid. Highschool made it all worse and I didn't have anyone to really...fall back on. I came from a poor family, my mom was a drug addict, my dad fell back into alcoholism when my nanny (his mother) died. I didn't have very many friends. All I had were my books. I was really struggling and I had a few acquiescence I had made with some goth and punk kids. \n\n\nWell, one day, one of them I'd say I was friends with came to me and gave me this beat up discman. It was blue and silver and covered in stickers. They also gave me a burned copy of Hybrid Theory and told me \"you should really listen to this\". I did and like...I just remember having this intense, tingling feeling rush through me. For as much as people make fun of linkin park's lyrics these days, to someone in that mind state it really...speaks to them. \n\n\nAs I listened to the songs I realized everything they sung about was what I was going through and that meant there were people out there who did understand. They understood, they made it through and now here they are, singing about it. That revelation stopped me from ending my life.\n\n\nOne of their songs asks \"What am I leaving when i'm done here?\". I wish more than anything I would have been able to tell Chester and the rest of the band that atleast ONE thing, of many, they left was a young girl who found a way to fight through their depression and keep going forward.\n\nEdit: Oh wow, I didn't expect this comment to get the attention it did. What a surprising thing to come home to. Thank you so very much to everyone who has liked this, commented on this, and to the wonderful user who gave me my first ever reddit gold. The messages I've received for having shared this bit of my past have truly been uplifting and I am so glad there are so many great people supporting each other here. \n\nEdit2: I'm truly beyond words. Thank you so much for the great things you've said. I'm trying to respond to everyone who has commented or messaged me but that's a bit of a larger task than I can manage at the moment. You are all so very wonderful for showing how much you care and supporting your fellow fans. ",
    "controversiality": 0,
    "ups": 2865,
    "downs": 0,
    "score": 2865,
    "created": 1500610992.0,
    "date_created": "2017-07-20",
    "time_created": "16:23:12",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhi5ey",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "Wow, and to think he wrote this letter to Chris Cornell after his suicide.  It's crazy to see how well people with depression can just hide it from everybody.  \n\nRIP Chester. You will be missed.\n\nhttps://twitter.com/ChesterBe/status/865227703091208192/photo/1",
    "controversiality": 0,
    "ups": 4796,
    "downs": 0,
    "score": 4796,
    "created": 1500603831.0,
    "date_created": "2017-07-20",
    "time_created": "14:23:51",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhpo00",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "I cried for the first time in years after hearing about his death. Hybrid Theory and Meteora carried me through some dark times in my youth. \n\nThe one lasting memory is putting Meteora in my mini hifi and writing a suicide note to my parents, telling them to play Breaking the Habit and Numb to understand why I killed myself. \n\nI put Breaking the Habit on and lay in the bath with a big, sharp knife in my hand. I started singing the lyrics to myself and decided to wait until the song was done to cut myself. \n\nAt that moment, halfway through the song my dad knocked on the door. He never came to my cottage (in my parents' backyard). He came in and asked me if something was bothering me and that I should talk to them. He didn't know what I was about to do. So we sat and listened to the album as I talked to him.\n\nRIP Chester, and thanks for everything you meant to me.  ",
    "controversiality": 0,
    "ups": 993,
    "downs": 0,
    "score": 993,
    "created": 1500611445.0,
    "date_created": "2017-07-20",
    "time_created": "16:30:45",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhj34h",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "Damn :(.\n\nI remember when youtube was 95% dbz linkin park amvs.\n\nEdit: Damn I really hoped it was not true when I first read the news. They got a lot of hate but LP is one of the bands that got me and many others into rock, and kept on bringing great music for many years. \n\nRest in peace.",
    "controversiality": 0,
    "ups": 13553,
    "downs": 0,
    "score": 13553,
    "created": 1500604758.0,
    "date_created": "2017-07-20",
    "time_created": "14:39:18",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhic92",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "Hybrid Theory was the first album that got me into that sort of music. I fell in love with it and it stuck with me the rest of my life. Fuck this sucks... ",
    "controversiality": 0,
    "ups": 9367,
    "downs": 0,
    "score": 9367,
    "created": 1500604020.0,
    "date_created": "2017-07-20",
    "time_created": "14:27:00",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhnugv",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "When my time comes,\n\nForget the wrong that I've done.\n\nHelp me leave behind some reasons to be missed\n\nAnd don't resent me\n\nAnd when you're feeling empty,\n\nKeep me in your memory,\n\nLeave out all the rest.\n",
    "controversiality": 0,
    "ups": 4699,
    "downs": 0,
    "score": 4699,
    "created": 1500609558.0,
    "date_created": "2017-07-20",
    "time_created": "15:59:18",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhk7ls",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "toured with him when LP were on the 2001 Ozzfest. \n\nhe was was nothing but affable and nice and quick with the puns. \n\nhe was on my bus a few times, shot the shit about dumb shit like movies (i had just bought the kubrick dvd boxset) and video games. \n\nhe knew his band was being mocked on that tour by the veterans and some fans. he didn’t care. paying your bills by performing music is a dream to anyone. \n\nwe all have our demons. artists, musicians et al. \n\nit’s outpacing them and acknowledging when you need help. \n\nwishing the best to his family now. \n",
    "controversiality": 0,
    "ups": 12041,
    "downs": 0,
    "score": 12041,
    "created": 1500605874.0,
    "date_created": "2017-07-20",
    "time_created": "14:57:54",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhouy7",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "I was a 14 year old boy from Pakistan when I first listened to Hybrid Theory on cassette. I couldn't understand half of what they were saying, I couldn't understand any of the feelings they were trying to express. \"In the end\" was catchy as hell and so I persisted with the album. I would try to sing along and sing aloud, I would try to scream like Chester, I would try to rap like Mike. I'm now a 30 year old who lives in Atlanta, GA. I'm fluent in English only because I tried to impersonate Chester. His music is what I used as a springboard into American culture. This one hurts. \n\n&nbsp;\n\nEDIT: Whoa. I don't Reddit frequently so coming back to gold and all this love was unexpected. Thank you all for sharing your stories, this just goes to show that the human experience is so similar throughout. \n\n&nbsp;\n\nEven though it's coming very late, I'd like take this edit as an opportunity to showcase the struggles of keeping up with Linkin Park as a fan from the third world. My 56k dial-up internet was so bad that I had to download 96 kbps versions of MP3s because any larger file just wouldn't finish downloading. When I first found Kazaa, I would see all these \"New Linkin Park\" songs and after hours of downloading, it'd turn out to be Adema or Taproot or something. I fell for it over and over again. Back then you had to pay for internet by the hour, so imagine how thrilled my older sisters were when they found out that I used all of our internet hours trying to download the music video for 'In The End.' Thankfully it was the real deal and not one of those DBZ fan clips.",
    "controversiality": 0,
    "ups": 10671,
    "downs": 0,
    "score": 10671,
    "created": 1500610607.0,
    "date_created": "2017-07-20",
    "time_created": "16:16:47",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhhxhz",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "Man this is one of the first rock stars of a band I listened to growing up has died and I am pretty fucking bummed right now",
    "controversiality": 0,
    "ups": 7680,
    "downs": 0,
    "score": 7680,
    "created": 1500603610.0,
    "date_created": "2017-07-20",
    "time_created": "14:20:10",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhk1di",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "Linkin Park will never know how much they helped me when I was younger and I was going through very shitty times. I still remember crying and falling asleep while listening to Meteora. Fuck.\n\nDepression claims another victim, and we're still not taking mental health as seriously as we should.",
    "controversiality": 0,
    "ups": 1074,
    "downs": 0,
    "score": 1074,
    "created": 1500605702.0,
    "date_created": "2017-07-20",
    "time_created": "14:55:02",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhr3fc",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "I didn't realize they had put an album out this year. Upon hearing this news I downloaded it.\n\nI just listened to it all the way through.\n\nThe title track is fucking heartbreaking, as is most of the album in hindsight. I mean, all you have to do is look at the track list.\n\nBut the title track *One More Light* has now been granted the most literal context it could. Holy fuck...\n\nThis may be the saddest song I have ever listened too. I wish I had heard it before this happened.\n\nI wonder when most of this album was written... I don't know if I should recommend anyone listen to this or not. It *will* make you feel some type of way.\n\n*\"Who cares if one more light goes out in the sky of a million stars? (it flickers, flickers)\nWho cares when someone's time runs out if a moment is all we are? (or quicker? quicker?)\nWho cares if one more light goes out?\nWell I do\"*\n",
    "controversiality": 0,
    "ups": 121,
    "downs": 0,
    "score": 121,
    "created": 1500612961.0,
    "date_created": "2017-07-20",
    "time_created": "16:56:01",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhhto0",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "That's awful. He had 6 kids who now lost their dad. Suicide is so horrible for all parts",
    "controversiality": 0,
    "ups": 2788,
    "downs": 0,
    "score": 2788,
    "created": 1500603503.0,
    "date_created": "2017-07-20",
    "time_created": "14:18:23",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhi7iy",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "2 Wives and 6 Kids.\n\nYou really have to feel for them. Big loss for music, but even a bigger loss for his family members and friends\n\nEdit: to clarify 2 different wives, not at the same time",
    "controversiality": 0,
    "ups": 13609,
    "downs": 0,
    "score": 13609,
    "created": 1500603887.0,
    "date_created": "2017-07-20",
    "time_created": "14:24:47",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhhpwm",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "Reports say him and Chris Cornell were really close, today would've been Chris' 53rd birthday... this is so sad",
    "controversiality": 0,
    "ups": 16130,
    "downs": 0,
    "score": 16130,
    "created": 1500603396.0,
    "date_created": "2017-07-20",
    "time_created": "14:16:36",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhke3o",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "I usually just lurk on Reddit but I feel I have to share this somewhere.\n\nWhen I was 15 I was in a bad place.  I was suicidal, I had a noose made, goodbye notes written; ready to go.  Around the same time, Linkin Park's 'A Thousand Suns' came out, featuring songs like 'Waiting For The End' and 'The Catalyst' that really spoke to me.  The inner booklet [described how the album was a study of human emotion, and how 'change is born in our most harrowing moments'](http://1.bp.blogspot.com/_YJM766qf5ps/TN68YEQwZ7I/AAAAAAAAMRM/8mE_31RQNI0/s1600/Booklet-2.jpg), and for the first time in a long time my perspective on my situation began to change.  It helped, not all the way, but it helped.  It made me reconsider what I was about to do, and for that, I am forever in debt to Linkin Park.  \n\nRIP Chester, thank you for the part you played in getting me through my darkest days.",
    "controversiality": 0,
    "ups": 6588,
    "downs": 0,
    "score": 6588,
    "created": 1500606056.0,
    "date_created": "2017-07-20",
    "time_created": "15:00:56",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhik54",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "first time in my life i am truely shocked by a celebrities death. i just saw them last month live. and now he's gone.",
    "controversiality": 0,
    "ups": 7959,
    "downs": 0,
    "score": 7959,
    "created": 1500604238.0,
    "date_created": "2017-07-20",
    "time_created": "14:30:38",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhi8sw",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "Oh wow, this one hurts. Since I'm 21, I've never really had that \"childhood\" connection with a majority of the recently deceased celebrities but this one hurts. Linkin Park was a huge part of my childhood as I'm sure it was for alot of other people my age. RIP Chester.",
    "controversiality": 0,
    "ups": 5373,
    "downs": 0,
    "score": 5373,
    "created": 1500603922.0,
    "date_created": "2017-07-20",
    "time_created": "14:25:22",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhojkn",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "I met Linkin Park in early 2001, when their tour came to my town. My local radio station had a meet-&-greet at a Blockbuster Music and barely anyone had heard of them. The rock station in town was **not** liked at all, in fact shut down in 2002 for being \"too vulgar\" playing heavy metal music, and not many people listened to it at all. \n\nAnyway, all of 10 people showed up to the meet-&-greet at the record store. I remember seeing a young guy with green hair come out of an SUV and we didn't even know what Linkin Park looked like really. No one clapped, no one really noticed until they went in and sat down. They had their CD, Hybrid Theory up for sale for $4.99 and they would sign it for free. Didn't want to buy it, but the radio station gave me a license plate for them to sign.\n\nI got to talk to Chester at the event a little bit, and he seemed like a really nice guy and was SUPER excited to have even 10 people show up for him. He shook all of our hands and him and Mike Shinoda were really gracious guys - the whole band was really. They were still SUPER new and being on a nationwide tour with P.O.D. was just a lot for them to process. I'll never forget meeting them, I still remember it fondly 16 years later. I've always been a fan, I even bought their songs for Rock Band 3 and bought the keyboard that goes with so I could play the Pro Keys for it, which was somewhat like actually playing the song. \n\nTo my wife, she was going through stage 4 breast cancer in 2001 (we didn't know each other at the time) and she was given 3 months to live. She struggled though, but she thought it was the end for her. The music of Linkin Park's first album, especially \"In The End\" was what got her through her Chemo and radiation therapy and she's now 16 years cancer-free. She is beyond words right now, I wish I wasn't stuck at work right now.\n\nRIP Chester.",
    "controversiality": 0,
    "ups": 654,
    "downs": 0,
    "score": 654,
    "created": 1500610281.0,
    "date_created": "2017-07-20",
    "time_created": "16:11:21",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhvmvb",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm Asian, so I never talk about my feelings because it's a bad holdover from how I was raised.\n\nWhen I was younger, I was walled in by strict christian Asian parents who dictated my life. I was only to have christian friends. I was to win at everything. A loss, to them, was only possible if I did not have faith in god and was therefore a wicked child who didn't try hard enough. If god could part the red sea, surely I could become the national champion in six different things at once. I became the state chess, debate and science fair champion, made it to all state in violin, and one tier below the professional orchestra at NEC. They didn't even go to my state debate champion awards ceremony. I remember standing alone outside waiting to be picked up while the second and even fifth place winners walked out with their happy parents. I cried, and when my father took me home he beat me for crying. I got straight As, I got a perfect score on the PSAT and a 2360 on the SAT. I took every single AP class at once and even took all of Harvard's undergraduate curriculum for biology while still in high school. It didn't matter. Nothing was ever good enough for them. Success wasn't to be rewarded. It was expected. The only time my father ever told me he was proud of me was when I got into caltech, which was immediately followed by his profound disappointment that I did not get into Harvard. I was only allowed to listen to classical music and was not allowed to hang out with other kids except christian kids and only on special occasions during christian potlucks. We only wore khaki pants and polo shirts, with the pants pulled up very high so we didn't look like \"gangsters with saggy jeans\". Dating was forbidden, and any sexual confusion was just ignored and treated like a mysterious evil curse. \n\nBecause my grandfather was both a pastor and military policeman with old ROC values, my father was just as strict and frugal. We had descended from the \"Dragon\" family line of generals stretching far back into history. We were to assemble at attention in a line instantly when called within 10 seconds or be beaten. No heat on the coldest nights and no air conditioning on the hottest days. Showers should only take 1 minute. We were not allowed to have food preferences. All food had been graciously provided by god, they said. He would buy clothes too big for us meant to last ten years. No TV. No celebrations on sinful american holidays. We were to forgo earthly needs, because \"man did not live on bread alone.\" Often, dinner consisted of a $1 hot dog wrapped in a kraft cheese single with one piece of white bread and a slice of lettuce. We ate rice gruel often. To this day I have a preference for super cheap food, like eating plain rice with just soy sauce and sesame oil. Because he didn't believe in women's rights or birth control, my mother kept having children. I had 4 other siblings. This made us very poor. Sometimes all we had to eat were saltines and condiments that we took from the free section of wendy's. We lived in a barn infested with bugs and were the poorest kids in town. I remember one time I asked my mother if we could give a friend a ride two blocks down and she screamed at me and then broke down in tears, saying we were running out of gas for the month and that my dad had to get to work. When things finally did get better, my dad said he would buy us an xbox if we could beat him in chess. When we beat him, he said instead that we had to win a tournament. When we finally got the console, he made us play The Bible Game on it, banned most violent games, and play DDR to exercise but only on songs that he approved of.\n\nBecause god had let the Israelites wander for 40 years as punishment until every person older than 18 died, my parents took that to mean that children weren't considered humans yet who could really make judgements they could be held accountable for. They basically thought we had no human rights of our own. My family made Tiger Mom look like Barney.\n\nBecause I had almost died when I was two months old to pneumonia, my parents had declared me a sacrifice to god, a Nazirite, if I were to survive. \"You are a priest forever, in the name of Melchizedek\", they told me. My life was not my own, because I had already died and this new life belonged to god. They named me Long Zhan in Chinese, meaning Dragon Warrior, and Genesis in english. I was to wear the armor of god and wage holy war against Satan. Ironically it basically meant my names were Genesis and Revelation, since revelation is often known as the dragon war. Which meant they named me Alpha and Omega, or god.\n\nOne day I stumbled upon a book in my father's study, where he kept his books from college. I read Nietzche's Beyond Good And Evil, thinking it was a christian book. When I finished reading it, everything changed. The things he said made too much sense for me to ignore.\n\nTHERE IS NO GOD kept flashing in my mind. I couldn't ignore it. I tried to force myself to believe in god and become christian again but it didn't work. I tried praying, but god wasn't there.\n\nI hid my new beliefs. I knew what would happen if my parents, who often told me that a wicked child should be stoned to death, found out. They often said they would rather kill me with their bare hands than raise an atheist.\n\nIt came to a head one day in middle school when I couldn't deal with a meaningless life anymore. I snuck away during worship and hid under a staircase, repeating to myself in shock \"what's the point?\"\n\nMy friend Katherine found me there. She understood. She was also dealing with hidden depression. We sat in our misery for hours. Before that moment, it seemed everyone was in paradise. That they were the dancing figures on the walls in Plato's cave that I was once a part of. It seemed all of them faced forward and that somehow I had looked backwards and found the void of nothingness behind their paradise that nobody else saw. But when I asked her what we could do, she didn't know how to answer either. We were blind leading the blind.\n\nToday I know this feeling isn't rare and that I wasn't alone. But because I was so isolated by christian rules, I didn't know of anything else in the world. I didn't know that the somber \"why bother\" of nihilism could be interpreted as the adventurous \"why not?\" I was an echo chamber of my own dark thoughts, with no-one to guide me. The only wise people were philosophers I read after Nietzche like Kant, and they were all dead. They couldn't talk to me. It was a long time before I would ever discover Nagel and Camus or the freedom of absurdism. Everyone I knew was christian. We had spent years shunning non-christians and the world outside my bubble was classified under a ubiquitous fog of war.\n\nWhen my father found me under the stairs he yelled at me for embarrassing him in the church and beat me when I got home. Slowly, they began to suspect that I was no longer christian. I remember making armor out of cardboard and wood in secret to protect against my father's blows. I remember making a runaway kit.  I remember running for my life up into the attic to keep my mother from killing me with a kitchen knife and calling the police while holding the door shut with my feet as she clawed at it. I remember fighting my father with a chair and cooking pot when he came for me with a metal bat.\n\nA friend of mine sent me the song Numb. I know that song saved me. It finally told me that someone else out there had dealt with this and come out with this beautiful song. It told me that the veneer of constant serenity of christianity I had forgotten I had even put up was a farce, that sometimes it was okay to be upset and mad and to punch a wall and let out all of these feelings instead of letting them eat me up. That it was preferable to feel anything, even bad things, instead of nothing, because then I valued the good more. The sonorific screams cut through my numbness.\n\nI remember sneaking up at 5am at night to play Morrowind to deal with stress while listening to Meteora on my cd player in secret and all the candy bars I had to sell at school to buy new batteries. I remember how when I entered portal temples Easier To Run would somehow always play as the sun rose outside my window, like it was telling me someday I would be free. To this day that song still pops up in my mind unbidden every time the sun rises. I listened to that CD player until it stopped spinning. I remember how I danced to Faint and went wild so I wouldn't be ignored anymore, how I longed for Somewhere I Belong and my heart soared when the ghostly echo of \"heal\" sounded. I remember being inspired to draw gothic art of monsters by Papercut, and how my mother poured oil on it and threw it in the trash. Years later when my sister took art lessons, I snuck something I drew to her teacher. He told me I had more talent than my sister did, said it to my mother's face. And my sister won the congressional national competition and her art is hanging in capitol hill. He made my sister use my other art pieces as the basis for her next few pieces, that I had given to my friend Annette in a folder so that it wouldn't be found in my house.\n\nToday, I'm a scientist and a breakdancer with zero signs of depression. I pushed through despite my parents not supporting my desire to be a biologist because they didn't believe in evolution, or thinking that breakdancing was just something that homeless black gangsters did while rolling around dirty floors. I taught myself bioinformatics in the kitchen, did research by hand that others did on computers or in the lab. I learned to do dangerous moves on concrete. Linkin Park saved my life. I have never cared for celebrity news before but somehow I am genuinely sad at Chester's passing because this man who saved me had no one to save him and I feel almost guilty.",
    "controversiality": 0,
    "ups": 576,
    "downs": 0,
    "score": 576,
    "created": 1500618154.0,
    "date_created": "2017-07-20",
    "time_created": "18:22:34",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhj49l",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "Everyone's fighting a battle you know nothing about. ",
    "controversiality": 0,
    "ups": 1312,
    "downs": 0,
    "score": 1312,
    "created": 1500604789.0,
    "date_created": "2017-07-20",
    "time_created": "14:39:49",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhisib",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm friends with his son, we go to University together. He's headed out to California now. I don't even know what I could possibly say to him right now. ",
    "controversiality": 0,
    "ups": 1919,
    "downs": 0,
    "score": 1919,
    "created": 1500604469.0,
    "date_created": "2017-07-20",
    "time_created": "14:34:29",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkpyy",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "If you are in your late 20s, Linkin Park is part of the soundtrack of your youth.  I hope he knew.",
    "controversiality": 0,
    "ups": 2495,
    "downs": 0,
    "score": 2495,
    "created": 1500606393.0,
    "date_created": "2017-07-20",
    "time_created": "15:06:33",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhhva4",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "Man his music got me through high school.. fuck",
    "controversiality": 0,
    "ups": 7513,
    "downs": 0,
    "score": 7513,
    "created": 1500603549.0,
    "date_created": "2017-07-20",
    "time_created": "14:19:09",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhni9s",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "In October 2001 my fiancé died from a drug overdose/suicide. I hurt so bad that it took all I had not to join him. I can remember listening to Hybrid Theory every day while driving to work. Their music made me understand why my fiancé had took his life. Their music actually kept me from losing what little mind I had left.. Chester was in so much pain and his music expressed a dark world that I'm so familiar with. I hope my fiancé and Chester have found  the peace they desperately had been searching for.. I don't know why I'm sitting here crying. Chester's death is bringing up memories that I had thought time had buried. I was just a young mom back then.. Now my children are grown and I'm a grandma. Just breaks my heart. I know the hell Chester's family and friends are going thru so well. You never forget. You just suck it down until the ghost's  catch up with you in the darkness of the night..",
    "controversiality": 0,
    "ups": 448,
    "downs": 0,
    "score": 448,
    "created": 1500609216.0,
    "date_created": "2017-07-20",
    "time_created": "15:53:36",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhl63d",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "M. Shinoda Confirmed on Twitter:\n\nhttps://twitter.com/mikeshinoda/status/888112045190561793\n\nedit: [screenshot](https://i.imgur.com/ALbBlN0.png) in case you can't view tweet",
    "controversiality": 0,
    "ups": 615,
    "downs": 0,
    "score": 615,
    "created": 1500606848.0,
    "date_created": "2017-07-20",
    "time_created": "15:14:08",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhhtai",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "This is insane. No one had a bigger impact on me growing up with music than Linkin Park. \n\nOne of the best voices out there in rock/alternative. ",
    "controversiality": 0,
    "ups": 4325,
    "downs": 0,
    "score": 4325,
    "created": 1500603492.0,
    "date_created": "2017-07-20",
    "time_created": "14:18:12",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhi83m",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "For the amount of shit this band gets, that first record will always be legendary.",
    "controversiality": 0,
    "ups": 10327,
    "downs": 0,
    "score": 10327,
    "created": 1500603903.0,
    "date_created": "2017-07-20",
    "time_created": "14:25:03",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhi2zy",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "He had dealt with addiction and depression for a long time. So sad to see this happen. \n\nIf anyone has problems please seek help. ",
    "controversiality": 0,
    "ups": 483,
    "downs": 0,
    "score": 483,
    "created": 1500603764.0,
    "date_created": "2017-07-20",
    "time_created": "14:22:44",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhoo47",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "This is...really sad.  This post is kind of a mess because I was trying to find information about this show while I wrote it and I kept going back and adding information.  Sorry about that.\n\nSo, I met these guys right before the release of Hybrid Theory.  They were an opening act...\n\n...I can't think of who the headliner was though...Found it!  Looks like I was there to see Twiztid and Kottonmouth Kings - no wonder I couldn't really remember that part of the show.  I was going though a juggalo phase, think of that what you will.  Oh yeah, ReHab was there and at that time they were this corny rap group who actually had strippers that toured with them.  Same songs, but they sounded completely different.\n\nRight - they were opening that tour (I don't think anyone was there to see them, in fact) at a little club in Winston Salem, NC:  Ziggy's.  It's closed now but they used to have some amazing shows.  I saw acts from Hank Williams III to Deftones to Weezer to ICP there, it was a really kind of \"close\" space - just about anywhere you were, it felt like you could reach out and touch the people on stage.\n\n...or at least get fully doused in Faygo\n\nAnyway, their show - this would have been around mid-to-late 1999 (found it!  Looking through setlist.fm - it was September 18th, 2000) was just amazing, partly because of the venue but largely because of their performance.\n\nThere couldn't have been more than a couple of dozen people in the place for their show, but it was probably one of the tightest live performances I've *ever* seen - and I've helped run sound for acts like MDC, Jucifer, Skeleton Witch, and plenty of others - not to mention the shows I've attended as an audience member.\n\nThe guitar player wore headphones.  I've never seen anyone else do that.  The \"DJ\" didn't just do the record-scratching that it seemed all other rap-rock-metal-alternative-Bizkit-bands did around then.  He was live-sampling and mixing the levels of the other members on stage.  The synergy between them was on another level.  The live sound was pretty much album-quality, but it was right *there*...\n\nI told them as much after the show.  They were humble, gracious, and extremely nice.  I told them straight up:  You guys are going to be selling out arenas before too much longer.  I'm paraphrasing here, but Chester said something like \"that would be amazing, but I don't really think so.  We've been doing this kind of thing for a while now and we just love going around and playing for people who are into the music.\"  It seemed like they weren't thinking \"what does the radio want, how can we sell a hundred million records?\" - they were more like \"this is what we sound like when we do what we love, enjoy it with us.\n\nChester and Mike signed two demo tapes for me.  I've still got them.  Besides tshirts, posters, and other random merch that I've been given by bands who I've booked or done stage work for, I don't really have any other \"memorabilia\" - just those two tapes.  I stopped paying attention to them well over a decade ago.  I just wasn't into the sound anymore, to be honest - tastes change.  I still think the first record is brilliant, and the second record is pretty great too - those songs will always remind me of my early years in the Marines.  Someone was almost always blasting one of those CDs during field day.\n\nI mopped so many floors to those tracks.\n\nI wish he hadn't gone so soon.  He was full of music, and poetry.  Maybe it was a bit on-the-nose, a bit too much angst...too much anger, resentment, and other vague but passionate feelings towards an undefined \"you.\"  Some might say that's simplistic, formulaic - but it allows for the listener to place themselves in the narrative of the song, and recognize the things that they're feeling - and know by extension that they're not alone.  As an angsty young guy with too many hormones and too little life experience, it was very therapeutic sometimes to just turn the volume up and scream along.  I know I'm not alone in this either - I've seen you doing the same thing when I drive by you in traffic, don't try to deny it.\n\nIt's just a shame that the man who wrote those words couldn't find the same solace in them that they conveyed to so many others.\n\nI could close this out with almost any couple of lines from one of their songs, but I don't want to pick just one.  So go hit up YouTube, dig deep into your mp3 library, or even dust off an old CD and play a song or two for yourself...and enjoy the music.  That's what he told me was most important, and I think that's the kind of farewell he would have wanted.",
    "controversiality": 0,
    "ups": 129,
    "downs": 0,
    "score": 129,
    "created": 1500610409.0,
    "date_created": "2017-07-20",
    "time_created": "16:13:29",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhj31r",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "What's sad is Chester was lashing out at fans a couple months ago, because fans hated their new album for being over produced pop. He was angry at being called a sell out and was confrontational. He seemed genuinely angry and was lashing out constantly. A redditor below said that in recent shows, fans would throw bottles at them when they played their new singles.\n\nThen his best friend Chris Cornell dies, and it's his birthday today. I wonder if it was all too much for him. Since he took his life the same way Chris did, and on his birthday.\n\nAs someone that did not like their new album, I feel fuckin awful. I know I wasn't an asshole about it, and I have a right to be critical. But as someone that grew up with their music (Hybrid theory and Meteora were huge in middle school) - I can't help but feel awful.\n\n**EDIT:**\n\nI apologize if I opened up a debate about criticism. This is a touchy subject given Chester just died. But to be clear, I'm only talking about myself on a personal level in my post.\n\nI didn't mean to make others feel guilty for not liking an album. It's perfectly okay to not like art and to even be critical of it. I think we all know the difference between being critical - and being an asshole. Attacking him and yelling he's a sell out on twitter - because he made music you didn't like - that is not valid criticism. That is malicious. That isn't the same as not liking an album, and being critical.\n\nI'm sorry if I pushed this conversation into another direction. I've been crying non stop, and I can't help but feel a lot of emotions. I personally feel guilt - but it's not rational. It's just a personal thing I'm feeling. I didn't mean for others to feel that.\n\nI also wanted to say that, we fans (regardless if you hated some of their work) - should be supporting each other and not taking out our emotions on each other. At the end of the day, we all loved a piece of who they are. We all loved what Chester could create. It doesn't matter if we all don't love the same things.\n\n*hugs*\n\nI love you guys \n\nI'm sorry.\n\n\n\n",
    "controversiality": 0,
    "ups": 2405,
    "downs": 0,
    "score": 2405,
    "created": 1500604756.0,
    "date_created": "2017-07-20",
    "time_created": "14:39:16",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkfal",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "Time is a valuable thing\n\nWatch it fly by as the pendulum swings\n\nWatch it count down to the end of the day\n\nThe clock ticks life away\n\nIt's so unreal",
    "controversiality": 0,
    "ups": 893,
    "downs": 0,
    "score": 893,
    "created": 1500606090.0,
    "date_created": "2017-07-20",
    "time_created": "15:01:30",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhi0xg",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "I didn't know the death of a singer could hit me so hard, I grew up listening to linkin park..man",
    "controversiality": 0,
    "ups": 672,
    "downs": 0,
    "score": 672,
    "created": 1500603706.0,
    "date_created": "2017-07-20",
    "time_created": "14:21:46",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkj63",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "I've struggled with depression since I was not even a teenager. When I was 13, Hybrid Theory came out, and it was the first album I ever bought with my own money. I was living in podunk East Texas, didn't fit in, and had caught one of their songs on the satellite music channel...I played that album constantly - until Reanimation came out, and I played that instead. Within a couple of years, I had mostly moved away from that sound, but I've never lost an appreciation for LP. They play music that's easy to identify with and I love that they didn't stick to their original sound. I always felt a gratitude to them (Chester and Mike), for saying the things I felt. Thanks for your help, Chester, and for your voice. Rest in peace.",
    "controversiality": 0,
    "ups": 63,
    "downs": 0,
    "score": 63,
    "created": 1500606201.0,
    "date_created": "2017-07-20",
    "time_created": "15:03:21",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhq0zf",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "Delivered pizzas to his house a few times. Super nice guy. \n",
    "controversiality": 0,
    "ups": 125,
    "downs": 0,
    "score": 125,
    "created": 1500611824.0,
    "date_created": "2017-07-20",
    "time_created": "16:37:04",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhl0x7",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "Many of these comments are what makes reddit so great. People from all over sharing stories and a sadness together. \n\nMakes the world a little less lonely and a little more hopeful.",
    "controversiality": 0,
    "ups": 402,
    "downs": 0,
    "score": 402,
    "created": 1500606704.0,
    "date_created": "2017-07-20",
    "time_created": "15:11:44",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhig42",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "I remember before my first day of Secondary School in 2003 I flicked on Kerrang and the second music video on was Somewhere I Belong  and I said to my dad how I liked the song. I then got home to find he'd went to HMV and bought me Meteora on CD and it became one of the first rock records I truly listened to over and over. Super important record for me and this is really gutting :(",
    "controversiality": 0,
    "ups": 276,
    "downs": 0,
    "score": 276,
    "created": 1500604127.0,
    "date_created": "2017-07-20",
    "time_created": "14:28:47",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhi0kj",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "Wow. One of my favorite bands growing up. RIP Chester. Time to go listen to some Linkin Park",
    "controversiality": 0,
    "ups": 465,
    "downs": 0,
    "score": 465,
    "created": 1500603696.0,
    "date_created": "2017-07-20",
    "time_created": "14:21:36",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhr91u",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm late to the comments and I know this will likely not be read by  many people. Still...it's cathartic to write it.\n\nI'm a 51 year old woman, mother of 2 grown kids. 5 years of recovery, after 10 years of active alcohol and opiate addiction, which I am so far surviving. Music has always played a huge role in my life, but never more than when I was first in recovery. I listened to Linkin Park SO MUCH early on, because both the words and Chester's expression of them totally represented all the anger, confusion, conflict, hopelessness AND hope that I felt. Faint, Numb, Somewhere I Belong, Breaking the Habit, Crawling, Runaway...Oh, man. Knowing that he had his own battle with addiction is one of the things that made him so authentic. I will be forever grateful for the role he played/plays in my recovery. I wish him peace as he begins this next chapter of his journey. \n\nNamaste, brother.",
    "controversiality": 0,
    "ups": 89,
    "downs": 0,
    "score": 89,
    "created": 1500613130.0,
    "date_created": "2017-07-20",
    "time_created": "16:58:50",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhknhj",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "When I was 13 (in 2013) I was relentlessly bullied, abused and I had a dysfunctional family. The only thing that I enjoyed was Linkin Park. I listened to their music for hours on hours. I have each on of their tracks. Even the demos. Linkin Park helped me get through some rough times. I remember feeling so connected with Crawling, One Step Closer etc. For two straight years I listened to only Linkin Park. Yes it was kiddish, but it helped me through so much. I cant believe that I am crying. \n\nLP got me into music. The guitar I use is a PRS, because Brad used it. \n\nWhat really made LP different? I am going to say Chester. He poured his heart into singing. The guy has been thorough so much. Every single lyric he sang had some sort of angst, and he conveyed it so well.\n\nHas anyone heard of 'Breaking the Habit\"? Chester couldnt sing that song for a year after it was released because it was so personal. \n\nHe was my Idol. I never got too see LP live, but I will be youtubing every concert I can find.\n\nRIP Chester. You helped me, and so many of us get through the tough times, and we hope you are in a better place.",
    "controversiality": 0,
    "ups": 291,
    "downs": 0,
    "score": 291,
    "created": 1500606323.0,
    "date_created": "2017-07-20",
    "time_created": "15:05:23",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkpz6",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "My father committed suicide very unexpectedly 16 years ago. As much as people will say this is selfish, it's not about that. People in the depths of sadness truly believe their loved ones will be better off. I'm here to say to anyone thinking this is the answer, I promise, your loved ones are not better off. It's an illness and you can get help. You can get better. It's nothing to be ashamed of. ",
    "controversiality": 0,
    "ups": 223,
    "downs": 0,
    "score": 223,
    "created": 1500606393.0,
    "date_created": "2017-07-20",
    "time_created": "15:06:33",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhi6p5",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "This shit hit so hard.  Linkin Park got me through middle/high school.  RIP. ",
    "controversiality": 0,
    "ups": 246,
    "downs": 0,
    "score": 246,
    "created": 1500603865.0,
    "date_created": "2017-07-20",
    "time_created": "14:24:25",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjkg6",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "The rising suicide rate among middle-aged men is a silent health crisis.\n\nhttp://health.usnews.com/wellness/mind/articles/2016-10-19/why-suicide-keeps-rising-for-middle-aged-men",
    "controversiality": 0,
    "ups": 320,
    "downs": 0,
    "score": 320,
    "created": 1500605233.0,
    "date_created": "2017-07-20",
    "time_created": "14:47:13",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhnoyf",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "This will get buried, but I wanted to share my memory of LP. I remember when their first album was coming out. They were playing a commercial for it on TV with clips of One Step Closer's music video. It was one of the first times I was really introduced to nu-metal that I liked and I remember being so excited about the album coming out. I bought it day one and listened to it over and over again. That blossomed into my adoration of all different genres of metal, which got me into playing musical instruments. Playing music gave me a greater respect for the talent that goes into ALL genres of music and really broadened my horizon for what I listen to. I don't know if that would have all happened without Linkin Park. Yet another sad day for music. My thoughts go out to his family.",
    "controversiality": 0,
    "ups": 177,
    "downs": 0,
    "score": 177,
    "created": 1500609403.0,
    "date_created": "2017-07-20",
    "time_created": "15:56:43",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhihri",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "Wow, that's incredibly sad... My boyfriend and I were so excited to see him next Friday at Citi Field... Like everyone else, we grew up listening to Linkin Park..\n\nRest in Peace, Chester.",
    "controversiality": 0,
    "ups": 289,
    "downs": 0,
    "score": 289,
    "created": 1500604172.0,
    "date_created": "2017-07-20",
    "time_created": "14:29:32",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhn01g",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "\"And the shadow of the day will embrace the world in gray, and the sun will set for you..\"",
    "controversiality": 0,
    "ups": 79,
    "downs": 0,
    "score": 79,
    "created": 1500608697.0,
    "date_created": "2017-07-20",
    "time_created": "15:44:57",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhik1e",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "Holy shit, his voice was a huge part of my childhood. So sad ",
    "controversiality": 0,
    "ups": 174,
    "downs": 0,
    "score": 174,
    "created": 1500604235.0,
    "date_created": "2017-07-20",
    "time_created": "14:30:35",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhiq8s",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "So sad. I used to think artists who killed themselves were being selfish. Then someone explained to me when someone kills themselves, they are fleeing a burning building.  \n\n\nEdit: Wow, thank you kind fellow redditor for my first gold! ",
    "controversiality": 0,
    "ups": 2062,
    "downs": 0,
    "score": 2062,
    "created": 1500604406.0,
    "date_created": "2017-07-20",
    "time_created": "14:33:26",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjl2a",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "Man I was just listening to meteora this week.\n\nI wish i had words for what this band meant to me when i was growing up. I wish he knew what they meant to me and all my friends and how they shaped our love of rock music. \n\nFuck this really hurts.",
    "controversiality": 0,
    "ups": 129,
    "downs": 0,
    "score": 129,
    "created": 1500605250.0,
    "date_created": "2017-07-20",
    "time_created": "14:47:30",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhilsz",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "RIP to the man who made all our teenage years that much better. I'm so shocked by this, I feel like I might cry but I don't want to let it be that real. I should just put on Hybrid Theory and hope this is all fake news for once. ",
    "controversiality": 0,
    "ups": 305,
    "downs": 0,
    "score": 305,
    "created": 1500604283.0,
    "date_created": "2017-07-20",
    "time_created": "14:31:23",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhm0x1",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "Chester's death is only the second time a celebrity's death has truly affected me (first being Satoru Iwata), and this is the first suicide therein. I gotta write this.\n\nHybrid Theory on CD was mine the week it came out, and Linkin Park immediately became a foundational pillar of my musical world. I was 13 at the time. Over the years, I have never lost faith in them or hated them. The only album I haven't loved is The Hunting Party. I adore every other main album of theirs for various reasons.\n\nI fucking LOVE One More Light. The band was never, ever afraid of exploring and trying new sounds. Sell outs? Nah, they morphed their music as they grew as people, and appropriately so.\n\nQuick story: my father was arrested for some real shit when I was in high school, and my family's perfect little suburban Americana life was irrevocably upended. This was soon after Meteora came out, and in my deep depression of immediate post-father-arrest, I became severely attached to the song Breaking the Habit. I would play it on repeat for days and days on my speakers, with my bedroom's door shut and locked (the key to open it always available on the door frame, of course - house rules). My poor mother was worried sick about my intentions, obviously. Back then, I wasn't even considering harming myself, but in retrospect it's completely understandable why she thought so, especially with that song. But goddamnit it helped me cope, and that song is the single most important song in my entire life, and a complete demonstration of how music can heal.\n\nWriting this post has reduced me to tears, and they aren't manly tears, they are pure tears of sadness and pain. I'll be selfish here, realizing his band mates (family of choice) and wives and children hurt so much worse, but goddamnit I lost something so special and dear to me today.\n\nI love you, Chester, thank you. I love you, Linkin Park, thank you.\n\nIn case you ask, I'd rather not talk about pops' arrest, thanks.\n\nEdit: missing word",
    "controversiality": 0,
    "ups": 61,
    "downs": 0,
    "score": 61,
    "created": 1500607710.0,
    "date_created": "2017-07-20",
    "time_created": "15:28:30",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhiwtt",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "I think this is the first celebrity death to have an impact on me.",
    "controversiality": 0,
    "ups": 233,
    "downs": 0,
    "score": 233,
    "created": 1500604587.0,
    "date_created": "2017-07-20",
    "time_created": "14:36:27",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjlbo",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "So sad. Linkin Park's music helped me to deal with depression and coming out as gay when I was a teenager, especially their song \"numb\". If I hadn't managed to deal with my depression, I might have committed suicide too. I'll always be thankful for their music.",
    "controversiality": 0,
    "ups": 122,
    "downs": 0,
    "score": 122,
    "created": 1500605257.0,
    "date_created": "2017-07-20",
    "time_created": "14:47:37",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhl80h",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "[Mike Shinoda confirmed it just now on twitter.](https://twitter.com/mikeshinoda/status/888112045190561793)",
    "controversiality": 0,
    "ups": 76,
    "downs": 0,
    "score": 76,
    "created": 1500606902.0,
    "date_created": "2017-07-20",
    "time_created": "15:15:02",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhhw6m",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "I remember them doing a duet of Hunger Strike at Projekt Revolution. Man, this year is brutal.",
    "controversiality": 0,
    "ups": 117,
    "downs": 0,
    "score": 117,
    "created": 1500603574.0,
    "date_created": "2017-07-20",
    "time_created": "14:19:34",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhhxqq",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "This really puts some of his lyrics into perspective... Like in Crawling and In the End. Old songs but I hear them a lot differently now.\n\n\"These wounds they will not heal\"\n\n\"I tried so hard and got so far but in the end it doesn't even matter\"\n\n\n\n RIP\n\nEdit:\nMore recent examples\n\nHeavy: \"Why is everything so heavy? Holding on... So much more than I can carry. I keep dragging around what's bringing me down, if I just let go, I'd be set free.\" \n\nGiven Up: \"I've given up, I'm sick of feeling... Put me out of my misery\"\n",
    "controversiality": 0,
    "ups": 966,
    "downs": 0,
    "score": 966,
    "created": 1500603617.0,
    "date_created": "2017-07-20",
    "time_created": "14:20:17",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhi86a",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "The 14-year-old me just died.",
    "controversiality": 0,
    "ups": 432,
    "downs": 0,
    "score": 432,
    "created": 1500603905.0,
    "date_created": "2017-07-20",
    "time_created": "14:25:05",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhvott",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "Went to a high school where all the cool kids wore Jordan's and I was(still am) the antithesis of a Jordan sneaker wearer.  I preferred to wear goth clothing and Linkin Park's 'Hybrid Theory' and 'Meteora' got me through all the finger pointing and ridicule. I got the news of Chester's death while I was at work and immediately broke down and I left, couldn't finish out my shift. If it wasn't for their music, I have no idea how I would have had the strength to power through all the negativity I endured for being a \"Black Rocker\". Thank you Linkin Park. Chester - you are deeply loved, missed, and appreciated. \n\n-Misfit Black Girl ",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1500618217.0,
    "date_created": "2017-07-20",
    "time_created": "18:23:37",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhi94v",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 94,
    "downs": 0,
    "score": 94,
    "created": 1500603932.0,
    "date_created": "2017-07-20",
    "time_created": "14:25:32",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkj4yha",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "A little late to this, but it's imperative to remember that while Chester Bennington's suicide is tragic, he was also a survivor of repeated sexual abuse as a child from ages 7-13. He bravely battled depression, body dysmorphia, shame, substance abuse and suicidal thoughts for nearly 30 years; and chose to channel that trauma and anger into his art - something I could certainly relate to (and admire) in my early adolescence. It was rare for \"Hybrid Theory\" to leave my CD player when I was 14/15. I felt less alone when I listened to that album. I felt understood. I skated to it. Linkin Park - along with Blink 182, NIN, and Marilyn Manson were much more the sound/a phase of my youth than Sound Garden, or Nirvana.\n\nWhen I look at Chester's life, the life of a tormented artist - who's effort was often ridiculed by people (including myself in my mid-twenties) who don't make anything other than critiques and criticisms - similar to Van Gogh, and David Foster Wallace (who also took their own lives) I am reminded of when I attempted to hang myself, in treatment, when I was nearly 26 years old - and ripped the lighting fixture out of the ceiling. I am reminded of the letter I had written my mother that stated \"I swear to God I tried\", congruent with Van Gogh's last letter to his brother, Theo - in which he wrote \"The sadness will last forever\".\n\nI think about how absolutely (for lack of a better word) *fucked* my life felt after overdosing, getting kicked out of grad school, and finding myself over 40k in debt. Stripped of the only coping mechanism (oxycontin) I had that worked at staving off the torment of just trying to survive. But when I thought I hit bottom, it started hitting back - and I know, from experience (I've broken a lot of bones), that there is no bruise like the bruise that loneliness kicks into your spine. Shame has an uncanny ability to warp/destroy any healthy perspective of ourselves, and our ability to be loved. It's like a shattered mirror. I thought that there was something inherently wrong with me - that I was broken/damaged - and that perspective dictated my behavior.\n\nA common misconception about \"why\" people chose to take their own lives is that they are \"weak\" or \"troubled\". And that couldn't be further from the truth.\n\nTo quote David Foster Wallace on the subject:\n\n> The so-called \"psychotically depressed\" person who tries to kill his/herself doesn’t do so out of quote \"hopelessness\" or any abstract conviction that life’s assets and debits do not square. And surely not because death seems suddenly appealing. The person in whom Its invisible agony reaches a certain unendurable level will kill themselves the same way a trapped person will eventually jump from the window of a burning high-rise.\n\n> Make no mistake about people who leap from burning windows. Their terror of falling from a great height is still just as great as it would be for you or me standing speculatively at the same window just checking out the view; the fear of falling remains a constant. The variable here is the other terror, the fire’s flames: when the flames get close enough, falling to death becomes the slightly less terrible of two terrors. It’s not desiring the fall; it’s terror of the flames. And yet nobody down on the sidewalk, looking up and yelling \"Don’t!\" and \"Hang on!\", can understand the jump. Not really. You’d have to have personally been trapped and felt flames to really understand a terror way beyond falling.\n\n\nHaving felt those flames - and making that choice to jump, I know (now - almost 7 years later) that it was definitively the wrong choice to make. I wasn't aware of any other option. I didn't know that if I asked for help - I wouldn't just learn how to fight those flames - people would meet me in them. I was terrified that if I was honest about how I felt, and what I thought about daily - that I'd end up in drooling in the corner of a padded room - pumped full of so many anti-psychotics that I wouldn't even respond to my own name. But what I was really afraid of was feeling the weight of everything. Of beauty, darkness, and trauma. I couldn't imagine, much less live in a world that wasn't curbed by something.\n\nThese days I'm not plagued, I still have intrusive thoughts, but I promise, it does get better. I got better because I got (and continue to get) the professional help I need(ed). I feel the weight of everything, in it's entirety, and it is more than enough. \n\nI am no longer sick, **I am infected with the tremendous excitement of living, because I believe that I have the strength to bear it. I believe that you do as well.**\n\nSo if you struggle with depression, substance abuse, and/or suicidal thoughts I want you to know you are not alone. I know that there is hope because I carry it with me. And I'm not going to yell up from the street asking you to hold on. I'll meet you in the flames every time they rise.\n\nAnd I know there is a chance that the worst day may still be coming, so let me say for the record \"I'm still going to be here, asking the world to dance - even if it keeps stepping on my holy feet\".\n\nFriend, if all we have to gain in staying is each other - My God that is plenty. My God, that is enough.\n\nThat is so, so much for the light to give.\n\nPS: Please consider giving a donation to https://www.rainn.org in Chester's Memory.",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1500687867.0,
    "date_created": "2017-07-21",
    "time_created": "13:44:27",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkiacb5",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "As a black man, born and bred in Atlanta Ga. surrounded by \"thugs\" and \"trap stars\" who's on the verge of 30 I have a lot to thank LP and Chester for.\n\nHybrid Theory was the first album I ever bought. It was the first time I truly engaged any music that wasn't rap or RnB. It was the first time I felt the urge to out myself as a \"rocker\" - the first time I ever asserted my identity. Gave me the confidence to consume diverse and disparate music and media. It was the first album that truly spoke to me and connected the dots by giving a voice to my own internal intellectual and emotion conflicts. That album is a part of the foundation of me. Chester was the voice that guided me. My modern blues man.\n\nThis is a massive loss. I only hope that he lived enough to honor whatever was in his heart.",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1500637941.0,
    "date_created": "2017-07-20",
    "time_created": "23:52:21",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhj7iy",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 74,
    "downs": 0,
    "score": 74,
    "created": 1500604878.0,
    "date_created": "2017-07-20",
    "time_created": "14:41:18",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhinjk",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "Why so much suicide, We really need to make mental health not a taboo.",
    "controversiality": 0,
    "ups": 220,
    "downs": 0,
    "score": 220,
    "created": 1500604331.0,
    "date_created": "2017-07-20",
    "time_created": "14:32:11",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkr4m",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "If you don't know how someone could do something like this and leave children behind, that's just it: you don't know. Admit you don't understand this type of illness, instead of judging. That fixes nothing. Educate yourself.\n\nAs someone who has struggled with depression for most of my life, part of me wants every single person on the planet to experience it for just one day, but I'm not that cruel.",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1500606426.0,
    "date_created": "2017-07-20",
    "time_created": "15:07:06",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhscwc",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "This is going to get buried and that's okay. \n\nI found out at work, and I listened to LP all the way home and wept. A lot of people bash on linkin park, and that's okay. But I grew up on these guys. Their music was a part of my childhood. Looking back now the lyrics were a little vague and the songs may not have been about much but at the time they allowed me to make them about me, about my middle school melodramatic nonsense that seemed so important. \n\nMetaphorically linkin park held my hand, and the hands of millions of other young adolescent kids through some dark and confusing times. The light that led us ashore from the darkness has gone out. \n\nI'm sad that one of my childhood heroes died. ",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1500614356.0,
    "date_created": "2017-07-20",
    "time_created": "17:19:16",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjluz",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "Linkin Park was the first band I ever identified with and one of the first band where I actually cared about music as more than background noise. I remember being 15 and seeing them in concert - my first ever concert. This is a sad day.\n\nRIP",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1500605272.0,
    "date_created": "2017-07-20",
    "time_created": "14:47:52",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjrfg",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "As I said on /r/popheads, there's gonna be a lot of ignorance when it comes to his death because his songs have become memes. I'm seriously shocked. RIP.\n\nFor those affected, please research your local suicide hotline (where I live in Britain, it's 116 123) and CALL IT NOW.",
    "controversiality": 0,
    "ups": 65,
    "downs": 0,
    "score": 65,
    "created": 1500605426.0,
    "date_created": "2017-07-20",
    "time_created": "14:50:26",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkpri",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "I wish this could serve as a wake up call about the state of our society--especially regarding adult men. Many of us are sad and alone and feel hopeless, and no social media likes or online multiplayer video game sessions will ever make up for the camaraderie of being relied upon and appreciated. ",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1500606387.0,
    "date_created": "2017-07-20",
    "time_created": "15:06:27",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhi2c5",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "NOOOOOOOOOOOOOO :( Linkin Park was my favorite band growing up...I loved his sound. I will miss him and his talent ",
    "controversiality": 0,
    "ups": 114,
    "downs": 0,
    "score": 114,
    "created": 1500603745.0,
    "date_created": "2017-07-20",
    "time_created": "14:22:25",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhl1vv",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "Man , they have just released a music video 3 hours ago 😭😭",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1500606731.0,
    "date_created": "2017-07-20",
    "time_created": "15:12:11",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhifbo",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "\n\nCall (1-800 273 8255) - National Suicide Prevention \n\nText (741741) - Crisis Text Line\n\nEdit: Good Lord, I just got off of work and came back to a total Shitstorm of comments calling me a Karma Whore. I keep these numbers saved in my phone for whenever someone needs them. I've given them to friends and Customers before that I knew needed someone to talk to when I couldn't be there for them.\n\nI personally haven't used the Hotline, but I have used the Text Line. I've struggled with Depression for years after I suffered physical and mental abuse at the hand of my Stepdad (ages 4 - 15. Now 25). I'm sorry if this came off as Karma Whorish, I had no intention of that. \n\nSuicide is no joke and I would never try to profit off of it, I just wanted to try and help someone who may have needed it. If anyone wants to talk to someone who has been there before, feel free to message me.",
    "controversiality": 0,
    "ups": 14156,
    "downs": 0,
    "score": 14156,
    "created": 1500604104.0,
    "date_created": "2017-07-20",
    "time_created": "14:28:24",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhik6x",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "Hybrid Theory is a masterpiece. Today sucks.",
    "controversiality": 0,
    "ups": 88,
    "downs": 0,
    "score": 88,
    "created": 1500604239.0,
    "date_created": "2017-07-20",
    "time_created": "14:30:39",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjsex",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "They shaped the music I listened to for the rest of my life. They were the first band I considered mine. Hybrid Theory is one of my top 5 albums of all time. \n\nThis one hurt. \n\nRest easy, friend. I'm sorry you couldn't find the help you needed.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1500605454.0,
    "date_created": "2017-07-20",
    "time_created": "14:50:54",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhknzp",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "Fuuuuuuuckkkkkk! This is the first real celebrity death that actually impacts me. I don't listen to the later songs but the first ones are still a big part of me. I can't belive this... How... Why!! Maaan this is insane ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1500606338.0,
    "date_created": "2017-07-20",
    "time_created": "15:05:38",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhlhg2",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "Just... fuck everything.\n\nI realize that nobody is going to see this post, but just in case, guys, if you are considering suicide, please talk to someone.  Please.  If not for yourself, for you friends, or your family, or your pets, or for your art.  Please.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1500607160.0,
    "date_created": "2017-07-20",
    "time_created": "15:19:20",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki43ut",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "I fucking hate depression, and I wish more people understood it. \n\nFuck depression, fuck you to hell. \n\nRest in peace, Chester. \n",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1500629208.0,
    "date_created": "2017-07-20",
    "time_created": "21:26:48",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhiivi",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "I didn't even listen to them that much, but it was impossible to be a kid/teenager in the mid 2000s without hearing Linkin Park everywhere. This is awful and hits me hard despite not even being a fan.",
    "controversiality": 0,
    "ups": 51,
    "downs": 0,
    "score": 51,
    "created": 1500604201.0,
    "date_created": "2017-07-20",
    "time_created": "14:30:01",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhw0yv",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "Man I've always pictured LP being the new rolling Stones, still touring in 2040.\n\nAlways wanted to see them live but never bought a ticket thinking 'there's always next time'. \n\nCrazy and shitty to think there won't actually be a next time.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1500618622.0,
    "date_created": "2017-07-20",
    "time_created": "18:30:22",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhj743",
    "parent_id": "t3_6oi3gu",
    "subreddit_name_prefixed": "r/news",
    "body": "I can't fucking do this today.",
    "controversiality": 0,
    "ups": 55,
    "downs": 0,
    "score": 55,
    "created": 1500604868.0,
    "date_created": "2017-07-20",
    "time_created": "14:41:08",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhmsya",
    "parent_id": "t1_dkhipo6",
    "subreddit_name_prefixed": "r/news",
    "body": "Never knew that :-( Childhood sex abuse is unfortunately a big risk factor for suicide. ",
    "controversiality": 0,
    "ups": 4620,
    "downs": 0,
    "score": 4620,
    "created": 1500608499.0,
    "date_created": "2017-07-20",
    "time_created": "15:41:39",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhmzoe",
    "parent_id": "t1_dkhipo6",
    "subreddit_name_prefixed": "r/news",
    "body": "This makes a scene in their first DVD \"Frat Party at the Pankake Festival\" really disturbing. I don't know if its any the other cuts but I distinctly remember Chester Bennington wearing a \"Chester the Molester\" shirt at like a fan signing event. Bizarre.\n\nedit: [3:08 for the interested](https://www.youtube.com/watch?v=H3kTYk6_paQ) ",
    "controversiality": 0,
    "ups": 773,
    "downs": 0,
    "score": 773,
    "created": 1500608687.0,
    "date_created": "2017-07-20",
    "time_created": "15:44:47",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhuiv0",
    "parent_id": "t1_dkhipo6",
    "subreddit_name_prefixed": "r/news",
    "body": "I wonder how his father didn't realize since he specialized in that subject and also it being his own son. I suppose working so closely with something ugly like that can normalize it for some?",
    "controversiality": 0,
    "ups": 272,
    "downs": 0,
    "score": 272,
    "created": 1500616824.0,
    "date_created": "2017-07-20",
    "time_created": "18:00:24",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhnajc",
    "parent_id": "t1_dkhipo6",
    "subreddit_name_prefixed": "r/news",
    "body": "I had no fucking idea about this until today...jesus man.",
    "controversiality": 0,
    "ups": 388,
    "downs": 0,
    "score": 388,
    "created": 1500608995.0,
    "date_created": "2017-07-20",
    "time_created": "15:49:55",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhvx4g",
    "parent_id": "t1_dkhipo6",
    "subreddit_name_prefixed": "r/news",
    "body": "I knew Chester really well in high school. We were in a group for \"troubled teens\". We shared a lot of darkness but we were all there for each other and he was doing really well. The last time I saw him was at my 16th birthday party at my house in Dec 1991. My dad died shortly after and I kind of fell out of touch with the group. He and I are the same age and I can't believe he's not here anymore and I am. \n\n",
    "controversiality": 0,
    "ups": 79,
    "downs": 0,
    "score": 79,
    "created": 1500618494.0,
    "date_created": "2017-07-20",
    "time_created": "18:28:14",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhy3f4",
    "parent_id": "t1_dkhp8fi",
    "subreddit_name_prefixed": "r/news",
    "body": "I've tried explaining that intense, tingling rush to people when I listened to Hybrid Theory and even Meteora the first time. I'm glad others can relate. There's very few other bands I've found that in, and sadly I stopped listening to LP after our tastes diverged. But those two or three albums will stick with me my entire life. They helped me with so much, and in some ways made me feel whole when I was just a broken, lost kid. ",
    "controversiality": 0,
    "ups": 237,
    "downs": 0,
    "score": 237,
    "created": 1500621199.0,
    "date_created": "2017-07-20",
    "time_created": "19:13:19",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhyxo9",
    "parent_id": "t1_dkhp8fi",
    "subreddit_name_prefixed": "r/news",
    "body": "A lot of these comments are great but I just wanted to say the \"Leave Out All The Rest\" quote you mentioned is so important. It's hard to imagine that if he could have just SEEN how people would react to this news that he'd still have gone forward. It's too little too late I suppose, but as you said, he left behind a hell of a lot. And it all started with stories similar to yours. A beat up disc man or a flash drive.",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1500622272.0,
    "date_created": "2017-07-20",
    "time_created": "19:31:12",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki85ax",
    "parent_id": "t1_dkhp8fi",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm glad you're here. The world is far better with you than without you.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1500634762.0,
    "date_created": "2017-07-20",
    "time_created": "22:59:22",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki8784",
    "parent_id": "t1_dkhp8fi",
    "subreddit_name_prefixed": "r/news",
    "body": "Holy shit the \"tingling rush\" is so fucking real. I've never felt that rush with ANY other music other than LP's. Any time they came out with a track I hadn't heard yet, the first time I would listen to it I would get goosebumps and feel all tingly inside like something had just clicked. Fuck man this sucks. Every couple years I was always eager to see when their next album would be. Been listening to them for 8 years and still love them just as much.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1500634835.0,
    "date_created": "2017-07-20",
    "time_created": "23:00:35",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhj8ak",
    "parent_id": "t1_dkhi5ey",
    "subreddit_name_prefixed": "r/news",
    "body": "That's just it! People think depression is this gray cloud that is obvious to everyone else, but it's not! I really find it scary that you don't know how much another person can be suffering until it's too late.\n\nEdit - fyi, been through depressive episodes myself, got medicated.  I can only thank the grace of the Almighty that I was never so low that I wanted to hurt myself.\n\nEdit 2 - the reason I mention my faith is that, yes, when I finally got on medication, it helped so much and I'll never downplay how important it is - but getting myself to therapy, and then the three months it took to actually get to a psychiatrist and get prescribed, was a trial.  I'm still not sure I managed to do it completely under my own willpower, and I'd like to think that even if I'm down on myself, Someone upstairs is still looking out for me.",
    "controversiality": 0,
    "ups": 2160,
    "downs": 0,
    "score": 2160,
    "created": 1500604900.0,
    "date_created": "2017-07-20",
    "time_created": "14:41:40",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkzpk",
    "parent_id": "t1_dkhi5ey",
    "subreddit_name_prefixed": "r/news",
    "body": "It's strange... I know many people here grew up with Linkin Park, with them often being the soundtrack to surviving or escaping their darkest times. This news hits as a shock, but in hindsight seeing someone who can so accurately and powerfully depict our lowest points into not only words, but a pure audible concentration of emotion, makes it somewhat obvious that their demons were no less intense than ours. ",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1500606668.0,
    "date_created": "2017-07-20",
    "time_created": "15:11:08",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhlven",
    "parent_id": "t1_dkhi5ey",
    "subreddit_name_prefixed": "r/news",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1500607554.0,
    "date_created": "2017-07-20",
    "time_created": "15:25:54",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhpqms",
    "parent_id": "t1_dkhpo00",
    "subreddit_name_prefixed": "r/news",
    "body": "Holy fuck this is powerful. Thank you for not going through with it. ",
    "controversiality": 0,
    "ups": 165,
    "downs": 0,
    "score": 165,
    "created": 1500611523.0,
    "date_created": "2017-07-20",
    "time_created": "16:32:03",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkic40l",
    "parent_id": "t1_dkhpo00",
    "subreddit_name_prefixed": "r/news",
    "body": "If your dad is anything like my dad, he may not have known everything, but he knew enough.\n\nSource: Adult constantly amazed and humbled by how much his parents really knew, from the worst of times to the best.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1500640727.0,
    "date_created": "2017-07-21",
    "time_created": "00:38:47",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkibljm",
    "parent_id": "t1_dkhpo00",
    "subreddit_name_prefixed": "r/news",
    "body": "Man... Chester saved you. \nHis songs helped me to get over my own depression but the irony...... ",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1500639893.0,
    "date_created": "2017-07-21",
    "time_created": "00:24:53",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhm1f9",
    "parent_id": "t1_dkhj34h",
    "subreddit_name_prefixed": "r/news",
    "body": "A golden age of 'In the End' and 'Crawling' videos as far as the eye could see. ",
    "controversiality": 0,
    "ups": 3056,
    "downs": 0,
    "score": 3056,
    "created": 1500607725.0,
    "date_created": "2017-07-20",
    "time_created": "15:28:45",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhllfn",
    "parent_id": "t1_dkhj34h",
    "subreddit_name_prefixed": "r/news",
    "body": "I was JUST thinking this.\n\nTrunks tribute to In the End... my childhood.",
    "controversiality": 0,
    "ups": 1689,
    "downs": 0,
    "score": 1689,
    "created": 1500607270.0,
    "date_created": "2017-07-20",
    "time_created": "15:21:10",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhneft",
    "parent_id": "t1_dkhj34h",
    "subreddit_name_prefixed": "r/news",
    "body": "Naruto and Sasuke's fight too. That made fight even cooler. :(",
    "controversiality": 0,
    "ups": 756,
    "downs": 0,
    "score": 756,
    "created": 1500609107.0,
    "date_created": "2017-07-20",
    "time_created": "15:51:47",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhm18d",
    "parent_id": "t1_dkhj34h",
    "subreddit_name_prefixed": "r/news",
    "body": "more like rurouni kenshin linkin park AMVs",
    "controversiality": 0,
    "ups": 95,
    "downs": 0,
    "score": 95,
    "created": 1500607720.0,
    "date_created": "2017-07-20",
    "time_created": "15:28:40",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhmnth",
    "parent_id": "t1_dkhj34h",
    "subreddit_name_prefixed": "r/news",
    "body": "That broly AMV with Lying From You that was spread around limewire, good times. ",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1500608358.0,
    "date_created": "2017-07-20",
    "time_created": "15:39:18",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhn0or",
    "parent_id": "t1_dkhj34h",
    "subreddit_name_prefixed": "r/news",
    "body": "If I could upvote this like 20 times, I would.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1500608715.0,
    "date_created": "2017-07-20",
    "time_created": "15:45:15",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhqoez",
    "parent_id": "t1_dkhj34h",
    "subreddit_name_prefixed": "r/news",
    "body": "> I remember when youtube was 95% dbz linkin park amvs.\n\nMan I'd nearly forgotten about those, though I seem to remember them predating Youtube by a bit.  They got pretty popular back in 2002-3 IIRC. \n\nEdit: [Or I guess they've been a thing since the early 80s, what the hell do I know?] (https://en.wikipedia.org/wiki/Anime_music_video)",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1500612515.0,
    "date_created": "2017-07-20",
    "time_created": "16:48:35",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhn6lm",
    "parent_id": "t1_dkhj34h",
    "subreddit_name_prefixed": "r/news",
    "body": "I wish kids on Youtube still made those instead of race science memes",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1500608884.0,
    "date_created": "2017-07-20",
    "time_created": "15:48:04",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkloz",
    "parent_id": "t1_dkhic92",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm with you dude. Chester was a big part of my angsty late teens. He'll never be forgotten. ",
    "controversiality": 0,
    "ups": 2736,
    "downs": 0,
    "score": 2736,
    "created": 1500606272.0,
    "date_created": "2017-07-20",
    "time_created": "15:04:32",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkqid",
    "parent_id": "t1_dkhic92",
    "subreddit_name_prefixed": "r/news",
    "body": "100% man. I would blast that album and Meteora after it came out on my portable cd player in middle school and early high school. What a shock. One of the first bands I ever got really into.",
    "controversiality": 0,
    "ups": 657,
    "downs": 0,
    "score": 657,
    "created": 1500606409.0,
    "date_created": "2017-07-20",
    "time_created": "15:06:49",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhous2",
    "parent_id": "t1_dkhic92",
    "subreddit_name_prefixed": "r/news",
    "body": "Same here. Hell, Hybrid Theory is almost single handedly responsible for all I've done in the second half of my life.  I never understood music when I was younger, it just didn't appeal to me. But when I was 16 my best friend at the time gave me Hybrid Theory to try. I fell in love.  Listened to it nonstop for months.  Ended up buying Meteora when it came out and loved that too. Thanks to my love of Linkin Park I connected with a girl I met online, who I ended up dating for 3 and a half years and almost marrying. She introduced me to other bands like Coheed and Cambria and AC/DC, which inspired me to pick up a guitar.  She's long out of my life unfortunately,  but thanks to that guitar I became an amateur musician, which lead me to becoming friends with my 2 best friends who are my life. Almost everything I am now stems from being given Hybrid Theory.  \n\nSorry for the long post, I'm just really bummed out and needed to let loose. \n",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1500610602.0,
    "date_created": "2017-07-20",
    "time_created": "16:16:42",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki14h5",
    "parent_id": "t1_dkhnugv",
    "subreddit_name_prefixed": "r/news",
    "body": "Forgetting\n\nAll the hurt inside you've learned to hide so well\n\nPretending\n\nSomeone else can come and save me from myself\n\nI can't be who you are\n\n\nFuck, reading those lyrics really hit me hard right now.  I haven't heard this song in such a long time. One of my absolute favorites.  Rest in peace, Chester",
    "controversiality": 0,
    "ups": 300,
    "downs": 0,
    "score": 300,
    "created": 1500625178.0,
    "date_created": "2017-07-20",
    "time_created": "20:19:38",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki0hqy",
    "parent_id": "t1_dkhnugv",
    "subreddit_name_prefixed": "r/news",
    "body": "If they say\n\nWho cares if one more light goes out?\n\nIn the sky of a million stars\n\nIt flickers, flickers\n\nWho cares when someone's time runs out?\n\nIf a moment is all we are\n\nOr quicker, quicker\n\nWho cares if one more light goes out?\n\n[Well I do](https://www.youtube.com/watch?v=3kaUvGSLMew)",
    "controversiality": 0,
    "ups": 594,
    "downs": 0,
    "score": 594,
    "created": 1500624329.0,
    "date_created": "2017-07-20",
    "time_created": "20:05:29",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki0yew",
    "parent_id": "t1_dkhnugv",
    "subreddit_name_prefixed": "r/news",
    "body": "Don't be afraid\n\nI've taken my beating\n\nI've shared what I've made\n\nI'm strong on the surface\n\nNot all the way through\n\nI've never been perfect\n\nBut neither have you\n",
    "controversiality": 0,
    "ups": 144,
    "downs": 0,
    "score": 144,
    "created": 1500624955.0,
    "date_created": "2017-07-20",
    "time_created": "20:15:55",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki00w0",
    "parent_id": "t1_dkhnugv",
    "subreddit_name_prefixed": "r/news",
    "body": "I don't like my mind right now\n\nStacking up problems that are so unnecessary\n\nWish that I could slow things down\n\nI wanna let go but there's comfort in the panic",
    "controversiality": 0,
    "ups": 168,
    "downs": 0,
    "score": 168,
    "created": 1500623701.0,
    "date_created": "2017-07-20",
    "time_created": "19:55:01",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhqya9",
    "parent_id": "t1_dkhnugv",
    "subreddit_name_prefixed": "r/news",
    "body": "My favorite song of theirs",
    "controversiality": 0,
    "ups": 161,
    "downs": 0,
    "score": 161,
    "created": 1500612809.0,
    "date_created": "2017-07-20",
    "time_created": "16:53:29",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhuh3s",
    "parent_id": "t1_dkhnugv",
    "subreddit_name_prefixed": "r/news",
    "body": "This song seems so personal right now. ",
    "controversiality": 0,
    "ups": 117,
    "downs": 0,
    "score": 117,
    "created": 1500616767.0,
    "date_created": "2017-07-20",
    "time_created": "17:59:27",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhoqkr",
    "parent_id": "t1_dkhk7ls",
    "subreddit_name_prefixed": "r/news",
    "body": "2001 Ozzfest was my first concert. I was there to see Linkin Park and Slipknot (I was 12, dammit!). There were plenty of bands on that tour that should have taken ridicule over LP. (Crazy Town anyone?). I got engaged and bought my first house last month, but right now Chester Bennington's passing marks the first real indication of aging and mortality to me. \n\nCertainly hearing about people like Robin Williams or Prince passing away was heartbreaking, but those people made their first impact on generations before me. It's a strange feeling, and I hope this doesn't begin a trend.",
    "controversiality": 0,
    "ups": 3260,
    "downs": 0,
    "score": 3260,
    "created": 1500610481.0,
    "date_created": "2017-07-20",
    "time_created": "16:14:41",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhlyoa",
    "parent_id": "t1_dkhk7ls",
    "subreddit_name_prefixed": "r/news",
    "body": "What band are you in?",
    "controversiality": 0,
    "ups": 60,
    "downs": 0,
    "score": 60,
    "created": 1500607647.0,
    "date_created": "2017-07-20",
    "time_created": "15:27:27",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhr8xl",
    "parent_id": "t1_dkhk7ls",
    "subreddit_name_prefixed": "r/news",
    "body": "I hung out with them on the tour they did with Snoop and Less Than Jake a few years later... We played basketball (me and Chester vs the other guys) and he kicked it with us a little during the day... He was so chill and so nice.\n\nMy roommate just committed suicide a few months ago (and my dad did a while ago)... But, man, suicide hurts so much :( To experience from all ends :( \n\nI was almost successful a few years ago, and the pain in my heart as I was starting the process was so deep and dark.. it hurts imagining how they felt :( I wish I could help :( \n\nNow I'm crying. Ugh.",
    "controversiality": 0,
    "ups": 93,
    "downs": 0,
    "score": 93,
    "created": 1500613126.0,
    "date_created": "2017-07-20",
    "time_created": "16:58:46",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhv035",
    "parent_id": "t1_dkhk7ls",
    "subreddit_name_prefixed": "r/news",
    "body": "If I've never have listened to linkin park at age 11 or 12 I wouldve been a completely different person now. These guys and SOAD planted the seeds that would make me interested in music at all. \n\nRest in piece chester.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1500617395.0,
    "date_created": "2017-07-20",
    "time_created": "18:09:55",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhryt0",
    "parent_id": "t1_dkhouy7",
    "subreddit_name_prefixed": "r/news",
    "body": "Linkin Park was all the rage in Pakistan back in 2003-08! I was around 14 yo as well and in Karachi, every time we'd 'discover' a new LP song that was all that me and my friends in school would talk about!",
    "controversiality": 0,
    "ups": 1635,
    "downs": 0,
    "score": 1635,
    "created": 1500613920.0,
    "date_created": "2017-07-20",
    "time_created": "17:12:00",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkht76o",
    "parent_id": "t1_dkhouy7",
    "subreddit_name_prefixed": "r/news",
    "body": "Same, Linkin park really had a special meaning for most kids in third world countries, generally being their first exposure to English and modern music. Goddamn, why couldn't we help him 1% of how he helped us.",
    "controversiality": 0,
    "ups": 608,
    "downs": 0,
    "score": 608,
    "created": 1500615301.0,
    "date_created": "2017-07-20",
    "time_created": "17:35:01",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhvqqc",
    "parent_id": "t1_dkhouy7",
    "subreddit_name_prefixed": "r/news",
    "body": "-Sir, may we hear why are you requesting the American visa?\n\n*clears throat*\n\n-I tried so hard and got so far\n\nEdit: formatting",
    "controversiality": 0,
    "ups": 218,
    "downs": 0,
    "score": 218,
    "created": 1500618280.0,
    "date_created": "2017-07-20",
    "time_created": "18:24:40",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhucvh",
    "parent_id": "t1_dkhouy7",
    "subreddit_name_prefixed": "r/news",
    "body": "This is one of the most American things I've heard. I'm happy to have you here and I think Chester would be proud of you and what you strove for.",
    "controversiality": 0,
    "ups": 166,
    "downs": 0,
    "score": 166,
    "created": 1500616633.0,
    "date_created": "2017-07-20",
    "time_created": "17:57:13",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhyr5s",
    "parent_id": "t1_dkhouy7",
    "subreddit_name_prefixed": "r/news",
    "body": "That's a great story. When I was in the Army, I worked along side an immigrant from Ecuador who had learned a lot of English from the TV shows that would play in English. \n\nWe bonded over classic TV. We could just talk in quotes, all day long. Highlander, MASH, and- \n\nHot damn, I just realized I can go look him up. Imma go do that, that dude was cool.\n\nIt's amazing how pop culture actually does have discernible positive influence. Damn shame the people contributing sometimes, y'know...",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1500622041.0,
    "date_created": "2017-07-20",
    "time_created": "19:27:21",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhyjin",
    "parent_id": "t1_dkhouy7",
    "subreddit_name_prefixed": "r/news",
    "body": "yea I got started listening to English songs when i was a 15 years old Chinese boy. I couldn't understand their lyrics , I would look up dictionary to find out what their song means. Minutes to Mitnight is my favourite LP album. Rest in peace Chester, my thoughts and condolences are with your family ,friends and fans ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1500621768.0,
    "date_created": "2017-07-20",
    "time_created": "19:22:48",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki3oo0",
    "parent_id": "t1_dkhouy7",
    "subreddit_name_prefixed": "r/news",
    "body": "Literally every Pakistani adult in their 20s and 30s knows who Linkin Park is and actively listen to their songs. It's beautiful really",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1500628648.0,
    "date_created": "2017-07-20",
    "time_created": "21:17:28",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhiq3z",
    "parent_id": "t1_dkhhxhz",
    "subreddit_name_prefixed": "r/news",
    "body": "That's the difference with this one for me. I knew it felt different somehow. ",
    "controversiality": 0,
    "ups": 2421,
    "downs": 0,
    "score": 2421,
    "created": 1500604402.0,
    "date_created": "2017-07-20",
    "time_created": "14:33:22",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhk7kd",
    "parent_id": "t1_dkhk1di",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 232,
    "downs": 0,
    "score": 232,
    "created": 1500605873.0,
    "date_created": "2017-07-20",
    "time_created": "14:57:53",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhrzjl",
    "parent_id": "t1_dkhr3fc",
    "subreddit_name_prefixed": "r/news",
    "body": "Seriously tho. The album sounds like a cry for help after this incident.. Fuck. ",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1500613942.0,
    "date_created": "2017-07-20",
    "time_created": "17:12:22",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjrdk",
    "parent_id": "t1_dkhhto0",
    "subreddit_name_prefixed": "r/news",
    "body": "Hard not to think how sad I am right now, but fuck, the kids! Man, death isn't easy on anyone, anytime. Especially suicide. Hopefully they're close and have strength in numbers with each other. ",
    "controversiality": 0,
    "ups": 335,
    "downs": 0,
    "score": 335,
    "created": 1500605425.0,
    "date_created": "2017-07-20",
    "time_created": "14:50:25",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhiocu",
    "parent_id": "t1_dkhhto0",
    "subreddit_name_prefixed": "r/news",
    "body": "The kids are the worst part of that news. Ugh, so sad.\n\nedit: yes, obviously the suicide itself is *the* most tragic part. but the kids losing their dad like that is a huge pain itself.",
    "controversiality": 0,
    "ups": 452,
    "downs": 0,
    "score": 452,
    "created": 1500604355.0,
    "date_created": "2017-07-20",
    "time_created": "14:32:35",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhlm68",
    "parent_id": "t1_dkhhto0",
    "subreddit_name_prefixed": "r/news",
    "body": "probably won't have too many people see eye to eye with me but the silver lining here is that whatever was haunting him, he's finally free from it and that somehow makes me feel a bit better about it all. selfishly though, i'm still disheveled and sorrowful that he's gone",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1500607291.0,
    "date_created": "2017-07-20",
    "time_created": "15:21:31",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhitqg",
    "parent_id": "t1_dkhi7iy",
    "subreddit_name_prefixed": "r/news",
    "body": "He had 5-year-old twins. Very sad.",
    "controversiality": 0,
    "ups": 4568,
    "downs": 0,
    "score": 4568,
    "created": 1500604502.0,
    "date_created": "2017-07-20",
    "time_created": "14:35:02",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhk9xf",
    "parent_id": "t1_dkhi7iy",
    "subreddit_name_prefixed": "r/news",
    "body": "Normally, family is what pushes you to strive past internal struggles. When someone commits suicide knowing full well that they're leaving behind 6 kids, you know they were going through some really dark times. Rest in peace.",
    "controversiality": 0,
    "ups": 2376,
    "downs": 0,
    "score": 2376,
    "created": 1500605939.0,
    "date_created": "2017-07-20",
    "time_created": "14:58:59",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjgc7",
    "parent_id": "t1_dkhi7iy",
    "subreddit_name_prefixed": "r/news",
    "body": "It's so sad, you alter so many lives when you take your own",
    "controversiality": 0,
    "ups": 543,
    "downs": 0,
    "score": 543,
    "created": 1500605120.0,
    "date_created": "2017-07-20",
    "time_created": "14:45:20",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhhwvw",
    "parent_id": "t1_dkhhpwm",
    "subreddit_name_prefixed": "r/news",
    "body": "[Chester wrote this after his death.](https://twitter.com/ChesterBe/status/865227703091208192/photo/1?ref_src=twsrc%5Etfw&ref_url=http%3A%2F%2Fwww.nme.com%2Fnews%2Fmusic%2Fchris-cornell-chester-bennington-tribute-2073635)",
    "controversiality": 0,
    "ups": 6599,
    "downs": 0,
    "score": 6599,
    "created": 1500603594.0,
    "date_created": "2017-07-20",
    "time_created": "14:19:54",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhik8t",
    "parent_id": "t1_dkhhpwm",
    "subreddit_name_prefixed": "r/news",
    "body": "This is an example of why suicide is often studied from the perspective of a disease.  Among social groups, suicidal actions can often be observed in clusters.\n\nIt's sad all around.",
    "controversiality": 0,
    "ups": 3901,
    "downs": 0,
    "score": 3901,
    "created": 1500604241.0,
    "date_created": "2017-07-20",
    "time_created": "14:30:41",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhijvl",
    "parent_id": "t1_dkhhpwm",
    "subreddit_name_prefixed": "r/news",
    "body": "A part of my childhood just died :/",
    "controversiality": 0,
    "ups": 1326,
    "downs": 0,
    "score": 1326,
    "created": 1500604230.0,
    "date_created": "2017-07-20",
    "time_created": "14:30:30",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjzz6",
    "parent_id": "t1_dkhhpwm",
    "subreddit_name_prefixed": "r/news",
    "body": "As a 27 year old man. I literally cried when I found out Chris Hung himself. His voice was the reason I started playing guitar. I wanted to be like him! Now this...this is so sad.. I remember listening to Linkin Parks albums late at night on repeat as part of my sleep routine! Rest In Peace Rock Stars! Thoughts and Prayers to your families and friends!",
    "controversiality": 0,
    "ups": 599,
    "downs": 0,
    "score": 599,
    "created": 1500605664.0,
    "date_created": "2017-07-20",
    "time_created": "14:54:24",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhnakv",
    "parent_id": "t1_dkhke3o",
    "subreddit_name_prefixed": "r/news",
    "body": "Linkin Park really helped me through some of the roughest abuse from my father. I was so severely depressed, so suicidal, and I found so much comfort in their music. Just alittle bit of the \"you are not alone\", and \" it's okay to be frustrated\". (Most people around me have ridiculously smooth life And I indulged in guilt for being dissatisfied with life.)\nLinkin Park to me is almost a religion. My love to them is beyond just \"their music is good\". It is very spiritual. \n\nIt hurts so much to know the same music couldn't save the one who created it.... \n\nEdit: edit: I know these people very personally, grew up with them for 12 years, and back then they were only 10-15, and barely anyone had real-life issues back then. they all live in really happy, complete, upper-middle class families, with no other social circles since their life is so sheltered.\nHad to point that out after people was upset about me \"assuming others life\"... Which I totally understand as I always came out as the most cheerful girl people know, with rich parents and good grades, until people hear about my parental abuse and multiple cases of rape.",
    "controversiality": 0,
    "ups": 860,
    "downs": 0,
    "score": 860,
    "created": 1500608996.0,
    "date_created": "2017-07-20",
    "time_created": "15:49:56",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhlrpj",
    "parent_id": "t1_dkhke3o",
    "subreddit_name_prefixed": "r/news",
    "body": "This is really beautiful, and I'm glad that you are still here. ",
    "controversiality": 0,
    "ups": 1329,
    "downs": 0,
    "score": 1329,
    "created": 1500607449.0,
    "date_created": "2017-07-20",
    "time_created": "15:24:09",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkj02",
    "parent_id": "t1_dkhke3o",
    "subreddit_name_prefixed": "r/news",
    "body": "Well said.",
    "controversiality": 0,
    "ups": 251,
    "downs": 0,
    "score": 251,
    "created": 1500606196.0,
    "date_created": "2017-07-20",
    "time_created": "15:03:16",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhnju4",
    "parent_id": "t1_dkhke3o",
    "subreddit_name_prefixed": "r/news",
    "body": "People love to hate their newer albums, but their constant change is what made them the master band of the 2000s era rock. They tried new things and had incredibly dedication to their craft.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1500609260.0,
    "date_created": "2017-07-20",
    "time_created": "15:54:20",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhnt5y",
    "parent_id": "t1_dkhke3o",
    "subreddit_name_prefixed": "r/news",
    "body": "Glad you're still here :) \n\nWaiting for the End has to be one of my favourite LP songs",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1500609521.0,
    "date_created": "2017-07-20",
    "time_created": "15:58:41",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkbry",
    "parent_id": "t1_dkhik54",
    "subreddit_name_prefixed": "r/news",
    "body": "Seeing him live was always a goal for me, RIP :(",
    "controversiality": 0,
    "ups": 1558,
    "downs": 0,
    "score": 1558,
    "created": 1500605990.0,
    "date_created": "2017-07-20",
    "time_created": "14:59:50",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhj70e",
    "parent_id": "t1_dkhik54",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm grateful I got to see them live! :(",
    "controversiality": 0,
    "ups": 653,
    "downs": 0,
    "score": 653,
    "created": 1500604865.0,
    "date_created": "2017-07-20",
    "time_created": "14:41:05",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhlb0x",
    "parent_id": "t1_dkhik54",
    "subreddit_name_prefixed": "r/news",
    "body": "it's weird cause his twitter shows him retweeting just 24 hours ago about plastic waste....I know he was battling depression but I feel like he might have been taking some strong downers that pushed his emotional state to suicide at that moment, rather than months of planning it.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1500606984.0,
    "date_created": "2017-07-20",
    "time_created": "15:16:24",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjxyh",
    "parent_id": "t1_dkhi8sw",
    "subreddit_name_prefixed": "r/news",
    "body": "I feel exactly the same. Linkin Park has been in my life for as long as I can remember. For the first time, it feels like a small part of me has been erased.",
    "controversiality": 0,
    "ups": 593,
    "downs": 0,
    "score": 593,
    "created": 1500605606.0,
    "date_created": "2017-07-20",
    "time_created": "14:53:26",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjs99",
    "parent_id": "t1_dkhi8sw",
    "subreddit_name_prefixed": "r/news",
    "body": "Me too man. I'm at work right now and trying not to let it get me down, but this is hard. \n\nRest in peace man. ",
    "controversiality": 0,
    "ups": 483,
    "downs": 0,
    "score": 483,
    "created": 1500605450.0,
    "date_created": "2017-07-20",
    "time_created": "14:50:50",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhk1cb",
    "parent_id": "t1_dkhi8sw",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm 32 and Hybrid was one of the first mainstream rock albums I bought when it came out, just as I was getting into metal.\n\nThe novelty of the sound wore off after a few years but the memory of hearing that sound for the very first time, and how groundbreaking and different it was, is always there.",
    "controversiality": 0,
    "ups": 119,
    "downs": 0,
    "score": 119,
    "created": 1500605701.0,
    "date_created": "2017-07-20",
    "time_created": "14:55:01",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhk19p",
    "parent_id": "t1_dkhi8sw",
    "subreddit_name_prefixed": "r/news",
    "body": "Same here, 21 as well and this one feels like a real punch.",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1500605700.0,
    "date_created": "2017-07-20",
    "time_created": "14:55:00",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhvbod",
    "parent_id": "t1_dkhojkn",
    "subreddit_name_prefixed": "r/news",
    "body": "Awesome story. Glad to hear she is cancer free. Thank you for sharing!",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1500617784.0,
    "date_created": "2017-07-20",
    "time_created": "18:16:24",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhzity",
    "parent_id": "t1_dkhvmvb",
    "subreddit_name_prefixed": "r/news",
    "body": "Thanks for writing this",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1500623042.0,
    "date_created": "2017-07-20",
    "time_created": "19:44:02",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhwmy1",
    "parent_id": "t1_dkhvmvb",
    "subreddit_name_prefixed": "r/news",
    "body": "Whatever happened to your friend?",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1500619362.0,
    "date_created": "2017-07-20",
    "time_created": "18:42:42",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki4ojm",
    "parent_id": "t1_dkhvmvb",
    "subreddit_name_prefixed": "r/news",
    "body": "That was an amazing story. Thank you for sharing. ",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1500629977.0,
    "date_created": "2017-07-20",
    "time_created": "21:39:37",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki56wv",
    "parent_id": "t1_dkhvmvb",
    "subreddit_name_prefixed": "r/news",
    "body": "> I didn't know that the somber \"why bother\" of nihilism could be interpreted as the adventurous \"why not?\"\n\nWelcome to Absurdism :)",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1500630682.0,
    "date_created": "2017-07-20",
    "time_created": "21:51:22",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkib54u",
    "parent_id": "t1_dkhvmvb",
    "subreddit_name_prefixed": "r/news",
    "body": "That's a well written and very very touching bittersweet story. \n\nI can't help but think that you should write a book about your upbringing, fictionalized if need be. I'd read it.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1500639164.0,
    "date_created": "2017-07-21",
    "time_created": "00:12:44",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkte2",
    "parent_id": "t1_dkhj49l",
    "subreddit_name_prefixed": "r/news",
    "body": "After going through my own struggles with mental health, recovering, and then reflecting on how poorly I acted towards others, I’ve really taken that to heart. We like to label every person that does something that hurts/bothers/annoys us as a ‘bad’ person, but in reality they are just wounded and struggling... spilling their pain out onto the world around them unknowingly. It’s surprising how with a little shift in perspective, so many petty things like being cut off, or someone being rude to you, can not only cease to be annoyances, but can actually rouse compassion for the person. ",
    "controversiality": 0,
    "ups": 79,
    "downs": 0,
    "score": 79,
    "created": 1500606491.0,
    "date_created": "2017-07-20",
    "time_created": "15:08:11",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhofqx",
    "parent_id": "t1_dkhisib",
    "subreddit_name_prefixed": "r/news",
    "body": "I lost my husband to suicide. It's devastating. I feel like devastating isn't even a strong enough word. \nHere's how I think you can help. There will be a lot of people giving him love and attention right now. This happens with deaths, but he's the son of a celebrity, so I imagine a lot of people will come out of the woodwork to express this. Here's how you can be a great friend. Wait until the commotion dies down and he flies back to wherever you two go to school. When life returns to normal for everyone else, it won't for him. Be there when all the commotion is over. Invite him to things often. He will bail on you. He will 400 times. Keep being there for him and giving him opportunities to feel normal again. Maybe on that 401st time, he'll be ready to try to be normal again. I had a friend who did this for me. I asked why she kept inviting me time and time again when I would flake everytime. She said, \"I just wanted you to know that you had options.\" It meant so very much to me. Everyone faded away when my husband dying was old news then someone who I wasn't actually that close to was the one who stayed in contact just to remind me that I had options when I was ready. Be as normal as you can with him. Don't talk to him about it. Just be his friend. If he wants to talk about it, he will. Be his passage back to normal.",
    "controversiality": 0,
    "ups": 1980,
    "downs": 0,
    "score": 1980,
    "created": 1500610170.0,
    "date_created": "2017-07-20",
    "time_created": "16:09:30",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkg84",
    "parent_id": "t1_dkhisib",
    "subreddit_name_prefixed": "r/news",
    "body": "Just let him know you're there for him. ",
    "controversiality": 0,
    "ups": 590,
    "downs": 0,
    "score": 590,
    "created": 1500606116.0,
    "date_created": "2017-07-20",
    "time_created": "15:01:56",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkmvr",
    "parent_id": "t1_dkhisib",
    "subreddit_name_prefixed": "r/news",
    "body": "No words could fix it. It's more important to listen. ",
    "controversiality": 0,
    "ups": 200,
    "downs": 0,
    "score": 200,
    "created": 1500606306.0,
    "date_created": "2017-07-20",
    "time_created": "15:05:06",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhne9l",
    "parent_id": "t1_dkhisib",
    "subreddit_name_prefixed": "r/news",
    "body": "My dad committed suicide and I can tell you it's not what you say to him. Just stay in contact and keep up with how he's holding up. I know my situation is severely different, but I know that this helps more than you would think.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1500609102.0,
    "date_created": "2017-07-20",
    "time_created": "15:51:42",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhmma4",
    "parent_id": "t1_dkhkpyy",
    "subreddit_name_prefixed": "r/news",
    "body": "Shit, I'm only 21 and I'm getting emotional.",
    "controversiality": 0,
    "ups": 724,
    "downs": 0,
    "score": 724,
    "created": 1500608315.0,
    "date_created": "2017-07-20",
    "time_created": "15:38:35",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhn4gy",
    "parent_id": "t1_dkhkpyy",
    "subreddit_name_prefixed": "r/news",
    "body": "28... Can confirm.  ",
    "controversiality": 0,
    "ups": 203,
    "downs": 0,
    "score": 203,
    "created": 1500608823.0,
    "date_created": "2017-07-20",
    "time_created": "15:47:03",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhnqnd",
    "parent_id": "t1_dkhkpyy",
    "subreddit_name_prefixed": "r/news",
    "body": "Everyone keeps putting these age brackets around it, I'm pushing 40 it doesnt matter. Music can be influential at any age.",
    "controversiality": 0,
    "ups": 223,
    "downs": 0,
    "score": 223,
    "created": 1500609450.0,
    "date_created": "2017-07-20",
    "time_created": "15:57:30",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhoipa",
    "parent_id": "t1_dkhkpyy",
    "subreddit_name_prefixed": "r/news",
    "body": "32 here. I remember being at school and one of my friends brought hybrid theory in for me to listen to. I wasn't a huge fan of rock at the time, but I fell in love with the album. I would always listen to it while playing unreal tournament in my bedroom.",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1500610255.0,
    "date_created": "2017-07-20",
    "time_created": "16:10:55",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjrit",
    "parent_id": "t1_dkhhva4",
    "subreddit_name_prefixed": "r/news",
    "body": "His music probably saved a lot of people from suicide.",
    "controversiality": 0,
    "ups": 4092,
    "downs": 0,
    "score": 4092,
    "created": 1500605429.0,
    "date_created": "2017-07-20",
    "time_created": "14:50:29",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhk6uz",
    "parent_id": "t1_dkhhva4",
    "subreddit_name_prefixed": "r/news",
    "body": "Same here, Hybrid Theory and Meteora were everyone's go to album around my high school.",
    "controversiality": 0,
    "ups": 96,
    "downs": 0,
    "score": 96,
    "created": 1500605853.0,
    "date_created": "2017-07-20",
    "time_created": "14:57:33",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhj35q",
    "parent_id": "t1_dkhhva4",
    "subreddit_name_prefixed": "r/news",
    "body": "I still get nostalgic chills whenever I listen to numb. Bum dum dum da dumm bu du do da do bum dum dum...",
    "controversiality": 0,
    "ups": 331,
    "downs": 0,
    "score": 331,
    "created": 1500604758.0,
    "date_created": "2017-07-20",
    "time_created": "14:39:18",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhj4es",
    "parent_id": "t1_dkhhva4",
    "subreddit_name_prefixed": "r/news",
    "body": "Got me through junior high:( ",
    "controversiality": 0,
    "ups": 82,
    "downs": 0,
    "score": 82,
    "created": 1500604792.0,
    "date_created": "2017-07-20",
    "time_created": "14:39:52",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhsumf",
    "parent_id": "t1_dkhni9s",
    "subreddit_name_prefixed": "r/news",
    "body": "I think with this occurring right now, maybe you should talk to someone as it sounds like this could be triggering.\nI say this and wanted to reach out to you because I understand the symbolism with Chester's suicide, his music, and your memories.\nSending you warm and healing vibes.",
    "controversiality": 0,
    "ups": 58,
    "downs": 0,
    "score": 58,
    "created": 1500614908.0,
    "date_created": "2017-07-20",
    "time_created": "17:28:28",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhxh96",
    "parent_id": "t1_dkhni9s",
    "subreddit_name_prefixed": "r/news",
    "body": "You are *so* brave. When I'm low I try and remember a quote from Winston Churchill, \"when you're going through hell, keep going.\" ",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1500620409.0,
    "date_created": "2017-07-20",
    "time_created": "19:00:09",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhshni",
    "parent_id": "t1_dkhl63d",
    "subreddit_name_prefixed": "r/news",
    "body": "Could you share a screenshot please? Twitter says I'm not authorised to see the tweet :(",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1500614505.0,
    "date_created": "2017-07-20",
    "time_created": "17:21:45",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhi5ng",
    "parent_id": "t1_dkhhtai",
    "subreddit_name_prefixed": "r/news",
    "body": "Seriously. For such a meme that early Linkin Park has turned into, I fucking JAMMED them between like 12-14 and it got me into playing music in general. \n\nHope the guy found some peace. ",
    "controversiality": 0,
    "ups": 1400,
    "downs": 0,
    "score": 1400,
    "created": 1500603837.0,
    "date_created": "2017-07-20",
    "time_created": "14:23:57",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhixuu",
    "parent_id": "t1_dkhhtai",
    "subreddit_name_prefixed": "r/news",
    "body": "Hybrid Theory was the first CD I ever bought myself, at age 12. I can't believe this. ",
    "controversiality": 0,
    "ups": 110,
    "downs": 0,
    "score": 110,
    "created": 1500604616.0,
    "date_created": "2017-07-20",
    "time_created": "14:36:56",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhihoo",
    "parent_id": "t1_dkhhtai",
    "subreddit_name_prefixed": "r/news",
    "body": "First album I ever bought was Meteora :( RIP",
    "controversiality": 0,
    "ups": 74,
    "downs": 0,
    "score": 74,
    "created": 1500604169.0,
    "date_created": "2017-07-20",
    "time_created": "14:29:29",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhih76",
    "parent_id": "t1_dkhhtai",
    "subreddit_name_prefixed": "r/news",
    "body": "I haven't kept up with them much lately but Linkin Park was a huge gateway band to rock/alternative music for me. Very sad to hear this. RIP Chester.",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1500604156.0,
    "date_created": "2017-07-20",
    "time_created": "14:29:16",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjsth",
    "parent_id": "t1_dkhi83m",
    "subreddit_name_prefixed": "r/news",
    "body": "Hybrid Theory and Meteora are the foundation for me being a metal enthusiast",
    "controversiality": 0,
    "ups": 1690,
    "downs": 0,
    "score": 1690,
    "created": 1500605465.0,
    "date_created": "2017-07-20",
    "time_created": "14:51:05",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhir6g",
    "parent_id": "t1_dkhi83m",
    "subreddit_name_prefixed": "r/news",
    "body": "Chester had 6 children, damn. RIP.",
    "controversiality": 0,
    "ups": 746,
    "downs": 0,
    "score": 746,
    "created": 1500604433.0,
    "date_created": "2017-07-20",
    "time_created": "14:33:53",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhj2i8",
    "parent_id": "t1_dkhi83m",
    "subreddit_name_prefixed": "r/news",
    "body": "Also, Numb/Encore.\n\nThe Jay-Z mashup album was insane and groundbreaking. \n\nEdit: holy shit...Here's the song: \n\nStudio: https://youtu.be/JcOwJh4F40M\n\nLive: https://youtu.be/DLlF2FMv968",
    "controversiality": 0,
    "ups": 5049,
    "downs": 0,
    "score": 5049,
    "created": 1500604741.0,
    "date_created": "2017-07-20",
    "time_created": "14:39:01",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhk0bi",
    "parent_id": "t1_dkhi83m",
    "subreddit_name_prefixed": "r/news",
    "body": "A Thousand Suns will always be their best album for me. I can put it on and listen from start to finish while enjoying every moment of it.\n\nEdit: I'm glad to see so many others that feel the same way. The final bonus song off of that album (titled: The Messenger) seems to fit this tragic situation so well. The words, the power and the feeling -- these all embody how I am feeling about this whole situation.",
    "controversiality": 0,
    "ups": 247,
    "downs": 0,
    "score": 247,
    "created": 1500605673.0,
    "date_created": "2017-07-20",
    "time_created": "14:54:33",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhj6r4",
    "parent_id": "t1_dkhi83m",
    "subreddit_name_prefixed": "r/news",
    "body": "And the Live in Texas album. Made me appreciate him as a singer more. ",
    "controversiality": 0,
    "ups": 75,
    "downs": 0,
    "score": 75,
    "created": 1500604857.0,
    "date_created": "2017-07-20",
    "time_created": "14:40:57",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkcp2",
    "parent_id": "t1_dkhi2zy",
    "subreddit_name_prefixed": "r/news",
    "body": "He also talked about wanting to kill himself for a long time due to being abused by an older man when he was a kid. ",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1500606016.0,
    "date_created": "2017-07-20",
    "time_created": "15:00:16",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkgkm",
    "parent_id": "t1_dkhi2zy",
    "subreddit_name_prefixed": "r/news",
    "body": "The problem is that seeking help doesn't just end the suffering.",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1500606126.0,
    "date_created": "2017-07-20",
    "time_created": "15:02:06",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhl572",
    "parent_id": "t1_dkhj31r",
    "subreddit_name_prefixed": "r/news",
    "body": "He probably didn't mind any criticism of the album but being called a sell out is probably what got to him. LP are pretty passionate about their music and they like trying new things and it probably hurts to have your work dismissed as 'selling out'.",
    "controversiality": 0,
    "ups": 773,
    "downs": 0,
    "score": 773,
    "created": 1500606823.0,
    "date_created": "2017-07-20",
    "time_created": "15:13:43",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhm7xu",
    "parent_id": "t1_dkhj31r",
    "subreddit_name_prefixed": "r/news",
    "body": "Guess I'm in the minority for not hating their new album. A few of the songs I really enjoy.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1500607910.0,
    "date_created": "2017-07-20",
    "time_created": "15:31:50",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhqv8y",
    "parent_id": "t1_dkhkfal",
    "subreddit_name_prefixed": "r/news",
    "body": "Chester isn't even the one that sings those lines yet I still can't help but tear up reading that",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1500612720.0,
    "date_created": "2017-07-20",
    "time_created": "16:52:00",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhofjt",
    "parent_id": "t1_dkhkfal",
    "subreddit_name_prefixed": "r/news",
    "body": "Fuck. Wiping tears out of my eyes at work is embarrassing.",
    "controversiality": 0,
    "ups": 56,
    "downs": 0,
    "score": 56,
    "created": 1500610164.0,
    "date_created": "2017-07-20",
    "time_created": "16:09:24",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhost2",
    "parent_id": "t1_dkhkfal",
    "subreddit_name_prefixed": "r/news",
    "body": "I want to be in another place\n\nI hate when you say you don’t understand\n\n(You’ll see it's not meant to be)\n\nI want to be in the energy, not with the enemy\n\nA place for my head",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1500610544.0,
    "date_created": "2017-07-20",
    "time_created": "16:15:44",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhm5ow",
    "parent_id": "t1_dkhi0xg",
    "subreddit_name_prefixed": "r/news",
    "body": "Right with you. At first it was like \"oh, that really sucks.\" and then I started thinking about all of my memories with their music and I'm sitting here crying all over my suit while at my desk. What a shot to the gut.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1500607847.0,
    "date_created": "2017-07-20",
    "time_created": "15:30:47",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhlec8",
    "parent_id": "t1_dkhkpz6",
    "subreddit_name_prefixed": "r/news",
    "body": "This was helpful to read. Thank you. ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1500607073.0,
    "date_created": "2017-07-20",
    "time_created": "15:17:53",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhl5db",
    "parent_id": "t1_dkhjkg6",
    "subreddit_name_prefixed": "r/news",
    "body": "Sadly it's rising it teenagers too. In fact, suicide is one of the biggest killers of men.",
    "controversiality": 0,
    "ups": 63,
    "downs": 0,
    "score": 63,
    "created": 1500606827.0,
    "date_created": "2017-07-20",
    "time_created": "15:13:47",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhks1o",
    "parent_id": "t1_dkhihri",
    "subreddit_name_prefixed": "r/news",
    "body": "I was supposed to see them 2 years ago and Chester broke his leg or foot so it was canceled.\n\nNow I was ready to see them at the BB&T in 2 weeks....even got seats up close...damn :(",
    "controversiality": 0,
    "ups": 55,
    "downs": 0,
    "score": 55,
    "created": 1500606452.0,
    "date_created": "2017-07-20",
    "time_created": "15:07:32",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkd4c",
    "parent_id": "t1_dkhiq8s",
    "subreddit_name_prefixed": "r/news",
    "body": "> The so-called 'psychotically depressed' person who tries to kill herself doesn't do so out of quote 'hopelessness' or any abstract conviction that life's assets and debits do not square. And surely not because death seems suddenly appealing. The person in whom *Its* invisible agony reaches a certain unendurable level will kill herself the same way a trapped person will eventually jump from the window of a burning high-rise. Make no mistake about the people who leap from burning windows. Their terror of falling from a great height is still just as great as it would be for you or me standing speculatively at the same window, i.e. the fear of falling remains a constant. The variable here is the other terror, the fire's flames: when the flames get close enough, falling to death becomes the slightly less terrible of two terrors. It's not desiring the fall; it's terror of the flames. And yet nobody down on the sidewalk, looking up and yelling 'Don't!' and 'Hang on!', can understand the jump. Not really. You'd have to have personally been trapped and felt flames to really understand a terror way beyond falling.\n\n-Infinite Jest by David Foster Wallace",
    "controversiality": 0,
    "ups": 1018,
    "downs": 0,
    "score": 1018,
    "created": 1500606028.0,
    "date_created": "2017-07-20",
    "time_created": "15:00:28",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjfg6",
    "parent_id": "t1_dkhiq8s",
    "subreddit_name_prefixed": "r/news",
    "body": "Thank you for considering it from a different perspective and changing your opinion. Nothing quite gets my blood boiling like someone dismissing someone driven to suicide as being a selfish act.",
    "controversiality": 0,
    "ups": 1060,
    "downs": 0,
    "score": 1060,
    "created": 1500605096.0,
    "date_created": "2017-07-20",
    "time_created": "14:44:56",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjcri",
    "parent_id": "t1_dkhhxqq",
    "subreddit_name_prefixed": "r/news",
    "body": "Dude. Heavy from their new album. ",
    "controversiality": 0,
    "ups": 357,
    "downs": 0,
    "score": 357,
    "created": 1500605021.0,
    "date_created": "2017-07-20",
    "time_created": "14:43:41",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjhv1",
    "parent_id": "t1_dkhhxqq",
    "subreddit_name_prefixed": "r/news",
    "body": "The song \"Given Up\" is all too real now...\n\"I've given up, I'm sick of feeling... Put me out of my misery\"\nRest In peace Chester, your music gave me a sense of identity before any other artist. ",
    "controversiality": 0,
    "ups": 216,
    "downs": 0,
    "score": 216,
    "created": 1500605162.0,
    "date_created": "2017-07-20",
    "time_created": "14:46:02",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhlk4o",
    "parent_id": "t1_dkhhxqq",
    "subreddit_name_prefixed": "r/news",
    "body": "Leave Out All the Rest is heartbreaking now, especially the chorus.\n\n> When my time comes\n\n>Forget the wrong that I've done\n\n>Help me leave behind some reasons to be missed\n\n> And don't resent me\n\n> And when you're feeling empty\n\n> Keep me in your memory\n\n> Leave out all the rest\n>\nLeave out all the rest",
    "controversiality": 0,
    "ups": 54,
    "downs": 0,
    "score": 54,
    "created": 1500607234.0,
    "date_created": "2017-07-20",
    "time_created": "15:20:34",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhq039",
    "parent_id": "t1_dkhj7iy",
    "subreddit_name_prefixed": "r/news",
    "body": "Roads Untraveled is probably in my top 5 favorite songs, and has really gotten me through some tough shit.  \n\nI wonder now since it's mostly sung by Mike if it was more Mike to Chester.  Damn.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1500611799.0,
    "date_created": "2017-07-20",
    "time_created": "16:36:39",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkwmr",
    "parent_id": "t1_dkhifbo",
    "subreddit_name_prefixed": "r/news",
    "body": "I called that hotline last year. I was an EMT suffering from traumatic stress that hit me like a freight train after my relationship disintegrated - I ended up walking down the side of a county road, with a backpack full of whatever stuff of mine I could fit in it when I got kicked out of the house, praying I'd get hit by a truck. \n\nWhen that didn't happen, I checked into a motel and tried to strangle myself in the bathroom with the hairdryer cord. That didn't work. I think they design those rooms to make them suicide proof. \n\nMy dad ended up tracking me down and took me back to his place on the other side of the country. The first night back, I got in my jeep and planned to drive it into the river - but for some reason, I decided to call that hotline. After four or five minutes, the counselor suddenly said, \"I'm sorry - I have to move on, I need to go now.\" \n\nI begged her to stay just a little longer - I thought I was going to die and I wanted to just ... talk, to anyone. Not to convince me not to, not to get pity - just to talk, one last time. \n\nShe hung up.\n\nI'm sure they have helped many, many people. And I can't imagine the vicarious trauma they bear. \n\nBut - that time, the time *I* needed them, they were god damn fucking useless.\n\nIt made me so angry, and at the time, even more hopeless - I didn't think that was possible. The irony is, I didn't kill myself that night because I was in so much despair that I passed out in my jeep from crying so hard. So I guess they saved my life. I don't think it was supposed to go like that, though.\n\n\n",
    "controversiality": 0,
    "ups": 1775,
    "downs": 0,
    "score": 1775,
    "created": 1500606582.0,
    "date_created": "2017-07-20",
    "time_created": "15:09:42",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhk3tc",
    "parent_id": "t1_dkhifbo",
    "subreddit_name_prefixed": "r/news",
    "body": "If you're in the UK, the number is 116123",
    "controversiality": 0,
    "ups": 662,
    "downs": 0,
    "score": 662,
    "created": 1500605768.0,
    "date_created": "2017-07-20",
    "time_created": "14:56:08",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkg2s",
    "parent_id": "t1_dkhifbo",
    "subreddit_name_prefixed": "r/news",
    "body": "I am going to be that guy. Fuck these people. My fiance called them and they put her on hold several times. Someone hung up on her. Luckily I got home in time and found her in the closet with a knife.  She was close to doing something terrible and they were no help. This happened twice. The first time she was just depressed and wanted someone to talk to. The second time it was worse for her and they were just awful\n",
    "controversiality": 0,
    "ups": 687,
    "downs": 0,
    "score": 687,
    "created": 1500606112.0,
    "date_created": "2017-07-20",
    "time_created": "15:01:52",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjbzq",
    "parent_id": "t1_dkhifbo",
    "subreddit_name_prefixed": "r/news",
    "body": "lol I remember when /r/bitcoin had to have this stickied. ",
    "controversiality": 0,
    "ups": 2996,
    "downs": 0,
    "score": 2996,
    "created": 1500605001.0,
    "date_created": "2017-07-20",
    "time_created": "14:43:21",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhk0w9",
    "parent_id": "t1_dkhik6x",
    "subreddit_name_prefixed": "r/news",
    "body": "Meteora as well. One of the best albums I've ever listen to.",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1500605689.0,
    "date_created": "2017-07-20",
    "time_created": "14:54:49",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhsxmn",
    "parent_id": "t1_dkhmsya",
    "subreddit_name_prefixed": "r/news",
    "body": "Lyrics From the Song \"Heavy Featuring Kiiara\" can really tell you alot...",
    "controversiality": 0,
    "ups": 1470,
    "downs": 0,
    "score": 1470,
    "created": 1500615001.0,
    "date_created": "2017-07-20",
    "time_created": "17:30:01",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhva0j",
    "parent_id": "t1_dkhmsya",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah.  I tried to kill myself 4 times as a kid because of what I went through and know several people who did or tried to because of sexual abuse.",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1500617729.0,
    "date_created": "2017-07-20",
    "time_created": "18:15:29",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhxodj",
    "parent_id": "t1_dkhmzoe",
    "subreddit_name_prefixed": "r/news",
    "body": "I just re-found this DVD. I must have watched it a gazillion times in my teenage years. I never realised how dark some it was until watching it later. There's one part were Chester is talking about his voice and says \"12 years of abuse causes a lot of pent up rage\". Poor guy must have been through alot. :( ",
    "controversiality": 0,
    "ups": 106,
    "downs": 0,
    "score": 106,
    "created": 1500620663.0,
    "date_created": "2017-07-20",
    "time_created": "19:04:23",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkht297",
    "parent_id": "t1_dkhmzoe",
    "subreddit_name_prefixed": "r/news",
    "body": "\"Chester the Molester\" was a cartoon strip character made by the same guy who owned \"Hustler\" pornographic magazine, the character was supposed to be humorous, the shirt was probably a reference to that. \n\nChester was like a proto-Pedobear, always plotting or attempting molest, but unlike Pedobear, Chester was only interested in underage girls.",
    "controversiality": 0,
    "ups": 158,
    "downs": 0,
    "score": 158,
    "created": 1500615146.0,
    "date_created": "2017-07-20",
    "time_created": "17:32:26",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki8p22",
    "parent_id": "t1_dkhmzoe",
    "subreddit_name_prefixed": "r/news",
    "body": "I remember reading an interview with him a while back- apparently when he was in school a bunch of the other kids found it hilarious to call him \"Chester the Molester.\" At the time it bothered him a lot because of the abuse, but apparently the shirt was supposed to show that as an adult he'd at least moved past teenage stupidity from teenagers. \n\nI am not sure he ever was as glib and \"okay\" with it, for lack of a better word, as he tried to portray. \n\nRIP Chester.",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1500635532.0,
    "date_created": "2017-07-20",
    "time_created": "23:12:12",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhvi79",
    "parent_id": "t1_dkhmzoe",
    "subreddit_name_prefixed": "r/news",
    "body": "Watching this I just know the whole group is devastated. Sorry for their loss.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1500618002.0,
    "date_created": "2017-07-20",
    "time_created": "18:20:02",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki33n9",
    "parent_id": "t1_dkhuiv0",
    "subreddit_name_prefixed": "r/news",
    "body": "I think sometimes there are few signs and the kids are groomed and manipulated into not talking. I took a training on child sex abuse and I remember the instructor mentioning that her previous colleague, who had done a lot of work in the area, had a son who was abused by his soccer coach, and the colleague didn't know because the son never gave any indication. This was a man who had done research on sex abuse, and he only found out because the son's friend finally told someone.",
    "controversiality": 0,
    "ups": 290,
    "downs": 0,
    "score": 290,
    "created": 1500627859.0,
    "date_created": "2017-07-20",
    "time_created": "21:04:19",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki58vz",
    "parent_id": "t1_dkhuiv0",
    "subreddit_name_prefixed": "r/news",
    "body": "Simple, parents who are detectives are literally never home.\n\nSource - Went through something similar with an LEO parent. My mom specialized in dealing with domestic violence victims, while my brother and I got the living hell beaten out of us by her husband. She didn't have a clue for several years. When you work 100 hours a week, it's very easy to miss problems with your kids no matter how trained and insightful you are. ",
    "controversiality": 0,
    "ups": 70,
    "downs": 0,
    "score": 70,
    "created": 1500630759.0,
    "date_created": "2017-07-20",
    "time_created": "21:52:39",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkiaklp",
    "parent_id": "t1_dkhuiv0",
    "subreddit_name_prefixed": "r/news",
    "body": "Did you ever hear the axiom \"the cobbler's children have no shoes\"?\n\nDrug counselor kids get into drugs all the time. Priests' and pastors' kids are even stereotyped as being the biggest fuck ups. Doctors' and nurses' kids have serious medical issues left untreated.\n\nPeople are very blind to what's under their own noses.",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1500638292.0,
    "date_created": "2017-07-20",
    "time_created": "23:58:12",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkigg30",
    "parent_id": "t1_dkhuiv0",
    "subreddit_name_prefixed": "r/news",
    "body": "The Japanese have a saying: とうだいもとくらし (toudaimotokurashi) which roughly translates to \"the light of the light house never touches its own base\". We usually miss things close to us because we are focused on things far away ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1500649421.0,
    "date_created": "2017-07-21",
    "time_created": "03:03:41",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki1r0d",
    "parent_id": "t1_dkhvx4g",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm sorry. ",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1500626026.0,
    "date_created": "2017-07-20",
    "time_created": "20:33:46",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkiip5h",
    "parent_id": "t1_dkhy3f4",
    "subreddit_name_prefixed": "r/news",
    "body": "> that intense, tingling rush\n\n[TYL it's called \"frisson\"](https://en.wikipedia.org/wiki/Frisson)\n\nI get it from listening to melodic death metal \\m/",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1500655304.0,
    "date_created": "2017-07-21",
    "time_created": "04:41:44",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki9231",
    "parent_id": "t1_dkhy3f4",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm glad to find that so many others have experienced the same feeling. It's a unifying feeling in my mind...one that goes to show how so many people can be connected through something so simple. I'm glad they were able to help you too. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1500636044.0,
    "date_created": "2017-07-20",
    "time_created": "23:20:44",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki964d",
    "parent_id": "t1_dki85ax",
    "subreddit_name_prefixed": "r/news",
    "body": "Thank you, truly. It means a lot of see those words.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1500636209.0,
    "date_created": "2017-07-20",
    "time_created": "23:23:29",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkcso",
    "parent_id": "t1_dkhj8ak",
    "subreddit_name_prefixed": "r/news",
    "body": "Depression is your brain twisting all happiness into a negative, you constantly put yourself down and never, ever talk about it to someone close that can help because you don't want to be more of a burden than you already are.\n\nIt's a thing that comes and goes but when it's there, you're literally incapable of being happy. You laugh at jokes as a reflex but internally, there is no change in how you feel.\n\nMost of the time I don't want to kill myself.\n\nI just want to go to sleep and not wake up.",
    "controversiality": 0,
    "ups": 1864,
    "downs": 0,
    "score": 1864,
    "created": 1500606019.0,
    "date_created": "2017-07-20",
    "time_created": "15:00:19",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhk1d8",
    "parent_id": "t1_dkhj8ak",
    "subreddit_name_prefixed": "r/news",
    "body": "Everybody's fighting a battle you know nothing about.",
    "controversiality": 0,
    "ups": 424,
    "downs": 0,
    "score": 424,
    "created": 1500605702.0,
    "date_created": "2017-07-20",
    "time_created": "14:55:02",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhtesv",
    "parent_id": "t1_dkhj8ak",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1500615542.0,
    "date_created": "2017-07-20",
    "time_created": "17:39:02",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkho79v",
    "parent_id": "t1_dkhlven",
    "subreddit_name_prefixed": "r/news",
    "body": "Pretending to be happy or content may help you blend in, but it feels more isolating, it makes the line between *them* and *you* that much more pronounced, that much thicker. So in the end, when you go home and the windows are shut and the door is locked, happiness seems further away than ever. Having to hide is incredibly taxing.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1500609926.0,
    "date_created": "2017-07-20",
    "time_created": "16:05:26",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhram0",
    "parent_id": "t1_dkhpqms",
    "subreddit_name_prefixed": "r/news",
    "body": "Thank you, life was difficult but looking back now, it made me stronger and shaped who I am now. ",
    "controversiality": 0,
    "ups": 92,
    "downs": 0,
    "score": 92,
    "created": 1500613177.0,
    "date_created": "2017-07-20",
    "time_created": "16:59:37",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhm9yd",
    "parent_id": "t1_dkhm1f9",
    "subreddit_name_prefixed": "r/news",
    "body": "Don't forget Papercut",
    "controversiality": 0,
    "ups": 1282,
    "downs": 0,
    "score": 1282,
    "created": 1500607968.0,
    "date_created": "2017-07-20",
    "time_created": "15:32:48",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhmuo3",
    "parent_id": "t1_dkhllfn",
    "subreddit_name_prefixed": "r/news",
    "body": " my brother had this downloaded on our computer before I even knew how to really use the internet. Back in my dial up days.",
    "controversiality": 0,
    "ups": 489,
    "downs": 0,
    "score": 489,
    "created": 1500608547.0,
    "date_created": "2017-07-20",
    "time_created": "15:42:27",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhpyao",
    "parent_id": "t1_dkhllfn",
    "subreddit_name_prefixed": "r/news",
    "body": "Oh man. Kazaa. Try to download porn, get DBZ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1500611746.0,
    "date_created": "2017-07-20",
    "time_created": "16:35:46",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhs2dw",
    "parent_id": "t1_dkhneft",
    "subreddit_name_prefixed": "r/news",
    "body": "Those AMV's were my childhood. ",
    "controversiality": 0,
    "ups": 300,
    "downs": 0,
    "score": 300,
    "created": 1500614031.0,
    "date_created": "2017-07-20",
    "time_created": "17:13:51",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhmt5v",
    "parent_id": "t1_dkhkloz",
    "subreddit_name_prefixed": "r/news",
    "body": "Same. Linkin Park is probably the only band that I still listen too from that part in my life. His music will stand the test of time.",
    "controversiality": 0,
    "ups": 1286,
    "downs": 0,
    "score": 1286,
    "created": 1500608505.0,
    "date_created": "2017-07-20",
    "time_created": "15:41:45",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhqrbf",
    "parent_id": "t1_dkhkqid",
    "subreddit_name_prefixed": "r/news",
    "body": "Exactly the same for me. I still listen to both albums in the car regularly. ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1500612601.0,
    "date_created": "2017-07-20",
    "time_created": "16:50:01",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki7c5k",
    "parent_id": "t1_dki0hqy",
    "subreddit_name_prefixed": "r/news",
    "body": "Seems we all do. \nThe most hurtful about this whole thing is that Linkin Park has so many songs discouraging people from hurting themselves, Chester sang those words precisely to lift up people, but he couldn't do that for himself. ",
    "controversiality": 0,
    "ups": 161,
    "downs": 0,
    "score": 161,
    "created": 1500633654.0,
    "date_created": "2017-07-20",
    "time_created": "22:40:54",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki7gei",
    "parent_id": "t1_dki0hqy",
    "subreddit_name_prefixed": "r/news",
    "body": "[This live version](https://www.youtube.com/watch?v=CgwL14IDDJY) that they performed just after Chris Cornell passed moved me to tears. There was so much emotion in this performance. His voice touched so many millions if not billions of lives, and we all care. ",
    "controversiality": 0,
    "ups": 55,
    "downs": 0,
    "score": 55,
    "created": 1500633814.0,
    "date_created": "2017-07-20",
    "time_created": "22:43:34",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki6eoy",
    "parent_id": "t1_dki00w0",
    "subreddit_name_prefixed": "r/news",
    "body": "I spent thousands of hours on RuneScape back in the day and for years people would type out lyrics to Linkin Park songs completely out of the blue, anywhere in the game. I loved it.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1500632360.0,
    "date_created": "2017-07-20",
    "time_created": "22:19:20",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhvo4c",
    "parent_id": "t1_dkhqya9",
    "subreddit_name_prefixed": "r/news",
    "body": "Honestly such an amazingly written song as well. Chester really sang it well and really brought life to the lyrics.",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1500618195.0,
    "date_created": "2017-07-20",
    "time_created": "18:23:15",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki4c3o",
    "parent_id": "t1_dkhuh3s",
    "subreddit_name_prefixed": "r/news",
    "body": "I listened to my entire LP playlist this afternoon. Almost all of them do. ",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1500629519.0,
    "date_created": "2017-07-20",
    "time_created": "21:31:59",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhra4f",
    "parent_id": "t1_dkhoqkr",
    "subreddit_name_prefixed": "r/news",
    "body": "> Crazy Town anyone?\n\noh my god. the crowd here tried to boo them off the stage. they wouldn't leave! they resorted to saying the names of other acts on the tour to get cheers.\n\nit was *brutal*. \n\nedit: my show was at coral sky/cruzan amphitheater in west palm beach fl.",
    "controversiality": 0,
    "ups": 1131,
    "downs": 0,
    "score": 1131,
    "created": 1500613162.0,
    "date_created": "2017-07-20",
    "time_created": "16:59:22",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhs3h0",
    "parent_id": "t1_dkhoqkr",
    "subreddit_name_prefixed": "r/news",
    "body": "The older you get, the more you'll come to find it's the only trend you can count on.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1500614065.0,
    "date_created": "2017-07-20",
    "time_created": "17:14:25",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhq8uw",
    "parent_id": "t1_dkhlyoa",
    "subreddit_name_prefixed": "r/news",
    "body": "not a band, touring crew member. worked for sabbath. \n\n\n\n",
    "controversiality": 0,
    "ups": 212,
    "downs": 0,
    "score": 212,
    "created": 1500612055.0,
    "date_created": "2017-07-20",
    "time_created": "16:40:55",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhwqd8",
    "parent_id": "t1_dkhryt0",
    "subreddit_name_prefixed": "r/news",
    "body": "In Brazil too, I hope he knew how many people he touched.",
    "controversiality": 0,
    "ups": 126,
    "downs": 0,
    "score": 126,
    "created": 1500619478.0,
    "date_created": "2017-07-20",
    "time_created": "18:44:38",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhut1v",
    "parent_id": "t1_dkhryt0",
    "subreddit_name_prefixed": "r/news",
    "body": "I lived in Karachi in 2001 and my Pakistani-American friend is who introduced me to them. From ages 10 - 14 they were my absolute favorite band.\n\nAfter 9/11, we had to move back to the states and I never talked to my friend again... but I took the music with me.",
    "controversiality": 0,
    "ups": 386,
    "downs": 0,
    "score": 386,
    "created": 1500617164.0,
    "date_created": "2017-07-20",
    "time_created": "18:06:04",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki0d9k",
    "parent_id": "t1_dkhryt0",
    "subreddit_name_prefixed": "r/news",
    "body": "Same here. Lived in Karachi 2002-2010. LP was all the rage. As (what seemed like) the only depressed teenager in my school at the time, Linkin Park helped me fight through those years in a culture where mental illness is largely ignored.",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1500624163.0,
    "date_created": "2017-07-20",
    "time_created": "20:02:43",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki2obs",
    "parent_id": "t1_dkhryt0",
    "subreddit_name_prefixed": "r/news",
    "body": "Same in Turkey. ",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1500627284.0,
    "date_created": "2017-07-20",
    "time_created": "20:54:44",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhv6y3",
    "parent_id": "t1_dkht76o",
    "subreddit_name_prefixed": "r/news",
    "body": "I was a 12 year old kid from a third world country growing up. Linkin Park definitely made me interested in Western music, or any kind of music at all. Now I'm 22 living in Canada, Linkin Park influenced a massive amount of my music taste. This really sucks.",
    "controversiality": 0,
    "ups": 116,
    "downs": 0,
    "score": 116,
    "created": 1500617624.0,
    "date_created": "2017-07-20",
    "time_created": "18:13:44",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki1vft",
    "parent_id": "t1_dkht76o",
    "subreddit_name_prefixed": "r/news",
    "body": "Could Linkin Park be the bridge to peace between Pakistan and India? ",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1500626192.0,
    "date_created": "2017-07-20",
    "time_created": "20:36:32",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjw2n",
    "parent_id": "t1_dkhiq3z",
    "subreddit_name_prefixed": "r/news",
    "body": "A lot of 20-34 year olds right now grew up with Hybrid Theory and Meteora coming out at their most impressionable time for music. I did a fucking class presentation in middle school on why the song structure of \"Breaking the Habit\" was unlike any other song ever made. LP was, and has remained a huge part of my life and the key factor in that is Chester's unbelievably good voice. A voice that was far and above better than anything in alt-rock/ metal at the time. I truly feel devastated, like I've lost part of my childhood. His poor family :(. Rest in peace man. You and Mike Shinoda changed the game forever.\n\n\nEdit: widened age range from 24-28 to 20-34. I in no way intended to upset anyone haha. My reason for picking that age range is because that is the one where Linkin Park could have literally been the first real music you were exposed to, as was the case for me :) \n\n\nEdit 2: Before one more person grills me about \"Breaking the Habit\" and schools me on standard song structure, I would like to point out that I was 11 years old at the time and had not been versed in such things. You missed my point entirely. The point was that I was such a huge fan that I was convinced no better music existed. I no longer feel that it is the most unique song ever made. I didn't know what I was talking about then because I was a small child, but what I knew was that I loved the band and that they had a significant impact on my music growth and development. Yikes...",
    "controversiality": 0,
    "ups": 4812,
    "downs": 0,
    "score": 4812,
    "created": 1500605554.0,
    "date_created": "2017-07-20",
    "time_created": "14:52:34",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhsyyw",
    "parent_id": "t1_dkhrzjl",
    "subreddit_name_prefixed": "r/news",
    "body": "It really does, but you could have said that after every record they put out, but fuck... it seems like entire record is about suicide.\n\nI just watched the live performance of One More Light from I-Days Monza. It's really hard to wrap my head around this one.\n\nThen I listened to *Leave Out All The Rest* fuck, man...\n\nI used to really dig that song, now it's... morbid and sad.\n\nWhat a shitty day. I feel awful for his friends and family and any of his fans that may be struggling.\n\nAsk for help if you need it, please!",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1500615042.0,
    "date_created": "2017-07-20",
    "time_created": "17:30:42",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkrsr",
    "parent_id": "t1_dkhjrdk",
    "subreddit_name_prefixed": "r/news",
    "body": "Man I'm really glad you put that comma after \"fuck\". You had me worried for a second",
    "controversiality": 0,
    "ups": 82,
    "downs": 0,
    "score": 82,
    "created": 1500606445.0,
    "date_created": "2017-07-20",
    "time_created": "15:07:25",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhm2vu",
    "parent_id": "t1_dkhiocu",
    "subreddit_name_prefixed": "r/news",
    "body": "My uncle recently committed suicide and when I called my cousin it was one of the hardest phone calls I've ever made. Like how do you even console someone in that situation. I can't even imagine being in her shoes.",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1500607768.0,
    "date_created": "2017-07-20",
    "time_created": "15:29:28",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhk0xe",
    "parent_id": "t1_dkhitqg",
    "subreddit_name_prefixed": "r/news",
    "body": "That was my first thought, i feel bad for his kids. Poor family. Sad.",
    "controversiality": 0,
    "ups": 1927,
    "downs": 0,
    "score": 1927,
    "created": 1500605690.0,
    "date_created": "2017-07-20",
    "time_created": "14:54:50",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhnyr1",
    "parent_id": "t1_dkhk9xf",
    "subreddit_name_prefixed": "r/news",
    "body": "This is really good insight actually. That struggle must have been huge knowing he had to leave his family behind. It can't be a coincidence that it happened on Chris Cornell's birthday either so that pain must be crippling. I feel especially bad for anyone close to both families. There aren't words to describe how awful of a time this must be for them.",
    "controversiality": 0,
    "ups": 694,
    "downs": 0,
    "score": 694,
    "created": 1500609683.0,
    "date_created": "2017-07-20",
    "time_created": "16:01:23",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhr67y",
    "parent_id": "t1_dkhk9xf",
    "subreddit_name_prefixed": "r/news",
    "body": "Actually that’s not always the case. There is a thought amongst many people who’ve attempted suicide that they’re “baggage” and their families would be better off without all of their issues weighing down on the family. ",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1500613043.0,
    "date_created": "2017-07-20",
    "time_created": "16:57:23",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhqnst",
    "parent_id": "t1_dkhk9xf",
    "subreddit_name_prefixed": "r/news",
    "body": "When my father committed suicide, he timed it and arranged it specifically so that 14-year-old me would be the one to find him.  I have some pretty good ideas as to what kind of dark hell he was in, but by setting it up the way he did, he managed to separate me from any and all fucks I might have given otherwise.  Your suicide can do some very fucked up shit to other people.  I can't think of anything that had more effect on how I see the world, and have really never had anything like a healthy relationship since then (I'm in my 50s now, already quite a bit older than my father was when he died.) Suicide is weird.  I don't pay attention to anyone who claims to understand it.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1500612497.0,
    "date_created": "2017-07-20",
    "time_created": "16:48:17",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkbkk",
    "parent_id": "t1_dkhjgc7",
    "subreddit_name_prefixed": "r/news",
    "body": "I know he had a history of depression and substance abuse, so this comment isn't meant to be taken in a vacuum but... it's probably not a coincidence that it's Chris Cornell's birthday. Unfortunately, your statement is all too true. ",
    "controversiality": 0,
    "ups": 364,
    "downs": 0,
    "score": 364,
    "created": 1500605984.0,
    "date_created": "2017-07-20",
    "time_created": "14:59:44",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhijs7",
    "parent_id": "t1_dkhhwvw",
    "subreddit_name_prefixed": "r/news",
    "body": "He also sung hallelujah for his funeral.  https://www.youtube.com/watch?v=s71v3dQ9m8I",
    "controversiality": 0,
    "ups": 4347,
    "downs": 0,
    "score": 4347,
    "created": 1500604227.0,
    "date_created": "2017-07-20",
    "time_created": "14:30:27",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjwjy",
    "parent_id": "t1_dkhhwvw",
    "subreddit_name_prefixed": "r/news",
    "body": "That was a beautiful note. Kind of a weird signature to end it with, though?\n\nEDIT: Bunch of people telling me what it says--I know it's his name and I can read it. I just meant that that the signature looks at odds with the heartfelt and well-written note above it. Just looks sort of...edgy.  ",
    "controversiality": 0,
    "ups": 782,
    "downs": 0,
    "score": 782,
    "created": 1500605567.0,
    "date_created": "2017-07-20",
    "time_created": "14:52:47",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjsj2",
    "parent_id": "t1_dkhik8t",
    "subreddit_name_prefixed": "r/news",
    "body": "There was a guy in /r/lastimages that posted a pic of his pal that committed suicide, a couple of weeks later he followed suit. Sad stuff.",
    "controversiality": 0,
    "ups": 675,
    "downs": 0,
    "score": 675,
    "created": 1500605457.0,
    "date_created": "2017-07-20",
    "time_created": "14:50:57",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjlui",
    "parent_id": "t1_dkhik8t",
    "subreddit_name_prefixed": "r/news",
    "body": ">Among social groups, suicidal actions can often be observed in clusters.\n>\n>It's sad all around. \n\nI never thought of it this way.  I've lost a LOT of friends I served with to suicide.  The social aspect of losing the people you're closest to along with all the other issues that arise from deployment(s) compounds the problem further.  \n\nNo real point to my comment.  Just wanted to tell you that you gave me one of those \"lightbulb\" moments that put me a bit more at ease.  \n",
    "controversiality": 0,
    "ups": 2159,
    "downs": 0,
    "score": 2159,
    "created": 1500605271.0,
    "date_created": "2017-07-20",
    "time_created": "14:47:51",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhk5gw",
    "parent_id": "t1_dkhik8t",
    "subreddit_name_prefixed": "r/news",
    "body": "Had a professor who studied \"suicide clusters\", as they're called. Main takeaway for me is that seeing friends, family, peers, or even celebrities kill themselves makes it seems like more of an option. \n",
    "controversiality": 0,
    "ups": 520,
    "downs": 0,
    "score": 520,
    "created": 1500605813.0,
    "date_created": "2017-07-20",
    "time_created": "14:56:53",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhizav",
    "parent_id": "t1_dkhik8t",
    "subreddit_name_prefixed": "r/news",
    "body": "This is terrifying, tbh. Two great musicians killing themselves, so close to each other, sends a message, especially to impressionable minds and the truly despondent. Hopefully this will move people to action, by talking with loved ones who seem lost...and not down a darker path where we see more people taking their own lives. ",
    "controversiality": 0,
    "ups": 940,
    "downs": 0,
    "score": 940,
    "created": 1500604654.0,
    "date_created": "2017-07-20",
    "time_created": "14:37:34",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkb8b",
    "parent_id": "t1_dkhijvl",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm 25, i've been listening to Linkin Park since I can remember. I still listen to them on a daily basis. I'm heartbroken.",
    "controversiality": 0,
    "ups": 726,
    "downs": 0,
    "score": 726,
    "created": 1500605975.0,
    "date_created": "2017-07-20",
    "time_created": "14:59:35",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhl11w",
    "parent_id": "t1_dkhjzz6",
    "subreddit_name_prefixed": "r/news",
    "body": "Dude I had the exact same experience. Meteora on repeat late at night to help me sleep. Those memories are most vivid during Summer 2003. 28 and choking back tears. RIP Chester.",
    "controversiality": 0,
    "ups": 68,
    "downs": 0,
    "score": 68,
    "created": 1500606708.0,
    "date_created": "2017-07-20",
    "time_created": "15:11:48",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhl964",
    "parent_id": "t1_dkhjzz6",
    "subreddit_name_prefixed": "r/news",
    "body": "> I remember listening to Linkin Parks albums late at night on repeat as part of my sleep routine!\n\nWhen my son was a toddler, I popped in Hybrid Theory to my cd player while driving, and played In the End.  Kid went nuts!  For ages, he had to hear it, over and over, every time we were in the car, but eventually he forgot about it.  Then, when he was 6 or 7 I got him a cd player and that CD, and he listened to it every night.  Couldn't get him to listen to anything else for the longest time, like a year at least.  He's 11 now.  This is going to break his little heart.",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1500606934.0,
    "date_created": "2017-07-20",
    "time_created": "15:15:34",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhmysc",
    "parent_id": "t1_dkhjzz6",
    "subreddit_name_prefixed": "r/news",
    "body": "Im a 31 year old dad to a little girl and I cried too. That was a hard day. Woke up for work and the first thing I did was check my FB and that was the first thing I read. I wanted to call into work but didn't. My gf didn't sleep much that night and she found out thru eddie Vedder's instagram and she didn't tell me cause she knew how much he meant to me. I was a huge Soundgarden and Audioslave and Temple of the Dog fan and his music shaped my musical taste and was one of the reasons I started singing and writing songs. I toughed it out that day at work and when I got home I grabbed a 6 pack and had a smoke on my back porch when I read this thing my gf sent me on fb. It was about why some people don't realise why it hurts some people so much when you lose someone like a musician you may not have met but has had so much influence in your life. They're your teachers, your philosophers, your rocks that you think are always gonna be there. They were there for you when you were down and helped you thru hard times. Im just paraphrasing but It was really beautiful and when I read that post I just started crying by myself in my porch while my daughter and gf were inside the house. I was never really big into Linkin Park but I know they also had a large fan base of people that looked up to them the way I looked up to Cornell. These guys touched a lot of people with their music and it's just so damn tragic the way their flames burnt out. \nRIP. ",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1500608661.0,
    "date_created": "2017-07-20",
    "time_created": "15:44:21",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhoygl",
    "parent_id": "t1_dkhnakv",
    "subreddit_name_prefixed": "r/news",
    "body": "That's what I've been thinking too.  Hope you're in a good place now.",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1500610706.0,
    "date_created": "2017-07-20",
    "time_created": "16:18:26",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhm70r",
    "parent_id": "t1_dkhkbry",
    "subreddit_name_prefixed": "r/news",
    "body": "Same here. I was hoping to see them this year on tour for their new album.",
    "controversiality": 0,
    "ups": 396,
    "downs": 0,
    "score": 396,
    "created": 1500607883.0,
    "date_created": "2017-07-20",
    "time_created": "15:31:23",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjsog",
    "parent_id": "t1_dkhj70e",
    "subreddit_name_prefixed": "r/news",
    "body": "I was finally going to go next Friday and see them. 😢",
    "controversiality": 0,
    "ups": 913,
    "downs": 0,
    "score": 913,
    "created": 1500605461.0,
    "date_created": "2017-07-20",
    "time_created": "14:51:01",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkoyc",
    "parent_id": "t1_dkhjs99",
    "subreddit_name_prefixed": "r/news",
    "body": "Its so weird how the death of someone I've never even met can have such an effect on me.",
    "controversiality": 0,
    "ups": 239,
    "downs": 0,
    "score": 239,
    "created": 1500606363.0,
    "date_created": "2017-07-20",
    "time_created": "15:06:03",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhyfid",
    "parent_id": "t1_dkhwmy1",
    "subreddit_name_prefixed": "r/news",
    "body": "I have no idea. My parents told me not to talk to her again, and they switched churches. She deleted her Facebook and I had no way of contacting her. This moment with her was over ten years ago.",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1500621626.0,
    "date_created": "2017-07-20",
    "time_created": "19:20:26",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki5fnc",
    "parent_id": "t1_dki56wv",
    "subreddit_name_prefixed": "r/news",
    "body": "\"If sub specie aeternitatis there is no reason to believe that anything matters, then that doesn't matter either, and we can approach our absurd lives with irony instead of heroism or despair.\" - The Absurd, Thomas Nagel",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1500631018.0,
    "date_created": "2017-07-20",
    "time_created": "21:56:58",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhus0t",
    "parent_id": "t1_dkhofqx",
    "subreddit_name_prefixed": "r/news",
    "body": "Your friend is the type of friend more people need.",
    "controversiality": 0,
    "ups": 102,
    "downs": 0,
    "score": 102,
    "created": 1500617129.0,
    "date_created": "2017-07-20",
    "time_created": "18:05:29",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhth1n",
    "parent_id": "t1_dkhofqx",
    "subreddit_name_prefixed": "r/news",
    "body": "That's great advice :)",
    "controversiality": 0,
    "ups": 98,
    "downs": 0,
    "score": 98,
    "created": 1500615615.0,
    "date_created": "2017-07-20",
    "time_created": "17:40:15",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhuqc9",
    "parent_id": "t1_dkhofqx",
    "subreddit_name_prefixed": "r/news",
    "body": "You 100% nailed the need to be a constant comfort when everyone else stops checking in and things seem to settle down, that's when things can get really bad. I'm sorry you had to learn this through personal experience. I wish you well.",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1500617073.0,
    "date_created": "2017-07-20",
    "time_created": "18:04:33",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhned4",
    "parent_id": "t1_dkhkg84",
    "subreddit_name_prefixed": "r/news",
    "body": "As someone who's gone through this situation recently, the one thing you can truly do for him is be there for him when he gets back. Get him out (not forcefully of course) but plan a few fun things to do. I'll say that the worst thing someone can do when they come back would be to sit around in the room and not enjoy their life. \nI was lucky to have excellent friends that know when to back off and let me be, and when to get me out and put a smile on my face.",
    "controversiality": 0,
    "ups": 110,
    "downs": 0,
    "score": 110,
    "created": 1500609105.0,
    "date_created": "2017-07-20",
    "time_created": "15:51:45",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhmarc",
    "parent_id": "t1_dkhkmvr",
    "subreddit_name_prefixed": "r/news",
    "body": "On an unrelated note, that's why I love this quote by marilyn manson. When asked about what he would have said to the columbine perps: \"I would not have said anything, I would have listened and that's what no one did.\"",
    "controversiality": 0,
    "ups": 262,
    "downs": 0,
    "score": 262,
    "created": 1500607990.0,
    "date_created": "2017-07-20",
    "time_created": "15:33:10",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhnefs",
    "parent_id": "t1_dkhmma4",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm a little younger but they were still part of my childhood, along with my older siblings growing up with them. :(\n\nWe even somehow had Meteora on our original Xbox too.",
    "controversiality": 0,
    "ups": 124,
    "downs": 0,
    "score": 124,
    "created": 1500609107.0,
    "date_created": "2017-07-20",
    "time_created": "15:51:47",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhn6ry",
    "parent_id": "t1_dkhmma4",
    "subreddit_name_prefixed": "r/news",
    "body": "Same, and I don't even listen to metal.\n\nBut that Numb mashup with Jay-Z is what got me into rap rock.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1500608890.0,
    "date_created": "2017-07-20",
    "time_created": "15:48:10",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhntyq",
    "parent_id": "t1_dkhmma4",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm 26 but would say anyone from 20 - 30 is down and out about this because childhood bands are what shapes certain memories. ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1500609544.0,
    "date_created": "2017-07-20",
    "time_created": "15:59:04",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhk7hb",
    "parent_id": "t1_dkhjrit",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 2090,
    "downs": 0,
    "score": 2090,
    "created": 1500605871.0,
    "date_created": "2017-07-20",
    "time_created": "14:57:51",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhklz6",
    "parent_id": "t1_dkhjrit",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm one of them.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1500606281.0,
    "date_created": "2017-07-20",
    "time_created": "15:04:41",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhleet",
    "parent_id": "t1_dkhjrit",
    "subreddit_name_prefixed": "r/news",
    "body": "This is the most ironic and saddening part. Linkin Park gets made fun of cause of the edgy teens we all were who listened to this stuff, but it probably helped a lot of us out of that same dark hole he was in. Shit dude a lot of their songs take on new meaning with his death in mind. ",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1500607075.0,
    "date_created": "2017-07-20",
    "time_created": "15:17:55",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhk4pa",
    "parent_id": "t1_dkhj35q",
    "subreddit_name_prefixed": "r/news",
    "body": "Numb/Encore was even better. I don't think I've ever heard a better mash up of two completely different songs ",
    "controversiality": 0,
    "ups": 89,
    "downs": 0,
    "score": 89,
    "created": 1500605792.0,
    "date_created": "2017-07-20",
    "time_created": "14:56:32",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhk3rx",
    "parent_id": "t1_dkhj4es",
    "subreddit_name_prefixed": "r/news",
    "body": "Breaking the Habit was the song my brothers and I would blast on repeat when we'd have Nerf fights in middle school. Just such a big part of my life :(",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1500605767.0,
    "date_created": "2017-07-20",
    "time_created": "14:56:07",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhsom4",
    "parent_id": "t1_dkhshni",
    "subreddit_name_prefixed": "r/news",
    "body": "It does that a lot for me too on mobile and I typically just reload it.\n\nHere ya go: https://i.imgur.com/ALbBlN0.png\n\n",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1500614722.0,
    "date_created": "2017-07-20",
    "time_created": "17:25:22",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhie49",
    "parent_id": "t1_dkhi5ng",
    "subreddit_name_prefixed": "r/news",
    "body": "I mean Hybrid Theory at the time was one of the best selling albums of all time.  They truly were awesome",
    "controversiality": 0,
    "ups": 777,
    "downs": 0,
    "score": 777,
    "created": 1500604071.0,
    "date_created": "2017-07-20",
    "time_created": "14:27:51",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhipa6",
    "parent_id": "t1_dkhi5ng",
    "subreddit_name_prefixed": "r/news",
    "body": "Dude, I'm pretty sure *everyone* jammed to Linkin Park in their early teens, I imagine a lot of people aged 15-30 will really feel this.\n\nI haven't listened to them in years and I still get their songs stuck in my head sometimes. Massive loss.",
    "controversiality": 0,
    "ups": 457,
    "downs": 0,
    "score": 457,
    "created": 1500604379.0,
    "date_created": "2017-07-20",
    "time_created": "14:32:59",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjzfl",
    "parent_id": "t1_dkhjsth",
    "subreddit_name_prefixed": "r/news",
    "body": "I think they played a large part in early 00's rock and for a lot of us millenials. This is very sad.",
    "controversiality": 0,
    "ups": 737,
    "downs": 0,
    "score": 737,
    "created": 1500605648.0,
    "date_created": "2017-07-20",
    "time_created": "14:54:08",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhixvx",
    "parent_id": "t1_dkhir6g",
    "subreddit_name_prefixed": "r/news",
    "body": "and 2 wives apparently",
    "controversiality": 0,
    "ups": 220,
    "downs": 0,
    "score": 220,
    "created": 1500604617.0,
    "date_created": "2017-07-20",
    "time_created": "14:36:57",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjjou",
    "parent_id": "t1_dkhj2i8",
    "subreddit_name_prefixed": "r/news",
    "body": "Along with Reanimation ",
    "controversiality": 0,
    "ups": 1318,
    "downs": 0,
    "score": 1318,
    "created": 1500605212.0,
    "date_created": "2017-07-20",
    "time_created": "14:46:52",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjny9",
    "parent_id": "t1_dkhj2i8",
    "subreddit_name_prefixed": "r/news",
    "body": "Collision Course is *still an A+ album*.\n\nBut then again so is Hybrid Theory and Meteora. LP was the soundtrack to my childhood and this hurts on a personal level. It's foundation shaking.\n\nPlease, everyone *it's okay to seek help.* Just like we need help from doctors for our bodies we can also need help for our minds. There is nothing wrong with needing help.\n\nTell your friends you're there for them. Tell your family you're there for them. And when they ask for your help actually be there for them.\n\nIt's time we destigmatize mental health.",
    "controversiality": 0,
    "ups": 469,
    "downs": 0,
    "score": 469,
    "created": 1500605329.0,
    "date_created": "2017-07-20",
    "time_created": "14:48:49",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkyz7",
    "parent_id": "t1_dkhk0bi",
    "subreddit_name_prefixed": "r/news",
    "body": "Same here. I think one day it will be considered one of the great rock concept albums.",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1500606647.0,
    "date_created": "2017-07-20",
    "time_created": "15:10:47",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhm5ot",
    "parent_id": "t1_dkhk0bi",
    "subreddit_name_prefixed": "r/news",
    "body": "Underrated masterpiece if you ask me",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1500607847.0,
    "date_created": "2017-07-20",
    "time_created": "15:30:47",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhm55m",
    "parent_id": "t1_dkhk0bi",
    "subreddit_name_prefixed": "r/news",
    "body": "This is one of my all time favorite albums. It transcends Linkin Park and is its own piece of art. I've got it on. Waiting For The End is the track currently playing.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1500607832.0,
    "date_created": "2017-07-20",
    "time_created": "15:30:32",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhl8xm",
    "parent_id": "t1_dkhkgkm",
    "subreddit_name_prefixed": "r/news",
    "body": "some people don't even have the money to seek help. ",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1500606927.0,
    "date_created": "2017-07-20",
    "time_created": "15:15:27",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhn2wg",
    "parent_id": "t1_dkhl572",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 432,
    "downs": 0,
    "score": 432,
    "created": 1500608778.0,
    "date_created": "2017-07-20",
    "time_created": "15:46:18",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhmn9t",
    "parent_id": "t1_dkhl572",
    "subreddit_name_prefixed": "r/news",
    "body": "I mean. For a lot of artists critique is frustrating. But critique that hits your own concerns is devastating. \n\nYou are your own worst critic. ",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1500608342.0,
    "date_created": "2017-07-20",
    "time_created": "15:39:02",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhlxnk",
    "parent_id": "t1_dkhkd4c",
    "subreddit_name_prefixed": "r/news",
    "body": "This is the one thing I always quote when I hear someone say \"suicide is selfish\". DFW put it best. So sad he went the same way. :(",
    "controversiality": 0,
    "ups": 129,
    "downs": 0,
    "score": 129,
    "created": 1500607618.0,
    "date_created": "2017-07-20",
    "time_created": "15:26:58",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkwws",
    "parent_id": "t1_dkhjfg6",
    "subreddit_name_prefixed": "r/news",
    "body": "Idk man, sometimes that thought process of thinking of it as selfish and the cowards way out; that had been the only thing to stop me before.\nI'm good now before you ask and I don't view it that way for others it's just those were the things I had to tell myself to stop myself. \nIf anyone ever contemplates self harm like that it's almost always for extremely personal intimate reasons that deserve to be respected, that much I get. Such a shitty subject. :/\nPeace brotha I'm just rambling now.",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1500606590.0,
    "date_created": "2017-07-20",
    "time_created": "15:09:50",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkmep",
    "parent_id": "t1_dkhjcri",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm thinking about the song One More Light iself.\n\n*\"Who cares if one more light goes out, on a sky of a million stars. it flickers, flickers\"*\n\nI do Chester =(",
    "controversiality": 0,
    "ups": 275,
    "downs": 0,
    "score": 275,
    "created": 1500606293.0,
    "date_created": "2017-07-20",
    "time_created": "15:04:53",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhk6fq",
    "parent_id": "t1_dkhjcri",
    "subreddit_name_prefixed": "r/news",
    "body": "The Messenger from A Thousand Suns",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1500605842.0,
    "date_created": "2017-07-20",
    "time_created": "14:57:22",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhnb0y",
    "parent_id": "t1_dkhkwmr",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah, \"even the suicide hotline wont help me\" can be just the thing to push a desperate person over the edge. They made it worse when I called them too.",
    "controversiality": 0,
    "ups": 647,
    "downs": 0,
    "score": 647,
    "created": 1500609010.0,
    "date_created": "2017-07-20",
    "time_created": "15:50:10",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhpb7t",
    "parent_id": "t1_dkhkwmr",
    "subreddit_name_prefixed": "r/news",
    "body": "From someone who worked at a crisis/suicide hotline (not this one, but a local one in my town), and also someone who's dealt with depression and mental illness for 10 years now, I'm so sorry that person handled it that way, and treated you like that. When I was working at the place I worked, we were trained to stay on the phone as long as the person needed us to, and to try to keep them talking if things escalated. It didn't matter if they weren't saying anything, or if they didn't want to talk about how they were feeling and just wanted to talk about something else. If they just wanted to sit there and listen to us speak to them, or if they just wanted to sit in silence, knowing that someone else was on the other end with them, we stayed connected. That call didn't end until the person who called wanted it to end. There were many late nights when I was the only one in the office, and I took calls that lasted an hour or longer, and I was glad to do it if there was even the smallest chance I was helping that other person in some way. I really wish that you would've had that kind of support that you needed that night.\n\nEdit: Wow, thank you so much for the gold! I wasn't expecting that. But, this is my first time getting gold, so I'm glad it was for a comment about something I'm so passionate about and an advocate for :)",
    "controversiality": 0,
    "ups": 616,
    "downs": 0,
    "score": 616,
    "created": 1500611074.0,
    "date_created": "2017-07-20",
    "time_created": "16:24:34",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhpc55",
    "parent_id": "t1_dkhkwmr",
    "subreddit_name_prefixed": "r/news",
    "body": "I can't find him but there was a redditor that went to a suicide sub here and asked what he should do. He called the suicide hotline and specifically told them he doesnt want to go to a hospital but they called the police anyway. After he got out of crisis, he had a bunch of hospital bills to pay for. That reinforced his decision to die and he hasn't made a comment or post since. I'm gonna try to find him now.\n\nEdit: Found him :(  [This](https://www.reddit.com/r/legaladvice/comments/69me25/comment/dh7olc6?st=J5CW99LK&sh=1e3b48a8) was his last comment.",
    "controversiality": 0,
    "ups": 128,
    "downs": 0,
    "score": 128,
    "created": 1500611103.0,
    "date_created": "2017-07-20",
    "time_created": "16:25:03",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhnbwj",
    "parent_id": "t1_dkhkwmr",
    "subreddit_name_prefixed": "r/news",
    "body": "Jesus dude, I'm so sorry they did that to you. How are you doing these days?",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1500609035.0,
    "date_created": "2017-07-20",
    "time_created": "15:50:35",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhp1dx",
    "parent_id": "t1_dkhkwmr",
    "subreddit_name_prefixed": "r/news",
    "body": "This may sound a bit nutters and it certainly doesn't work for everyone, but when I was going through my bouts of severe depression and suicidal tendencies, I would watch and play all the sad, sappy movies and games. Bittersweet tragedies that made me weep beautiful tears. I don't know what it was about it, but just knowing I wasn't the only one feeling that way and sharing in that primally human experience of sorrow and loss helped me get through some of my hardest moments.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1500610790.0,
    "date_created": "2017-07-20",
    "time_created": "16:19:50",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkl06",
    "parent_id": "t1_dkhk3tc",
    "subreddit_name_prefixed": "r/news",
    "body": "https://en.wikipedia.org/wiki/List_of_suicide_crisis_lines\n\nIts sorted in alphabetic order... Please, seek help if you are in need. ",
    "controversiality": 0,
    "ups": 266,
    "downs": 0,
    "score": 266,
    "created": 1500606252.0,
    "date_created": "2017-07-20",
    "time_created": "15:04:12",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhm0xt",
    "parent_id": "t1_dkhkg2s",
    "subreddit_name_prefixed": "r/news",
    "body": "I was just going to say, isn't there a better number to call? I was going through a really tough time a few years back and called, and they were horrible. The woman I spoke with was extremely rude and not helpful at all, and was annoyed that I even called. In a strange way, it actually helped - I was so caught off guard by how bad the experience was, that I actually went from being ready to end my life to being angry at this person for being such a dick and it snapped me out of it. ",
    "controversiality": 0,
    "ups": 109,
    "downs": 0,
    "score": 109,
    "created": 1500607711.0,
    "date_created": "2017-07-20",
    "time_created": "15:28:31",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhn4rj",
    "parent_id": "t1_dkhkg2s",
    "subreddit_name_prefixed": "r/news",
    "body": "I agree 100%. I was having a shitty month dealing with some legal issues from another state, all while my relationship was tanking with my ex girlfriend. \n\nI had gotten a bit drunk & hopeless, so I called a state crisis hotline & the two attendees kept asking over & over if I felt like I was going to hurt myself or other people, to which I said something along the lines of, \"yeah I guess sometimes life doesn't feel worth the hassle sometimes\". \n\nIn my drunken pitiful stupor I gave them my home address when they asked. I live in florida. Cop car & ambulance roll up & I get Baker Acted & carted away in tge ambulance to an ER where I get locked in a hospital room with no door handle on the inside & a fucking bed. They also gave me Ativan to turn me into a zombie because understandably I had sobered up & was freaking out as I had work the next morning.\n\nSpent the minimum 48 hours in a mental institution that was annexed from the main hospital. Met some seriously not-okay people. I'm still getting bills of upwards towards $15,000 total for that mess. I can appreciate that things like that save lives, but fuck if it doesn't throw me even deeper into despair now that my job knows what happened & the incurring debt with collection agencies harassing me.\n\nNot a fun time, I don't recommend telling them where you live.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1500608832.0,
    "date_created": "2017-07-20",
    "time_created": "15:47:12",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkpb1",
    "parent_id": "t1_dkhkg2s",
    "subreddit_name_prefixed": "r/news",
    "body": "I've heard nothing but bad stories about the hotline. People love to post it because it's an easy way to feel like a hero, but they're probably doing more harm than good.",
    "controversiality": 0,
    "ups": 484,
    "downs": 0,
    "score": 484,
    "created": 1500606374.0,
    "date_created": "2017-07-20",
    "time_created": "15:06:14",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkq3l",
    "parent_id": "t1_dkhkg2s",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 111,
    "downs": 0,
    "score": 111,
    "created": 1500606397.0,
    "date_created": "2017-07-20",
    "time_created": "15:06:37",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhk080",
    "parent_id": "t1_dkhjbzq",
    "subreddit_name_prefixed": "r/news",
    "body": "dude shit got real for some people when it tanked",
    "controversiality": 0,
    "ups": 1892,
    "downs": 0,
    "score": 1892,
    "created": 1500605670.0,
    "date_created": "2017-07-20",
    "time_created": "14:54:30",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhk3dw",
    "parent_id": "t1_dkhjbzq",
    "subreddit_name_prefixed": "r/news",
    "body": "Which is a shame because the price always rebounds and with a vengeance. Today the price is 2700 for example. ",
    "controversiality": 0,
    "ups": 234,
    "downs": 0,
    "score": 234,
    "created": 1500605755.0,
    "date_created": "2017-07-20",
    "time_created": "14:55:55",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhu4nu",
    "parent_id": "t1_dkhsxmn",
    "subreddit_name_prefixed": "r/news",
    "body": "Man... As a kid I grew up listening to their music. Bought both hybrid theory and was hooked since. Bought meteora the day it came out and binged on it so hard. As time passed I started listening to other types of genres, eventually stopped following them but occasionally checked out their new stuff. Chester was the first person's voice who I could relate to, I always thought I had to have a super masculine singing voice, but when I heard him and how great he sounded in In the end, I started to realise I didn't need to force myself to try to sing in a deeper key just to conform. I've always wanted to eventually see them at a concert, they were the first band I avidly followed, but now I won't get that chance. \n\n\nRip, one of the most unique voices that has touched untold millions around the world.",
    "controversiality": 0,
    "ups": 2314,
    "downs": 0,
    "score": 2314,
    "created": 1500616366.0,
    "date_created": "2017-07-20",
    "time_created": "17:52:46",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhwwaw",
    "parent_id": "t1_dkhsxmn",
    "subreddit_name_prefixed": "r/news",
    "body": "*Lyrics for the lazy:*  \n\n\n[Verse 1: Chester Bennington]\nI don’t like my mind right now\nStacking up problems that are so unnecessary\nWish that I could slow things down\nI wanna let go but there’s comfort in the panic\nAnd I drive myself crazy\nThinking everything's about me\nYeah, I drive myself crazy\n'Cause I can’t escape the gravity\n\n[Chorus: Chester Bennington & Kiiara]\nI'm holding on\nWhy is everything so heavy?\nHolding on\nSo much more than I can carry\nI keep dragging around what's bringing me down\nIf I just let go, I'd be set free\nHolding on\nWhy is everything so heavy?\n\n[Verse 2: Kiiara]\nYou say that I'm paranoid\nBut I’m pretty sure the world is out to get me\nIt’s not like I make the choice\nTo let my mind stay so fucking messy\nI know I'm not the center of the universe\nBut you keep spinning 'round me just the same\nI know I'm not the center of the universe\nBut you keep spinning 'round me just the same  \n\nI'm holding on\nWhy is everything so heavy?\nHolding on\nSo much more than I can carry\nI keep dragging around what's bringing me down\nIf I just let go, I'd be set free\nHolding on\nWhy is everything so heavy?\n\n[Bridge: Chester Bennington & Kiiara]\nI know I'm not the center of the universe\nBut you keep spinning 'round me just the same\nI know I'm not the center of the universe\nBut you keep spinning 'round me just the same\nAnd I drive myself crazy\nThinking everything’s about me\n\n[Chorus: Chester Bennington & Kiiara]\nHolding on\nWhy is everything so heavy?\nHolding on\nSo much more than I can carry\nI keep dragging around what's bringing me down\nIf I just let go, I'd be set free\nHolding on\nWhy is everything so heavy?  (3x)  \n ",
    "controversiality": 0,
    "ups": 426,
    "downs": 0,
    "score": 426,
    "created": 1500619681.0,
    "date_created": "2017-07-20",
    "time_created": "18:48:01",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhu0ns",
    "parent_id": "t1_dkht297",
    "subreddit_name_prefixed": "r/news",
    "body": "Damn I never would have known that... the second part, was that the general plot? Wtf?",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1500616235.0,
    "date_created": "2017-07-20",
    "time_created": "17:50:35",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki9lmy",
    "parent_id": "t1_dki33n9",
    "subreddit_name_prefixed": "r/news",
    "body": "It's that way with all abuses, you're manipulated into thinking nothing good can come from squealing",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1500636836.0,
    "date_created": "2017-07-20",
    "time_created": "23:33:56",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkz4u",
    "parent_id": "t1_dkhkcso",
    "subreddit_name_prefixed": "r/news",
    "body": "I dont get the suicidal feelings, but my world just decays due to neglect around me when I'm feeling down and I end up being in a worse place each time, it's tiring to feel stuck in a rut for months on end.",
    "controversiality": 0,
    "ups": 348,
    "downs": 0,
    "score": 348,
    "created": 1500606652.0,
    "date_created": "2017-07-20",
    "time_created": "15:10:52",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkho68c",
    "parent_id": "t1_dkhkcso",
    "subreddit_name_prefixed": "r/news",
    "body": "\"It's not that I particularly want to die, I just want a painless way to conveniently stop living.\"",
    "controversiality": 0,
    "ups": 401,
    "downs": 0,
    "score": 401,
    "created": 1500609895.0,
    "date_created": "2017-07-20",
    "time_created": "16:04:55",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkibs34",
    "parent_id": "t1_dkhram0",
    "subreddit_name_prefixed": "r/news",
    "body": "Good luck in the future buddy. You aren't the only one, even if it feels that way. ",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1500640181.0,
    "date_created": "2017-07-21",
    "time_created": "00:29:41",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhssnr",
    "parent_id": "t1_dkhm9yd",
    "subreddit_name_prefixed": "r/news",
    "body": "I used Papercut in my first DBZ stick-death flash animation I ever put on Newgrounds.\n\nToday is a sad day :(",
    "controversiality": 0,
    "ups": 136,
    "downs": 0,
    "score": 136,
    "created": 1500614849.0,
    "date_created": "2017-07-20",
    "time_created": "17:27:29",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhrytg",
    "parent_id": "t1_dkhm9yd",
    "subreddit_name_prefixed": "r/news",
    "body": "There was a badass Papercut one with Trunks' story I watched so many times.",
    "controversiality": 0,
    "ups": 662,
    "downs": 0,
    "score": 662,
    "created": 1500613921.0,
    "date_created": "2017-07-20",
    "time_created": "17:12:01",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhni0q",
    "parent_id": "t1_dkhmuo3",
    "subreddit_name_prefixed": "r/news",
    "body": "tie up the phone line to see Trunks cut Frieza into a 100 pieces ",
    "controversiality": 0,
    "ups": 307,
    "downs": 0,
    "score": 307,
    "created": 1500609208.0,
    "date_created": "2017-07-20",
    "time_created": "15:53:28",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhtl7l",
    "parent_id": "t1_dkhs2dw",
    "subreddit_name_prefixed": "r/news",
    "body": "Those amv's made with Windows Movie Maker damn too bad I deleted the ones I made at like 12-13 years old :(",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1500615743.0,
    "date_created": "2017-07-20",
    "time_created": "17:42:23",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhmy1o",
    "parent_id": "t1_dkhmt5v",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah, I'm devastated. I haven't heard much of the new album. Think it's time to give it a listen. We went on a school trip to Finland back in 2002. That album was the soundtrack for that trip and a huge part of that time in my life.  \n\nI'm sorry I never got the chance to see him perform live. ",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1500608640.0,
    "date_created": "2017-07-20",
    "time_created": "15:44:00",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkidzmj",
    "parent_id": "t1_dki7c5k",
    "subreddit_name_prefixed": "r/news",
    "body": "Ironic. He could save others from death...but not himself.\n\nIn all seriousness though, Linkin Park and Chester will be one of maybe 10 bands from the 2000s that will be remembered and go down in history as one of the GOAT. Their fusion of rap, hip-hop, electronica, rock/hard rock, and metal was never done before, and especially not done on the reach and scale of Linkin Park (RATM did rap rock and Radiohead incorporated electronics into rock with OK Computer but they were more influenced by it than a full genre fusion like Linkin Park). RIP Chester, you will be missed.",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1500644100.0,
    "date_created": "2017-07-21",
    "time_created": "01:35:00",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki94dz",
    "parent_id": "t1_dki7gei",
    "subreddit_name_prefixed": "r/news",
    "body": "4:21  \nI've been trying to cry ever since the news dropped. This one moment did it. It's absolutely heartbreaking. Thanks for posting it. ",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1500636138.0,
    "date_created": "2017-07-20",
    "time_created": "23:22:18",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki5zh5",
    "parent_id": "t1_dki4c3o",
    "subreddit_name_prefixed": "r/news",
    "body": "I was always afraid something like this would happen. And if it did I knew listening to some of their songs would be just downright gut wrenching.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1500631771.0,
    "date_created": "2017-07-20",
    "time_created": "22:09:31",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkht1c6",
    "parent_id": "t1_dkhra4f",
    "subreddit_name_prefixed": "r/news",
    "body": "I live in Kitchener-Waterloo Ontario, former home of the live venue, The Twist.\n\nIn 85 The Cult was headlining a show with a relatively unknown band. That opening band was booed off the stage because of The Cult's popularity of the time.\n\nThat band was Guns n' Roses.\n\nOf course that same album they were touring went on to be the best selling debut album of all time in the US.\n",
    "controversiality": 0,
    "ups": 701,
    "downs": 0,
    "score": 701,
    "created": 1500615117.0,
    "date_created": "2017-07-20",
    "time_created": "17:31:57",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhqplg",
    "parent_id": "t1_dkhq8uw",
    "subreddit_name_prefixed": "r/news",
    "body": "Ah, cool.  Thanks for answering.",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1500612550.0,
    "date_created": "2017-07-20",
    "time_created": "16:49:10",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhrhpg",
    "parent_id": "t1_dkhq8uw",
    "subreddit_name_prefixed": "r/news",
    "body": "You've probably got some great stories",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1500613393.0,
    "date_created": "2017-07-20",
    "time_created": "17:03:13",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki36jg",
    "parent_id": "t1_dkhwqd8",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1500627969.0,
    "date_created": "2017-07-20",
    "time_created": "21:06:09",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki38ca",
    "parent_id": "t1_dkhwqd8",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm sure he knew. He also knew his family loved him. Depression could really fuck your head:(",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1500628039.0,
    "date_created": "2017-07-20",
    "time_created": "21:07:19",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki5ft5",
    "parent_id": "t1_dkhut1v",
    "subreddit_name_prefixed": "r/news",
    "body": "I was in Karachi in 2001/2002 at the American Consulate. I used to workout to their CD all the time in our gym. ",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1500631024.0,
    "date_created": "2017-07-20",
    "time_created": "21:57:04",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkpdc",
    "parent_id": "t1_dkhjw2n",
    "subreddit_name_prefixed": "r/news",
    "body": "Bump the upper limit of that bracket up a bit. Those of us who were in middle/high school when Hybrid Theory came out are in our 30's now",
    "controversiality": 0,
    "ups": 1508,
    "downs": 0,
    "score": 1508,
    "created": 1500606376.0,
    "date_created": "2017-07-20",
    "time_created": "15:06:16",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkbyn",
    "parent_id": "t1_dkhjw2n",
    "subreddit_name_prefixed": "r/news",
    "body": "> the song structure of \"Breaking the Habit\" was unlike any other song ever made. \n\nI'm interested in this  \n\nEdit: asking because while I think the song is cool, it doesn't exactly sound groundbreaking to me.  It seems like a pretty standard song structure ",
    "controversiality": 0,
    "ups": 191,
    "downs": 0,
    "score": 191,
    "created": 1500605996.0,
    "date_created": "2017-07-20",
    "time_created": "14:59:56",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhla83",
    "parent_id": "t1_dkhkrsr",
    "subreddit_name_prefixed": "r/news",
    "body": "I should have kept the comma but added a 't' to but and really confused people. ",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1500606962.0,
    "date_created": "2017-07-20",
    "time_created": "15:16:02",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhqm24",
    "parent_id": "t1_dkhnyr1",
    "subreddit_name_prefixed": "r/news",
    "body": "His second marriage just ended this year. The last album was heavily criticized and you could see the band was losing its sense of direction, especially with Chester also being the new vocalist of Stone Temple Pilots. The long-term struggle with depression. You could tell Chester was lost on multiple fronts and felt he had nowhere to go and nobody to turn to. It's sad he couldn't find the help and comfort he needed before it was too late. RIP.",
    "controversiality": 0,
    "ups": 475,
    "downs": 0,
    "score": 475,
    "created": 1500612445.0,
    "date_created": "2017-07-20",
    "time_created": "16:47:25",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhs6x6",
    "parent_id": "t1_dkhnyr1",
    "subreddit_name_prefixed": "r/news",
    "body": "If you read up on the psychology of suicide, suicidal people believe their families are genuinely better off without them. They genuinely believe they are a negative impact on everyone around them. This feeling is part of why they tend to not reach out for help and their closest friends and family are shocked. ",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1500614169.0,
    "date_created": "2017-07-20",
    "time_created": "17:16:09",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkho6c0",
    "parent_id": "t1_dkhkbkk",
    "subreddit_name_prefixed": "r/news",
    "body": "It's definitely not a coincidence. 1 out of 365 and it's his birthday. \n\nIt's a bad day for my friends and I. He was such a huge part of our childhood. Linkin Park were more important to me than just about anything. \n\nIf you need help and are going through something horrific... people are here for you. Don't let go. ",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1500609898.0,
    "date_created": "2017-07-20",
    "time_created": "16:04:58",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhiu7w",
    "parent_id": "t1_dkhijs7",
    "subreddit_name_prefixed": "r/news",
    "body": "Well this is just even more heartbreaking.",
    "controversiality": 0,
    "ups": 2047,
    "downs": 0,
    "score": 2047,
    "created": 1500604515.0,
    "date_created": "2017-07-20",
    "time_created": "14:35:15",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhk5zl",
    "parent_id": "t1_dkhijs7",
    "subreddit_name_prefixed": "r/news",
    "body": "Man, I loved Chester's voice. Meteora was my favorite album.",
    "controversiality": 0,
    "ups": 1296,
    "downs": 0,
    "score": 1296,
    "created": 1500605829.0,
    "date_created": "2017-07-20",
    "time_created": "14:57:09",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjmf1",
    "parent_id": "t1_dkhijs7",
    "subreddit_name_prefixed": "r/news",
    "body": "goddammit that's so fucking sad.",
    "controversiality": 0,
    "ups": 339,
    "downs": 0,
    "score": 339,
    "created": 1500605286.0,
    "date_created": "2017-07-20",
    "time_created": "14:48:06",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhk48g",
    "parent_id": "t1_dkhijs7",
    "subreddit_name_prefixed": "r/news",
    "body": "Damn, is there a better recording?",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1500605780.0,
    "date_created": "2017-07-20",
    "time_created": "14:56:20",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkepb",
    "parent_id": "t1_dkhijs7",
    "subreddit_name_prefixed": "r/news",
    "body": "https://youtu.be/IEQGti649qs?t=144",
    "controversiality": 0,
    "ups": 72,
    "downs": 0,
    "score": 72,
    "created": 1500606073.0,
    "date_created": "2017-07-20",
    "time_created": "15:01:13",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhnuu4",
    "parent_id": "t1_dkhijs7",
    "subreddit_name_prefixed": "r/news",
    "body": "Tbh don't know what to write i just wanna share this Crawling duo by Chris and Chester\nhttps://www.youtube.com/watch?v=F_v1SLIt01Q",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1500609568.0,
    "date_created": "2017-07-20",
    "time_created": "15:59:28",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhk7p3",
    "parent_id": "t1_dkhjwjy",
    "subreddit_name_prefixed": "r/news",
    "body": "Could be an inside joke between them",
    "controversiality": 0,
    "ups": 524,
    "downs": 0,
    "score": 524,
    "created": 1500605876.0,
    "date_created": "2017-07-20",
    "time_created": "14:57:56",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkesu",
    "parent_id": "t1_dkhjwjy",
    "subreddit_name_prefixed": "r/news",
    "body": "Look at the tracklist on Linkin Park's reanimation album. Seems like he's a fan of stuff like that",
    "controversiality": 0,
    "ups": 204,
    "downs": 0,
    "score": 204,
    "created": 1500606076.0,
    "date_created": "2017-07-20",
    "time_created": "15:01:16",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhojc6",
    "parent_id": "t1_dkhjwjy",
    "subreddit_name_prefixed": "r/news",
    "body": "What I don't get is how \"][][][\" translates to \"nnin\". Since his signature ends in \"][\", we know that that's \"n\", but then where's the I? In the negative space?",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1500610274.0,
    "date_created": "2017-07-20",
    "time_created": "16:11:14",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhnesh",
    "parent_id": "t1_dkhjwjy",
    "subreddit_name_prefixed": "r/news",
    "body": "Imagine him bawling his eyes out while trying to find all these character codes.",
    "controversiality": 0,
    "ups": 58,
    "downs": 0,
    "score": 58,
    "created": 1500609116.0,
    "date_created": "2017-07-20",
    "time_created": "15:51:56",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkipd",
    "parent_id": "t1_dkhjsj2",
    "subreddit_name_prefixed": "r/news",
    "body": "Well that's a devastating sub. ",
    "controversiality": 0,
    "ups": 564,
    "downs": 0,
    "score": 564,
    "created": 1500606188.0,
    "date_created": "2017-07-20",
    "time_created": "15:03:08",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhk1d9",
    "parent_id": "t1_dkhjlui",
    "subreddit_name_prefixed": "r/news",
    "body": "Hey, thanks for your service, and I hope life is treating you okay!! If I could donate my taxes directly to veterans and eduction I would; you deserve a lot more than you get. I'm sorry you've seen so much loss.",
    "controversiality": 0,
    "ups": 568,
    "downs": 0,
    "score": 568,
    "created": 1500605702.0,
    "date_created": "2017-07-20",
    "time_created": "14:55:02",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhl04h",
    "parent_id": "t1_dkhk5gw",
    "subreddit_name_prefixed": "r/news",
    "body": "We had something like that happen in the UK in 2007-08. 26 people from Bridgend, Wales killed themselves, mostly teenagers and all but one by hanging themselves.\n\nEDIT: some further information if anyone is interested \n\nhttp://www.vanityfair.com/culture/2009/02/wales-suicides200902\n\nhttps://en.wikipedia.org/wiki/Bridgend_suicide_incidents",
    "controversiality": 0,
    "ups": 218,
    "downs": 0,
    "score": 218,
    "created": 1500606680.0,
    "date_created": "2017-07-20",
    "time_created": "15:11:20",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhk15n",
    "parent_id": "t1_dkhizav",
    "subreddit_name_prefixed": "r/news",
    "body": ">  Two great musicians killing themselves, so close to each other, sends a message, especially to impressionable minds and the truly despondent.\n\nIf nothing else, maybe more people will realize that fame and fortune isn't necessarily all it's cracked up to be. In other words, if you're miserable while you're broke as fuck, you'll probably be miserable also when you're rich as fuck.\n\nEdit: I want to clarify what I mean here. I'm not talking about living paycheck to paycheck and then having some semblance of stability; I'm talking about broke-ass people who think, 'If I could just win the lottery or become a mega star, that would solve all my problems ...'",
    "controversiality": 0,
    "ups": 1171,
    "downs": 0,
    "score": 1171,
    "created": 1500605696.0,
    "date_created": "2017-07-20",
    "time_created": "14:54:56",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhlsld",
    "parent_id": "t1_dkhkb8b",
    "subreddit_name_prefixed": "r/news",
    "body": "I am truly heartbroken by the loss of one of my favourite musicians, what makes it worse was that it was suicide. He was on tour recently and he seemed ok, I guess you never really know what someone is going through on the outside.\n\nI've never been a fan of Rock, but Linkin Park was the exception, they helped me get through so much and this is really tough to hear, Hybrid Theory and Meteora are two albums that I'm sure have changed a lot of our lives.\n\nRest in Peace to a truly inspirational human being.\n",
    "controversiality": 0,
    "ups": 159,
    "downs": 0,
    "score": 159,
    "created": 1500607474.0,
    "date_created": "2017-07-20",
    "time_created": "15:24:34",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhnsjp",
    "parent_id": "t1_dkhkb8b",
    "subreddit_name_prefixed": "r/news",
    "body": "Bro, I'm 40, and I'm heartbroken. I can't even say \"I grew up listening to them\" because I was already 23 by the time Hybrid Theory came out, but it *feels* like I grew up on them. Probably fair to say they've been my favorite band of my adult life. I was never really depressed to the point of considering suicide, but I largely thank Linkin Park for that. So many of their songs served as a great outlet for anger and depression that it never became a problem for me, in my opinion. I'm usually a little sad hearing about musicians dying: Prince, Michael Jackson, David Bowie, Chris Cornell...but this one stings. This one stings a lot.\n\nExample. Eight years ago, my wife survived a very difficult year-long battle with cancer. when I say \"difficult year-long battle with cancer,\" I mean the kind that pushed her to ask me to just kill her - and meant it - several times. A couple years later, we were flying on a plane somewhere and she asked if she could listen in to whatever I was listening to on my phone, so of course I gave her one of the ear pieces. A few minutes later, Iridescent comes on. She had never heard it before, and after a minute or so, I realized that she was really paying attention to the lyrics because tears were streaming down her face. She has generally been a much happier person since that flight.\n\nYup, this sucks.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1500609503.0,
    "date_created": "2017-07-20",
    "time_created": "15:58:23",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhmkio",
    "parent_id": "t1_dkhm70r",
    "subreddit_name_prefixed": "r/news",
    "body": "This made me realize, I need to start going to concerts more often. ",
    "controversiality": 0,
    "ups": 358,
    "downs": 0,
    "score": 358,
    "created": 1500608265.0,
    "date_created": "2017-07-20",
    "time_created": "15:37:45",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkwcp",
    "parent_id": "t1_dkhjsog",
    "subreddit_name_prefixed": "r/news",
    "body": "I have tickets for next month. Was going to be my first time seeing them too 😢",
    "controversiality": 0,
    "ups": 133,
    "downs": 0,
    "score": 133,
    "created": 1500606574.0,
    "date_created": "2017-07-20",
    "time_created": "15:09:34",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkcei",
    "parent_id": "t1_dkhjsog",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah I know they were about to play in Philly. I'm so shook up about this one...",
    "controversiality": 0,
    "ups": 209,
    "downs": 0,
    "score": 209,
    "created": 1500606008.0,
    "date_created": "2017-07-20",
    "time_created": "15:00:08",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkemt",
    "parent_id": "t1_dkhjsog",
    "subreddit_name_prefixed": "r/news",
    "body": "Me too, for the first time.",
    "controversiality": 0,
    "ups": 57,
    "downs": 0,
    "score": 57,
    "created": 1500606071.0,
    "date_created": "2017-07-20",
    "time_created": "15:01:11",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhluq6",
    "parent_id": "t1_dkhkoyc",
    "subreddit_name_prefixed": "r/news",
    "body": "This is why music is so important, we can connect with someone on a spiritual level even with a complete stranger. We get to hear their heart and relate it to our own and know that our problems are not only our problems, but shared with others who are feeling same, it helps you remember that you are never truly alone.",
    "controversiality": 0,
    "ups": 96,
    "downs": 0,
    "score": 96,
    "created": 1500607535.0,
    "date_created": "2017-07-20",
    "time_created": "15:25:35",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkend",
    "parent_id": "t1_dkhk7hb",
    "subreddit_name_prefixed": "r/news",
    "body": "A lot of times it's just about staying strong in the hardest of times. If you can't think of a better place to be, just focus on surviving until you can move on. \n\nYou're not alone my friend, and your loved ones want to help, you are not a burden on anyone. You deserve happiness. ",
    "controversiality": 0,
    "ups": 1051,
    "downs": 0,
    "score": 1051,
    "created": 1500606071.0,
    "date_created": "2017-07-20",
    "time_created": "15:01:11",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkcas",
    "parent_id": "t1_dkhk7hb",
    "subreddit_name_prefixed": "r/news",
    "body": "You will. Seek help.",
    "controversiality": 0,
    "ups": 503,
    "downs": 0,
    "score": 503,
    "created": 1500606005.0,
    "date_created": "2017-07-20",
    "time_created": "15:00:05",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkex9",
    "parent_id": "t1_dkhk7hb",
    "subreddit_name_prefixed": "r/news",
    "body": "That's what is the most fucked up part. People like this are able help so many but nobody is really there to help them. ",
    "controversiality": 0,
    "ups": 62,
    "downs": 0,
    "score": 62,
    "created": 1500606079.0,
    "date_created": "2017-07-20",
    "time_created": "15:01:19",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkufm",
    "parent_id": "t1_dkhklz6",
    "subreddit_name_prefixed": "r/news",
    "body": "Me too, friend.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1500606521.0,
    "date_created": "2017-07-20",
    "time_created": "15:08:41",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhm349",
    "parent_id": "t1_dkhk4pa",
    "subreddit_name_prefixed": "r/news",
    "body": "That whole album was much better than it had any right to be. ",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1500607775.0,
    "date_created": "2017-07-20",
    "time_created": "15:29:35",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhiin4",
    "parent_id": "t1_dkhie49",
    "subreddit_name_prefixed": "r/news",
    "body": "Not to mention his contributions to Stone Temple Pilots while they were touring the past few years. \n\nIt must have been hell to step into someone like Scott Weiland's shoes, but I thought he held his own. I wonder if Scott passing and then Chris just hit something too deep and close. Truly sad for music. ",
    "controversiality": 0,
    "ups": 247,
    "downs": 0,
    "score": 247,
    "created": 1500604195.0,
    "date_created": "2017-07-20",
    "time_created": "14:29:55",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjoqo",
    "parent_id": "t1_dkhipa6",
    "subreddit_name_prefixed": "r/news",
    "body": "I am 31, I was in 9th grade when that CD was released. I remember rocking out to LP, Powerman 5000, Static X, Korn, etc. while playing THPS 2. That shit defined middle school for me. What a weird feeling to remember all of that. ",
    "controversiality": 0,
    "ups": 168,
    "downs": 0,
    "score": 168,
    "created": 1500605351.0,
    "date_created": "2017-07-20",
    "time_created": "14:49:11",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhiy9l",
    "parent_id": "t1_dkhipa6",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm 26 and I definitely feel this. I guess this is the first death among the bands I listened to as a teenager. Damn, I have no words really.",
    "controversiality": 0,
    "ups": 170,
    "downs": 0,
    "score": 170,
    "created": 1500604627.0,
    "date_created": "2017-07-20",
    "time_created": "14:37:07",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjq8i",
    "parent_id": "t1_dkhipa6",
    "subreddit_name_prefixed": "r/news",
    "body": "I just turned 40 and I'm feeling this.  I was 23 and a few years into my stint in the Navy when Hybrid Theory was released.  Definitely got a lot of play time on my portable CD player during deployment.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1500605394.0,
    "date_created": "2017-07-20",
    "time_created": "14:49:54",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkk3w",
    "parent_id": "t1_dkhjzfl",
    "subreddit_name_prefixed": "r/news",
    "body": "Can confirm. Am millennial. Meteora and Hybrid Theory were by far my 2 favourite albums growing up. ",
    "controversiality": 0,
    "ups": 321,
    "downs": 0,
    "score": 321,
    "created": 1500606226.0,
    "date_created": "2017-07-20",
    "time_created": "15:03:46",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjpbl",
    "parent_id": "t1_dkhjjou",
    "subreddit_name_prefixed": "r/news",
    "body": "Totally.  I was starting to think I was the only one who actually liked Reanimation.",
    "controversiality": 0,
    "ups": 340,
    "downs": 0,
    "score": 340,
    "created": 1500605368.0,
    "date_created": "2017-07-20",
    "time_created": "14:49:28",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjnch",
    "parent_id": "t1_dkhjjou",
    "subreddit_name_prefixed": "r/news",
    "body": "I loved Reanimation",
    "controversiality": 0,
    "ups": 499,
    "downs": 0,
    "score": 499,
    "created": 1500605312.0,
    "date_created": "2017-07-20",
    "time_created": "14:48:32",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjvh9",
    "parent_id": "t1_dkhjjou",
    "subreddit_name_prefixed": "r/news",
    "body": "Dont forget Live in Texas, shit is still on my workout playlist. ",
    "controversiality": 0,
    "ups": 145,
    "downs": 0,
    "score": 145,
    "created": 1500605538.0,
    "date_created": "2017-07-20",
    "time_created": "14:52:18",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjwuz",
    "parent_id": "t1_dkhjjou",
    "subreddit_name_prefixed": "r/news",
    "body": "And Meteora",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1500605575.0,
    "date_created": "2017-07-20",
    "time_created": "14:52:55",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhruz2",
    "parent_id": "t1_dkhn2wg",
    "subreddit_name_prefixed": "r/news",
    "body": "> It doesn't mean that they sold out or suck, it just means they changed and unfortunately for me it does not match my taste.\n\nThat's nice, but for every person like you, there's a 100 more thinking that \"real music\" died during some decade that happens to correlate with them becoming adults.\n\nSee: every 50+ rocker whining that Led Zeppelin was peak music, or 2Pac + Biggie for the 30+ set, or Soundgarden for a different 30+ set. \n\nI bring up the 30+ because I'm one of them, and I see the attitude infecting some of the more hardcore music fans in my circle. Like, just admit you really connected to some shit when you were a teenager and now you're not a raw ball of emotions anymore.",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1500613804.0,
    "date_created": "2017-07-20",
    "time_created": "17:10:04",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhnuen",
    "parent_id": "t1_dkhlxnk",
    "subreddit_name_prefixed": "r/news",
    "body": "He understood it, though. Beautifully written.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1500609556.0,
    "date_created": "2017-07-20",
    "time_created": "15:59:16",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhljzt",
    "parent_id": "t1_dkhkmep",
    "subreddit_name_prefixed": "r/news",
    "body": "Who cares when someone's time runs out, if a moment is all we are  \nWell, I do. ",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1500607230.0,
    "date_created": "2017-07-20",
    "time_created": "15:20:30",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhmhpl",
    "parent_id": "t1_dkhkmep",
    "subreddit_name_prefixed": "r/news",
    "body": "The entire album, actually. Their new music video also came out just a few hours ago",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1500608186.0,
    "date_created": "2017-07-20",
    "time_created": "15:36:26",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhnz2n",
    "parent_id": "t1_dkhkmep",
    "subreddit_name_prefixed": "r/news",
    "body": "God, yes. I know they caught so much shit for their newest album, but I personally loved it. It's not my favorite, but it's a good album. One More Light had become one of my favorite songs by them, and it strikes way too close to this situation.",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1500609693.0,
    "date_created": "2017-07-20",
    "time_created": "16:01:33",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhrdn3",
    "parent_id": "t1_dkhnb0y",
    "subreddit_name_prefixed": "r/news",
    "body": "They've hung up on me before and when I've told someone they just denied it happened, and said \"they don't do that\". Fucked me up bad",
    "controversiality": 0,
    "ups": 121,
    "downs": 0,
    "score": 121,
    "created": 1500613270.0,
    "date_created": "2017-07-20",
    "time_created": "17:01:10",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhy20d",
    "parent_id": "t1_dkhnb0y",
    "subreddit_name_prefixed": "r/news",
    "body": "Over 1/3 of VA suicide hotline calls go unanswered. I never can forget that fact.",
    "controversiality": 0,
    "ups": 48,
    "downs": 0,
    "score": 48,
    "created": 1500621151.0,
    "date_created": "2017-07-20",
    "time_created": "19:12:31",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhqu0w",
    "parent_id": "t1_dkhpb7t",
    "subreddit_name_prefixed": "r/news",
    "body": "You fucking rock dude.",
    "controversiality": 0,
    "ups": 66,
    "downs": 0,
    "score": 66,
    "created": 1500612681.0,
    "date_created": "2017-07-20",
    "time_created": "16:51:21",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhvd8w",
    "parent_id": "t1_dkhpb7t",
    "subreddit_name_prefixed": "r/news",
    "body": "You are a hero and are one of the persons who makes this world a better place by not just living for him/herself. Reading about you dealing with depression: I am not sure if it helps when some Internet stranger says something, but I hope it contributes just a little to keep you from the dark. You are a good person and this world is brighter because of you. ",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1500617837.0,
    "date_created": "2017-07-20",
    "time_created": "18:17:17",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhwrtj",
    "parent_id": "t1_dkhpb7t",
    "subreddit_name_prefixed": "r/news",
    "body": "You absolute legend.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1500619529.0,
    "date_created": "2017-07-20",
    "time_created": "18:45:29",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhqeky",
    "parent_id": "t1_dkhpc55",
    "subreddit_name_prefixed": "r/news",
    "body": "Damn, and people down voted him too.\n\nWe did it reddit! /s",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1500612226.0,
    "date_created": "2017-07-20",
    "time_created": "16:43:46",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhqrhc",
    "parent_id": "t1_dkhpc55",
    "subreddit_name_prefixed": "r/news",
    "body": "Holy shit! That is so crazy sad. I don't even know what to say, I just wish I hadn't seen that. Or maybe I am glad that I did. I am not depressed or anything, but after seeing that I would never ever call that fucking hot line.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1500612605.0,
    "date_created": "2017-07-20",
    "time_created": "16:50:05",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhnmet",
    "parent_id": "t1_dkhm0xt",
    "subreddit_name_prefixed": "r/news",
    "body": "Glad you're still here. I kinda chuckled at your comment. Emotions can be really fickle sometimes huh?",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1500609333.0,
    "date_created": "2017-07-20",
    "time_created": "15:55:33",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhn4ra",
    "parent_id": "t1_dkhkpb1",
    "subreddit_name_prefixed": "r/news",
    "body": "I imagine we only hear about the bad ones because those who don't get needed help are more likely to complain than those that get the support. They can't be all bad, and should still be called should the situation arise.",
    "controversiality": 0,
    "ups": 87,
    "downs": 0,
    "score": 87,
    "created": 1500608832.0,
    "date_created": "2017-07-20",
    "time_created": "15:47:12",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhp6q6",
    "parent_id": "t1_dkhkpb1",
    "subreddit_name_prefixed": "r/news",
    "body": "They have helped people I know.",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1500610944.0,
    "date_created": "2017-07-20",
    "time_created": "16:22:24",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhnoog",
    "parent_id": "t1_dkhkpb1",
    "subreddit_name_prefixed": "r/news",
    "body": "You can personally address the problem it and feel like a hero yourself, for real. Volunteer for a local crisis call center. Become trained in crisis counseling and suicide prevention techniques so that you can do more good than harm.",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1500609395.0,
    "date_created": "2017-07-20",
    "time_created": "15:56:35",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhk6bg",
    "parent_id": "t1_dkhk080",
    "subreddit_name_prefixed": "r/news",
    "body": "Which is why you don't gamble your life savings like a fucking retard ",
    "controversiality": 0,
    "ups": 4204,
    "downs": 0,
    "score": 4204,
    "created": 1500605839.0,
    "date_created": "2017-07-20",
    "time_created": "14:57:19",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkdgp",
    "parent_id": "t1_dkhk3dw",
    "subreddit_name_prefixed": "r/news",
    "body": "A lot of people in /r/bitcoin lost millions when their coins were stollen through mtgox.\n\n[Gox horror story thread - How much did you lose?](https://www.reddit.com/r/Bitcoin/comments/1yv26o/gox_horror_story_thread_how_much_did_you_lose/)",
    "controversiality": 0,
    "ups": 335,
    "downs": 0,
    "score": 335,
    "created": 1500606037.0,
    "date_created": "2017-07-20",
    "time_created": "15:00:37",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhuwn1",
    "parent_id": "t1_dkhu4nu",
    "subreddit_name_prefixed": "r/news",
    "body": "Same here, loved them when I was younger, rinsed Hybrid Theory so much. Listened to it every for months. Finally got to see them less than 3 weeks ago in Belgium. Those guys put on a great show. Surreal now, thinking that was one of his last concerts",
    "controversiality": 0,
    "ups": 470,
    "downs": 0,
    "score": 470,
    "created": 1500617281.0,
    "date_created": "2017-07-20",
    "time_created": "18:08:01",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhvbnl",
    "parent_id": "t1_dkhu4nu",
    "subreddit_name_prefixed": "r/news",
    "body": "> I've always wanted to eventually see them at a concert, they were the first band I avidly followed, but now I won't get that chance. \n\nSame here. I bought Meteora as my first CD along with a \"Discman\" to play it during car trips. Eventually I went to electronica and techno, but I always kept checking for new LP albums (Hunting Party is amazing). Sadly, I've never been to a concert (I'm more a clubbing guy), but I promised myself I'd get to see Linkin Park live. Now I won't be able to",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1500617784.0,
    "date_created": "2017-07-20",
    "time_created": "18:16:24",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhxzol",
    "parent_id": "t1_dkhwwaw",
    "subreddit_name_prefixed": "r/news",
    "body": "There's the comment with the lyrics. Thanks ",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1500621070.0,
    "date_created": "2017-07-20",
    "time_created": "19:11:10",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhu5fx",
    "parent_id": "t1_dkhu0ns",
    "subreddit_name_prefixed": "r/news",
    "body": "The TRUE irony is that the artist who drew Chester the Molester for Hustler, Dwaine B. Tinsley, [was himself convicted of molesting girls in 1990](http://articles.latimes.com/1990-01-11/news/ve-324_1_jury-convicts-hustler)",
    "controversiality": 0,
    "ups": 98,
    "downs": 0,
    "score": 98,
    "created": 1500616391.0,
    "date_created": "2017-07-20",
    "time_created": "17:53:11",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhlzl3",
    "parent_id": "t1_dkhkz4u",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm like a mix of these. I feel so exhausted that I want to just sleep forever, and I also completely neglect my entire life to the point of self sabotage. It's so hard :(",
    "controversiality": 0,
    "ups": 187,
    "downs": 0,
    "score": 187,
    "created": 1500607672.0,
    "date_created": "2017-07-20",
    "time_created": "15:27:52",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhw5j2",
    "parent_id": "t1_dkho68c",
    "subreddit_name_prefixed": "r/news",
    "body": "I've never really considered killing myself.\n\nBut there have been times where I sure as fuck wasn't afraid of death.",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1500618772.0,
    "date_created": "2017-07-20",
    "time_created": "18:32:52",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhuogn",
    "parent_id": "t1_dkhssnr",
    "subreddit_name_prefixed": "r/news",
    "body": "this is the most 2001 comment I've ever read",
    "controversiality": 0,
    "ups": 162,
    "downs": 0,
    "score": 162,
    "created": 1500617010.0,
    "date_created": "2017-07-20",
    "time_created": "18:03:30",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhsl32",
    "parent_id": "t1_dkhrytg",
    "subreddit_name_prefixed": "r/news",
    "body": "A place for my head...",
    "controversiality": 0,
    "ups": 192,
    "downs": 0,
    "score": 192,
    "created": 1500614611.0,
    "date_created": "2017-07-20",
    "time_created": "17:23:31",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhx1ac",
    "parent_id": "t1_dkhrytg",
    "subreddit_name_prefixed": "r/news",
    "body": "I think this is the one: https://youtu.be/XIGbqdl8zCc",
    "controversiality": 0,
    "ups": 53,
    "downs": 0,
    "score": 53,
    "created": 1500619854.0,
    "date_created": "2017-07-20",
    "time_created": "18:50:54",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhwdnp",
    "parent_id": "t1_dkhrytg",
    "subreddit_name_prefixed": "r/news",
    "body": "Dude. I'm positive it's the same one. My friends and I passed that one around on CD-RWs in a land where Internet was hard to come by. ",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1500619046.0,
    "date_created": "2017-07-20",
    "time_created": "18:37:26",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhtkpp",
    "parent_id": "t1_dkhrytg",
    "subreddit_name_prefixed": "r/news",
    "body": "One of my favourite DBZ music vids was Gohan battling against 17 and 18, and finally losing at the end, to the sound Offsprings The Kids Aren't Alright, then after the song finishes a young Trunks finds Gohan dead, screams and ascends for the first time. Excellent. :)",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1500615728.0,
    "date_created": "2017-07-20",
    "time_created": "17:42:08",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhosq1",
    "parent_id": "t1_dkhni0q",
    "subreddit_name_prefixed": "r/news",
    "body": "Damn I just looked back on those old grainy trunks AMVs. Time when I was still learning English and I was the biggest trunks fangirl\n\nE: https://youtu.be/z4NEXAqorZk",
    "controversiality": 0,
    "ups": 142,
    "downs": 0,
    "score": 142,
    "created": 1500610542.0,
    "date_created": "2017-07-20",
    "time_created": "16:15:42",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhua2v",
    "parent_id": "t1_dkhtl7l",
    "subreddit_name_prefixed": "r/news",
    "body": "movie maker, Linkin Park or Evanescence recorded with unregistered hypercam 2.",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1500616542.0,
    "date_created": "2017-07-20",
    "time_created": "17:55:42",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhuxlr",
    "parent_id": "t1_dkhtl7l",
    "subreddit_name_prefixed": "r/news",
    "body": "I still have my Itachi vs. Sasuke with \"Crawling in My Skin\" saved. \n\nI'm actually kind of proud of it, lmao.",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1500617313.0,
    "date_created": "2017-07-20",
    "time_created": "18:08:33",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhqngh",
    "parent_id": "t1_dkhmy1o",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah I went on an eighth grade trip in 2002. I listened to that CD the entire time. Hasn't listened to them much recently. This is just terrible. ",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1500612486.0,
    "date_created": "2017-07-20",
    "time_created": "16:48:06",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhrnno",
    "parent_id": "t1_dkhmy1o",
    "subreddit_name_prefixed": "r/news",
    "body": "Lots of people planned on seeing him/them live for the first time in the next few weeks, myself included.  I have many fond memories of their first few albums, and then... adult life sorta kicked in?  But then I heard the new album, and it's pretty good. \n\nI'd expect the band to postpone a portion of the tour, and I am not disappointed if I am unable to see them next week.  A group of band mates like that is family.  It's a shame when someone surrounded by so much love can still feel so alone in the world they decide to end it. That is the reality of depression sometimes. \n\nSo if you see someone who needs help, help them.  I've been depressed before.  Shit sucks, but I found comfort and relief in friends, old and new.  \n\nedit: finished some thoughts that seemed... half complete.  I was just flooded with memories, nights driving to their music, during the good times and the bad :/",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1500613579.0,
    "date_created": "2017-07-20",
    "time_created": "17:06:19",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhtmke",
    "parent_id": "t1_dkht1c6",
    "subreddit_name_prefixed": "r/news",
    "body": "In Dallas in what I assume was the mid-late 80's, my then teenage parents went to see a Ratt concert.  The opening act they booed off?  Bon Jovi.",
    "controversiality": 0,
    "ups": 339,
    "downs": 0,
    "score": 339,
    "created": 1500615787.0,
    "date_created": "2017-07-20",
    "time_created": "17:43:07",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhu47l",
    "parent_id": "t1_dkht1c6",
    "subreddit_name_prefixed": "r/news",
    "body": "Guns N' Roses took a band Axl liked out on tour. They were booed off the stage. That band was Nine Inch Nails. ",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1500616351.0,
    "date_created": "2017-07-20",
    "time_created": "17:52:31",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhl0uw",
    "parent_id": "t1_dkhkpdc",
    "subreddit_name_prefixed": "r/news",
    "body": "Can confirm, I was 11 or 12 when Hybrid Theory dropped. Pushing 30 now.\n\nEDIT: low key I love all you guys",
    "controversiality": 0,
    "ups": 427,
    "downs": 0,
    "score": 427,
    "created": 1500606702.0,
    "date_created": "2017-07-20",
    "time_created": "15:11:42",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhlux7",
    "parent_id": "t1_dkhkpdc",
    "subreddit_name_prefixed": "r/news",
    "body": "Maybe the lower limit too, 21 years here. Couldn't even believe the first tmz article.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1500607541.0,
    "date_created": "2017-07-20",
    "time_created": "15:25:41",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhlikx",
    "parent_id": "t1_dkhkbyn",
    "subreddit_name_prefixed": "r/news",
    "body": "Spoiler: he was in middle school and the argument doesn't hold a lot of weight. Still a cool song.",
    "controversiality": 0,
    "ups": 499,
    "downs": 0,
    "score": 499,
    "created": 1500607190.0,
    "date_created": "2017-07-20",
    "time_created": "15:19:50",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhlym1",
    "parent_id": "t1_dkhiu7w",
    "subreddit_name_prefixed": "r/news",
    "body": "Imagine what he went through singing that",
    "controversiality": 0,
    "ups": 745,
    "downs": 0,
    "score": 745,
    "created": 1500607645.0,
    "date_created": "2017-07-20",
    "time_created": "15:27:25",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhlyl2",
    "parent_id": "t1_dkhk5zl",
    "subreddit_name_prefixed": "r/news",
    "body": "Hybrid theory and meteora were all I listened to in middle school. Might have to marathon those two for the entire day in memory of Chester :(",
    "controversiality": 0,
    "ups": 1084,
    "downs": 0,
    "score": 1084,
    "created": 1500607644.0,
    "date_created": "2017-07-20",
    "time_created": "15:27:24",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhl9c4",
    "parent_id": "t1_dkhk48g",
    "subreddit_name_prefixed": "r/news",
    "body": "As much as I hate to give vultures views here is a [better version](https://youtu.be/IEQGti649qs?t=145)",
    "controversiality": 0,
    "ups": 120,
    "downs": 0,
    "score": 120,
    "created": 1500606938.0,
    "date_created": "2017-07-20",
    "time_created": "15:15:38",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhsma2",
    "parent_id": "t1_dkhk7p3",
    "subreddit_name_prefixed": "r/news",
    "body": "I think it's almost a throwback to the early days of 1337. A friend of mine had his old online username etched into his headstone, which could be confusing to an outsider, but endearing to someone who played with him. I think it's similar to the weird signature",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1500614648.0,
    "date_created": "2017-07-20",
    "time_created": "17:24:08",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhl862",
    "parent_id": "t1_dkhkesu",
    "subreddit_name_prefixed": "r/news",
    "body": "I mean that album came out in 2002 when l33t speak was more commonly used. That was fifteen years ago, however.\n",
    "controversiality": 0,
    "ups": 137,
    "downs": 0,
    "score": 137,
    "created": 1500606906.0,
    "date_created": "2017-07-20",
    "time_created": "15:15:06",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhlmf7",
    "parent_id": "t1_dkhkipd",
    "subreddit_name_prefixed": "r/news",
    "body": "I think it arose out of reddits \"not on this sub!\" mentality about things. Way back in the day I can remember /r/pics getting a lot of \"my last photo of my dad/dog/grandma/dinner\" submissions. It got to be overtaking the sub so they were pushed off by the community. We all grieve in different ways, and for many it's sharing the last moments of a loved one with strangers. I think taken that way it's a solid sub that has a worthwhile purpose, although I always fear it's a way for the morbidly curious to take pleasure from the pain of others.",
    "controversiality": 0,
    "ups": 282,
    "downs": 0,
    "score": 282,
    "created": 1500607297.0,
    "date_created": "2017-07-20",
    "time_created": "15:21:37",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhn5kf",
    "parent_id": "t1_dkhkipd",
    "subreddit_name_prefixed": "r/news",
    "body": "No kidding. I can browse r/watchpeopledie and most of those don't bother me. But every single image on r/lastimages cuts deep. \n\nI think it's because they all seem so human. So real and alive. ",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1500608854.0,
    "date_created": "2017-07-20",
    "time_created": "15:47:34",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkckp",
    "parent_id": "t1_dkhk1d9",
    "subreddit_name_prefixed": "r/news",
    "body": "Oh man when i read the comment I took serve as like a server at a restaurant, and was like why there so many suicidal waiters? ",
    "controversiality": 0,
    "ups": 340,
    "downs": 0,
    "score": 340,
    "created": 1500606012.0,
    "date_created": "2017-07-20",
    "time_created": "15:00:12",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhmo3p",
    "parent_id": "t1_dkhl04h",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah some of the first ones of the 26 were in a friendship group, and then some of the later ones were cousins and other relations of the earlier lot.",
    "controversiality": 0,
    "ups": 37,
    "downs": 0,
    "score": 37,
    "created": 1500608366.0,
    "date_created": "2017-07-20",
    "time_created": "15:39:26",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhlui3",
    "parent_id": "t1_dkhl04h",
    "subreddit_name_prefixed": "r/news",
    "body": "I remember this so well. A girl from my school (in England) had moved from near Bridgend not long before and tried to kill herself a few years later.\n",
    "controversiality": 0,
    "ups": 53,
    "downs": 0,
    "score": 53,
    "created": 1500607529.0,
    "date_created": "2017-07-20",
    "time_created": "15:25:29",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhn302",
    "parent_id": "t1_dkhl04h",
    "subreddit_name_prefixed": "r/news",
    "body": "Bridgend is my hometown and it's still going on here now but the media doesn't report on it any more. ",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1500608781.0,
    "date_created": "2017-07-20",
    "time_created": "15:46:21",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhlvpj",
    "parent_id": "t1_dkhl04h",
    "subreddit_name_prefixed": "r/news",
    "body": "Wasn't there  documentary on that?",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1500607563.0,
    "date_created": "2017-07-20",
    "time_created": "15:26:03",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhlqyv",
    "parent_id": "t1_dkhl04h",
    "subreddit_name_prefixed": "r/news",
    "body": "That was such a bad time, literally couldn't imagine what it must have been like for families of the area.",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1500607428.0,
    "date_created": "2017-07-20",
    "time_created": "15:23:48",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkd9r",
    "parent_id": "t1_dkhk15n",
    "subreddit_name_prefixed": "r/news",
    "body": "Speaking as a clinically depressed person, deaths like this, particularly Robin Williams (though his suicide was linked to what's basically worst-case dementia, which I did not know at the time) give me a sense of \"if people with all of this support and love and money and success couldn't make it, what does that say about me? Why even bother?\"  \n\nEdit: Thanks everyone for the support. I assure you, you don't need to worry about me. I don't think I clarified well enough that I know this feeling is a temporary response to a stimulus event, and that it will pass like it always does, just gotta care for myself in the mean time. ",
    "controversiality": 0,
    "ups": 854,
    "downs": 0,
    "score": 854,
    "created": 1500606032.0,
    "date_created": "2017-07-20",
    "time_created": "15:00:32",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkcrk",
    "parent_id": "t1_dkhk15n",
    "subreddit_name_prefixed": "r/news",
    "body": "So why the hell should I try..  \n\nEdit: Holy shit thanks for the support guys. I've got a bit of a dark place going on and I've been fighting it for years. I worry at some point I'll slip up and it will be a downward spiral from there ",
    "controversiality": 0,
    "ups": 98,
    "downs": 0,
    "score": 98,
    "created": 1500606018.0,
    "date_created": "2017-07-20",
    "time_created": "15:00:18",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhmov4",
    "parent_id": "t1_dkhmkio",
    "subreddit_name_prefixed": "r/news",
    "body": "My wake up call was Dio.  I'll forever regret not going when I had the chance.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1500608387.0,
    "date_created": "2017-07-20",
    "time_created": "15:39:47",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkkyc",
    "parent_id": "t1_dkhkend",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1500606250.0,
    "date_created": "2017-07-20",
    "time_created": "15:04:10",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkgo9",
    "parent_id": "t1_dkhkcas",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 303,
    "downs": 0,
    "score": 303,
    "created": 1500606129.0,
    "date_created": "2017-07-20",
    "time_created": "15:02:09",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkov3",
    "parent_id": "t1_dkhkex9",
    "subreddit_name_prefixed": "r/news",
    "body": "But Doctor, I am Pagliacci :(",
    "controversiality": 0,
    "ups": 86,
    "downs": 0,
    "score": 86,
    "created": 1500606361.0,
    "date_created": "2017-07-20",
    "time_created": "15:06:01",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhmr46",
    "parent_id": "t1_dkhm349",
    "subreddit_name_prefixed": "r/news",
    "body": "Actually it was sort of a match made in heaven.  Linkin Park was already from two worlds, with the rock and rap influences blended together.  JayZ is all hiphop, but has worked with Rick Ruben who is known for using heavier, rock-inspired tracks for rap songs.  Mike Shinoda was the like the catalyst that allowed both styles to wed perfectly, and I bet he knew from the beginning that the resulting album would be legendary.  One of my favorite EPs of all time, and possibly the best mashup album period.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1500608449.0,
    "date_created": "2017-07-20",
    "time_created": "15:40:49",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhk0nd",
    "parent_id": "t1_dkhjoqo",
    "subreddit_name_prefixed": "r/news",
    "body": "THPS was responsible for shaping my music taste as a teenager. Those were the days.",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1500605682.0,
    "date_created": "2017-07-20",
    "time_created": "14:54:42",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkqj2",
    "parent_id": "t1_dkhjoqo",
    "subreddit_name_prefixed": "r/news",
    "body": "Same here, RIP Wayne Static as well. Though I was playing Crazy Taxi on Dreamcast jamming out to Offspring.\n\nSo many vocalists from bands that shaped my youth have offed themselves either directly or indirectly through addiction.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1500606410.0,
    "date_created": "2017-07-20",
    "time_created": "15:06:50",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjbtc",
    "parent_id": "t1_dkhiy9l",
    "subreddit_name_prefixed": "r/news",
    "body": "This transcends age.  I've loved their work since Day One and I'm 52.",
    "controversiality": 0,
    "ups": 93,
    "downs": 0,
    "score": 93,
    "created": 1500604997.0,
    "date_created": "2017-07-20",
    "time_created": "14:43:17",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjt80",
    "parent_id": "t1_dkhjpbl",
    "subreddit_name_prefixed": "r/news",
    "body": "reanimation was brilliant. PTS.OF.ATHRTY was a strong favourite of mine.",
    "controversiality": 0,
    "ups": 298,
    "downs": 0,
    "score": 298,
    "created": 1500605475.0,
    "date_created": "2017-07-20",
    "time_created": "14:51:15",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhjwqz",
    "parent_id": "t1_dkhjnch",
    "subreddit_name_prefixed": "r/news",
    "body": "Meteora is also amazing!",
    "controversiality": 0,
    "ups": 507,
    "downs": 0,
    "score": 507,
    "created": 1500605572.0,
    "date_created": "2017-07-20",
    "time_created": "14:52:52",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhk1ff",
    "parent_id": "t1_dkhjnch",
    "subreddit_name_prefixed": "r/news",
    "body": "Reanimation doesn't get the love it deserves. Even the original songs on it are great.",
    "controversiality": 0,
    "ups": 169,
    "downs": 0,
    "score": 169,
    "created": 1500605704.0,
    "date_created": "2017-07-20",
    "time_created": "14:55:04",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhqxi9",
    "parent_id": "t1_dkhqeky",
    "subreddit_name_prefixed": "r/news",
    "body": "What a bunch of pieces of shit to downvote and bury their comment. Jesus Christ. ",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1500612787.0,
    "date_created": "2017-07-20",
    "time_created": "16:53:07",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhvmr8",
    "parent_id": "t1_dkhqeky",
    "subreddit_name_prefixed": "r/news",
    "body": "Of course they did. I spoke against the hotlines in this very post and got downvoted into oblivion, nasty comments, and angry PMs. But these people are still \"good people\" on here.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1500618150.0,
    "date_created": "2017-07-20",
    "time_created": "18:22:30",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhr92y",
    "parent_id": "t1_dkhqrhc",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm not sure what's worse. Forcing someone into debt like this when he was asking for help or flat out hanging up on him like the OP",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1500613130.0,
    "date_created": "2017-07-20",
    "time_created": "16:58:50",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkl2n",
    "parent_id": "t1_dkhk6bg",
    "subreddit_name_prefixed": "r/news",
    "body": "I see you aren't a fan of r/wallstreetbets",
    "controversiality": 0,
    "ups": 1463,
    "downs": 0,
    "score": 1463,
    "created": 1500606254.0,
    "date_created": "2017-07-20",
    "time_created": "15:04:14",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhm88i",
    "parent_id": "t1_dkhk6bg",
    "subreddit_name_prefixed": "r/news",
    "body": "People often feel extremely stupid when they make such a decision, which is why posting a suicide prevention hotline is a good thing to do.\n\nI have been highly critical of bitcoin as an \"investment\". But that doesn't mean you should kick someone while they are down.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1500607919.0,
    "date_created": "2017-07-20",
    "time_created": "15:31:59",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhm23k",
    "parent_id": "t1_dkhkdgp",
    "subreddit_name_prefixed": "r/news",
    "body": "That first post, 12 million today. Holy shit.",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1500607745.0,
    "date_created": "2017-07-20",
    "time_created": "15:29:05",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhvh70",
    "parent_id": "t1_dkhuwn1",
    "subreddit_name_prefixed": "r/news",
    "body": "Damn you were lucky to finally get to see them live. \n\nYeah it's so surreal, I think I'm still trying to process that he's gone. I don't know why, I guess he always seemed larger than life and it's just hard to think he's really gone. I guess in a way we grew up with them, even though we don't know them personally, they in some way, shape or form helped molded our life. Kids are impressionable, and growing up listening to their music, I definitely related to their music. Fuck, I still can't believe it...",
    "controversiality": 0,
    "ups": 80,
    "downs": 0,
    "score": 80,
    "created": 1500617967.0,
    "date_created": "2017-07-20",
    "time_created": "18:19:27",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhy5wz",
    "parent_id": "t1_dkhuwn1",
    "subreddit_name_prefixed": "r/news",
    "body": "I played the fuck out of hybrid theory. I remember i went to go buy a jay z album with my mom and then my mom didnt let me because of the parental advisory so the guy working at walmart recommended hybrid theory instead (weird recommendation right?), but it ended up being one of my most played cds ever. Thank u random walmart guy.",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1500621287.0,
    "date_created": "2017-07-20",
    "time_created": "19:14:47",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki4rkh",
    "parent_id": "t1_dkhxzol",
    "subreddit_name_prefixed": "r/news",
    "body": "glad I could help ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1500630095.0,
    "date_created": "2017-07-20",
    "time_created": "21:41:35",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhuiwp",
    "parent_id": "t1_dkhu5fx",
    "subreddit_name_prefixed": "r/news",
    "body": "Is that really ironic though or just sort of predictable  ",
    "controversiality": 0,
    "ups": 274,
    "downs": 0,
    "score": 274,
    "created": 1500616826.0,
    "date_created": "2017-07-20",
    "time_created": "18:00:26",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhnv44",
    "parent_id": "t1_dkhlzl3",
    "subreddit_name_prefixed": "r/news",
    "body": "Self sabotage is the rot in clinical depression.   Have you reached out for help yet?  AMA covers in and out patient help.   There's a text chat as well: https://www.crisistextline.org/\n\n",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1500609577.0,
    "date_created": "2017-07-20",
    "time_created": "15:59:37",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhze6f",
    "parent_id": "t1_dkhw5j2",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1500622871.0,
    "date_created": "2017-07-20",
    "time_created": "19:41:11",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhwi19",
    "parent_id": "t1_dkhuogn",
    "subreddit_name_prefixed": "r/news",
    "body": "The good old days. ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1500619195.0,
    "date_created": "2017-07-20",
    "time_created": "18:39:55",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhy6he",
    "parent_id": "t1_dkhx1ac",
    "subreddit_name_prefixed": "r/news",
    "body": "I had no idea how much I needed this in my life as a teenager. Now that I'm 24 I can just greatly appreciate it",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1500621307.0,
    "date_created": "2017-07-20",
    "time_created": "19:15:07",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhyjq6",
    "parent_id": "t1_dkhx1ac",
    "subreddit_name_prefixed": "r/news",
    "body": "My childhood",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1500621776.0,
    "date_created": "2017-07-20",
    "time_created": "19:22:56",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhu0wz",
    "parent_id": "t1_dkhtmke",
    "subreddit_name_prefixed": "r/news",
    "body": "Does booing off opening acts happen often? I've been to a lot of shows (at least 100) and never seen anyone booed off stage.",
    "controversiality": 0,
    "ups": 289,
    "downs": 0,
    "score": 289,
    "created": 1500616245.0,
    "date_created": "2017-07-20",
    "time_created": "17:50:45",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhwa8z",
    "parent_id": "t1_dkhu47l",
    "subreddit_name_prefixed": "r/news",
    "body": "NIN toured with a man who was booed off stage and then failed algebra.  That man was Albert Einstein. ",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1500618932.0,
    "date_created": "2017-07-20",
    "time_created": "18:35:32",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhlcji",
    "parent_id": "t1_dkhl0uw",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 348,
    "downs": 0,
    "score": 348,
    "created": 1500607024.0,
    "date_created": "2017-07-20",
    "time_created": "15:17:04",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkho9lw",
    "parent_id": "t1_dkhlikx",
    "subreddit_name_prefixed": "r/news",
    "body": "That gave me a much needed laugh.",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1500609994.0,
    "date_created": "2017-07-20",
    "time_created": "16:06:34",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhnoih",
    "parent_id": "t1_dkhlym1",
    "subreddit_name_prefixed": "r/news",
    "body": "Nope, not watching that at work. I am not gonna fucking cry at work! Fuck, man. This is sad.",
    "controversiality": 0,
    "ups": 94,
    "downs": 0,
    "score": 94,
    "created": 1500609391.0,
    "date_created": "2017-07-20",
    "time_created": "15:56:31",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhokpb",
    "parent_id": "t1_dkhlyl2",
    "subreddit_name_prefixed": "r/news",
    "body": "I totally get you. I've been listening to Linkin Park non-stop since I heard the news. Hybrid Theory was the album that got me through my loneliness while I was homeschooled. I was the kid that always wore LP shirts and had LP posters plastered all over my wall. I shamelessly loved that band, and still do. Meteora was what got me through my parents divorce and kept me company during the fighting and screaming I heard down the hall when I was in middle school. \n\nLinkin Park had this beautiful ability to touch your soul in a way that when you walked around outside you would be in disbelief that the not everyone felt the fullness that you felt. \n\nSomewhere I Belong helped me stop cutting myself and made me feel like I wasn't alone. Linkin Park helped me and many others feel less alone and it kills me to think that's how Chester felt at the very end. I will be forever grateful. \n\nRIP Chester. ",
    "controversiality": 0,
    "ups": 572,
    "downs": 0,
    "score": 572,
    "created": 1500610313.0,
    "date_created": "2017-07-20",
    "time_created": "16:11:53",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhn9rm",
    "parent_id": "t1_dkhlyl2",
    "subreddit_name_prefixed": "r/news",
    "body": "Right there with ya :/",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1500608974.0,
    "date_created": "2017-07-20",
    "time_created": "15:49:34",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhnptq",
    "parent_id": "t1_dkhlyl2",
    "subreddit_name_prefixed": "r/news",
    "body": "Seriously man. I listened to those albums nonstop from ages like 11-15",
    "controversiality": 0,
    "ups": 90,
    "downs": 0,
    "score": 90,
    "created": 1500609429.0,
    "date_created": "2017-07-20",
    "time_created": "15:57:09",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhnl91",
    "parent_id": "t1_dkhlyl2",
    "subreddit_name_prefixed": "r/news",
    "body": "Same man. I genuinely listened to barely anything else for *years*. \n\nThen 10 years later they were my gym anthems to beat myself into good shape. \n\nI'll be with you on the marathon tomorrow. ",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1500609299.0,
    "date_created": "2017-07-20",
    "time_created": "15:54:59",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhnbgo",
    "parent_id": "t1_dkhlyl2",
    "subreddit_name_prefixed": "r/news",
    "body": "Same here except with high school. Definitely going to be an LP marathon tonight. ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1500609023.0,
    "date_created": "2017-07-20",
    "time_created": "15:50:23",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhut5r",
    "parent_id": "t1_dkhlmf7",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm a regular viewer. It's a reminder to keep things in perspective. Keeps me grateful for all the people in my life.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1500617168.0,
    "date_created": "2017-07-20",
    "time_created": "18:06:08",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkvyg",
    "parent_id": "t1_dkhkckp",
    "subreddit_name_prefixed": "r/news",
    "body": "Because working food sucks.",
    "controversiality": 0,
    "ups": 364,
    "downs": 0,
    "score": 364,
    "created": 1500606564.0,
    "date_created": "2017-07-20",
    "time_created": "15:09:24",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhl1vb",
    "parent_id": "t1_dkhkckp",
    "subreddit_name_prefixed": "r/news",
    "body": "\"This burger is still pink in the middle! I asked for MEDIUM!\"",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1500606730.0,
    "date_created": "2017-07-20",
    "time_created": "15:12:10",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhnxmp",
    "parent_id": "t1_dkhmo3p",
    "subreddit_name_prefixed": "r/news",
    "body": "Some were related or friends but a lot of them had no real links to each other. I guess if you're depressed or in a really shitty situation then seeing articles and news reports of local people committing suicide every couple of weeks just kept it at the forefront of their mind and made it seem like a  much more viable option.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1500609648.0,
    "date_created": "2017-07-20",
    "time_created": "16:00:48",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhnkef",
    "parent_id": "t1_dkhn302",
    "subreddit_name_prefixed": "r/news",
    "body": "A lot of countries avoid reporting on suicides at all unless there are special circumstances surrounding it. If I remember correctly the police or government actually requested that the media stopped reporting on suicides in the Bridgend area because they felt it was in part to blame for the suicides. ",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1500609276.0,
    "date_created": "2017-07-20",
    "time_created": "15:54:36",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhly68",
    "parent_id": "t1_dkhlvpj",
    "subreddit_name_prefixed": "r/news",
    "body": "Yes there was! A horrific scenario, all across. Last time I checked, it was on Netflix. Named after the city.",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1500607633.0,
    "date_created": "2017-07-20",
    "time_created": "15:27:13",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhku82",
    "parent_id": "t1_dkhkd9r",
    "subreddit_name_prefixed": "r/news",
    "body": "Money and success don't necessarily mean support and love. ",
    "controversiality": 0,
    "ups": 106,
    "downs": 0,
    "score": 106,
    "created": 1500606515.0,
    "date_created": "2017-07-20",
    "time_created": "15:08:35",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkr6i",
    "parent_id": "t1_dkhkd9r",
    "subreddit_name_prefixed": "r/news",
    "body": "Unfortunately, I tend to view it that same way.  I have 0 want for fame and all the burdens that come with it, but if these guys that seemingly have it all can't figure out, what makes me think I'm going to do any better.",
    "controversiality": 0,
    "ups": 211,
    "downs": 0,
    "score": 211,
    "created": 1500606427.0,
    "date_created": "2017-07-20",
    "time_created": "15:07:07",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhl8sq",
    "parent_id": "t1_dkhkd9r",
    "subreddit_name_prefixed": "r/news",
    "body": "To me it's somewhat reassuring. It reminds me that my negative feelings about myself are not the CAUSE of my depression, rather a symptom of it. It reminds me that what I suffer from is not a failure of morals, a failure of will, or a failure to accomplish my goals. It's a chemical imbalance that doesn't discriminate.\n\nIt reminds me that my depression doesn't define me. It's not my friend, and the conclusions it reaches are not my own. I must never embrace it and fight it every day.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1500606923.0,
    "date_created": "2017-07-20",
    "time_created": "15:15:23",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkrdv",
    "parent_id": "t1_dkhkgo9",
    "subreddit_name_prefixed": "r/news",
    "body": "Keep your chin up. The fact that you're already seeking help shows your strength. ",
    "controversiality": 0,
    "ups": 91,
    "downs": 0,
    "score": 91,
    "created": 1500606433.0,
    "date_created": "2017-07-20",
    "time_created": "15:07:13",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkw2q",
    "parent_id": "t1_dkhkgo9",
    "subreddit_name_prefixed": "r/news",
    "body": "You got this. There's a sticky at the top it you need to talk. Or PM me.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1500606567.0,
    "date_created": "2017-07-20",
    "time_created": "15:09:27",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhk2e5",
    "parent_id": "t1_dkhjt80",
    "subreddit_name_prefixed": "r/news",
    "body": "That video was [the shit](https://www.youtube.com/watch?v=GgxcvmkPD-I) back then. ",
    "controversiality": 0,
    "ups": 108,
    "downs": 0,
    "score": 108,
    "created": 1500605730.0,
    "date_created": "2017-07-20",
    "time_created": "14:55:30",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhki8z",
    "parent_id": "t1_dkhjt80",
    "subreddit_name_prefixed": "r/news",
    "body": "Pushing me Away, Runaway, one step closer, and Crawling on Reanimation are my favorite tracks off that album. Still play it once a week. Had some crazy guest vocalists on that album. ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1500606175.0,
    "date_created": "2017-07-20",
    "time_created": "15:02:55",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhk10j",
    "parent_id": "t1_dkhjwqz",
    "subreddit_name_prefixed": "r/news",
    "body": "Hybrid Theory/Meteora, winning duo",
    "controversiality": 0,
    "ups": 445,
    "downs": 0,
    "score": 445,
    "created": 1500605692.0,
    "date_created": "2017-07-20",
    "time_created": "14:54:52",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkngi",
    "parent_id": "t1_dkhkl2n",
    "subreddit_name_prefixed": "r/news",
    "body": "It's not gambling, DRY is going to go back up",
    "controversiality": 0,
    "ups": 368,
    "downs": 0,
    "score": 368,
    "created": 1500606322.0,
    "date_created": "2017-07-20",
    "time_created": "15:05:22",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhqasl",
    "parent_id": "t1_dkhm23k",
    "subreddit_name_prefixed": "r/news",
    "body": "It's funny because people are tipping him dogecoin with a tip bot that recently stole everyone's money. So he may have been screwed over again. ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1500612113.0,
    "date_created": "2017-07-20",
    "time_created": "16:41:53",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhxmao",
    "parent_id": "t1_dkhvh70",
    "subreddit_name_prefixed": "r/news",
    "body": "Man I feel the same, can't believe he's gone :( watching their concert live will always stay a broken dream now",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1500620587.0,
    "date_created": "2017-07-20",
    "time_created": "19:03:07",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki1lzx",
    "parent_id": "t1_dkhy5wz",
    "subreddit_name_prefixed": "r/news",
    "body": "Honestly if you think about it, Wal-Mart guy had your back. L.P. Probably should have had parental advisory on their stuff, but it's just enough to fly under the radar. Mom doesn't worry, you get a good CD, Wal-Mart guy gets a sale in, everyone wins",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1500625838.0,
    "date_created": "2017-07-20",
    "time_created": "20:30:38",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkho3ep",
    "parent_id": "t1_dkhnv44",
    "subreddit_name_prefixed": "r/news",
    "body": "I definitely have, thank you :) I have a lot of support from my husband and a lot of resources here. It's been a lifelong battle but I'm doing my best to keep my head up during the worst of the cycles! Thanks for caring enough to reach out to me!",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1500609814.0,
    "date_created": "2017-07-20",
    "time_created": "16:03:34",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dki01hk",
    "parent_id": "t1_dkhze6f",
    "subreddit_name_prefixed": "r/news",
    "body": "I've been there.  Looking at a dwindling bank account with no prospects was a bad time in my life.  \n\nLife wasn't exactly easy for me, but I just kept doing positive things, and with positive actions, positive results have to follow.  I read that famous Winston Churchill quote to myself many nights and mornings:\n\n\"If you're going through hell, keep going.\"  \n\nI took that quote to heart and lived by it.  \n\nI kept going and made it out.  It took over 2 years of struggling.  Life is the best its ever been for me now.  Just keep going bro, and don't give up.  \n\nIt sounds cliche, but its cliche for a reason, because its true.   Best of luck dude, you aren't the first in that position and you won't be the last.  ",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1500623722.0,
    "date_created": "2017-07-20",
    "time_created": "19:55:22",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhuc0m",
    "parent_id": "t1_dkhu0wz",
    "subreddit_name_prefixed": "r/news",
    "body": "Things are different now... for the most part",
    "controversiality": 0,
    "ups": 115,
    "downs": 0,
    "score": 115,
    "created": 1500616607.0,
    "date_created": "2017-07-20",
    "time_created": "17:56:47",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhnlgv",
    "parent_id": "t1_dkhlcji",
    "subreddit_name_prefixed": "r/news",
    "body": "Back when you had to search \"Lincoln Park\" in KaZaa and Napster to find them, and it took 30 minutes to download one song.\n\nThis one fucking sucks...",
    "controversiality": 0,
    "ups": 415,
    "downs": 0,
    "score": 415,
    "created": 1500609305.0,
    "date_created": "2017-07-20",
    "time_created": "15:55:05",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhmt6f",
    "parent_id": "t1_dkhlcji",
    "subreddit_name_prefixed": "r/news",
    "body": "Same here. And yeah, I can't even believe it's been 17 years, are you fucking kidding me? This news brings back so many memories and nostalgia along with the sadness. Linkin Park had a huge impact on a lot of people. ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1500608505.0,
    "date_created": "2017-07-20",
    "time_created": "15:41:45",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhpv2w",
    "parent_id": "t1_dkhokpb",
    "subreddit_name_prefixed": "r/news",
    "body": "\n>Somewhere I Belong helped me stop cutting myself and made me feel like I wasn't alone. \n\nThanks for your perspective! I used Somewhere I Belong to motivate myself to meet new people and make new friends when I moved away for college. Despite being surrounded by more people than ever before, I felt lonely and had a terrible freshman year. I used that song to envision what a better place would look like in my mind, then made it a reality by getting to know people and socializing outside of a classroom or dorm setting. \n\nNowadays, all of my closest friends are people I met that sophomore year. Linkin Park, in essence, had a huge impact on my life. \n",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1500611650.0,
    "date_created": "2017-07-20",
    "time_created": "16:34:10",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhrw6t",
    "parent_id": "t1_dkhokpb",
    "subreddit_name_prefixed": "r/news",
    "body": "Beautifully written, my friend. I hope you're doing better now. LP's music has definitely helped a lot of folks and in a way, helped their fans feel belonged. \n\nThe worst part of suicide is, after they're gone they'll never know how much they were truly loved by their friends and family. It's always difficult to tell someone has severe depression by just their appearances alone. You won't know til they actually tell you. \n\nWhat's worse is that some people don't take it seriously. So theres a chance the person they confide in wont take them seriously, thus brushing off their mental illness. Afterwards, feeling hopeless, in your head it would just be easier to put on a mask everyday and pretend life is great than have to go through that again. \n\nSorry for the rant, but i'd really like those who are suffering from depression, that suicide is not the option and to seek help. And most importantly there are people who do love and care for you.\n\nAs the fortune said from a fortune cookie I got awhile back, \"There's always a way out\"...",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1500613839.0,
    "date_created": "2017-07-20",
    "time_created": "17:10:39",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhmut1",
    "parent_id": "t1_dkhkvyg",
    "subreddit_name_prefixed": "r/news",
    "body": "That's why they drink",
    "controversiality": 0,
    "ups": 53,
    "downs": 0,
    "score": 53,
    "created": 1500608550.0,
    "date_created": "2017-07-20",
    "time_created": "15:42:30",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhleuo",
    "parent_id": "t1_dkhku82",
    "subreddit_name_prefixed": "r/news",
    "body": "True, but not having support and love while also not having money isn't really a walk in the park either.  \n\nWhich isn't to say that I don't have support and love, but there are definitely people who don't have that or money and idk if this argument is particularly comforting for them.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1500607088.0,
    "date_created": "2017-07-20",
    "time_created": "15:18:08",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkygm",
    "parent_id": "t1_dkhkr6i",
    "subreddit_name_prefixed": "r/news",
    "body": "Because we're here, and we're in this together.\n\nWe will grieve. We will listen to each other, and we will mock each other's typos relentlessly. We will carry on, and we will never stop posting. ",
    "controversiality": 0,
    "ups": 282,
    "downs": 0,
    "score": 282,
    "created": 1500606633.0,
    "date_created": "2017-07-20",
    "time_created": "15:10:33",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkq2z",
    "parent_id": "t1_dkhk2e5",
    "subreddit_name_prefixed": "r/news",
    "body": "I was so happy there was a badass band who loved giant robots as much as I did",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1500606396.0,
    "date_created": "2017-07-20",
    "time_created": "15:06:36",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkc6n",
    "parent_id": "t1_dkhk10j",
    "subreddit_name_prefixed": "r/news",
    "body": "Papercut will forever be my favorite song from linkinpark",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1500606002.0,
    "date_created": "2017-07-20",
    "time_created": "15:00:02",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhkshl",
    "parent_id": "t1_dkhkngi",
    "subreddit_name_prefixed": "r/news",
    "body": "Still waiting for that RAD bounce!",
    "controversiality": 0,
    "ups": 218,
    "downs": 0,
    "score": 218,
    "created": 1500606465.0,
    "date_created": "2017-07-20",
    "time_created": "15:07:45",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhuf85",
    "parent_id": "t1_dkhuc0m",
    "subreddit_name_prefixed": "r/news",
    "body": "That probably explains it. I didn't really start going to many shows until the mid 2000s.",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1500616707.0,
    "date_created": "2017-07-20",
    "time_created": "17:58:27",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhxgl5",
    "parent_id": "t1_dkhuc0m",
    "subreddit_name_prefixed": "r/news",
    "body": "Hendrix opened for the Monkees and was barraged with chants of \"We want Davy!\" \n\n\n>Jimi Hendrix managed to get through a total of only seven dates with the Monkees, culminating in his final show on July 17, 1967, which may or may not have ended with Hendrix saluting the crowd with his middle finger. \n\n\nhttp://www.history.com/this-day-in-history/jimi-hendrix-drops-out-as-opening-act-for-the-monkees ",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1500620387.0,
    "date_created": "2017-07-20",
    "time_created": "18:59:47",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhr5ug",
    "parent_id": "t1_dkhnlgv",
    "subreddit_name_prefixed": "r/news",
    "body": "Haha omfg Kazaa ",
    "controversiality": 0,
    "ups": 88,
    "downs": 0,
    "score": 88,
    "created": 1500613032.0,
    "date_created": "2017-07-20",
    "time_created": "16:57:12",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhn2fc",
    "parent_id": "t1_dkhmut1",
    "subreddit_name_prefixed": "r/news",
    "body": "Can confirm.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1500608764.0,
    "date_created": "2017-07-20",
    "time_created": "15:46:04",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhoocz",
    "parent_id": "t1_dkhkygm",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1500610416.0,
    "date_created": "2017-07-20",
    "time_created": "16:13:36",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhw87d",
    "parent_id": "t1_dkhuf85",
    "subreddit_name_prefixed": "r/news",
    "body": "I didn't start booing opening bands until 2003.",
    "controversiality": 0,
    "ups": 56,
    "downs": 0,
    "score": 56,
    "created": 1500618863.0,
    "date_created": "2017-07-20",
    "time_created": "18:34:23",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhzgn7",
    "parent_id": "t1_dkhuf85",
    "subreddit_name_prefixed": "r/news",
    "body": "I don't know. I'm from the '80s and went to plenty of concerts late 80s, early 90s and not once did any opening bands get booed off stage. Maybe it just depends on the crowd that night? Or area? IDK. We were always just amped up and having fun.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1500622964.0,
    "date_created": "2017-07-20",
    "time_created": "19:42:44",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhuhze",
    "parent_id": "t1_dkhuf85",
    "subreddit_name_prefixed": "r/news",
    "body": "Same here, but I've just heard my parents and their friends talk about shows in the 80's and they were pretty brutal sometimes. Also some bands had to play soft songs at the end of their sets to calm the crowd.",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1500616796.0,
    "date_created": "2017-07-20",
    "time_created": "17:59:56",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhub3d",
    "parent_id": "t1_dkhr5ug",
    "subreddit_name_prefixed": "r/news",
    "body": "Hehe, when the file you were searching for could be anything, from a troll song version to a cameo, to porn or simply the song itself. Was quite confused when I turned on the \"see live what others search\"",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1500616575.0,
    "date_created": "2017-07-20",
    "time_created": "17:56:15",
    "submission_id": "news-6oi3gu"
  },
  {
    "id": "dkhpcag",
    "parent_id": "t1_dkhn2fc",
    "subreddit_name_prefixed": "r/news",
    "body": "Am drunk at noon on my day off at home alone. Confirming. ",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1500611107.0,
    "date_created": "2017-07-20",
    "time_created": "16:25:07",
    "submission_id": "news-6oi3gu"
  }
]