[
  {
    "id": "dncchef",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I torrent because the excessive censorship in country where I live savages R-rated films to Disney level. I want to see the art that that film makers created, not some butchered version. ",
    "controversiality": 0,
    "ups": 3937,
    "downs": 0,
    "score": 3937,
    "created": 1506084599.0,
    "date_created": "2017-09-22",
    "time_created": "00:49:59",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncblws",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "When I was a kid, I would pirate games because games are expensive and I was a kid, with no job. \n\nNow that I've grown up, I don't have anymore pirated games on my PC and those games that I've pirated in the past are now just sitting in my steam library never to be installed ",
    "controversiality": 0,
    "ups": 11146,
    "downs": 0,
    "score": 11146,
    "created": 1506083064.0,
    "date_created": "2017-09-22",
    "time_created": "00:24:24",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnc4ko2",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is the best tl;dr I could make, [original](https://gizmodo.com/the-eu-suppressed-a-300-page-study-that-found-piracy-do-1818629537) reduced by 64%. (I'm a bot)\n*****\n> The report concluded that: &quot;In general, the results do not show robust statistical evidence of displacement of sales by online copyright infringements. That does not necessarily mean that piracy has no effect but only that the statistical analysis does not prove with sufficient reliability that there is an effect.\"\n\n> The report found that illegal downloads and streams can actually boost legal sales of games, according to the report.\n\n> The paper, &quot;Movie Piracy and Displaced Sales in Europe,&quot; only mentioned the part of the Ecory report that highlights the relationship between piracy and blockbuster film lost sales, and excluded the other findings of the report.\n\n\n*****\n[**Extended Summary**](http://np.reddit.com/r/autotldr/comments/71nv9u/the_eu_suppressed_a_300page_study_that_found/) | [FAQ](http://np.reddit.com/r/autotldr/comments/31b9fm/faq_autotldr_bot/ \"Version 1.65, ~214371 tl;drs so far.\") | [Feedback](http://np.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **report**^#1 **piracy**^#2 **sales**^#3 **Ecory**^#4 **European**^#5",
    "controversiality": 0,
    "ups": 1295,
    "downs": 0,
    "score": 1295,
    "created": 1506073313.0,
    "date_created": "2017-09-21",
    "time_created": "21:41:53",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncdtqg",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Also, some things are hard to find legally. IE old games and shows.",
    "controversiality": 0,
    "ups": 553,
    "downs": 0,
    "score": 553,
    "created": 1506087235.0,
    "date_created": "2017-09-22",
    "time_created": "01:33:55",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnc2oei",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm stealing this ",
    "controversiality": 0,
    "ups": 2503,
    "downs": 0,
    "score": 2503,
    "created": 1506070823.0,
    "date_created": "2017-09-21",
    "time_created": "21:00:23",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncc6h5",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Steam's regional pricing has been a godsend for countries like India. Before Steam introduced Indian rupee pricing, I used to pirate all my games because most weren't available in India and those that were, often cost more than in the US. Now with Steam I buy all my games, sometimes even when they aren't on sale.\n\nIf you're fucking lazy when it comes to making things easy for your customers, you're gonna get pirates.",
    "controversiality": 0,
    "ups": 473,
    "downs": 0,
    "score": 473,
    "created": 1506084047.0,
    "date_created": "2017-09-22",
    "time_created": "00:40:47",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbsdl",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "If you really want to stop piracy, make a better service. I don't want to pay stupid amounts of money for stuff I don't want just to get the little I do Comcast. And while HBO isn't much of a problem for me, the rest of the world seems to have a lot of problems with getting your content from you. I'm starting to wonder if you just hate money or if there are actually enough people paying your high prices to offset that. And boy howdy do I sure love intrusive DRM and unreasonable amounts of DLC and cut content in my video games that you already ask a lot of money for. And boy do I love that demos aren't a thing anymore (/s).\n\nNetflix and Steam have done far more to combat piracy by just being good than trying to kill the pirates ever has.",
    "controversiality": 0,
    "ups": 1068,
    "downs": 0,
    "score": 1068,
    "created": 1506083366.0,
    "date_created": "2017-09-22",
    "time_created": "00:29:26",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnc7fzb",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Companies act like piracy is such a horrible thing and people are stealing from them, yet they do things like create their own streaming service wherein people have to pay $5-$20/mo. to watch the *one* or *two* shows that streaming service offers. I get that they want a slice of that sweet, sweet Netflix pie without having to share the profits, but nobody's going to bite. They must *want* pirates, because that's how you get pirates.",
    "controversiality": 0,
    "ups": 4496,
    "downs": 0,
    "score": 4496,
    "created": 1506077124.0,
    "date_created": "2017-09-21",
    "time_created": "22:45:24",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnc3z1k",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's almost as if people steal because they weren't going to pay for it anyway.",
    "controversiality": 0,
    "ups": 16812,
    "downs": 0,
    "score": 16812,
    "created": 1506072525.0,
    "date_created": "2017-09-21",
    "time_created": "21:28:45",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncck3g",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I focused on IP in law school. I was especially interested in the policy rationale and, in particular, whether it has any justification in empirical data. It doesn't. And not for lack of trying, either. Various organizations have been funding study after study trying to find the barest shred of evidence that copyright or patent law achieves any of the social objectives it's meant to. And they've come up dry or, in some cases, demonstrated the opposite. The closest they have ever gotten has been showing that increasing patent protections increases investment in acquiring pharmaceutical patents. We can hem and haw all day about why the results look the way they do, but the data is pretty much in already: copyright law and patent law, in their current incarnations, are not properly serving their purpose. Not only do they fail to increase production of works of art and inventions, in many cases they do the opposite, by standing in the way of creators who can't defend themselves against legal threats.\n\nTrademark law is mostly fine.",
    "controversiality": 0,
    "ups": 304,
    "downs": 0,
    "score": 304,
    "created": 1506084742.0,
    "date_created": "2017-09-22",
    "time_created": "00:52:22",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncev2f",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> The European Commission paid €360,000 (about $428,000) for a study on how piracy impacts the sales of copyrighted music, books, video games, and movies. But the EU never shared the report—possibly because it determined that there is no evidence that piracy is a major problem.\n\nThis reminds me of when former UK Drug Advisor, Professor David Nutt, published the results of his investigation into the harms of drugs. He came out stating that MDMA and LSD were found to be [safer than horse-riding](http://blogs.discovermagazine.com/neuroskeptic/2009/02/15/ecstasy-vs-horseriding/#.WcSpO7jLe6w). The result was that instead of being praised for investigating the reality of drugs using applied science, he instead [got sacked](https://theconversation.com/david-nutt-i-was-sacked-i-was-angry-i-was-right-19848).\n\nI think a lot of governments are just so full of shit.",
    "controversiality": 0,
    "ups": 48,
    "downs": 0,
    "score": 48,
    "created": 1506089493.0,
    "date_created": "2017-09-22",
    "time_created": "02:11:33",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnc4xk7",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Can someone explain why this is?",
    "controversiality": 0,
    "ups": 211,
    "downs": 0,
    "score": 211,
    "created": 1506073781.0,
    "date_created": "2017-09-21",
    "time_created": "21:49:41",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncc21a",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Release your shit worldwide and at a reasonable price or expect your shit to be pirated. \n\nThere is no reason why a product readily available in the UK and the US should not be readily available in another English speaking place like Australia. Yet this happens all the fucking time. ",
    "controversiality": 0,
    "ups": 451,
    "downs": 0,
    "score": 451,
    "created": 1506083830.0,
    "date_created": "2017-09-22",
    "time_created": "00:37:10",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbs0x",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "At first i thought that said \"piracy doesn't harm sails,\" to which i thought \"tell that to the british navy!\"\nAnyway...turns out that is NOT what this article is about",
    "controversiality": 0,
    "ups": 431,
    "downs": 0,
    "score": 431,
    "created": 1506083350.0,
    "date_created": "2017-09-22",
    "time_created": "00:29:10",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccqer",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The EU commissioned the study, so they didn't really put their thumb on free research. I'm also glad to hear they *do* spent money on those studies. \n\nIf it was held back due to suspicions about the methods of the study I would have preferred to see it released with a disclaimer anyway. Since the tax payer provided the funds for this.\n",
    "controversiality": 0,
    "ups": 105,
    "downs": 0,
    "score": 105,
    "created": 1506085074.0,
    "date_created": "2017-09-22",
    "time_created": "00:57:54",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncderk",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "When I was in community college in like, 2003, I wrote a paper for my English class about the effects of piracy, because Napster et all were in the news and the RIAA was kicking off it's mobster tactics. I cited I think 6 or so real studies that showed that piracy had no noticeable effect on profit and that the companies were likely losing money fighting it instead of ignoring it.\n\nThis was for a 3 page paper for my goddamn English II class over 10 years ago. The only reason the crusade against piracy still exists is because company execs go with their gut feeling a 3rd party DRM sales rep is selling them instead of spending the 6 hours I spent researching the topic. And so the real consumers AND the company suffer as a result.\n\nI refused to buy Sonic Mania because they delayed it on PC so they could add DRM to it. I don't want to be treated like a suspect when I'm giving you my money. I don't want to be one of those people the DRM completely fucks up for. I don't want THOSE people to even have that happen because it shouldn't need to.\n\nMost people who pirate cannot or will not buy the thing in question. No matter what. On the other hand, some people pirate because the owning company doesn't take the effort to make their product available. Look at the foreign prices of some of the mainstream titles on Steam - some of them cost a *month* of pay for one game, because the publisher can't be assed to look up the actual information. Some games are just never flagged as sellable in some countries.\n\nYou want to reduce piracy? Pay some non idiot 60k a year or whatever to fix those easy issues. It'll more than pay for itself and it's a hell of a lot cheaper than drinking Denuvo Kool-Aid",
    "controversiality": 0,
    "ups": 109,
    "downs": 0,
    "score": 109,
    "created": 1506086387.0,
    "date_created": "2017-09-22",
    "time_created": "01:19:47",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncf4ag",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "As an indie filmmaker, I welcome the piracy of my content. That's a huge career milestone.",
    "controversiality": 0,
    "ups": 67,
    "downs": 0,
    "score": 67,
    "created": 1506090071.0,
    "date_created": "2017-09-22",
    "time_created": "02:21:11",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncfdf4",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Of course it doesn't.  It's been part of the entertainment business model since records were invented and probably long before that when printing presses were common.\n\nThe reality is that piracy is an advertising platform and a very effective one.  In more recent times, Photoshop would not have gained it's level of market penetration if it wasn't so widely available to students who would never have spent the money on it.  Tons of bands with cult followings never would have developed those followings without bootleg recordings and easy access to their music.  Once those followings develop money gets made, but there's no pretending that they would have developed otherwise.  \n\nThe anti-piracy movement is not about stopping piracy.  It's about controlling market and mind share.  As long as you _think_ the best movies are $100+M blockbusters, you will keep paying $20 to see the latest Tom Cruise movie in the theaters.  \n\nBut the movement comes at a cost.  There was a solid decade when the music industry produced nothing new of any real value.  The 98-08 collection isn't going to produce much of a nostalgic back catalog because there's very little there.  It's lost revenue, but there was a reason and a business plan around it.  There was potential for the entire market to be lost.  Many independents have come around, but the majority of the move and music markets are still controlled by the same companies.\n\n",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1506090648.0,
    "date_created": "2017-09-22",
    "time_created": "02:30:48",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnc43g3",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Misleading title. Notice the key word in article's thesis: \"the EU never shared the report—*possibly* because it determined that there is no evidence that piracy is a major problem.\"",
    "controversiality": 0,
    "ups": 915,
    "downs": 0,
    "score": 915,
    "created": 1506072685.0,
    "date_created": "2017-09-21",
    "time_created": "21:31:25",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccejd",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 98,
    "downs": 0,
    "score": 98,
    "created": 1506084455.0,
    "date_created": "2017-09-22",
    "time_created": "00:47:35",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncdqnq",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[Crotchety old man voice] Back in my day, we used to have get ‘Demos’ on the bbs, or buy magazines to get demo disks. So we could actually play games to decide if they were worth buying. And then we bought games that came with most of the bugs tested out of them. \n\nNow we pay developers full price to play in their undeveloped Early Access alphas. And count ourselves fortunate to participate in their beta tests.\n\nTimes they are a-changing.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1506087061.0,
    "date_created": "2017-09-22",
    "time_created": "01:31:01",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncf866",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Dear deluded corporate heads:  \nAverage US monthly pay is 3600$. Average monthly pay in my country is 400$. Goods that you are selling are digital, it's not like you are losing money if I pay less, so if you scale your pricing to my region you will actually earn more money and not have your goods pirated. Let's say 5/100 people actually bought your game and other 95 pirated it. Scale a 60$ game to my standard or 7$. Now 80/100 will buy your game. Instead of earning 300$, you will earn 560$. It's simple math, I'm not a genius, why is it so hard for you to understand this?",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1506090311.0,
    "date_created": "2017-09-22",
    "time_created": "02:25:11",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnc5dl2",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I used to pirate everything, until I realized when I was selling VHS copies of From Justin to Kelly I was singlehandedly funding Al-qaeda. Howard Al-qaeda. I bought him some fries with the $3 I made. ",
    "controversiality": 0,
    "ups": 182,
    "downs": 0,
    "score": 182,
    "created": 1506074362.0,
    "date_created": "2017-09-21",
    "time_created": "21:59:22",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncb5sm",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "i see no good reason why digital content is not universally sold online.  why can’t i buy music or movies sold in another country?",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1506082338.0,
    "date_created": "2017-09-22",
    "time_created": "00:12:18",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbzaf",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Megaupload, how I miss you",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1506083697.0,
    "date_created": "2017-09-22",
    "time_created": "00:34:57",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncce0b",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This problem is not new, it is just another chapter in an ongoing battle.\n\nVHS was originally illegal to make your own recordings, then it got accepted and even expected to happen. The big honchos thought that people recording movies at home would kill Hollywood... \n\nBefore that vinyls were thought to become the death of the music industry, they even made singles, as in you could only play them once, thinking that otherwise people would never buy music again...\n\nVideo didn't kill the radio star, video enhanced the radio star. (yes I get that this is taking the original out of context)\n\nPiracy will not kill Hollywood, or gaming, or music, or TV, it makes it better. ",
    "controversiality": 0,
    "ups": 89,
    "downs": 0,
    "score": 89,
    "created": 1506084429.0,
    "date_created": "2017-09-22",
    "time_created": "00:47:09",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncg83e",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Gotta stand up for my Australian brothers and sisters here, we get completely shafted on pretty much all forms of media UNLESS you pay for Foxtel and all of their extended packages, but wait to install Foxtel you have to own the property you live at. Our streaming services have been thrown all over the place too, if you want to access all the content they have on American Netflix then you have to pay upwards of $50USD/m and you still don't get as much content as they do.\n\nWe get shafted even harder on games.\n\nI don't like pirating, but until companies give me a way to actually access the content I would like then I kind of have to.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1506092734.0,
    "date_created": "2017-09-22",
    "time_created": "03:05:34",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbujw",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Once i started earning enough to buy the shit I liked I bought it. \n\n\n\nLet college kids steal your content and eventually once they finish paying the god damn student loans, they'll start paying. Otherwise you are missing out on a big demo.",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1506083470.0,
    "date_created": "2017-09-22",
    "time_created": "00:31:10",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncj1k6",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "A lot of the most upvoted comments here are calling piracy *stealing*. Looks like the information war is working after all.  \n  \n> The basic tool for the manipulation of reality is the manipulation of words. If you can control the meaning of words, you can control the people who must use them.  \n  \n--Philip K. Dick",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1506100772.0,
    "date_created": "2017-09-22",
    "time_created": "05:19:32",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncduyj",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This will get buried but -- I've always seen piracy, especially in modern day, as a form of protest. \n\nIf you provide a convenient service to a consumer, and/or a quality product, at an affordable price, people will gladly pay for it. It really is that simple. ",
    "controversiality": 0,
    "ups": 54,
    "downs": 0,
    "score": 54,
    "created": 1506087305.0,
    "date_created": "2017-09-22",
    "time_created": "01:35:05",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbi4f",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You wouldn't download a car...",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1506082893.0,
    "date_created": "2017-09-22",
    "time_created": "00:21:33",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnch9ww",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Time and time again I see people in positions of power impose rules with no consideration of human psychology.\n\nI went through a phase where I consumed a lot of music. Wanting to be a righteous citizen I bought a load of DRM music downloads. What a mistake!\n\nMoving the music between computers and devices in the conventional way - USB sticks, cloud storage, email - broke the files. Igave up in frustration after a while and it permanently put me off.\n\nCompany execs need to start reading up on human everyday psychology. It confounds me how little they regard it in decisions that can break their business.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1506095544.0,
    "date_created": "2017-09-22",
    "time_created": "03:52:24",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncb8c0",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "i mean.. i've eventually spent money on many things that i had at first pirated. but i've also pirated things i would have bought. ",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1506082450.0,
    "date_created": "2017-09-22",
    "time_created": "00:14:10",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncc16k",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "MAKE 'EM WALK TH' PLANK",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1506083789.0,
    "date_created": "2017-09-22",
    "time_created": "00:36:29",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccid3",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I've bought albums and games based off what I've heard or seen as pirated material... ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1506084650.0,
    "date_created": "2017-09-22",
    "time_created": "00:50:50",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncd3y8",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Honestly every person is different.... but I will never pay for cable... ever Canada has garbage price gouging companies that don't compete but just both raise their prices. That said I pay for any product that is well served to me. E.g. steam is great I buy games through that. I pay for Netflix and I tried to get HBO but I couldn't without a cable company.... so either way I won't do that so at the end of the day I either watch it and they don't make money or I don't watch it and they still don't make money. That said I believe in supporting content so I will buy the season and I even tried to get HBO through Amazon prime video but it isn't available with HBO in Canada.... so if you won't sell to me I won't buy from you",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506085798.0,
    "date_created": "2017-09-22",
    "time_created": "01:09:58",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncf6fl",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "If you want to stop piracy, change costs of products based on user's country. People in shitholes who barely make 300 euros a month might save 20 euros if they're super frugal, no way they're paying 60 euros for a video game.\n\nNow if the price scaled to the country's minimal wage or medium wage, say to 5 euros, it'd make a lot more people buy it\n\nI mean think about it, do you want to work your ass off for a week to buy a video game that you might get bored of after a day? It's too much risk and hard work compared to just pirating \n\nYeah i know, there's a problem of this being abusable but if that's fixed, it'd be pretty neat \n\n",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1506090202.0,
    "date_created": "2017-09-22",
    "time_created": "02:23:22",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncfopj",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The number of pages of a study doesn’t matter. It’s the content and methods that count. What assumptions did they make, what variables did they control for, etc. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1506091395.0,
    "date_created": "2017-09-22",
    "time_created": "02:43:15",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncfpjs",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "When i was a kid with no money i pirated games because I had no money. Now I mostly pirate stuff when paying for it would be more hassle. Think about that for a moment dear online distributors.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1506091451.0,
    "date_created": "2017-09-22",
    "time_created": "02:44:11",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnchjgr",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "If I hadn't become a fan if the games and music I downloaded when I was younger and had no money, u wouldn't be buying the games and music I now enjoy as an adult.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1506096293.0,
    "date_created": "2017-09-22",
    "time_created": "04:04:53",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnchs8b",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Suddenly I support Brexit.\n\nJust kidding, but this should come as a surprise to no one.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1506096979.0,
    "date_created": "2017-09-22",
    "time_created": "04:16:19",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncj17o",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I torrent when they make it stupid expensive and inconvenient to purchase. \n\nIf I have to click way too much just to be able to purchase something, I end up not wanting to do it. \n\nGiving me options to pay with my Amazon account or PayPal so I don't have to look for my wallet and credit card is even better. \n\nAlso, charge for a damn subscription, I don't want to buy each show separately. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506100742.0,
    "date_created": "2017-09-22",
    "time_created": "05:19:02",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncmj4a",
    "parent_id": "t3_71nmck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I wouldn't have bought half the games I had if I hadn't been able to try them out through piracy first. \n\nSame applies to my stack of vinyl. A lot of them I bought as I discovered the music in my teens through piracy. \n\nAs for software, I will never be able to afford Photoshop, so why the fuck not?!",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1506109592.0,
    "date_created": "2017-09-22",
    "time_created": "07:46:32",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncfl0b",
    "parent_id": "t1_dncchef",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I remember watching Bruce almighty in the cinema in the middle east. They'd removed all references to god (and all romantic scenes)... the film was 40 minutes long. \n\nWe all came out of the cinema slightly puzzled, and it took me a good few years to realise why the film was so shit when I accidentally watched it again \n\nE: Quick google brings up someone with similar experience https://www.reddit.com/r/movies/comments/5gfmuu/the_bloopers_from_bruce_almighty_shows_how_jim/das0c21/",
    "controversiality": 0,
    "ups": 2164,
    "downs": 0,
    "score": 2164,
    "created": 1506091146.0,
    "date_created": "2017-09-22",
    "time_created": "02:39:06",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnce3cz",
    "parent_id": "t1_dncchef",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "where do you live :O",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1506087805.0,
    "date_created": "2017-09-22",
    "time_created": "01:43:25",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnciw7w",
    "parent_id": "t1_dncchef",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "i pirate cuz its too expensive to pay 20$ for every movie i wanted to watch, and i watch a shit ton of movies.\n\nonce i watch them though ill usually recommend them and those people will then buy or stream the movie legally which would definitely not have occurred had i not pirated the movie to begin with",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506100320.0,
    "date_created": "2017-09-22",
    "time_created": "05:12:00",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnci1nt",
    "parent_id": "t1_dncchef",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Try watching GoT in Asia. I have HBO  and it doesnt even air on it. It airs on a Fox channel. I torrent it mainly due to censorship. The wait time isn't an issue.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1506097749.0,
    "date_created": "2017-09-22",
    "time_created": "04:29:09",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccyhx",
    "parent_id": "t1_dncblws",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Also because of the convenience Steam brings. No one in their right mind is going to pay *more* to get *less*. Most DRMs actually make the user experience **worse** than if they had pirated it. Just take a second to think about how insane that is.\n\nSteam allows me to download all my games at full speed and play them anywhere on any computer. It takes only a few clicks, and it also syncs my progress and all sorts of other neat bonuses too. That's far superior than me having to find a torrent, hope I get decent speeds, extract it, install it myself, apply the crack, copy my save file over, etc.\n\nSimilarly, music streaming services allow me to listen to any of millions of songs anytime anywhere on any device. Compare that to having to track and download every individual song and album that comes out every week. Could say the same about Netflix too.\n\nPiracy is mostly a service problem, as Gabe Newell pointed out. The rest is people who either literally cannot access the content or weren't going to buy it anyway.",
    "controversiality": 0,
    "ups": 6009,
    "downs": 0,
    "score": 6009,
    "created": 1506085502.0,
    "date_created": "2017-09-22",
    "time_created": "01:05:02",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncdkq4",
    "parent_id": "t1_dncblws",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Sometimes, a pirated game is also just the best demo for the game. The last game I pirated was the base EU3 game, probably some time around 2005 or 2006. When the first expansion was released, I ended up buying that and the base game. Fat forward a few more years, and I had bought all four EU3 expansions. Then came EU4, I bought all of its expansion packs on release, that's around 9 at the moment, plus CK2 and most of that's dlc, same with most other Paradox games. That base game I pirated more than a decade ago ended up being the most convincing ad ever, netting them hundreds of €.\n\nI wonder if the reason why Paradox don't really copy protect their games, is that they know it's basically digital heroin they just allow freely lying around on the net, and sooner or later, people will come back with their cash out, begging for more.",
    "controversiality": 0,
    "ups": 112,
    "downs": 0,
    "score": 112,
    "created": 1506086722.0,
    "date_created": "2017-09-22",
    "time_created": "01:25:22",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnce4ie",
    "parent_id": "t1_dncblws",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I pirated Stardew Valley because I wanted to see what all the hype was about, and whether or not it was better than Harvest Moon. Had I not done it, Concerned Ape would have 0 of my dollars. I've since purchased 3 copies for myself, my fiance, and my best friend.\n\nAnybody remember PC Gamer Demo Discs? Those made so much money for the developers from me just by sheer virtue of letting me handle the game for free and let me make a decision. There's so much shit in the market today, you can't trust AAAs or indies anymore.\n\nDemo culture needs to make a comeback. It'll be great for talented developers and the customer together. ",
    "controversiality": 0,
    "ups": 740,
    "downs": 0,
    "score": 740,
    "created": 1506087877.0,
    "date_created": "2017-09-22",
    "time_created": "01:44:37",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccigk",
    "parent_id": "t1_dncblws",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Same. I bought all the titles I enjoyed as a kid, but these days I simply buy games that I play. ",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1506084654.0,
    "date_created": "2017-09-22",
    "time_created": "00:50:54",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccfvz",
    "parent_id": "t1_dncblws",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Same.\n\nI actually bought two copies of the original deus ex over the years, because I had pirated it originally when I was a kid.\n\nThe second copy I don't think I ever even took the wrap off the jewel case lol.... I think I gave it away to someone.",
    "controversiality": 0,
    "ups": 144,
    "downs": 0,
    "score": 144,
    "created": 1506084524.0,
    "date_created": "2017-09-22",
    "time_created": "00:48:44",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccfyl",
    "parent_id": "t1_dncblws",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 200,
    "downs": 0,
    "score": 200,
    "created": 1506084528.0,
    "date_created": "2017-09-22",
    "time_created": "00:48:48",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncc6xj",
    "parent_id": "t1_dnc4ko2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "If I had to guess it's because people play it for a good time, enjoy it and want to pay the devs for their hardwork",
    "controversiality": 0,
    "ups": 37,
    "downs": 0,
    "score": 37,
    "created": 1506084070.0,
    "date_created": "2017-09-22",
    "time_created": "00:41:10",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnclobo",
    "parent_id": "t1_dncdtqg",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Either that or they still try to charge full price after 10+ years",
    "controversiality": 0,
    "ups": 99,
    "downs": 0,
    "score": 99,
    "created": 1506107831.0,
    "date_created": "2017-09-22",
    "time_created": "07:17:11",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncjitm",
    "parent_id": "t1_dncdtqg",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Good Old Games, GOG.com , may help you there. ",
    "controversiality": 0,
    "ups": 119,
    "downs": 0,
    "score": 119,
    "created": 1506102252.0,
    "date_created": "2017-09-22",
    "time_created": "05:44:12",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncgq4d",
    "parent_id": "t1_dncdtqg",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Man, I just wanna watch some night court.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1506094029.0,
    "date_created": "2017-09-22",
    "time_created": "03:27:09",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnckgvw",
    "parent_id": "t1_dncdtqg",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Try watching any anime older than 5 years legally. Either import dvds for a million bucks or don't.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1506104933.0,
    "date_created": "2017-09-22",
    "time_created": "06:28:53",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncoulc",
    "parent_id": "t1_dncdtqg",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I live in the US and fell in love with Caravan Palace when they first came out.  I scoured the internet for a place to purchase their album, but to no avail.  It simply wasn't available for purchase in the United States...  So I pirated it.  I was really angry it came to that.  \n\nFor the record, I have since paid for the albums I had to pirate.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506113563.0,
    "date_created": "2017-09-22",
    "time_created": "08:52:43",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnc4use",
    "parent_id": "t1_dnc2oei",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You wouldn't steal a Gizmodo article!",
    "controversiality": 0,
    "ups": 861,
    "downs": 0,
    "score": 861,
    "created": 1506073684.0,
    "date_created": "2017-09-21",
    "time_created": "21:48:04",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncedlp",
    "parent_id": "t1_dncc6h5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Same with Mexico. And at first I didn't want it because all my life I had seen that even though games would get priced in pesos, it was still more expensive than in the US, almost double price. I was proven wrong, it's almost hard to believe you are getting fair prices.",
    "controversiality": 0,
    "ups": 106,
    "downs": 0,
    "score": 106,
    "created": 1506088424.0,
    "date_created": "2017-09-22",
    "time_created": "01:53:44",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnceio3",
    "parent_id": "t1_dncc6h5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": " Now if only they'd do the same damn thing for Australia instead of making bullshit claims that they \"don't actually do business in Australia\".",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1506088730.0,
    "date_created": "2017-09-22",
    "time_created": "01:58:50",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncgueh",
    "parent_id": "t1_dncc6h5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I wish they would do the same for Romania,we have prices in € just like the uk or germany but its a huge diferance in purchase power.\n\nA 60€ game its not a big deal for a german but when your job pays 6-700€ a month its a hard sell,so I just buy when games have big sales or raise money for 2-3 months.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1506094349.0,
    "date_created": "2017-09-22",
    "time_created": "03:32:29",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncdv4q",
    "parent_id": "t1_dncbsdl",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Netflix ain't great. I shouldn't have to pirate a Netflix Original Series that isn't available in my region, and I shouldn't have to pirate kung fu movies as my only means of finding a copy with English subtitles.\n\nSteam is doing it right with their refund policy though. I'll buy anything at all on that platform.",
    "controversiality": 0,
    "ups": 380,
    "downs": 0,
    "score": 380,
    "created": 1506087315.0,
    "date_created": "2017-09-22",
    "time_created": "01:35:15",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnc9wa2",
    "parent_id": "t1_dnc7fzb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It inevitably wheels back to [Gabe Newell calling it six years ago](http://www.escapistmagazine.com/news/view/114391-Valves-Gabe-Newell-Says-Piracy-Is-a-Service-Problem), and Steam prints money as a result. ",
    "controversiality": 0,
    "ups": 2002,
    "downs": 0,
    "score": 2002,
    "created": 1506080499.0,
    "date_created": "2017-09-21",
    "time_created": "23:41:39",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncc6bq",
    "parent_id": "t1_dnc7fzb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm even tempted to \"sail\" VPN in my Netflix account, so I can watch content not available in my country",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1506084040.0,
    "date_created": "2017-09-22",
    "time_created": "00:40:40",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnc9r05",
    "parent_id": "t1_dnc7fzb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yep, this is how I behave as a consumer.  I use Netflix.  You want my money, you put your content on Netflix.  You set up your own janky-ass streaming service?  Yeah, I'm pirating it, fuck you.",
    "controversiality": 0,
    "ups": 622,
    "downs": 0,
    "score": 622,
    "created": 1506080292.0,
    "date_created": "2017-09-21",
    "time_created": "23:38:12",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncc6yq",
    "parent_id": "t1_dnc7fzb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "People said Steam wouldn't work in Russia!? Man, imagine their reaction to CS:GO today.",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1506084072.0,
    "date_created": "2017-09-22",
    "time_created": "00:41:12",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccgxv",
    "parent_id": "t1_dnc7fzb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "They are maxing out the profit. It's what every one of those companies try to do. They are not pushing for anti-piracy to protect some carefully built balance or to push moral behavior onto people. It's all about profit. From this point of view it would seem understandable - it's not about those pirated copies people would pay for (even though some in the industry may be misinformed or dumb enough to think so), but most of the smart ones are doing this to make piracy harder and push people to use legal ways to obtain the copy.\n\nBTW: piracy is not theft. Piracy is making copies, theft removes the original. The thing which makes theft bad - removing the original from the owner - is simply not there in piracy. If anything piracy increases the amount of copies present.",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1506084577.0,
    "date_created": "2017-09-22",
    "time_created": "00:49:37",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccgln",
    "parent_id": "t1_dnc7fzb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Piracy has been a thing since cassettes. It was just as easy to rip a song off the radio fifty years ago as it is today. If big corporations weren't so slow to adapt to new technology they could have negated any profit loss many times over by now. ",
    "controversiality": 0,
    "ups": 37,
    "downs": 0,
    "score": 37,
    "created": 1506084559.0,
    "date_created": "2017-09-22",
    "time_created": "00:49:19",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncdmb3",
    "parent_id": "t1_dnc7fzb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "How CBS is handling the new Star Trek is baffling because of how blatantly of a cash grab the distribution is. \"We're going to go through Netflix to distribute the show. Unless if you live in the U.S., then fuck pay us.\"",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1506086812.0,
    "date_created": "2017-09-22",
    "time_created": "01:26:52",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnceux7",
    "parent_id": "t1_dnc7fzb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's cherry picking. Steve Jobs famously said \"Apple shamelessly steals the best ideas\" but the second someone had something even remotely good Apple was sure to get in there and shut them down for stealing \"their\" idea.\n\nSame thing with piracy. Don't copy that floppy pirated the music used to make that commercial. It's all hypocrisy, the shamer is just as shameful.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1506089485.0,
    "date_created": "2017-09-22",
    "time_created": "02:11:25",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnc4wew",
    "parent_id": "t1_dnc3z1k",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Most of the time it's due to accessibility too. I'm such a lazy fuck that if you make your product easily paid for I don't even bother torrenting. ",
    "controversiality": 0,
    "ups": 8880,
    "downs": 0,
    "score": 8880,
    "created": 1506073740.0,
    "date_created": "2017-09-21",
    "time_created": "21:49:00",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnc584x",
    "parent_id": "t1_dnc3z1k",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 343,
    "downs": 0,
    "score": 343,
    "created": 1506074163.0,
    "date_created": "2017-09-21",
    "time_created": "21:56:03",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbqzw",
    "parent_id": "t1_dnc3z1k",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I remember Notch, the head of Mojang (who made Minecraft), having a similar opinion. He was asked about piracy and whether it bothered him, because Minecraft was pirated a ton, and still is, and his viewpoint was that it's not lost sales if they weren't going to buy it in the first place.\n\nI've pirated games before that I didn't mean to buy because I wasn't sure tey were worth my money, but I also pirated games just to make sure they ran on my computer because nobody does demos anymore and my computer's a fickle beast that doesn't seem to care about system requirements so I *have* to check whether the game actually runs on my computer. If it does, I buy it. If it doesn't, I didn't spend $20-60 on functionally nothing.",
    "controversiality": 0,
    "ups": 434,
    "downs": 0,
    "score": 434,
    "created": 1506083302.0,
    "date_created": "2017-09-22",
    "time_created": "00:28:22",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbwow",
    "parent_id": "t1_dnc3z1k",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I may watch the odd, illegal movie. But I buy em if I like em. ",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1506083572.0,
    "date_created": "2017-09-22",
    "time_created": "00:32:52",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbkew",
    "parent_id": "t1_dnc3z1k",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Or watching the first two movies for free gets people to go see the third one in a theater.",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1506082997.0,
    "date_created": "2017-09-22",
    "time_created": "00:23:17",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncakca",
    "parent_id": "t1_dnc3z1k",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Or steal because they want to make sure it's fucking worth the money. Hell, AcidWizardStudio uploaded a torrent of their game Darkwood. I still bought it because I really enjoy it.",
    "controversiality": 0,
    "ups": 101,
    "downs": 0,
    "score": 101,
    "created": 1506081423.0,
    "date_created": "2017-09-21",
    "time_created": "23:57:03",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnc9qot",
    "parent_id": "t1_dnc3z1k",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "piracy and sharing increases sales because it exposes people to music.    sometimes they buy it.  ",
    "controversiality": 0,
    "ups": 87,
    "downs": 0,
    "score": 87,
    "created": 1506080280.0,
    "date_created": "2017-09-21",
    "time_created": "23:38:00",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncekue",
    "parent_id": "t1_dnc3z1k",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Except that's not true, come on people. I pirate as much as the rest of you but let's not pretend it's not hurting sales rofl. Stupid as hell.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506088863.0,
    "date_created": "2017-09-22",
    "time_created": "02:01:03",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncfpys",
    "parent_id": "t1_dncck3g",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I did not focus on IP law in law school (my undergrad was not a hard science so getting into the patent bar was going to be difficult/impossible), but I did take a couple classes related to it. The evidence intellectual property protections encourage creativity and innovation is tenuous at best. The origins of intellectual property had more to do with royalty handing out exclusive monopolies on profits than anything else. How we as societies think about and approach intellectual property is all wrong and the specific examples of how we've codified protections and adjudicate IP disputes very often does the exact opposite of their alleged intentions.\n\nThis book may interest you: [Against Intellectual Monopoly by Michele Boldrin and David K. Levine.](http://levine.sscnet.ucla.edu/general/intellectual/againstnew.htm)",
    "controversiality": 0,
    "ups": 53,
    "downs": 0,
    "score": 53,
    "created": 1506091479.0,
    "date_created": "2017-09-22",
    "time_created": "02:44:39",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncnedc",
    "parent_id": "t1_dncck3g",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Relevant story.  My friend's company got sued by Monster for copyright (or maybe trademark) infringement.  Friend's company won.  Monster made it clear that their pockets were deeper and they would keep taking them back to court if they didn't change their logo.  Fuck Monster. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1506111202.0,
    "date_created": "2017-09-22",
    "time_created": "08:13:22",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncimqb",
    "parent_id": "t1_dncck3g",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[IP law is no longer serving its intended purpose](http://www.smbc-comics.com/comic/2014-05-29)",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1506099532.0,
    "date_created": "2017-09-22",
    "time_created": "04:58:52",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncttmu",
    "parent_id": "t1_dncck3g",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> copyright law and patent law, in their current incarnations, are not properly serving their purpose\n\nThey are, just not the purpose that the public expects.  Copyright is supposed to be, ultimately, a lien on the natural rights of the public for a limited time (and limited does not mean \"lifetime of so-and-so\" or \"as long as we can bribe Congress to pad it out to,\" more like \"a few years so that people who want to do something with it aren't going to be rotted bones by the time it hits the public domain\") to allow content producers to make money off of their creations, with the end goal being the benefit to the public.\n\nIt stopped being that a long time ago.\n\nAt this point, copyright is about **control** on just about every level.  Specifically, controlling you.  This ranges from a hoped-for end game where you have to rent all the media you watch, to dictating how you do repairs on your tractor (which is already here, see: John Deere tractors and the DRM on their software), to what you can do with your own private property (although they've failed in many instances - resale of cars, jailbreaking/rooting phones - but they keep trying), and probably at some point what you can and cannot do with your computer.  The companies and the government would love that, a computer that you pay for but they own for all intents and purposes.  Only able to do what they permit you to.  And because it has DRM, it's illegal to try to remove the software that does that.  Considering some of the things that have happened with software lately, what with telemetry and the crap that we hear about creeping into our computers (e.g. Intel Management Engine), I wouldn't be a bit surprised if they're trying to creep towards that.\n\nPlus, it's used to retard innovation, as are patents for that matter.  Scientific research behind a paywall where you have to pay $50 just to look at one paper for 24 hours?  Companies that buy up patents so that they can't be produced, sometimes for things that can radically improve people's lives?  Yeah, that's all there.  Again.  Control.\n\nIn truth, it's pretty scary.  Piracy is just one side of it, and it's a very one-dimensional side at that, at least if you listen to the line you're being fed.  Heck, piracy doesn't even go into the fact that in a lot of cases the work really should have become public domain after a few years, if we were paying attention to the Constitution.\n\nAnd ultimately, nobody is going to pay any attention to it until it's gone completely out of control and is likely baked into most of our technology, even though it's slowly creeping in all around us.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1506119837.0,
    "date_created": "2017-09-22",
    "time_created": "10:37:17",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnc5gla",
    "parent_id": "t1_dnc4xk7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Because the difference between the people who engage in entertainment that's free vs those that would engage in entertainment that's even a few pennies is astronomical.\n\nBasically if it's free everyone will take it, but that doesn't mean those people wanted it or would want it badly enough to even pay one cent for the product.\n\nSo if a pirated version was not available, the vast majority of pirating people would simply do without, rather than pay.\n\nAn airline did a study once on on in flight wifi once that showed when they offered it for free everyone used it. They played with pricing in the study and found as soon as they attached any price the usage dropped by something like 80%, even when the price was as low as a few cents. Because the effort of the transaction alone simply wasn't worth it for a large number of passengers. ",
    "controversiality": 0,
    "ups": 1202,
    "downs": 0,
    "score": 1202,
    "created": 1506074474.0,
    "date_created": "2017-09-21",
    "time_created": "22:01:14",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnc5nmd",
    "parent_id": "t1_dnc4xk7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "There are two main reasons I see for this conclusion. First, people who pirate something are likely to just go without it if they can't pirate it, instead of just purchasing it. Second, pirates consume the media and talk about it in their social circles, giving it greater exposure and more weight than a traditional ad campaign could. For example, you are probably going to be more likely to see a movie that your friends rave about than one that you've only seen ads for.",
    "controversiality": 0,
    "ups": 197,
    "downs": 0,
    "score": 197,
    "created": 1506074732.0,
    "date_created": "2017-09-21",
    "time_created": "22:05:32",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnc5oqx",
    "parent_id": "t1_dnc4xk7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "why what is? why piracy doesn't effect sales?\n\nmainly because, people who are pirating a movie/show were never going to buy it anyway.\n\nAlso, some people are pirating to see if something is worth it. like a \"demo\".\n\nAnd most importantly, some people are pirating because there is no legal means available or legal means are obscenely expensive. For example, in Canada to watch Game of THrones, you need HBO which comes in a package that is $100+",
    "controversiality": 0,
    "ups": 81,
    "downs": 0,
    "score": 81,
    "created": 1506074774.0,
    "date_created": "2017-09-21",
    "time_created": "22:06:14",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnc5hjc",
    "parent_id": "t1_dnc4xk7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 48,
    "downs": 0,
    "score": 48,
    "created": 1506074507.0,
    "date_created": "2017-09-21",
    "time_created": "22:01:47",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnc8qks",
    "parent_id": "t1_dnc4xk7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "anecdotal explanation: I hate scary movies, but I've heard everyone saying how great IT is. There's no chance I will ever pay for the movie because I'm 99% sure I'll hate it. But once it's easily available to stream online I might watch at least the first few minutes to see if I'll enjoy it",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1506078883.0,
    "date_created": "2017-09-21",
    "time_created": "23:14:43",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncd8yn",
    "parent_id": "t1_dncc21a",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is what the big movie industry has realized and many movies now have worldwide theater release dates. As an expat living abroad this is awesome, since I don't have to watch a shitty cam rip to stay in line with the recent trends ",
    "controversiality": 0,
    "ups": 90,
    "downs": 0,
    "score": 90,
    "created": 1506086071.0,
    "date_created": "2017-09-22",
    "time_created": "01:14:31",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnce52x",
    "parent_id": "t1_dncc21a",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "From what I can tell Australia gets fucked so hard with stuff like this.  ISP deals, game pricing, the lot.",
    "controversiality": 0,
    "ups": 74,
    "downs": 0,
    "score": 74,
    "created": 1506087911.0,
    "date_created": "2017-09-22",
    "time_created": "01:45:11",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncf08t",
    "parent_id": "t1_dncc21a",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "why only Australia? I am from Central Europe and I watch everything in English, just release it world wide, region locking is such a retarded concept in the age of the Internet. If you want to region lock something, region lock pricing. ",
    "controversiality": 0,
    "ups": 37,
    "downs": 0,
    "score": 37,
    "created": 1506089815.0,
    "date_created": "2017-09-22",
    "time_created": "02:16:55",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnce639",
    "parent_id": "t1_dncbs0x",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> \"tell that to the british navy!\"\n\nPirates don't attack navy. Any navy casualties is because the navy attack the pirates.\n\n\\#SelfDefense #NotPiratesFault",
    "controversiality": 0,
    "ups": 137,
    "downs": 0,
    "score": 137,
    "created": 1506087971.0,
    "date_created": "2017-09-22",
    "time_created": "01:46:11",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnceekq",
    "parent_id": "t1_dncbs0x",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Arr you disappointed? ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1506088481.0,
    "date_created": "2017-09-22",
    "time_created": "01:54:41",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncf6bi",
    "parent_id": "t1_dncbs0x",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "ARRR Maytees, aim low. We wouldn't wanna harm those sails.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1506090195.0,
    "date_created": "2017-09-22",
    "time_created": "02:23:15",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccgwc",
    "parent_id": "t1_dncbs0x",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Okay good, I thought I was the only one disappointed that actual pirates aren't in this story. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1506084574.0,
    "date_created": "2017-09-22",
    "time_created": "00:49:34",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnciggr",
    "parent_id": "t1_dnccqer",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Any EU research should be public. And the Commission isn't likely capable of judging the methods of the paper. It did not fit their agenda so they hid it. Why the Commission is against the people is a conundrum.",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1506098992.0,
    "date_created": "2017-09-22",
    "time_created": "04:49:52",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncj4tb",
    "parent_id": "t1_dnccqer",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's worse, they published a paper that selectively used the one section of the study that suggested piracy causes lost sales.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1506101059.0,
    "date_created": "2017-09-22",
    "time_created": "05:24:19",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncg030",
    "parent_id": "t1_dncderk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is the other issue - regional pricing. It's not just about saying hey the Google Play store/iTunes store/Netflix is now available in your country, they have to price it according to the local market. An HD copy of a digital movie in my 3rd world country costs 2 weeks salary! Crazy pricing! A pirated Blu-Ray is $1.80. No wonder I see so many Blu-Ray shops travelling out and about. To combat piracy you have to offer everything - no regional restrictions and you have to price according to that market. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1506092171.0,
    "date_created": "2017-09-22",
    "time_created": "02:56:11",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnckv1a",
    "parent_id": "t1_dncf4ag",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Well why don't you upload your film somewhere so I can pirate it to help you reach that milestone?",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1506105930.0,
    "date_created": "2017-09-22",
    "time_created": "06:45:30",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbler",
    "parent_id": "t1_dnc43g3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"possibly\" is from gizmodo's thesis, not the EU nor the report. That is a journalists opinion and has no basis on the actual report. The report concluded:\n\n>\"In general, the results do not show robust statistical evidence of displacement of sales by online copyright infringements. That does not necessarily mean that piracy has no effect but only that the statistical analysis does not prove with sufficient reliability that there is an effect.”\n\n>The report found that illegal downloads and streams can actually boost legal sales of games, according to the report. The only negative link the report found was with major blockbuster films:“The results show a displacement rate of 40 percent which means that for every ten recent top films watched illegally, four fewer films are consumed legally.”\n\nEDIT: I keep seeing a lot of people mention assumptions about the study but they don't seem to have read the study. You can find the study here:\n\nhttps://cdn.netzpolitik.org/wp-upload/2017/09/displacement_study.pdf",
    "controversiality": 0,
    "ups": 616,
    "downs": 0,
    "score": 616,
    "created": 1506083042.0,
    "date_created": "2017-09-22",
    "time_created": "00:24:02",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnc56ki",
    "parent_id": "t1_dnc43g3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The only way to prove them wrong is to share the report ",
    "controversiality": 0,
    "ups": 103,
    "downs": 0,
    "score": 103,
    "created": 1506074108.0,
    "date_created": "2017-09-21",
    "time_created": "21:55:08",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnca8bu",
    "parent_id": "t1_dnc43g3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I feel like 300 page studies would have a bit of evidence in them, its not a college study.",
    "controversiality": 0,
    "ups": 57,
    "downs": 0,
    "score": 57,
    "created": 1506080948.0,
    "date_created": "2017-09-21",
    "time_created": "23:49:08",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncdohm",
    "parent_id": "t1_dnccejd",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is the biggest point, the day demos died I stopped buying 75% of the games I was interested in, unless I could pirate them, and play a few hours to see if I enjoyed them. \n\nFew hours in I've hated most of the games I've been interested in lately, guess that's why there's no demo! ;)",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1506086939.0,
    "date_created": "2017-09-22",
    "time_created": "01:28:59",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncchbo",
    "parent_id": "t1_dnccejd",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And 2 hours refund limit on Steam is far too low. No Man's Sky being a great example ",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1506084595.0,
    "date_created": "2017-09-22",
    "time_created": "00:49:55",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncea3b",
    "parent_id": "t1_dnccejd",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Our game has a demo and it's being pirated to no end. I know because we have feedback widget in the game so people can give us a piece of their mind while playing. A lot of pirates do and they say they might buy it one day and sometimes even that they are buying it immediately, which suggests they use torrent as a demo. They usually have no idea about our free long demo on steam. Never even occured to them to look for the demo button. They see the screenshots and short description nad off they go to find pirated copy and demo the game. Not that we mind but we put effort into that demo. I guess we have to put demo on torrents, maybe people will notice it then.\n\nI mean pirating early access title that has a demo and is updated weekly is asking for bugs and inferior experience. I guess torrents are a default goto solution now, even if there is a demo on Steam. ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1506088212.0,
    "date_created": "2017-09-22",
    "time_created": "01:50:12",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbqlt",
    "parent_id": "t1_dnc5dl2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Ah I know his uncle, Barry Daesh",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1506083285.0,
    "date_created": "2017-09-22",
    "time_created": "00:28:05",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccn7a",
    "parent_id": "t1_dncb5sm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Being an expat this is my biggest reason of all to pirate. I miss home, and a big chunk of my homesickness is eased by media from home, only thing is I can't get the BBC iPlayer in the USA, nor can I get ITV or Channel 4, it really sucks.\n\nI can get the whole TV licence with the BBC but let me pay for an extended licence, or a foreign license and let me watch! \n\nIs it really that hard that they prefer to let us pirate doctor who and sherlock, QI and all the other joys. I just want my Saturday kitchen live back, and bake-off (I know they are gone...). ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506084904.0,
    "date_created": "2017-09-22",
    "time_created": "00:55:04",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncfy64",
    "parent_id": "t1_dncbzaf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "r/megalinks",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1506092041.0,
    "date_created": "2017-09-22",
    "time_created": "02:54:01",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnce11n",
    "parent_id": "t1_dncce0b",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> they even made singles, as in you could only play them once\n\nWait... Really?\nIf that is true, that is really interesting. Where can I learn more about the single?",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1506087667.0,
    "date_created": "2017-09-22",
    "time_created": "01:41:07",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncidc1",
    "parent_id": "t1_dncduyj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's definitely what it is. Copyright is a privilege given to content producers by the society but they (or the copyright owners) seem to want to abuse it by turning it into profits for investors.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1506098733.0,
    "date_created": "2017-09-22",
    "time_created": "04:45:33",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncc8cd",
    "parent_id": "t1_dncbi4f",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Fuck yes I would",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1506084143.0,
    "date_created": "2017-09-22",
    "time_created": "00:42:23",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncci01",
    "parent_id": "t1_dncc16k",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Avast captain, there's a ship at sea.\n\n\n*Blast 'em*\n\n",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1506084631.0,
    "date_created": "2017-09-22",
    "time_created": "00:50:31",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnciglu",
    "parent_id": "t1_dnchs8b",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I get that you're joking, but don't for a second think the UK government wouldn't suppress this exactly the same.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506099005.0,
    "date_created": "2017-09-22",
    "time_created": "04:50:05",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncfzhk",
    "parent_id": "t1_dncfl0b",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Why the fuck even show the movie then. ",
    "controversiality": 0,
    "ups": 1555,
    "downs": 0,
    "score": 1555,
    "created": 1506092130.0,
    "date_created": "2017-09-22",
    "time_created": "02:55:30",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncg9ne",
    "parent_id": "t1_dncfl0b",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I would love to see that cut of the movie",
    "controversiality": 0,
    "ups": 56,
    "downs": 0,
    "score": 56,
    "created": 1506092843.0,
    "date_created": "2017-09-22",
    "time_created": "03:07:23",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncioeb",
    "parent_id": "t1_dncfl0b",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Named \"Bruce Alrighty\"",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1506099674.0,
    "date_created": "2017-09-22",
    "time_created": "05:01:14",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncfs97",
    "parent_id": "t1_dnce3cz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "South East Asia ",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1506091633.0,
    "date_created": "2017-09-22",
    "time_created": "02:47:13",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncdpnr",
    "parent_id": "t1_dnccyhx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Steam, spotify, and netflix completely ended my torrenting as soon as I got a job.\n\nWhen you're a teenager with no job and you can't afford shit, you just steal because it's so easy. But $20 a month is completely worth it for Spotify and Netflix when you're an adult for the convenience and lack of viruses. \n\nOnce I'm not a grad student anymore maybe I'll even be able to afford my own HBO subscription ",
    "controversiality": 0,
    "ups": 3633,
    "downs": 0,
    "score": 3633,
    "created": 1506087004.0,
    "date_created": "2017-09-22",
    "time_created": "01:30:04",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncfr4y",
    "parent_id": "t1_dnccyhx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Speaking of DRM, this is a true story. Tried to play a blu ray on my laptop a couple years ago. After 15 minutes of frustration regarding playback and DRM issues, i finally torrented the movie instead. Shit got crazy for a while. No i won't buy windvd5 to watch a God damned movie i paid for",
    "controversiality": 0,
    "ups": 183,
    "downs": 0,
    "score": 183,
    "created": 1506091559.0,
    "date_created": "2017-09-22",
    "time_created": "02:45:59",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncem2s",
    "parent_id": "t1_dnccyhx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Unless god forbid you bought any of the Steam games that used GFWL that didn't get updated when they closed the service.  I get to pirate those if I ever want to play them again, even though I bought them.\n\nEdit: Fable 3 is the worst of them, not available on Steam anymore unless you already own it.  All the purchased DLC has to be downloaded from Microsoft's GFWL servers, which don't exist.  They didn't bother patching, they just flagged it not available and forgot it existed. ",
    "controversiality": 0,
    "ups": 55,
    "downs": 0,
    "score": 55,
    "created": 1506088937.0,
    "date_created": "2017-09-22",
    "time_created": "02:02:17",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncf1k4",
    "parent_id": "t1_dnccyhx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I would happily pay for the cowboy bebop music collection and as it spans like 5 albums, I'm sure it would cost a bit. However it simply does not exist in a legal, streaming/digital purchase service. So, I'll keep streaming it on YouTube in a form of piracy. Shit up and take my money ",
    "controversiality": 0,
    "ups": 45,
    "downs": 0,
    "score": 45,
    "created": 1506089896.0,
    "date_created": "2017-09-22",
    "time_created": "02:18:16",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncft1s",
    "parent_id": "t1_dnccyhx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I completely agree with this, the way to stop piracy is not to make piracy seem bad, it is to make paying for it affordable and more convenient then pirating.",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1506091689.0,
    "date_created": "2017-09-22",
    "time_created": "02:48:09",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncfwwn",
    "parent_id": "t1_dnccyhx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "i am stil paranoid about being reliant on the 'cloud' in general.\n\ni use steam, because i can buy games dirt cheap and it works offline, for a time. but i'd rather have my music on my hdd.\n",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1506091953.0,
    "date_created": "2017-09-22",
    "time_created": "02:52:33",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncf011",
    "parent_id": "t1_dnccyhx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Tbh it depends on how wealthy the country you're in is. If you're making 15 euros an hour, a 20 euro game is nearly nothing! But if you're making 1 euro an hour... you might save for it after a few weeks  because living expenses ",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1506089802.0,
    "date_created": "2017-09-22",
    "time_created": "02:16:42",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncf8aw",
    "parent_id": "t1_dnccyhx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Steam took a long time to get where they are now. Their system was a hot pile of garbage at first, but unlike other DRM providers, they went with transparency, and ease of use -- instead of doubling down on the root everything, always online approach (hello, well, virtually everyone else).",
    "controversiality": 0,
    "ups": 53,
    "downs": 0,
    "score": 53,
    "created": 1506090320.0,
    "date_created": "2017-09-22",
    "time_created": "02:25:20",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncfcz1",
    "parent_id": "t1_dnccyhx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is a valid point regarding delivery of games, and I agree wholly.  Now let's also bring software into the fold.  I got Corel Draw for Christmas one year as a pre-teen.  It was a gigantic box and surely wasn't cheap, and I loved the hell outta that program. Fast forward a few years, and photoshop was near a grand for a single disc?  Not saying I did or didn't, but I definitely one of those things'd it. ",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1506090620.0,
    "date_created": "2017-09-22",
    "time_created": "02:30:20",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncg4w1",
    "parent_id": "t1_dnccyhx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I often browse games on Steam, then torrent the ones I am interested in and give them a try, and if I like them I buy them. \n\nThis has saved me absurd amounts of money, jesus fuck there are a lot of bad games out there.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1506092507.0,
    "date_created": "2017-09-22",
    "time_created": "03:01:47",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncg92e",
    "parent_id": "t1_dnccyhx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Steam and Spotify are great as they hold the majority of content.\n\nThe problem is Tv Shows and Movies,  Netflix dont have the majority, theres Amazon, Hulu, HBO, Crunchyroll, Apple, Google and many local options per region.\nToo much splintering for that side of stuff so piracy is still pretty rampant, licensing needs to change to stop exclusivity.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506092803.0,
    "date_created": "2017-09-22",
    "time_created": "03:06:43",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncgpas",
    "parent_id": "t1_dncdkq4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">it's basically digital heroin\n\n1000+ hours in Stellaris.  Friend, you are not kidding.",
    "controversiality": 0,
    "ups": 55,
    "downs": 0,
    "score": 55,
    "created": 1506093968.0,
    "date_created": "2017-09-22",
    "time_created": "03:26:08",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncj7v1",
    "parent_id": "t1_dncdkq4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> it's basically digital heroin \n\nBro, for real.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1506101326.0,
    "date_created": "2017-09-22",
    "time_created": "05:28:46",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncgqnv",
    "parent_id": "t1_dnce4ie",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Demos stopped being made when devs found out it only helps sales when the game is good. If you make something mediocre, a demo is likely only to turn people away - and if a dev can choose to have people buy the game and endure some backlash, or spend money only to show people they don't want the game anyway, obviously they are going to choose the former.",
    "controversiality": 0,
    "ups": 294,
    "downs": 0,
    "score": 294,
    "created": 1506094069.0,
    "date_created": "2017-09-22",
    "time_created": "03:27:49",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncg5r0",
    "parent_id": "t1_dnce4ie",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is very similar to my take on the music industry. Their business model is all wrong for the digital age. In the early days of modern music, acts would tour and 45s were released to promote the artist so people would attend the performances. But the music industry saw the 45 as the product not the artist and began to push those and then 33 albums.\n\nBecause I used to pirate early mp3s on Morpheus and Limewire 20 years ago, I discovered bands I loved that I'd never discover other ways.... This was pre-youtube!  So I went to their gigs and bought their merchandise. You can't download an experience or a t-shirt! So for the loss of the cost of an album, they have gained 100s in concert fees and merchandising. Plus... Album sales because I want to support the artists.\n\nNow don't get me started on the film industry.......!",
    "controversiality": 0,
    "ups": 189,
    "downs": 0,
    "score": 189,
    "created": 1506092569.0,
    "date_created": "2017-09-22",
    "time_created": "03:02:49",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncgxt2",
    "parent_id": "t1_dnce4ie",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Nowadays you can purchase any game on Steam, and play for two hours before deciding if you want to get a refund with no questions asked. It's very useful for \"demoing\" the game if there isn't a demo already available.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1506094603.0,
    "date_created": "2017-09-22",
    "time_created": "03:36:43",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnch28y",
    "parent_id": "t1_dnce4ie",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Reality is that the big AAA publishers don't want to EARN sales with a good game.\n\nThey want to do huge marketing campaigns, sell the campaign not the game and push all the smaller and medium sized devs out of the industry that way. (they successfully killed most of the A-B publishers over the last 10 years).\n\nBig fish eating all the small fish in the pond.\n\nAAA publishers are no longer in the business of making games, the game is just a tool to make a marketing campaign around,  that's their business.\n\nGame being worth playing or not is not important to them, all that matters is how easy it is to market. (production values, graphics, showing off skinnerbox elements to entice the cookie clicker addicts).\n\nThey spend so much money that the game has to sell to recoup the marketing costs , good or bad. For that they have to control the message. Demos don't let them control the message, consumers can't find out their game is bad/not worth playing till after the pre order is shipped/day one sale is made.\n\nHence why you no longer get demos, why there's review embargos that don't expire till launch day, why they are so desperate to take ownership away (all the big publishers crowing about games as a service now and going full digital, goal being to end the second hand market as the second hand market devalues bad games quickly) .\n\nThey know that word of mouth sells good games, but they're not interested in that. AAA Publishers sell marketing not games.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1506094947.0,
    "date_created": "2017-09-22",
    "time_created": "03:42:27",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnce98i",
    "parent_id": "t1_dnccfvz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I've got 3 copies of Jedi Knight: Jedi Academy by now, and I didn't even pirate it in the first place.  I bought one physical copy back-in-the-day and I've ended up buying two more as part of Star Wars bundles (Humble and Steam) with various other games.  ",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1506088161.0,
    "date_created": "2017-09-22",
    "time_created": "01:49:21",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccoaz",
    "parent_id": "t1_dnccfyl",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I bought them when they were on sale",
    "controversiality": 0,
    "ups": 681,
    "downs": 0,
    "score": 681,
    "created": 1506084961.0,
    "date_created": "2017-09-22",
    "time_created": "00:56:01",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccnhf",
    "parent_id": "t1_dnccfyl",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 140,
    "downs": 0,
    "score": 140,
    "created": 1506084920.0,
    "date_created": "2017-09-22",
    "time_created": "00:55:20",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccptw",
    "parent_id": "t1_dnccfyl",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "He later bought them because he was no longer a poor kid.",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1506085042.0,
    "date_created": "2017-09-22",
    "time_created": "00:57:22",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncculc",
    "parent_id": "t1_dnccfyl",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You can also make shortcuts for pirated games in your steam library. In case you were wondering.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506085292.0,
    "date_created": "2017-09-22",
    "time_created": "01:01:32",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnchk1w",
    "parent_id": "t1_dncc6xj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Games being popular is the best advertising possible. Without piracy you might get 100 sales and that's that. With piracy, maybe you get 100 sales, 500 pirate copies, leading to a 600 strong userbase that draws in another 100 legit sales. It's a snowball effect. \n\nMany devs seem to think pirates are lost sales, but they are both advertising and future customers if they enjoy your game. There are millions of gamers, the goal should never be to capture them all, just make enough of them know about your game.",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1506096339.0,
    "date_created": "2017-09-22",
    "time_created": "04:05:39",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncda86",
    "parent_id": "t1_dncc6xj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Also they don't feel like they were screwed out of their money if the game was awful and then deciding to never buy something from that publisher again.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1506086143.0,
    "date_created": "2017-09-22",
    "time_created": "01:15:43",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncob9y",
    "parent_id": "t1_dnclobo",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I fucking hate that shit. It's not been out 10 years yet but whenever I see TLOZ: Spirit Tracks its almost 40 dollars! It came out in 2009! I just wanna drive a choo choo.",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1506112725.0,
    "date_created": "2017-09-22",
    "time_created": "08:38:45",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnck00b",
    "parent_id": "t1_dncjitm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "They dont have it. :(",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1506103673.0,
    "date_created": "2017-09-22",
    "time_created": "06:07:53",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnci11d",
    "parent_id": "t1_dncgq4d",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And I just want to play the old McGee's Alice.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1506097695.0,
    "date_created": "2017-09-22",
    "time_created": "04:28:15",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncnnum",
    "parent_id": "t1_dnckgvw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The nightmare that was trying to find a legal way to watch Evangelion for the first time ~~so I just ended up streaming it and all the movies~~. For such an iconic anime it's surprisingly difficult to find on hard copy outside of Japan.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1506111642.0,
    "date_created": "2017-09-22",
    "time_created": "08:20:42",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnc52ws",
    "parent_id": "t1_dnc4use",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Gizmodo is a known carcinogen, you're going to give your computer cancer.",
    "controversiality": 0,
    "ups": 406,
    "downs": 0,
    "score": 406,
    "created": 1506073974.0,
    "date_created": "2017-09-21",
    "time_created": "21:52:54",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncc3fu",
    "parent_id": "t1_dnc4use",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You wouldn't steal a car.",
    "controversiality": 0,
    "ups": 57,
    "downs": 0,
    "score": 57,
    "created": 1506083899.0,
    "date_created": "2017-09-22",
    "time_created": "00:38:19",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncc4x6",
    "parent_id": "t1_dnc4use",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1506083971.0,
    "date_created": "2017-09-22",
    "time_created": "00:39:31",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnch67j",
    "parent_id": "t1_dncedlp",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yes it's shocking to see that we aren't getting ripped off, especially when we're so used to paying so much more for all other tech goodies.",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1506095258.0,
    "date_created": "2017-09-22",
    "time_created": "03:47:38",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncib45",
    "parent_id": "t1_dncedlp",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Same in Costa Rica, where video games have a tax of 49% or some stupid crazy shit. Digital goods aren’t taxed though, so we can get games from Steam or PSN at US prices.\n\n(Of course they are looking how to tax those as we speak)",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1506098546.0,
    "date_created": "2017-09-22",
    "time_created": "04:42:26",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnced22",
    "parent_id": "t1_dncdv4q",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I was kinda furious to have 1/10 of the content for more money and no ability to watch house of cards on netflix just because I live in Hungary.Made me drop my subscription 2 months after Netflix came to Europe.I'd probably still have it if I got the same package but I wont pay a cent for a seriously cut down version.Netflix is very far from perfect.",
    "controversiality": 0,
    "ups": 171,
    "downs": 0,
    "score": 171,
    "created": 1506088391.0,
    "date_created": "2017-09-22",
    "time_created": "01:53:11",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbheo",
    "parent_id": "t1_dnc9wa2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "End of that article.\n\n\"When is Half Life 3 comong out?\"",
    "controversiality": 0,
    "ups": 692,
    "downs": 0,
    "score": 692,
    "created": 1506082859.0,
    "date_created": "2017-09-22",
    "time_created": "00:20:59",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccr23",
    "parent_id": "t1_dnc9wa2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Fucking Steam ... I went  from being a proud game pirate to spending almost 5000 euro's (since 2003) on steam games and then I did not play half of them as much as I should have ... \n\nIf there was ever a movie and tv show place that would have almost everything that would be the same. I like Netflix but now that it is hard to access USA netflix the content you get in Canada is just not good enough. So I still torrent a lot. ",
    "controversiality": 0,
    "ups": 187,
    "downs": 0,
    "score": 187,
    "created": 1506085110.0,
    "date_created": "2017-09-22",
    "time_created": "00:58:30",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccwcj",
    "parent_id": "t1_dnc9wa2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Actually I can't remember having pirated a game since I started using steam, so he's right.",
    "controversiality": 0,
    "ups": 199,
    "downs": 0,
    "score": 199,
    "created": 1506085387.0,
    "date_created": "2017-09-22",
    "time_created": "01:03:07",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncchu1",
    "parent_id": "t1_dncc6bq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I think they've blocked that now, but seriously, don't even get me started on how bullshit that is\n\nIt's such such shit that I can't watch stuff cause some stupid contract says that since I live in a certain country I can't cause some other stupid fucking company owns the rights but isn't making it available at all so it's just a waste of fucking time for everyone",
    "controversiality": 0,
    "ups": 90,
    "downs": 0,
    "score": 90,
    "created": 1506084622.0,
    "date_created": "2017-09-22",
    "time_created": "00:50:22",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncc81j",
    "parent_id": "t1_dnc9r05",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Same pretty much. I'll even go to your site if it's free to watch spam me with Hulu ads I can't disable or your own. As long as it's reasonable I will watch it. You put it behind a wall and I will watch it and you will get nothing it's your choice.",
    "controversiality": 0,
    "ups": 149,
    "downs": 0,
    "score": 149,
    "created": 1506084127.0,
    "date_created": "2017-09-22",
    "time_created": "00:42:07",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccaxy",
    "parent_id": "t1_dnc9r05",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I pay for Hulu, sling TV, Netflix, HBO now, & Amazon prime. If I have to pirate your bullshit, go fuck yourself. ",
    "controversiality": 0,
    "ups": 214,
    "downs": 0,
    "score": 214,
    "created": 1506084270.0,
    "date_created": "2017-09-22",
    "time_created": "00:44:30",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccdqi",
    "parent_id": "t1_dnc9r05",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "We had such a terrible experience with HBO NOW that honestly it would have been vastly more enjoyable just to torrent it.  Not only does it use flash, but the flash player is coded terribly, unstable, and when it isn't dropping frames or crashing, it's having HDCP handshaking issues that are causing any screen hooked up via HDMI to flash black randomly every few minutes.\n\nHow these big companies can screw up something that is already solved kind of blows my mind.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506084414.0,
    "date_created": "2017-09-22",
    "time_created": "00:46:54",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncdwnc",
    "parent_id": "t1_dnc9r05",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> You want my money, you put your content on Netflix.\n\nYou realize that Netflix might not want to pay what the show is worth right?",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1506087407.0,
    "date_created": "2017-09-22",
    "time_created": "01:36:47",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncd86n",
    "parent_id": "t1_dnccgln",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "But when recording from radio you had bad quality (and degrading with each copy) and often the announcer talked well into the song etc. So the companies didn't really care.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1506086028.0,
    "date_created": "2017-09-22",
    "time_created": "01:13:48",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnc52p0",
    "parent_id": "t1_dnc4wew",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is a huge part of it, especially for TV shows where they either don't air in your region or the barrier to access them is unreasonably high.\n\nI live in Canada and if I wanted to watch game of thrones it would cost me over $100 a month to access HBO. ",
    "controversiality": 0,
    "ups": 5319,
    "downs": 0,
    "score": 5319,
    "created": 1506073965.0,
    "date_created": "2017-09-21",
    "time_created": "21:52:45",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncb7ow",
    "parent_id": "t1_dnc4wew",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "See: Steam. Not pirated a game in years, unless it's entirely unavailable for purchase. ",
    "controversiality": 0,
    "ups": 482,
    "downs": 0,
    "score": 482,
    "created": 1506082421.0,
    "date_created": "2017-09-22",
    "time_created": "00:13:41",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnc8sxg",
    "parent_id": "t1_dnc4wew",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Seriously. They don't offer HBO streaming in my country so the only way I can legally watch game of thrones is paying 80 bucks a month for a cable subscription only to then have to pay more for HBO. Game of thrones isn't worth that much money. I want to give them my money and legally pay for it they just don't seem to want my money at all.",
    "controversiality": 0,
    "ups": 152,
    "downs": 0,
    "score": 152,
    "created": 1506078976.0,
    "date_created": "2017-09-21",
    "time_created": "23:16:16",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbyu7",
    "parent_id": "t1_dnc4wew",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yup. I haven't downloaded a single song since Spotify became available.\nPeople want more culture than they can afford. Provide an affordable platform and there is really no reason not to use it.",
    "controversiality": 0,
    "ups": 138,
    "downs": 0,
    "score": 138,
    "created": 1506083676.0,
    "date_created": "2017-09-22",
    "time_created": "00:34:36",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbgfj",
    "parent_id": "t1_dnc4wew",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I think it'll take another 30 years for any of the studios or cable channels to figure this shit out. I'm 30 now, I have a good job. I will pay for your shit if you **let** me. If I have to figure out *which* of your 4 different services I have to jump through hoops to sign up for, then fuck it. I can just pirate it in 10 minutes. Cable networks are by far the worst at this. Sorry, I don't have a \"cable provider,\" I want to just pay you to watch X thing. If you won't let me then hey, your loss. ",
    "controversiality": 0,
    "ups": 106,
    "downs": 0,
    "score": 106,
    "created": 1506082814.0,
    "date_created": "2017-09-22",
    "time_created": "00:20:14",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbbms",
    "parent_id": "t1_dnc4wew",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Netflix put a stop to my torrenting. I recently downloaded a few movies to prepare for a long flight but at home it's easier to flick on the TV than it is to find and download something. ",
    "controversiality": 0,
    "ups": 80,
    "downs": 0,
    "score": 80,
    "created": 1506082598.0,
    "date_created": "2017-09-22",
    "time_created": "00:16:38",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnc65l2",
    "parent_id": "t1_dnc4wew",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Right, like I haven't bought an assassin's creed game in years because Uplay is awful software (not to mention unsecured) and they put content behind further paywalls and exclusive purchasing locations. One full game minus the terrible platform, please.",
    "controversiality": 0,
    "ups": 90,
    "downs": 0,
    "score": 90,
    "created": 1506075400.0,
    "date_created": "2017-09-21",
    "time_created": "22:16:40",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncckte",
    "parent_id": "t1_dnc4wew",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Accessibility",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506084781.0,
    "date_created": "2017-09-22",
    "time_created": "00:53:01",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnc8yt3",
    "parent_id": "t1_dnc4wew",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yep. If I'm willing to spend an hour looking for a good torrent or stream, that usually means I wasn't gonna pay for it anyway. If I have money to spend and I really want to watch/read/play your game, and you make it easier to pay (a reasonable price) for it than to download it illegally, I'm probably gonna pay for it.\n\nThis is why I paid real money for Civ 5 with all the expansions, but I haven't paid for a Sims game since I was in high school. This is also why I broke down and bought a subscription to Starz, instead of waiting for torrents of Outlander, although it took me a season to decide that was worth it. ",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1506079203.0,
    "date_created": "2017-09-21",
    "time_created": "23:20:03",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbrn6",
    "parent_id": "t1_dnc584x",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'd buy DRM-free copies of movies if they were available. You give me a legal movie where I don't have to deal with streaming, limited device availability, storing in a rack I don't want to have to own and keep handy... Sure, I'm cool with that. I'd happily pay the DVD/bluray price for that. But that's not what we're offered.",
    "controversiality": 0,
    "ups": 74,
    "downs": 0,
    "score": 74,
    "created": 1506083331.0,
    "date_created": "2017-09-22",
    "time_created": "00:28:51",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnc680c",
    "parent_id": "t1_dnc584x",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Movies are way over priced. I'm not paying $15 for something I'm going to watch once then maybe once again 6 years later.\n\nEDIT: I was talking about DVDs/online purchase. Movie tickets here are only $6 with a student ID.",
    "controversiality": 0,
    "ups": 262,
    "downs": 0,
    "score": 262,
    "created": 1506075488.0,
    "date_created": "2017-09-21",
    "time_created": "22:18:08",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccm6v",
    "parent_id": "t1_dncbqzw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> I also pirated games just to make sure they ran on my computer because nobody does demos anymore and my computer's a fickle beast that doesn't seem to care about system requirements so I have to check whether the game actually runs on my computer. If it does, I buy it. If it doesn't, I didn't spend $20-60 on functionally nothing.\n\nSo, so much of this.\n\nI'd never spend money on any software if I couldn't test it first and make sure that it actually works.\n\nWould you buy a car without taking it on a test drive?",
    "controversiality": 0,
    "ups": 126,
    "downs": 0,
    "score": 126,
    "created": 1506084852.0,
    "date_created": "2017-09-22",
    "time_created": "00:54:12",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncck51",
    "parent_id": "t1_dncbqzw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Years ago I pirated minecraft, and what do you know, I ended up buying it after realizing it was pretty fun and not stupid like I'd previously thought.",
    "controversiality": 0,
    "ups": 223,
    "downs": 0,
    "score": 223,
    "created": 1506084745.0,
    "date_created": "2017-09-22",
    "time_created": "00:52:25",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncc030",
    "parent_id": "t1_dncbqzw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "If you don't already know, steam allows you to refund if you haven't played for over 2 hours and have had the game for more than 14 days. I used it to test if I could run Witcher 3. The response takes very little time to get you a full refund. :3",
    "controversiality": 0,
    "ups": 56,
    "downs": 0,
    "score": 56,
    "created": 1506083735.0,
    "date_created": "2017-09-22",
    "time_created": "00:35:35",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncc0fs",
    "parent_id": "t1_dncakca",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I pirated No Man's Sky at launch.\n\nI have yet to hear anyone criticize me for that.",
    "controversiality": 0,
    "ups": 137,
    "downs": 0,
    "score": 137,
    "created": 1506083753.0,
    "date_created": "2017-09-22",
    "time_created": "00:35:53",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbtne",
    "parent_id": "t1_dnc9qot",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Books too. Years ago [Eric Flint](https://en.wikipedia.org/wiki/Eric_Flint) had his publisher (Baen) put an old novel of his up on the company's website in a variety of ebook formats completely free of charge. The book's print sales surged dramatically, and the rest of his back catalog saw a reasonable uptick as well.",
    "controversiality": 0,
    "ups": 85,
    "downs": 0,
    "score": 85,
    "created": 1506083427.0,
    "date_created": "2017-09-22",
    "time_created": "00:30:27",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncoew7",
    "parent_id": "t1_dncnedc",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Sounds like Trademark infringement. That's too bad for your friend. But if a corporation with deep-pockets wants to kick your ass in court, they can do it.\n\nTo be honest, I don't have a ton of problems with trademark law. It isn't as readily abused as patent and copyright law, and the foundation of trademark law is different, and makes a lot of sense to me. But of course, it can still be abused by stronger parties.\n\nI've heard lots of stories like this. Companies know what they can get away with. It's part of their business strategy. One guest speaker came to talk about his ten year and still ongoing battle with MS over a stolen idea. He wasn't fighting because it was worth it, but for the principle. He knew that MS can take inventions with near impunity. Almost no one fights back, and those who do get crushed, or they just give up. Who wants to spend their whole life fighting that battle? But he didn't want to just let them get away with it. So the fight goes on.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1506112881.0,
    "date_created": "2017-09-22",
    "time_created": "08:41:21",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncjqyk",
    "parent_id": "t1_dncimqb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It never served it",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1506102937.0,
    "date_created": "2017-09-22",
    "time_created": "05:55:37",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccfn4",
    "parent_id": "t1_dnc5gla",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The difference between 0 and 0.01 is that I have to login and take extra steps to get what I want, and it's usually worse than the \"free\" version. I'm already putting in effort and money, why the fuck am I getting an inferior product?",
    "controversiality": 0,
    "ups": 504,
    "downs": 0,
    "score": 504,
    "created": 1506084512.0,
    "date_created": "2017-09-22",
    "time_created": "00:48:32",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccncn",
    "parent_id": "t1_dnc5gla",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I pirate Photoshop. If I couldn't, I would just use GIMP. If GIMP didn't exist, I would just use a shitty free filter app or not do anything at all. There's no scenario where I would ever pay for Photoshop. They have lost literally nothing as a result of my piracy. ",
    "controversiality": 0,
    "ups": 373,
    "downs": 0,
    "score": 373,
    "created": 1506084912.0,
    "date_created": "2017-09-22",
    "time_created": "00:55:12",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncawql",
    "parent_id": "t1_dnc5nmd",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah, I'm fairly confident a ton of shows like GoT would not have gained nearly the following it did if not for pirates, even if it was as fantastic in that case as it is now.",
    "controversiality": 0,
    "ups": 110,
    "downs": 0,
    "score": 110,
    "created": 1506081946.0,
    "date_created": "2017-09-22",
    "time_created": "00:05:46",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncclsh",
    "parent_id": "t1_dnc5oqx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I miss those demo games on Playstation. We need to bring that shit back.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1506084833.0,
    "date_created": "2017-09-22",
    "time_created": "00:53:53",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnceewz",
    "parent_id": "t1_dnce52x",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yep, an incredible majority of stuff is a lot more easily available in the US, even online. A good example of this is trying to watch Rick and morty on adult swims website, which we can't. Game pricing sucks because currency exchange rates and our internet sucks and everything wants to kill us.",
    "controversiality": 0,
    "ups": 54,
    "downs": 0,
    "score": 54,
    "created": 1506088502.0,
    "date_created": "2017-09-22",
    "time_created": "01:55:02",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncfsve",
    "parent_id": "t1_dnce639",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Hey, sails not sailors! I've seen those buggers use their knives to decrease their falling speed along sails so I say that this is fake news straight up. ",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1506091677.0,
    "date_created": "2017-09-22",
    "time_created": "02:47:57",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncjvch",
    "parent_id": "t1_dnce639",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I've watched that huge documentary, One Part or something. It pretty much agrees with your asseesment, most pirates just want to live and let live. The Navy keep trying to arrest them all the time. It's a sad world.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1506103296.0,
    "date_created": "2017-09-22",
    "time_created": "06:01:36",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncpjqk",
    "parent_id": "t1_dnckv1a",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's like your mom getting your cousin to take you to prom. \n\nThe milestone is in someone knowing it exists and wanting to hunt it down and get it.",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1506114576.0,
    "date_created": "2017-09-22",
    "time_created": "09:09:36",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncc1e1",
    "parent_id": "t1_dncbler",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Uh, 40% seems pretty significant.",
    "controversiality": 0,
    "ups": 214,
    "downs": 0,
    "score": 214,
    "created": 1506083799.0,
    "date_created": "2017-09-22",
    "time_created": "00:36:39",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbk6m",
    "parent_id": "t1_dnca8bu",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Don't assume research or a study is good just because it's got a lot of pages behind it.  There's been tons of shit research that's somehow made it through peer review.  Probably more than a few PhD dissertations as well.",
    "controversiality": 0,
    "ups": 102,
    "downs": 0,
    "score": 102,
    "created": 1506082988.0,
    "date_created": "2017-09-22",
    "time_created": "00:23:08",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncdhwg",
    "parent_id": "t1_dncchbo",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "THAT'S WHY WE DON'T PRE-ORDER",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1506086563.0,
    "date_created": "2017-09-22",
    "time_created": "01:22:43",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncevik",
    "parent_id": "t1_dncchbo",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1506089520.0,
    "date_created": "2017-09-22",
    "time_created": "02:12:00",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncedgj",
    "parent_id": "t1_dncea3b",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1506088416.0,
    "date_created": "2017-09-22",
    "time_created": "01:53:36",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncf39s",
    "parent_id": "t1_dncea3b",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Quick question. \n\nIf the demo is free. What stopped you from throwing your Demo onto torrent sites? Using P2P to distribute the demo?",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1506090006.0,
    "date_created": "2017-09-22",
    "time_created": "02:20:06",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnce4xy",
    "parent_id": "t1_dnce11n",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I've never heard this in my life ",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1506087903.0,
    "date_created": "2017-09-22",
    "time_created": "01:45:03",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnciiek",
    "parent_id": "t1_dnciglu",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Of course they'd suppress it, May hates the internet more than anything in the world.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1506099159.0,
    "date_created": "2017-09-22",
    "time_created": "04:52:39",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncg5bl",
    "parent_id": "t1_dncfzhk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "exactly. I am guessing they remove profanity too so we don't get this beautiful [scene](https://media.tenor.com/images/864ef3b3cf45bc131bf5179b94845087/tenor.gif). So we have a movie of a complicated married couple, where the husband also has problems with a bully at work. Down on his luck. Nothing happens, suddenly his luck changes, nothing happens again and he starts acting like a decent human being.End",
    "controversiality": 0,
    "ups": 810,
    "downs": 0,
    "score": 810,
    "created": 1506092539.0,
    "date_created": "2017-09-22",
    "time_created": "03:02:19",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncgkjb",
    "parent_id": "t1_dncfzhk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "As a regime, it's better for you to have people think they've seen it and it just sucks instead of thinking you won't let them see it at all.",
    "controversiality": 0,
    "ups": 151,
    "downs": 0,
    "score": 151,
    "created": 1506093625.0,
    "date_created": "2017-09-22",
    "time_created": "03:20:25",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncg9g0",
    "parent_id": "t1_dncfzhk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "God knows (lol)\n\nI also accidentally went to see both toy story and james bond in arabic when i was a kid. We clearly didn't do much research back in the day\n\nSpoiler: I don't speak arabic",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1506092829.0,
    "date_created": "2017-09-22",
    "time_created": "03:07:09",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncho9v",
    "parent_id": "t1_dncfzhk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "As always: the answer is money ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1506096668.0,
    "date_created": "2017-09-22",
    "time_created": "04:11:08",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncghv0",
    "parent_id": "t1_dncg9ne",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It was a long time ago now, but IIRC.... of course there was no morgan freeman in it. Essentially the entire storyline was removed. You'd get used to cinemas cutting out romantic scenes, so half of Jennifer Aniston's screentime was cut (rarely adds to the story anyway).\n\nI think it just sort of cut to him one day having powers and walking down the street doing weird shit as if he were some kind of magician or something. Then cut back to his partially explained relationship troubles. I'm not going to say it made any sense, but we didn't know anything about it before watching it, so didn't know what we'd missed.",
    "controversiality": 0,
    "ups": 83,
    "downs": 0,
    "score": 83,
    "created": 1506093432.0,
    "date_created": "2017-09-22",
    "time_created": "03:17:12",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnchkno",
    "parent_id": "t1_dncfs97",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Shit man, I thought that was like the land of the free and the home of the depraved. Perhaps that's just the nature of the tourists who visit you.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1506096385.0,
    "date_created": "2017-09-22",
    "time_created": "04:06:25",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnceq0p",
    "parent_id": "t1_dncdpnr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I got Netflix because it advertised it had certain shows and season whatever. Since I live in the Netherlands, a lot of those shows are not available and we're behind about three seasons on everything.",
    "controversiality": 0,
    "ups": 1014,
    "downs": 0,
    "score": 1014,
    "created": 1506089183.0,
    "date_created": "2017-09-22",
    "time_created": "02:06:23",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncfhr2",
    "parent_id": "t1_dncdpnr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">you just steal because it's so easy\n\nOr you \"steal\" because its not available anywhere in your own country. HBO for GoT is only available to one tv provider here and ill go to hell first before i change to Ziggo and its \"horrible\" (for american standards maybe not so horrible since you got comcast and whatnot) internet and services. Anime is nowhere to be found legally since nobody here has a license for it. \n\nSo yeah theres that.. not just because \"its easy\"",
    "controversiality": 0,
    "ups": 245,
    "downs": 0,
    "score": 245,
    "created": 1506090933.0,
    "date_created": "2017-09-22",
    "time_created": "02:35:33",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnceipq",
    "parent_id": "t1_dncdpnr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Spotify is a godsend, I remember during my middle school and high school years I'd spend hours trying to find mp3 files of songs to add to my device, and if I found another song I liked, I had to do the same routine of finding the proper quality file to add. Once I discovered Spotify, I instantly deleted all the mp3 files and bought a premium subscription for it, I love Spotify too much to go back to the dark times.",
    "controversiality": 0,
    "ups": 254,
    "downs": 0,
    "score": 254,
    "created": 1506088732.0,
    "date_created": "2017-09-22",
    "time_created": "01:58:52",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncea7l",
    "parent_id": "t1_dncdpnr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Use your student edu email for 5$ spotify/hulu package- you get both  for 5$ together. I also think ~~hulu~~ HBO is much cheaper as a student!\n\nEdit: Corrected typo. Hulu was meant to be HBO.",
    "controversiality": 0,
    "ups": 303,
    "downs": 0,
    "score": 303,
    "created": 1506088219.0,
    "date_created": "2017-09-22",
    "time_created": "01:50:19",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncfwtp",
    "parent_id": "t1_dncdpnr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Getting addicted to tv, movies, and games as a teen pirating is in fact like a little trial period that had now got you continually buying them. In a sense, piracy made you a good customer.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506091948.0,
    "date_created": "2017-09-22",
    "time_created": "02:52:28",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncla43",
    "parent_id": "t1_dncfr4y",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It is fucking stupid. Most of the big studios use what's called BD-J where they shit some Java layer on to the disc so they can stream you trailers using your internet connection for movies you don't want to see. It has the added bonus of making the mouse unusable in menus and the disc incapable of remembering where it was last played(SO SO SO annoying for TV shows) unless they explicitly program it which almost none do IME. Two things ANY DVD can do on PC. It's retarded I get a worse user experience with a Blu-ray from 2017 than a DVD from 1997.\n\nOh and you can't screenshot Blu-rays. Cause you know I'm going to pirate the movie frame by frame with no audio...",
    "controversiality": 0,
    "ups": 63,
    "downs": 0,
    "score": 63,
    "created": 1506106942.0,
    "date_created": "2017-09-22",
    "time_created": "07:02:22",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnckyqh",
    "parent_id": "t1_dncfr4y",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "We have shelves full of DVDs (some of them unopened) that we refer to as \"talismans of legality\". It's a much better user experience to download a DRM-free copy than to watch the actual DVD.",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1506106186.0,
    "date_created": "2017-09-22",
    "time_created": "06:49:46",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnclnis",
    "parent_id": "t1_dncfr4y",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is why my optical drive is still a DVD drive and why I own zero Blu-rays.  The technology behind Blu-ray is fundamentally good, but they crippled it with all of the DRM bullshit.  When it comes down to it, I refuse to pay money for a product that doesn't work.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1506107784.0,
    "date_created": "2017-09-22",
    "time_created": "07:16:24",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncj99o",
    "parent_id": "t1_dncfr4y",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I finally figured out enough of the rigamarole to get Blu Ray working with VLC, bit even then you have to blindly isolate video and audio and subtitle components. Come on, open source solution...",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1506101446.0,
    "date_created": "2017-09-22",
    "time_created": "05:30:46",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncj6qh",
    "parent_id": "t1_dncfr4y",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I really can't remember what it is off the top of my head, but I found a free blu ray player somewhere. They are our there. But lack of blu ray support on PC after I bought a desktop blu ray player to watch all the hobbits made me rage quit for a moment.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1506101225.0,
    "date_created": "2017-09-22",
    "time_created": "05:27:05",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnchytq",
    "parent_id": "t1_dncem2s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I don't remember what game i got on Steam but i had to go download GFWL or else the game would crash, then i had to go download a program that disabled GFWL because it made the game crash since there wasn't any service\n\ni don't think i ever had a good experience with Games for Windows Live",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1506097512.0,
    "date_created": "2017-09-22",
    "time_created": "04:25:12",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnchrlu",
    "parent_id": "t1_dncem2s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I feel you.I own a CIV4 complete edition.After a format I couldnt reinstall the game because a Windows update disabled a feature needed for the installation.\n\nTried some workarounds found online but nothing seem to work,so I torrented the same game and installed it with no problems",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1506096928.0,
    "date_created": "2017-09-22",
    "time_created": "04:15:28",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnclcx2",
    "parent_id": "t1_dncf1k4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">Shit up and take my money\n\nI tried shitting up but it fell right back down",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1506107129.0,
    "date_created": "2017-09-22",
    "time_created": "07:05:29",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncfnof",
    "parent_id": "t1_dncf011",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's another thing Gabe Newell realized early on. He started having variable game prices in poorer countries, realizing that it was much harder for them to afford them at the same price as the US.\n\nPeople often get really angry at this, and cheer sites like G2A that basically buys from cheaper locations and resells them to the rest of the world, but they often don't realize how much harder it is for people in those countries with their income to afford the same games.",
    "controversiality": 0,
    "ups": 56,
    "downs": 0,
    "score": 56,
    "created": 1506091324.0,
    "date_created": "2017-09-22",
    "time_created": "02:42:04",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncm9lm",
    "parent_id": "t1_dncf8aw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "GOG is incredible in this regard. Gog adds no DRM (offline alaways available), and do great curation. Also they are owned by the Witcher guys.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1506109071.0,
    "date_created": "2017-09-22",
    "time_created": "07:37:51",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnchd97",
    "parent_id": "t1_dncgqnv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah, there are definitely a few games I would not have bought if I'd played a free demo first.",
    "controversiality": 0,
    "ups": 64,
    "downs": 0,
    "score": 64,
    "created": 1506095810.0,
    "date_created": "2017-09-22",
    "time_created": "03:56:50",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnckjjn",
    "parent_id": "t1_dncgqnv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "But now there are 1000s of YT channels that review games, so Demo should come back!",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1506105124.0,
    "date_created": "2017-09-22",
    "time_created": "06:32:04",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncgihb",
    "parent_id": "t1_dncg5r0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Dave Matthews Band openly encouraged bootlegging of their concerts (as long as the recordings were shared), and I seem to recall them being pretty blase with Napster back in the day.  DMB ended up being the highest earning musical group for several years running, because of concerts and merchandise.",
    "controversiality": 0,
    "ups": 58,
    "downs": 0,
    "score": 58,
    "created": 1506093477.0,
    "date_created": "2017-09-22",
    "time_created": "03:17:57",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncjfzm",
    "parent_id": "t1_dncg5r0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's a complicated mixed bag.\n\nMost musical acts are a loss for the record companies, once you account for the costs of production and promotion(whether that be with music videos or plain old advertising).\n\nThe ones that they do make money on are used to finance the new acts, and hopefully a handful of those will turn into succesful acts to finance the next wave of new acts and whatnot.\n\nThe situation where that is not necessary is when they can take a more or less \"guarranteed\" act: one that already has a significant local following and has self-promoted and created a real following.\n\nThis is certainly changing, and some artists are eschewing the need for a record company, recording by themselves and promoting through social media and word of mouth. But lets be real: the vast majority of succesful acts still come through the \"old ways\".\n\nThe \"new way\" with digital distro has apple and google taking a huge cut for doing nearly nothing. Or with platforms like spotify it pays the artists pennies. It's great for consumers because it's super cheap but it really does not help to actually finance the signing on of new artists.\n\nI'm not saying the old ways are good or the new ways are bad, I just think that this is all a bit more nuanced than what we consumers see on the surface.\n\nConsider this: say before that you had a thousand music fans that used to spend from 10-200 a month on music(say $30,000). And now they all just sub to spotify($10,000), that's three times less money  going into the industry. Then the question becomes of where that money goes.\n\nWith spotify it goes towards dev costs, server costs, profits, and licensing costs(which are ultimately handed off to the record companies or artists). With old media it gets diced off to retail stores, distributors, physical media production costs, with the remnants going to the record company or artists.\n\nI'd contend that new media probably has a higher ratio of the consumer spent money going to artists, but it has a lower lump sum that reaches them.  It's more \"efficient\" but it also has less money reaching the recording industry so fewer loss leaders on which to finance new acts, and thus an increased need for independence and \"self-production\" from acts to make it big. That could be a good or bad thing. But it's certainly not as simple as \"digital age good, old age bad\". Though for the consumers, at least as far as the cost of music it is good. But the quality/variety may suffer, and it may be bad for musicians who have little leverage.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1506102008.0,
    "date_created": "2017-09-22",
    "time_created": "05:40:08",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncd69t",
    "parent_id": "t1_dnccoaz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Pirate the $60 game today and for a small fee of $2.50 clear your conscience 5 years later.",
    "controversiality": 0,
    "ups": 589,
    "downs": 0,
    "score": 589,
    "created": 1506085922.0,
    "date_created": "2017-09-22",
    "time_created": "01:12:02",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncczpv",
    "parent_id": "t1_dnccnhf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And now has no time to play them. Cest la vie ",
    "controversiality": 0,
    "ups": 167,
    "downs": 0,
    "score": 167,
    "created": 1506085568.0,
    "date_created": "2017-09-22",
    "time_created": "01:06:08",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccx8j",
    "parent_id": "t1_dnccptw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "He bought them in the future after having previously torrented them so that the developers can get the profit.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506085434.0,
    "date_created": "2017-09-22",
    "time_created": "01:03:54",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnclhoo",
    "parent_id": "t1_dnchk1w",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Never would've bought Mount & Blade: Warband had I not been able to pirate it first.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1506107431.0,
    "date_created": "2017-09-22",
    "time_created": "07:10:31",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncxv6x",
    "parent_id": "t1_dncob9y",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "this is most likely because it has a demand that heavily outweighs the supply. this is the case with most older games because they're out of production. you have to go out and find a copy to purchase first, which means that the price will be higher because of it's scarcity. if you could run into walmart and find a bunch in packages they'd probably be like 10$ but that will never happen again ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1506124151.0,
    "date_created": "2017-09-22",
    "time_created": "11:49:11",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncoqpk",
    "parent_id": "t1_dnck00b",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "There are also sites where you can find [abandonware](https://www.myabandonware.com/). Found Jazz Jackrabbit over there. GOG sometimes adopts some abandonware and puts it in everyone's library.\n\n> some things are hard to find legally\n\nGOG is trying to fight this exact thing. Or at least, that's what it does as a side effect of providing downloads for old lost games. I remember reading an article about having a team that sometimes finds that one leftover copy of a lost game in some collector's basement and then trying to find the right's holder so that it's legitly published.",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1506113399.0,
    "date_created": "2017-09-22",
    "time_created": "08:49:59",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnc5xk3",
    "parent_id": "t1_dnc52ws",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Mine already got cancer from all of the League of Legends I used to play. Currently in remission. ",
    "controversiality": 0,
    "ups": 197,
    "downs": 0,
    "score": 197,
    "created": 1506075103.0,
    "date_created": "2017-09-21",
    "time_created": "22:11:43",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnce0rd",
    "parent_id": "t1_dncc3fu",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You wouldn't shoot a policeman, and then steal his helmet.\n\nYou wouldn't go to the toilet in his helmet. And then send it to the policeman's grieving widow. And then steal it again!",
    "controversiality": 0,
    "ups": 127,
    "downs": 0,
    "score": 127,
    "created": 1506087650.0,
    "date_created": "2017-09-22",
    "time_created": "01:40:50",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncftyv",
    "parent_id": "t1_dncc4x6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Be careful, they may have a patent on that.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1506091753.0,
    "date_created": "2017-09-22",
    "time_created": "02:49:13",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncg3eg",
    "parent_id": "t1_dnced22",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's the same with every service here. I used to pay for Crunchyroll (anime streaming) but their catalog had about 1/3 of the content of the US catalog and playback on the site sucked (no EU CDN or just a shitty one?). Now I just pirate. If a company decides that the market in my region is not worth developing or whatever, then they don't get my money, simple as that.\n\nSteam, on the other hand is great and I haven't pirated a game in years.",
    "controversiality": 0,
    "ups": 90,
    "downs": 0,
    "score": 90,
    "created": 1506092399.0,
    "date_created": "2017-09-22",
    "time_created": "02:59:59",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbr39",
    "parent_id": "t1_dncbheo",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "How times have changed",
    "controversiality": 0,
    "ups": 344,
    "downs": 0,
    "score": 344,
    "created": 1506083306.0,
    "date_created": "2017-09-22",
    "time_created": "00:28:26",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncfudj",
    "parent_id": "t1_dnccr23",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Imagine Steam but for movies and with sales, same as for the games, and also bonuses and soundtracks to movies, same as disc versions.",
    "controversiality": 0,
    "ups": 66,
    "downs": 0,
    "score": 66,
    "created": 1506091781.0,
    "date_created": "2017-09-22",
    "time_created": "02:49:41",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncfv5v",
    "parent_id": "t1_dnccr23",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I haven't pirated a video game in about a decade. Music for about half that.   \nMy piracy of movies and TV shows has gone down somewhat with Netflix and other similar services, but they're still not quite there for me to completely stop. \nThey just need to catch up with the times and adjust their business models. Subscription might not even be the best option...   \nBut that's also the difference between paying for 10-100 hours of entertainment from a video game vs 2 hours from a single movie.   \nAt the end of the day, pretty much all forms of entertainment compete for the same disposable income and free time.  ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1506091835.0,
    "date_created": "2017-09-22",
    "time_created": "02:50:35",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncib9p",
    "parent_id": "t1_dnccr23",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I've found that Canada's Netflix library is slowly getting better now that Shomi shut down. Now if only Netflix would expand it's original series collection to include more SciFi and fantasy. I nearly cried when I found out they cancelled Sense8.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1506098561.0,
    "date_created": "2017-09-22",
    "time_created": "04:42:41",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncil24",
    "parent_id": "t1_dnccr23",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Steam is the opposite of piracy. Instead of not paying for the games you play, you pay for the games you'll never play :D",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1506099388.0,
    "date_created": "2017-09-22",
    "time_created": "04:56:28",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncd3r4",
    "parent_id": "t1_dnccwcj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Movies on the other hand...",
    "controversiality": 0,
    "ups": 81,
    "downs": 0,
    "score": 81,
    "created": 1506085786.0,
    "date_created": "2017-09-22",
    "time_created": "01:09:46",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncgs80",
    "parent_id": "t1_dncchu1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Just to be 100% clear: This wasn't Netflix faults, a bunch of networks got their panties in a bunch when their monopoly was being bypassed so they threatened to sue Netflix if they did not try to stop proxy users.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1506094187.0,
    "date_created": "2017-09-22",
    "time_created": "03:29:47",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncd2jk",
    "parent_id": "t1_dncchu1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's not completely blocked /r/netflixbyproxy",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1506085716.0,
    "date_created": "2017-09-22",
    "time_created": "01:08:36",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccld4",
    "parent_id": "t1_dnccaxy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah that's already too much.  Stop before they think everyone is like you. ",
    "controversiality": 0,
    "ups": 345,
    "downs": 0,
    "score": 345,
    "created": 1506084810.0,
    "date_created": "2017-09-22",
    "time_created": "00:53:30",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncdmub",
    "parent_id": "t1_dnccaxy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Jesus, what does that cost? Also, not all of us are in the US.",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1506086845.0,
    "date_created": "2017-09-22",
    "time_created": "01:27:25",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncctr1",
    "parent_id": "t1_dnccaxy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1506085248.0,
    "date_created": "2017-09-22",
    "time_created": "01:00:48",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncckp4",
    "parent_id": "t1_dnccdqi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The same way video game publishers keep fucking it up.  \"Surely they'll want to use *our* shitty platform, and not the one they already use that has the majority of their content!\"",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1506084774.0,
    "date_created": "2017-09-22",
    "time_created": "00:52:54",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnc5oov",
    "parent_id": "t1_dnc52p0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "literally watched all of true blood on a free movies website because i wouldn't want to pay so much money to HBO to watch it",
    "controversiality": 0,
    "ups": 1637,
    "downs": 0,
    "score": 1637,
    "created": 1506074772.0,
    "date_created": "2017-09-21",
    "time_created": "22:06:12",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbwxo",
    "parent_id": "t1_dnc52p0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's such a hassle just to figure out where you can watch a certain TV show in my country that it's way easier to just torrent it. I have a Netflix subscription + a legal password to stream \"on demand\" shows from most channels because my family has a very good cable plan. I used to use a Netflix proxy to watch content from the US but they banned the free ones and now the catalog is very poor.\n\nThere's \"Fox Play\" where I can stream some of the shows. Black Sails is on there. Fox Play also has most FX shows, but not IASIP.\n\nCuriously they also have Vikings. Even if there is \"Seu History\", a History Channel website where you can stream most of their other shows.\n\nThen there's another site called \"Globosat Play\" that has Elementary. Suits is on Netflix, but not the latest season. I don't know if it's possible to watch that in my country. \n\nThey all share the same login/password from the cable provider (except Netflix), but the interfaces are all different, some of them are terrible. Sometimes they work, sometimes they don't. Even HBO Go works through this system here. \n\n\n",
    "controversiality": 0,
    "ups": 51,
    "downs": 0,
    "score": 51,
    "created": 1506083584.0,
    "date_created": "2017-09-22",
    "time_created": "00:33:04",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbqnj",
    "parent_id": "t1_dnc52p0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "HBO sold Game of Thrones to Rupert Murdoch's cable-TV-monopoly 'Foxtel' in Australia, which means that you need a satellite dish on your roof, so can't even watch it as a renter, and also need to be reasonably rich to access that crazy expensive monopoly priced luxury.\n\nIf you're a renter, which I am, or just low income, they've intentionally picked a distribution outlet where it's impossible for you to be a customer, so it's not a lost sale if you pirate, they've intentionally picked that option to make more money from the more limited by wealthier static homeowners class.",
    "controversiality": 0,
    "ups": 385,
    "downs": 0,
    "score": 385,
    "created": 1506083286.0,
    "date_created": "2017-09-22",
    "time_created": "00:28:06",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncblun",
    "parent_id": "t1_dnc52p0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I pay about $40/yr for my VPN, which comes with other benefits, but the primary reason was to watch Game of Thrones. That $40 could be HBO's, but it isn't.",
    "controversiality": 0,
    "ups": 111,
    "downs": 0,
    "score": 111,
    "created": 1506083062.0,
    "date_created": "2017-09-22",
    "time_created": "00:24:22",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbov9",
    "parent_id": "t1_dnc52p0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Why is TV so expensive in Canada?",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1506083202.0,
    "date_created": "2017-09-22",
    "time_created": "00:26:42",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbw9j",
    "parent_id": "t1_dnc52p0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And I live in the united states. And sure as Boots and the Ginger fucked an ostrich, you can bet I torrented Letterkenny.\n\n... Fuckin' Crave TV only taking Canadian money.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1506083551.0,
    "date_created": "2017-09-22",
    "time_created": "00:32:31",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncc62v",
    "parent_id": "t1_dncb7ow",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Steam's Gabe Newell on piracy in 2011:\n\n> \"We think there is a fundamental misconception about piracy. Piracy is almost always a service problem and not a pricing problem,\" he said. \"If a pirate offers a product anywhere in the world, 24 x 7, purchasable from the convenience of your personal computer, and the legal provider says the product is region-locked, will come to your country 3 months after the US release, and can only be purchased at a brick and mortar store, then the pirate's service is more valuable.\"\n\n\n> The proof is in the proverbial pudding. \"Prior to entering the Russian market, we were told that Russia was a waste of time because everyone would pirate our products. Russia is now about to become [Steam's] largest market in Europe,\" Newell said.\n\n[Source article](http://www.escapistmagazine.com/news/view/114391-Valves-Gabe-Newell-Says-Piracy-Is-a-Service-Problem)",
    "controversiality": 0,
    "ups": 955,
    "downs": 0,
    "score": 955,
    "created": 1506084030.0,
    "date_created": "2017-09-22",
    "time_created": "00:40:30",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccasl",
    "parent_id": "t1_dncb7ow",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Exactly this.\n\nIn my country, Need for speed Most wanted was at a 120 usd price tag st a game stop. On origin, it was a \"it's on the house game\" (or whatever it's called in English).\n\nBefore digital stores, games were a luxury item, so pirating was a common practice. Now it's ridiculous, since it's affordable.\n\n(Ps: cheers to GOG for their regional pricing, my salary loves you guys)",
    "controversiality": 0,
    "ups": 112,
    "downs": 0,
    "score": 112,
    "created": 1506084264.0,
    "date_created": "2017-09-22",
    "time_created": "00:44:24",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncc7be",
    "parent_id": "t1_dncb7ow",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I generally pirate a game before buying simply to try it as steam has denied multiple refund requests. So no more $60+ games for me without a demo or pirate. I prefer demo it's legal but so few demos these days.",
    "controversiality": 0,
    "ups": 134,
    "downs": 0,
    "score": 134,
    "created": 1506084090.0,
    "date_created": "2017-09-22",
    "time_created": "00:41:30",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncct2k",
    "parent_id": "t1_dnc8sxg",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I live in Europe and one thing I absolutely hate is when I come across a TV show I really want to watch that there is no way to watch legally, except to import Blu-ray's which honestly is too expensive. Some recent examples of this happening to me is Agents of Shield and Star wars Rebels. \n\nYour last sentence sums it pretty good, I want to pay for this stuff, I really do. But there's is no way to do so.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1506085213.0,
    "date_created": "2017-09-22",
    "time_created": "01:00:13",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncb028",
    "parent_id": "t1_dnc8sxg",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Well actually... They want \"80 a month plus more for HBO\" of your money...",
    "controversiality": 0,
    "ups": 58,
    "downs": 0,
    "score": 58,
    "created": 1506082092.0,
    "date_created": "2017-09-22",
    "time_created": "00:08:12",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncdup8",
    "parent_id": "t1_dnc8sxg",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Im also not willing to pay something like €5 euros an episode on itunes either. Nope. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1506087290.0,
    "date_created": "2017-09-22",
    "time_created": "01:34:50",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncclhh",
    "parent_id": "t1_dncbyu7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm in the same boat. I used to have hundreds of gigabytes of music - somewhere in the ballpark of 60,000 songs, the overwhelming majority of which was pirated. Then Spotify came around, I ditched most of the pirated songs, and still do I rarely download. Spotify's student discount makes it even better now that I only pay a few bucks a month, too.",
    "controversiality": 0,
    "ups": 57,
    "downs": 0,
    "score": 57,
    "created": 1506084817.0,
    "date_created": "2017-09-22",
    "time_created": "00:53:37",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncc9k2",
    "parent_id": "t1_dncbgfj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Also without a dvr or online Stream service (which often cost extra) your additionally restricted to *when* you watch it, which is my biggest complaint ",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1506084201.0,
    "date_created": "2017-09-22",
    "time_created": "00:43:21",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncco15",
    "parent_id": "t1_dncbgfj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Hbo has already I figured it out in northern Europe. We have HBO's version of Netföix., HBO Nordic. Ten bucks a month, tons of shows and movies. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1506084948.0,
    "date_created": "2017-09-22",
    "time_created": "00:55:48",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncc5xe",
    "parent_id": "t1_dncbbms",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That may change soon.  More and more studios are opening their \"me too\" streaming service and walling their content behind their own paywall.  Star Trek Discovery and S3 of Young Justice are going to get the shit pirated out of them because I just don't see people signing up for a proprietary service for just 1 show.  \n\nThis latest spasm of idiocy from the major content publishers is going nowhere.",
    "controversiality": 0,
    "ups": 210,
    "downs": 0,
    "score": 210,
    "created": 1506084023.0,
    "date_created": "2017-09-22",
    "time_created": "00:40:23",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncc2xt",
    "parent_id": "t1_dncbrn6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "MakeMKV is a thing.  My entire movie collection is packed away in storage.  Every DVD and BluRay I own now resides on my 20TB media server.",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1506083875.0,
    "date_created": "2017-09-22",
    "time_created": "00:37:55",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbe4u",
    "parent_id": "t1_dnc680c",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "There are plenty of sites where you can rent HD movies for about five bucks. Amazon, Google, iTunes, Vudu.",
    "controversiality": 0,
    "ups": 57,
    "downs": 0,
    "score": 57,
    "created": 1506082708.0,
    "date_created": "2017-09-22",
    "time_created": "00:18:28",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncburb",
    "parent_id": "t1_dnc680c",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Here it's like $18. If I take my girlfriend to the movies that's like $50+ easily (popcorn is nonoptional). So I can hold it in for three and a half hours in a seat that's less comfortable than my couch watching a movie that's too loud in a theater that's too cold on a screen that's...okay, yeah the screens are pretty great. But yeah, there are some movies I think are worth going to see in the theaters (Star Wars, for example) but if it's not going to make full use of the hi-fi surround sound and the giant screen, then why not just watch it at home on my own schedule?\n\n",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1506083480.0,
    "date_created": "2017-09-22",
    "time_created": "00:31:20",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncf911",
    "parent_id": "t1_dnccm6v",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">Would you buy a car without taking it on a test drive?\n\nNot if I could just download it instead",
    "controversiality": 0,
    "ups": 72,
    "downs": 0,
    "score": 72,
    "created": 1506090366.0,
    "date_created": "2017-09-22",
    "time_created": "02:26:06",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncdmwv",
    "parent_id": "t1_dncck51",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's why FULL free trials should be an industry standard. It's like trying on a pair of pants before you buy them, vs just looking at a grainy photograph to decide.",
    "controversiality": 0,
    "ups": 98,
    "downs": 0,
    "score": 98,
    "created": 1506086849.0,
    "date_created": "2017-09-22",
    "time_created": "01:27:29",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccanc",
    "parent_id": "t1_dncc030",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "2 hours may not be enough time to put it through its paces. Some games, you'll spend that much time just figuring out *how* to play!",
    "controversiality": 0,
    "ups": 54,
    "downs": 0,
    "score": 54,
    "created": 1506084257.0,
    "date_created": "2017-09-22",
    "time_created": "00:44:17",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncchql",
    "parent_id": "t1_dncc0fs",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "They hyped it up so much and pretty much lied to people about it. Fuck 'em if they can't be honest. I think they'd be forgiven by a good number of people if they just came out and said that a lot of the features just weren't ready in time and they're still working hard to fulfill them and they bit off more than they could chew. Honesty goes a long way with people who give a fuck.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1506084617.0,
    "date_created": "2017-09-22",
    "time_created": "00:50:17",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncce71",
    "parent_id": "t1_dncbtne",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I've discovered quite a few authors I enjoy through the Baen free library.  I'm glad to read it's as useful as it seems.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1506084438.0,
    "date_created": "2017-09-22",
    "time_created": "00:47:18",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccyrt",
    "parent_id": "t1_dncbtne",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "There are many articles like this?\n\nI swear I read one where some rock and roll group let all their music slip out free in key demographics before announcing a world tour...going to exactly those places...and experiencing a huge uptick in ticket sales.\n\nBut listen if you pirate stuff you're basically hitler.\n\nOr whatever slogan the music industry uses these days.\n\n\nEdit: spelling.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1506085516.0,
    "date_created": "2017-09-22",
    "time_created": "01:05:16",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncddsj",
    "parent_id": "t1_dnccfn4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "DRM and Launcher Platforms like Origin, ugh.",
    "controversiality": 0,
    "ups": 138,
    "downs": 0,
    "score": 138,
    "created": 1506086333.0,
    "date_created": "2017-09-22",
    "time_created": "01:18:53",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncddpm",
    "parent_id": "t1_dnccncn",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And in fact, they gain from it!\n\nBecause of Photoshop pirates like you and I, there's a robust community of people that can be drawn on for help with photoshop.\n\nPlus, there's a scenario that I figure is common. A person pirates photoshop, gets good at it, and then gets a professional job relating to it. What software is s/he going to purchase, to have a legitimate business? The one s/he's been using forever, obviously.",
    "controversiality": 0,
    "ups": 396,
    "downs": 0,
    "score": 396,
    "created": 1506086328.0,
    "date_created": "2017-09-22",
    "time_created": "01:18:48",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncdrfv",
    "parent_id": "t1_dnccncn",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "One could even say that because you pirated Photoshop and, for the sake of argument, liked it. And now, because you liked the product, you could potentially recommend it and they might then purchase it.\n\nIt's a lot of what ifs, but it's not unlikely.\n\nExample: I pirated the movie Drive when it came out. Loved it. Showed it to a few friends. We all bought it.",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1506087105.0,
    "date_created": "2017-09-22",
    "time_created": "01:31:45",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccam0",
    "parent_id": "t1_dncawql",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yup, HBO for a larger part knew damn well how many people where pirating it and sharing HBO accounts but didn't crack the whip to hard as they where still making money and eventually hooking in customers for when they made their own streaming service without cable.\n\nHeck I went from pirating it to account sharing to now just flat out paying for it over the years. Their largest hook is it being instantly streamed and easy to track location across multiple shows.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1506084255.0,
    "date_created": "2017-09-22",
    "time_created": "00:44:15",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncg473",
    "parent_id": "t1_dncawql",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I mean I would have paid for it if there were a useful source for it. The german dubbed version just sucks and even now that amazon sells it online, i won't wait for spoilers on the internet just because they give it away a day or two later. It's the internet for gods sake. I pay for good service, not for being placed second or third just because I live a few hours to the east.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1506092459.0,
    "date_created": "2017-09-22",
    "time_created": "03:00:59",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncc65q",
    "parent_id": "t1_dncc1e1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah, movies seem to be impacted a lot by piracy. Which I guess is why the EU commission reported on that fact, but omitted the rest of the study when they discussed it.",
    "controversiality": 0,
    "ups": 155,
    "downs": 0,
    "score": 155,
    "created": 1506084034.0,
    "date_created": "2017-09-22",
    "time_created": "00:40:34",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccmxz",
    "parent_id": "t1_dncc1e1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I didn't read the link from OP, but I did look at the study itself. Displacement is something else than the effect on sales. The study says they estimate that to be at around 5%.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1506084890.0,
    "date_created": "2017-09-22",
    "time_created": "00:54:50",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbsj1",
    "parent_id": "t1_dncbk6m",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's really an eye-opening experience the first time you read a published academic paper and realize halfway through that the author had no idea what the fuck they're talking about.",
    "controversiality": 0,
    "ups": 53,
    "downs": 0,
    "score": 53,
    "created": 1506083373.0,
    "date_created": "2017-09-22",
    "time_created": "00:29:33",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncf6gx",
    "parent_id": "t1_dncf39s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "We update the game weekly (early access) and the torrent version couldn't use steam infrastructure for that. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506090205.0,
    "date_created": "2017-09-22",
    "time_created": "02:23:25",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncgg4h",
    "parent_id": "t1_dnce4xy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's because it's not only not true, it isn't even an urban legend or anything. ",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1506093308.0,
    "date_created": "2017-09-22",
    "time_created": "03:15:08",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnck7io",
    "parent_id": "t1_dnce4xy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I think he's maybe confused with the single play tapes, not vinyls.\n\n[Here's a video of them in action.](https://www.youtube.com/watch?v=0TiqXFssKMY)",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506104245.0,
    "date_created": "2017-09-22",
    "time_created": "06:17:25",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnchpi0",
    "parent_id": "t1_dncg5bl",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Ah. The dictators cut. ",
    "controversiality": 0,
    "ups": 1072,
    "downs": 0,
    "score": 1072,
    "created": 1506096766.0,
    "date_created": "2017-09-22",
    "time_created": "04:12:46",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncgat6",
    "parent_id": "t1_dncg5bl",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Good message. I did nothing and things happened. I basically have no influence on my own life.",
    "controversiality": 0,
    "ups": 225,
    "downs": 0,
    "score": 225,
    "created": 1506092928.0,
    "date_created": "2017-09-22",
    "time_created": "03:08:48",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncgm4n",
    "parent_id": "t1_dncgkjb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Hmm, i can understand that. The thought still makes me pretty angry and I guess it is by far not the worst stuff that happens there. Still very fucked up.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1506093742.0,
    "date_created": "2017-09-22",
    "time_created": "03:22:22",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnckpgk",
    "parent_id": "t1_dncghv0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "aw man, they cut the scene where he made her boobs bigger!\n\ncurse you, censorship!!",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1506105544.0,
    "date_created": "2017-09-22",
    "time_created": "06:39:04",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncgxpz",
    "parent_id": "t1_dnceq0p",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah, and now Disney thinks another platform for their own content is a good idea. I guess the movie/tv industry still has some catching up to do with the music and game industry when it comes to digital distribution. ",
    "controversiality": 0,
    "ups": 605,
    "downs": 0,
    "score": 605,
    "created": 1506094596.0,
    "date_created": "2017-09-22",
    "time_created": "03:36:36",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnchlk9",
    "parent_id": "t1_dnceq0p",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is what i've been saying all the time.\n\nLook, here is /u/Phasko, he has the money, he is offering his money to the producers/services/studios to see his favorite show. He's waving the money infront of them, asking them to take it and just let him see the show.. but no! They say \"we don't want your money!\". \"We don't want it... no show for you!\".\n\nThen comes along a friendly neigbor torrent site, with everything there, and /u/Phasko just clicks download, waits for a short time, and (s)he can see all the newest episodes for free.\n\nThen the producers/studios/*aa comes out and screams \"OMG, we're hungry, we have very poor people here, who can't even afford their second island, because of the piracy... please, please, police, fbi/cia/fsb/mosad help and stop the goddamn pirates stealing bread from our mouths!\"\n\nAnd yes... as a guy from an even smaller european country, I understand. ",
    "controversiality": 0,
    "ups": 396,
    "downs": 0,
    "score": 396,
    "created": 1506096453.0,
    "date_created": "2017-09-22",
    "time_created": "04:07:33",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncflai",
    "parent_id": "t1_dnceq0p",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Same in Germany. ",
    "controversiality": 0,
    "ups": 168,
    "downs": 0,
    "score": 168,
    "created": 1506091164.0,
    "date_created": "2017-09-22",
    "time_created": "02:39:24",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnch99g",
    "parent_id": "t1_dnceq0p",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "In Germany we don't have access to the latest season of House of Cards.\n\nIt's a *Netflix-produced* show for fuck's sake, and yet we still can't watch all the episodes.",
    "controversiality": 0,
    "ups": 119,
    "downs": 0,
    "score": 119,
    "created": 1506095495.0,
    "date_created": "2017-09-22",
    "time_created": "03:51:35",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnch11c",
    "parent_id": "t1_dnceq0p",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah im from belgium and got netflix as soon as it was available. I was very hyped but to my dissillusion it had none of the shows i wanted to see. I'm still subscribed as there still are very decent series available, but they are very slow in adding quality content. Only 10% of the catalogue interests me though, i don't understand why clearing rights of american shows is so difficult, you'd think the producers of major shows on american netflix would like to see their content enjoyed all over the world.",
    "controversiality": 0,
    "ups": 124,
    "downs": 0,
    "score": 124,
    "created": 1506094853.0,
    "date_created": "2017-09-22",
    "time_created": "03:40:53",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnchcwf",
    "parent_id": "t1_dnceq0p",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I use netflix as an excuse to download the latest series/movies. They'll eventually end up on netflix anyway so i just 'prepay' them a bit.\n\nUnless they're on netflix, than i watch them on netflix because it's less trouble than downloading them.",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1506095783.0,
    "date_created": "2017-09-22",
    "time_created": "03:56:23",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncgqvz",
    "parent_id": "t1_dnceq0p",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's how you support piracy, good job Netflix :)",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1506094085.0,
    "date_created": "2017-09-22",
    "time_created": "03:28:05",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnch79c",
    "parent_id": "t1_dnceq0p",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Oh man, here in sweden we once had seasons *2 and 3* of madmen, but no season 1. Netflix is really wonky sometimes.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1506095340.0,
    "date_created": "2017-09-22",
    "time_created": "03:49:00",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnchwnz",
    "parent_id": "t1_dnceq0p",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Hmm, in Russia Netflix is surprisingly good, especially because it provides content in its original language, some things are missing but it didn't trouble me that much.\n\nHowever selling only content dubbed in Russian language is a huge problem for other services like Google Play, I don't watch any movies/shows from Google Play because of this.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1506097334.0,
    "date_created": "2017-09-22",
    "time_created": "04:22:14",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncl12i",
    "parent_id": "t1_dncfhr2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "In Italy Got is available only through Sky, which I have a subscription to because of my parents watching sports, but their streaming services are so messy that I still torrent every episode",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1506106342.0,
    "date_created": "2017-09-22",
    "time_created": "06:52:22",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncf79f",
    "parent_id": "t1_dnceipq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Last time I added anything to my MP3 music library was in 2010 when I got Spotify Premium. I don't even know how to pirate music anymore.",
    "controversiality": 0,
    "ups": 55,
    "downs": 0,
    "score": 55,
    "created": 1506090253.0,
    "date_created": "2017-09-22",
    "time_created": "02:24:13",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncg93n",
    "parent_id": "t1_dnceipq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Wow, do I feel old. I remember in junior high and high school listening to the radio for hours waiting to hear my favorite songs, and running to the radio to push the record button as soon as I heard one I wanted. Then I got my first 5 cd changer, and spent hours creating mix tapes for school from all my other tapes, and the few CDs I owned at the time.",
    "controversiality": 0,
    "ups": 85,
    "downs": 0,
    "score": 85,
    "created": 1506092805.0,
    "date_created": "2017-09-22",
    "time_created": "03:06:45",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncew9v",
    "parent_id": "t1_dncea7l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And if you have a capital one credit card as your payment method, they credit you 2.50 so it winds up only costing 2.50 for spotify and hulu every month!",
    "controversiality": 0,
    "ups": 143,
    "downs": 0,
    "score": 143,
    "created": 1506089565.0,
    "date_created": "2017-09-22",
    "time_created": "02:12:45",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncfd8o",
    "parent_id": "t1_dncea7l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's if you're a student in the US.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1506090638.0,
    "date_created": "2017-09-22",
    "time_created": "02:30:38",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncp9h7",
    "parent_id": "t1_dncla43",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> Oh and you can't screenshot Blu-rays. Cause you know I'm going to pirate the movie frame by frame with no audio...\n\nLiterally the very first pirated bluray disc was done in less than a day after release, by actually screenshotting every frame sent to the display then muxing it with the audio stream. None of the extra DRM that was added to \"prevent piracy\" (read: control your experience and stuff ads down your throat) did a damn thing to stop piracy at all. HDMI-compliant security in the display? Laughable, stupid concept that only increases the price of the display because the manufacturers have to pay to add that feature. ",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1506114172.0,
    "date_created": "2017-09-22",
    "time_created": "09:02:52",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnckjzs",
    "parent_id": "t1_dnchd97",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Its easy to return bad games on steam if you do it within the time limit.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506105155.0,
    "date_created": "2017-09-22",
    "time_created": "06:32:35",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnco9qq",
    "parent_id": "t1_dnchd97",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's how you spot good games. They offer free weekends for everybody. That's how I ended up buying Team Fortress 2 (before it went f2p) and Killer Floor 2.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1506112656.0,
    "date_created": "2017-09-22",
    "time_created": "08:37:36",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncnvxg",
    "parent_id": "t1_dncgihb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah, but using Dave Matthews is selection bias. They're a great live jam band. There are other bands piracy would hurt. What if a band didn't want to tour? Someone like the Beatles. There is more than one way to live life. Some people want to play shows and rake their income there, some people want to put out a product.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1506112020.0,
    "date_created": "2017-09-22",
    "time_created": "08:27:00",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncest1",
    "parent_id": "t1_dncd69t",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Nah, that's not how it works.\n\nIf there was no piracy he'd never play these games as a kid. And he'd never buy them as an adult.",
    "controversiality": 0,
    "ups": 420,
    "downs": 0,
    "score": 420,
    "created": 1506089352.0,
    "date_created": "2017-09-22",
    "time_created": "02:09:12",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncfcjf",
    "parent_id": "t1_dncd69t",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Still 2.5$ more than if he never bought it. Which was his point when mentioning being young and poor. ",
    "controversiality": 0,
    "ups": 45,
    "downs": 0,
    "score": 45,
    "created": 1506090593.0,
    "date_created": "2017-09-22",
    "time_created": "02:29:53",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncdhgk",
    "parent_id": "t1_dncd69t",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Let's be real, CoD is only worth 2.50.",
    "controversiality": 0,
    "ups": 287,
    "downs": 0,
    "score": 287,
    "created": 1506086537.0,
    "date_created": "2017-09-22",
    "time_created": "01:22:17",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncg1wf",
    "parent_id": "t1_dncd69t",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I know i am contributing to the Witcher 3 appreciation circlejerk but here it goes.... \n\nI was getting so bugged because I pirated Witcher 3 that getting the game during sale was not good enough for me.  I actually waited for it to go out of sale and purchase it for full $60. Unfortunately, the game was for ~$10 due to regional pricing. So i got it from gog. Then later i got the entire Witcher trilogy from steam. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1506092295.0,
    "date_created": "2017-09-22",
    "time_created": "02:58:15",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncg9fi",
    "parent_id": "t1_dncczpv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Piracy: play games you can't buy\n\nSteam: Buy games you can't play",
    "controversiality": 0,
    "ups": 80,
    "downs": 0,
    "score": 80,
    "created": 1506092828.0,
    "date_created": "2017-09-22",
    "time_created": "03:07:08",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncdrzq",
    "parent_id": "t1_dncczpv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yep, as most professionals now...",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1506087136.0,
    "date_created": "2017-09-22",
    "time_created": "01:32:16",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnce2ck",
    "parent_id": "t1_dncczpv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "So true, so sad :(. Always kept those games for \"later\" but I don't have time to play now with two jobs ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506087743.0,
    "date_created": "2017-09-22",
    "time_created": "01:42:23",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnc7008",
    "parent_id": "t1_dnc5xk3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I guess salt cancels out cancer, huh?",
    "controversiality": 0,
    "ups": 96,
    "downs": 0,
    "score": 96,
    "created": 1506076528.0,
    "date_created": "2017-09-21",
    "time_created": "22:35:28",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncegs1",
    "parent_id": "t1_dnce0rd",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Man, these anti-piracy ads are getting really mean...",
    "controversiality": 0,
    "ups": 70,
    "downs": 0,
    "score": 70,
    "created": 1506088614.0,
    "date_created": "2017-09-22",
    "time_created": "01:56:54",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncghri",
    "parent_id": "t1_dncg3eg",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "In the defence of these platforms: it is all a copyright issue. America has a large audience and acquiring rights is for the whole country. On the other side of the ocean every country has their own redistribution companies. If any of them has bought the exclusive redistribution rights to, say house of cards, Netflix themselves aren't allowed to stream it in that country.\n\nNow think that every country also got their own copyright laws, and all this makes Europe a hell to offer these kind of services to.",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1506093424.0,
    "date_created": "2017-09-22",
    "time_created": "03:17:04",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbx8r",
    "parent_id": "t1_dncbr39",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Have they really changed? Because I'm still asking that question and pretending to be blissfully ignorant.",
    "controversiality": 0,
    "ups": 185,
    "downs": 0,
    "score": 185,
    "created": 1506083598.0,
    "date_created": "2017-09-22",
    "time_created": "00:33:18",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnchpha",
    "parent_id": "t1_dncfudj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It makes me laugh how expensive films are. They are pretty much £15+ where I live for a Bluray at best (and lets face it, I'm not paying a single penny for a DVD copy because it's 2017). If I wanted to watch a couple a week it's just unreasonable. Would anyone pay £120 a month so they can watch 8 films? God no. Or I can rent them, so I can only watch them a single time, for the super reasonable price of £48? Fucking lol at that.\n\nBut, how much do I actually spend on films now? £0. Literally nothing, ever. I'm *willing* to pay for films, but there is absolutely no way to acquire them at a price point I'd be happy to pay...the industry is entirely missing out on millions of sales because they are hellbent on charging a fortune for them. ",
    "controversiality": 0,
    "ups": 89,
    "downs": 0,
    "score": 89,
    "created": 1506096765.0,
    "date_created": "2017-09-22",
    "time_created": "04:12:45",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncddis",
    "parent_id": "t1_dncd3r4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Netflix doesn't have much worth watching in my country(or rather anything worth watching, I've already seen), and there's no other decent streaming service here that I know of, so I still pirate movies quite a bit.",
    "controversiality": 0,
    "ups": 80,
    "downs": 0,
    "score": 80,
    "created": 1506086318.0,
    "date_created": "2017-09-22",
    "time_created": "01:18:38",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncdn4v",
    "parent_id": "t1_dncd3r4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Always on media PC at home with Plex server. TeamViewer on my phone to torrent. Eh, it's a bit of a hassle, but if it's not on Netflix...\n\n\nAnd who the fuck bothers with pirating music these days? Steam and Spotify absolutely killed that part of piracy ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1506086862.0,
    "date_created": "2017-09-22",
    "time_created": "01:27:42",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnchsoz",
    "parent_id": "t1_dncgs80",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's really fucking annoying as a legit user. I run a VPN 24/7 because I live in the UK where privacy seems to be a joke, but now I can't watch UK Netflix without turning the VPN off. I wish they would allow you to watch content from a UK VPN server, if your billing address is also in the UK. ",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1506097018.0,
    "date_created": "2017-09-22",
    "time_created": "04:16:58",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnchaa0",
    "parent_id": "t1_dnccld4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "He may as well just get a fucking cable subscription at this point, it'd be cheaper.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1506095572.0,
    "date_created": "2017-09-22",
    "time_created": "03:52:52",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncm915",
    "parent_id": "t1_dnccld4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Tbf, Amazon Prime is worth it for free delivery.  ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506109037.0,
    "date_created": "2017-09-22",
    "time_created": "07:37:17",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncdske",
    "parent_id": "t1_dncdmub",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "~$50/month + $99 year for amazon prime. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1506087169.0,
    "date_created": "2017-09-22",
    "time_created": "01:32:49",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncefy6",
    "parent_id": "t1_dncctr1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Absolutely, the way I see it is, Hulu has all the t.v. shows, Netflix has all the movies, HBO is doing their quality HBO content stuff, And Amazon prime just kinda sits in the corner (but that's me).\n\nThen again in my family each of us pays for 1 service and we all share it.  ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1506088563.0,
    "date_created": "2017-09-22",
    "time_created": "01:56:03",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnceccd",
    "parent_id": "t1_dncctr1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506088348.0,
    "date_created": "2017-09-22",
    "time_created": "01:52:28",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncb0p5",
    "parent_id": "t1_dnc5oov",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Hbo is the only charge on my cable bill that doesn't upset me. Fuck every other channel and network but that $20/month is worth every penny. ",
    "controversiality": 0,
    "ups": 715,
    "downs": 0,
    "score": 715,
    "created": 1506082118.0,
    "date_created": "2017-09-22",
    "time_created": "00:08:38",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncccop",
    "parent_id": "t1_dncbqnj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I got Foxtel NOW, the streaming service just for Game of Thrones.\n\nMy lord, it is the absolute worst streaming service you can imagine.\n\nFirstly, you don't get access to everything, you have to choose 'packs' just like Foxtel boxsets because apparently this is the 90s.\n\nSecondly, the app is the worst piece of shit ever. You cannot. Can *not* watch more than one show in a row, if you try to start a new episode, it crashes. If you try to change channel more than once on the live tv section, it crashes. If you even try to fast-forward or rewind something, it's likely it's going to crash.",
    "controversiality": 0,
    "ups": 211,
    "downs": 0,
    "score": 211,
    "created": 1506084361.0,
    "date_created": "2017-09-22",
    "time_created": "00:46:01",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncccft",
    "parent_id": "t1_dncbqnj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It is more clear every day that the problem is not piracy, the problem are the business models and platforms large companies use to broadcast their contents. TV subscriptions made sense 20 years ago but they don't make sense anymore, as a matter of fact no subscription service makes sense anymore you should be able to have access to neutral networks where you pay for what you watch directly to the content creator not pay to some middle man.",
    "controversiality": 0,
    "ups": 258,
    "downs": 0,
    "score": 258,
    "created": 1506084349.0,
    "date_created": "2017-09-22",
    "time_created": "00:45:49",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccpoa",
    "parent_id": "t1_dncblun",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "In layman's terms, because I've never fully understood, what's a VPN?",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1506085034.0,
    "date_created": "2017-09-22",
    "time_created": "00:57:14",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbxzh",
    "parent_id": "t1_dncbov9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Because Canadians are too nice to bitch about it.",
    "controversiality": 0,
    "ups": 73,
    "downs": 0,
    "score": 73,
    "created": 1506083634.0,
    "date_created": "2017-09-22",
    "time_created": "00:33:54",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncc7rs",
    "parent_id": "t1_dncbov9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Huge country, low population, low competition, and culture protectionism that heavily subsidizes Canadian content. \n\nI worked with so many channels whose biggest worry wasn't the quality of their content or even ratings, but how they would be able to keep up their subscriber numbers to keep their subsidies when the government allowed consumers to remove channels from their bundles a year or two ago. ",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1506084113.0,
    "date_created": "2017-09-22",
    "time_created": "00:41:53",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncculb",
    "parent_id": "t1_dncc62v",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is true in China as well.  Used to be pirate heaven; but it was because it was impossible to get things easily and legally.\n\nNow, the old pirate services have all gone legit, and you download quickly and easily- just not for free.  But people pay, because they would've paid a fair price for it in the first place if you just let them do it.",
    "controversiality": 0,
    "ups": 143,
    "downs": 0,
    "score": 143,
    "created": 1506085292.0,
    "date_created": "2017-09-22",
    "time_created": "01:01:32",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccley",
    "parent_id": "t1_dncc62v",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is it, in a nutshell. The media corporations need to realize that if people can access their media more conveniently from piracy than they can from the horrendous service options they currently limit us to, many will pirate. Make it easy and affordable like Netflix and they won’t. Simple.",
    "controversiality": 0,
    "ups": 247,
    "downs": 0,
    "score": 247,
    "created": 1506084814.0,
    "date_created": "2017-09-22",
    "time_created": "00:53:34",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccney",
    "parent_id": "t1_dncc7be",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's something I'd really like an explanation for: Why do so few games these days have demos? Did people stop using them? I know I've passed up several games just because I wasn't sure how it would run on my computer, and there was no demo to test it out before buying. System requirements never tell the whole story.",
    "controversiality": 0,
    "ups": 138,
    "downs": 0,
    "score": 138,
    "created": 1506084916.0,
    "date_created": "2017-09-22",
    "time_created": "00:55:16",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccsix",
    "parent_id": "t1_dncc9k2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This. Ease of paying and ease of access. Ever since I got Netflix 3 years ago I barely stream anything online that's not on it or HBO GO. I get to pay easily and at a fair price and watch shows whenever I want. ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1506085185.0,
    "date_created": "2017-09-22",
    "time_created": "00:59:45",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccv7u",
    "parent_id": "t1_dncc5xe",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's so asinine ...\n\nI understand they want to cut out the middle-man, but don't start 10 stream services in hopes of doing that.\n\nIf you want to compete with Netflix, then make a damn Netflix alternative and get as many of the studios on board as possible. Data gathering should make dividing the pot SUPER easy.",
    "controversiality": 0,
    "ups": 68,
    "downs": 0,
    "score": 68,
    "created": 1506085325.0,
    "date_created": "2017-09-22",
    "time_created": "01:02:05",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccuwi",
    "parent_id": "t1_dncc5xe",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It'll only last as long as it takes them to realize people won't put up with that crap, and they'll make more money licensing to netflix so people can watch it, than charging the 2 people who will pay for their proprietary service while everyone else pirates it\n\nThe only one I see sticking around right now is Disney's. CBS's is gonna flop even with trek, I guarantee it.",
    "controversiality": 0,
    "ups": 71,
    "downs": 0,
    "score": 71,
    "created": 1506085307.0,
    "date_created": "2017-09-22",
    "time_created": "01:01:47",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccz4c",
    "parent_id": "t1_dncc5xe",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "We'll see whether the market actually supports it. I wouldn't be surprised if a bunch of the 'me too' services get promptly shuttered once the owners realize they're earning less revenue from subscriptions than they were originally getting from Netflix in exchange for streaming rights.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1506085535.0,
    "date_created": "2017-09-22",
    "time_created": "01:05:35",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncf76c",
    "parent_id": "t1_dncc2xt",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "In some countries, even making a home backup is illegal. You buy something, but you still don't own it.",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1506090248.0,
    "date_created": "2017-09-22",
    "time_created": "02:24:08",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncedd1",
    "parent_id": "t1_dncc2xt",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I second this. 17TB worth of movies and TV shows (though I still have a wall full of the DVDs that I bought to get that far).  The ease of use of that plus a program like PLEX or Kodi to let you watch it anywhere, anytime, makes it a worthy effort.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506088409.0,
    "date_created": "2017-09-22",
    "time_created": "01:53:29",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncc155",
    "parent_id": "t1_dncbe4u",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Then you have to rent it for 5 bucks again next time.",
    "controversiality": 0,
    "ups": 87,
    "downs": 0,
    "score": 87,
    "created": 1506083787.0,
    "date_created": "2017-09-22",
    "time_created": "00:36:27",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncc59b",
    "parent_id": "t1_dncburb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Psssssssst:\n\nhttp://nypost.com/2017/09/19/netflix-for-theaters-sending-industry-into-a-frenzy/",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1506083989.0,
    "date_created": "2017-09-22",
    "time_created": "00:39:49",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnceaub",
    "parent_id": "t1_dncdmwv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I can see why you'd want a preview with a subset of the features/missions/etc. but a FULL preview for every game? I don't think it makes as much sense as you'd think.\n\ne.g.: multiplayer only game. hard to implement, has fixed costs to run the servers",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1506088257.0,
    "date_created": "2017-09-22",
    "time_created": "01:50:57",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncddni",
    "parent_id": "t1_dnccanc",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's good to weed out those games that crash 5 minutes into the game and you CBF to go download a 3rd party patch or change some files to make it run well.",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1506086325.0,
    "date_created": "2017-09-22",
    "time_created": "01:18:45",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnceykn",
    "parent_id": "t1_dncddsj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Don't forget Uplay and Games for Windows Live ... worst crap in software",
    "controversiality": 0,
    "ups": 76,
    "downs": 0,
    "score": 76,
    "created": 1506089711.0,
    "date_created": "2017-09-22",
    "time_created": "02:15:11",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncdwb4",
    "parent_id": "t1_dncddpm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This. There's a reason Photoshop is the most used art program out there, while at the same time, it's also the most pirated software out there. Adobe doesn't condone it, but they're not trying to stop it.",
    "controversiality": 0,
    "ups": 183,
    "downs": 0,
    "score": 183,
    "created": 1506087386.0,
    "date_created": "2017-09-22",
    "time_created": "01:36:26",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnceq6l",
    "parent_id": "t1_dncddpm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "another scenario that helps them:  \nA person pirates photoshop, then uses 'photoshop' as a verb.  \nyou literally can't get better product recognition than that.  \nIf the only people that use photoshop were those that use it enough to merit buying it had it, it wouldn't be part of everyone's vocabulary.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1506089192.0,
    "date_created": "2017-09-22",
    "time_created": "02:06:32",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnce8z5",
    "parent_id": "t1_dncddpm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's why you get free MS and Autodesk software on university. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506088144.0,
    "date_created": "2017-09-22",
    "time_created": "01:49:04",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnce5p6",
    "parent_id": "t1_dnccam0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I did the same, pirated the first 4 seasons, bought the other 3 and they are on my google play account. If i hadnt pirated those first 4 seasons i wouldnt have bought any, its a profit for them",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1506087950.0,
    "date_created": "2017-09-22",
    "time_created": "01:45:50",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccqrl",
    "parent_id": "t1_dncc65q",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Likely because people want to see the movie in their own homes and the film industry doesn’t provide a way for them to do so until 3-4 months after the movie release in theaters.\n\nEvery single movie or show I’ve pirated in the last 8-10 years did not having a legal alternative to pay for the content directly. Give me a way to pay for your service and I’m more than happy to do so, otherwise I’ll keep pirating Rick and Morty because you haven’t figured out a reasonable means to give you money for what you produce.",
    "controversiality": 0,
    "ups": 96,
    "downs": 0,
    "score": 96,
    "created": 1506085094.0,
    "date_created": "2017-09-22",
    "time_created": "00:58:14",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbxqi",
    "parent_id": "t1_dncbsj1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "According to my professors in my Eco unit, you really need to be careful with what you reference and read since some were really obviously paid for to get through the process given their content and that whole Chinese journal scare that popped up a few months ago. \n\nOr it was just written by people who didn't know what they were doing and did something like a single sample T-Test when it was meant to be a paired T-Test.\n\nAcademia isn't some bastion of facts that I thought it was.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1506083622.0,
    "date_created": "2017-09-22",
    "time_created": "00:33:42",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncnhp2",
    "parent_id": "t1_dnchpi0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Aladeenovision.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1506111359.0,
    "date_created": "2017-09-22",
    "time_created": "08:15:59",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnci8wm",
    "parent_id": "t1_dnchpi0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That could become a thing. People cutting away anything that could be slightly offensive to anyone and replace the score with [muzak]( https://en.wikipedia.org/wiki/Muzak).",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1506098355.0,
    "date_created": "2017-09-22",
    "time_created": "04:39:15",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnciqtq",
    "parent_id": "t1_dncgat6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Sounds like religion",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1506099878.0,
    "date_created": "2017-09-22",
    "time_created": "05:04:38",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnci5xx",
    "parent_id": "t1_dncgat6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "So /r/me_irl? ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1506098106.0,
    "date_created": "2017-09-22",
    "time_created": "04:35:06",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnch27p",
    "parent_id": "t1_dncgm4n",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It makes you angry because it's probably way below what you'd consider \"being free\" (your nickname sounds German so I'm assuming stuff here). There are places where even being allowed to go to a cinema to see state propaganda is considered \"better than it used to be\", by comparison seeing a heavily-censored \"Bruce Almighty\" might feel like you're finally a free man. It's all about perspective and baselines.\n\nIt's blood-boiling, anger-inducing, but that's the world we live in, sadly.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1506094945.0,
    "date_created": "2017-09-22",
    "time_created": "03:42:25",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnck9yt",
    "parent_id": "t1_dncgxpz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah the golden age of streaming services is ending as cable companies sink their nasty claws into streaming",
    "controversiality": 0,
    "ups": 275,
    "downs": 0,
    "score": 275,
    "created": 1506104427.0,
    "date_created": "2017-09-22",
    "time_created": "06:20:27",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnci3gh",
    "parent_id": "t1_dncgxpz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "At least Steam has pretty much remained king of the digital gaming stores, despite EA being asshats and forcing Origin on everyone. I have to have Origin installed just to play two damn games. Really wish they'd get over themselves and publish on Steam. ",
    "controversiality": 0,
    "ups": 61,
    "downs": 0,
    "score": 61,
    "created": 1506097897.0,
    "date_created": "2017-09-22",
    "time_created": "04:31:37",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnckauz",
    "parent_id": "t1_dncgxpz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "yeah the disruption in TV looked like it was going to save people money by not having to subscribe to channels they don't want. Not happening. At the moment the streaming services have made the benefit theirs by getting exclusivity of certain shows meaning you (legally) need a handful of services to get the best shows. So you end up with a bunch of shows you don't care about at all - sound familiar?\n\nProbably gone too far now and I can't see production companies settling for a paid-per-play system that's more like Spotify",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1506104493.0,
    "date_created": "2017-09-22",
    "time_created": "06:21:33",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncmiqk",
    "parent_id": "t1_dnchlk9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Australian.For game of thrones we have a monopoly distribution method, specifically Foxtel. They charge pretty extravagant prices, even for their new streaming service.\n\n\nAbout 2 seasons ago I tried to buy a HBO Go account. Needed a US billing address and payment method, as well as a VPN.\n\nI tried to give them proper money. \n\nNow granted my legal method was Foxtel, but at something crazy like $105 for just the season it's a bit bullshit. And that was their cheaper model.",
    "controversiality": 0,
    "ups": 89,
    "downs": 0,
    "score": 89,
    "created": 1506109571.0,
    "date_created": "2017-09-22",
    "time_created": "07:46:11",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncg97k",
    "parent_id": "t1_dncflai",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The Irish Netflix seems to be getting worse and worse each month.",
    "controversiality": 0,
    "ups": 121,
    "downs": 0,
    "score": 121,
    "created": 1506092813.0,
    "date_created": "2017-09-22",
    "time_created": "03:06:53",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnci6rc",
    "parent_id": "t1_dncflai",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's why I hope the EU goes ahead with making a proper single digital market, meaning movie licenses can only be granted for the EU as a whole or not at all... because this causes Netflix to be so fragmented and low quality in most countries: they have to acquire licenses for each individual nation. But if they could acquire EU licenses and the studios have no other way but to sell them EU wide, then it would be a.) less tedious and b.) every license would encompass the ENTIRE EU market.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1506098176.0,
    "date_created": "2017-09-22",
    "time_created": "04:36:16",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncl4zf",
    "parent_id": "t1_dnch99g",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah Sky Deutschland (the cable provider) bought exclusive rights to House of Cards in Germany. \n\nSo you can watch House of Cards on the same channel that airs Game of Thrones, but it does sort of negate the reason why you'd get Netflix in the first place.  \n\nMovie selection is shit as well. I've used both the US Netflix and the Irish Netflix. US netflix probably had 4-5 times the amount of movies and a lot of the bigger ones (because EU cable providers keep buying the big movie releases in exclusive deals).\n\nNetflix is just pretty fucking crap in Europe. ",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1506106607.0,
    "date_created": "2017-09-22",
    "time_created": "06:56:47",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnchu2a",
    "parent_id": "t1_dnch11c",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's because the (possibly exclusive) license to broadcast this content was already sold to some company in your country. In Poland we had a situation where Netflix didn't have House of Cards because the rights to it were already sold to some station.",
    "controversiality": 0,
    "ups": 95,
    "downs": 0,
    "score": 95,
    "created": 1506097122.0,
    "date_created": "2017-09-22",
    "time_created": "04:18:42",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnci2zc",
    "parent_id": "t1_dnch11c",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Say thanks to belgacom for that. As it's half ownership of the goverment, we don't get shit cuz they bought content for the oldies on television... so stupid",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1506097858.0,
    "date_created": "2017-09-22",
    "time_created": "04:30:58",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncj1ly",
    "parent_id": "t1_dnch11c",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Most content producers will try and squeeze as much money out of a product as possible, so lets say \"Content Producer A\" produces \"Show A\" in the US. They sell the US rights to Netflix for 100 million dollars. Now, Netflix says, we want rights to these 10 other countries that we are also in. We will pay 10 million for that on top of the 100 million for the US rights. But \"Content Producer\" wants to make as much as possible, so they go to these individual 10 countries and sell the rights in each country for 5 million instead, so instead of getting just 10 million from netflix, they will get 50 million from \"broadcaster 1-10\" in those countries. Hell, they might even make it into a bidding war to get as much out of it as possible.\n\nSo unless Netflix matches what big invidiual media conglomrates who pay for it in their native countries, thats never happening.\n\nIts why Netflix is making so much of their own content now, to get free of all that licensing stuff (they are tired of it too)",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1506100777.0,
    "date_created": "2017-09-22",
    "time_created": "05:19:37",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncgveg",
    "parent_id": "t1_dncgqvz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's more likely that the media companies that Netflix gets their stuff from are disallowing Netflix from showing things in every country",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1506094426.0,
    "date_created": "2017-09-22",
    "time_created": "03:33:46",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncmutw",
    "parent_id": "t1_dncf79f",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Sorry I picked this post to reply to.. But I really don't get the Spotify thing. Ok from a convenience point of view it's amazing.\n\nDoes it not irk anybody that the second you stop playing the monthly fee you lose the ability to access your entire library on the move.\n\nWhat happens if / when the service dies or closes. You don't get that money back and until then you are at the mercy of any price rises they want to make if you want to maintain access to your collection.\n\nPeople argue that the monthly fee isn't too high.. But they don't offer a full library of music. If you want access to all music there are more and more competing sites like Tidal  all locking in their own list of exclusive labels or artists diluting the market.\n\nThis really erodes the value of the fee each  individual service charges. The same is happening with TV shows. \n\nIs not realistic to subscribe to all of the providers for most people and you end  by subscribing you only encourage this kind of market.  More competition = higher fees paid to lock in exclusive shows = higher sub fees to cover this. In the end everyone ends up paying more for a worse quality product. \n\nHow can do many people live such a flawed model for the user. \nAnd they wonder why piracy is still a thing?\n\n",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1506110215.0,
    "date_created": "2017-09-22",
    "time_created": "07:56:55",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncj5ta",
    "parent_id": "t1_dncg93n",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And then the DJ would talk over it! ARRGHHHH SHUT UP! ",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1506101145.0,
    "date_created": "2017-09-22",
    "time_created": "05:25:45",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncjidl",
    "parent_id": "t1_dncg93n",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yep. Oldie here. I used to tape songs from American Top 40, every Sunday in Australia. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1506102212.0,
    "date_created": "2017-09-22",
    "time_created": "05:43:32",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncl5ol",
    "parent_id": "t1_dncg93n",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It was an art form to stop the tape before the DJ spoke at the end of the track. Then put the pencil in and rewind it so slightly so the audible click wasn't heard between tracks. Good times ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1506106656.0,
    "date_created": "2017-09-22",
    "time_created": "06:57:36",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncf1pz",
    "parent_id": "t1_dncew9v",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Wait really, godamn I feel like the ultimate Frugal now.Until now I was under spotifies 99c for 3 months plan, and now I got to only pay 2.50 . I wish google music had the same pricing/student pricing, I really miss their app.",
    "controversiality": 0,
    "ups": 91,
    "downs": 0,
    "score": 91,
    "created": 1506089907.0,
    "date_created": "2017-09-22",
    "time_created": "02:18:27",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncfhc8",
    "parent_id": "t1_dncfd8o",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "If you are outside of the usa there are websites that issue you a free edu email. I've never tested them since I already have an email, and would rather not break some weird American law. But if you are not in the USA it's risk free ;)\n\nAlso I am almost sure you might be able to sign up for some community college in the USA online/over the phone. Most colleges/universities don't get rid of your edu email once you are done.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1506090905.0,
    "date_created": "2017-09-22",
    "time_created": "02:35:05",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncg0bs",
    "parent_id": "t1_dncest1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "People refuse to understand this. Poor people and kids won't be buying the games anyway so there's no loss of sale, but if they pirate it they're more likely to buy it later when they can afford it because they know they like it already!",
    "controversiality": 0,
    "ups": 293,
    "downs": 0,
    "score": 293,
    "created": 1506092187.0,
    "date_created": "2017-09-22",
    "time_created": "02:56:27",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnce2bq",
    "parent_id": "t1_dncdhgk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And yet it will never drop to $2.50 on Steam.",
    "controversiality": 0,
    "ups": 148,
    "downs": 0,
    "score": 148,
    "created": 1506087742.0,
    "date_created": "2017-09-22",
    "time_created": "01:42:22",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbkb5",
    "parent_id": "t1_dnc7008",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's why I'm thinking of going back to World of Tanks.",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1506082993.0,
    "date_created": "2017-09-22",
    "time_created": "00:23:13",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncjdrx",
    "parent_id": "t1_dncegs1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I still think we're sitting too close to the screen!",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1506101822.0,
    "date_created": "2017-09-22",
    "time_created": "05:37:02",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncgsji",
    "parent_id": "t1_dncghri",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "As a consumer, I don't think it is even possible for me to care less about this stuff. ",
    "controversiality": 0,
    "ups": 57,
    "downs": 0,
    "score": 57,
    "created": 1506094211.0,
    "date_created": "2017-09-22",
    "time_created": "03:30:11",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncgstd",
    "parent_id": "t1_dncghri",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "But didn't Netflix in fact choose to sell the exclusive redistribution rights rather than streaming it themselves? I get it with other media from other creators, but they chose themselves to sell the rights to their own content instead of offering it to their customers? You make it seem like they didn't set it up this way themselves.\n\nOr am I missing something here? Genuinely wondering because to me it just seems like they're purposely fucking over their own customers,  and that seems like the exact shitty service that the above commenters were talking about.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1506094232.0,
    "date_created": "2017-09-22",
    "time_created": "03:30:32",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncc63j",
    "parent_id": "t1_dncbx8r",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Modders are hard at work on it, there will be something close to what Episode 3 would have been within the next few years, I guarantee it.",
    "controversiality": 0,
    "ups": 161,
    "downs": 0,
    "score": 161,
    "created": 1506084030.0,
    "date_created": "2017-09-22",
    "time_created": "00:40:30",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncc1l4",
    "parent_id": "t1_dncbx8r",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I mean the story of episode 3 did get released a couple of weeks ago",
    "controversiality": 0,
    "ups": 57,
    "downs": 0,
    "score": 57,
    "created": 1506083808.0,
    "date_created": "2017-09-22",
    "time_created": "00:36:48",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncifl9",
    "parent_id": "t1_dnchpha",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yes. Movies prices are way too high. It's the only thing I pirate. Spotify for Music, Steam for Games. I just can't bring myself to spend 10 - 20 dollars (5 to rent for 48 hours) on a movie thats 1 1/2 hours that I'll probably never watch again.\n\nYou know when the last time I watched a movie? When google gave me a code to watch any movie for 99 cents. Thats about what any movie is worth to watch. A dollar. That's why you still se Redbox machines even in the golden age of streaming. \n\nThe prices they want though is just too much.\n\nEdit: Also forgot. Movies are the ONLY medium to this day that you can't get at home day one (without pirating). New album drops, you can buy it multiple places online and even stream. Game releases? Same thing. Movies? Ahh shit well you're gonna have to drive you dumb ass out to an overpriced movie theatre. Oh you wanted to own it? Yeah well see you in 6 months.",
    "controversiality": 0,
    "ups": 53,
    "downs": 0,
    "score": 53,
    "created": 1506098922.0,
    "date_created": "2017-09-22",
    "time_created": "04:48:42",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnci4o3",
    "parent_id": "t1_dncddis",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Amazon is getting really good here In the UK. Films are way cheaper to buy in there than on virgin on demand which has a similar catalogue. Other than those or occasionally Netflix I really can't think of where else other than the cinema id buy or watch a film... haven't bought a dvd in years and never bothered with blu ray since I skipped it and went to streaming services.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1506097998.0,
    "date_created": "2017-09-22",
    "time_created": "04:33:18",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnckigw",
    "parent_id": "t1_dnchsoz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Reading this gave me second-hand frustration.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1506105045.0,
    "date_created": "2017-09-22",
    "time_created": "06:30:45",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncho3z",
    "parent_id": "t1_dnchaa0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Isn't slingTV pretty much basic cable on your computer? ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1506096656.0,
    "date_created": "2017-09-22",
    "time_created": "04:10:56",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncirnr",
    "parent_id": "t1_dncdske",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "So $700/year?",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1506099945.0,
    "date_created": "2017-09-22",
    "time_created": "05:05:45",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncfpxg",
    "parent_id": "t1_dncefy6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Amazon service is so rubbish. I pay prime for the next day delivery, so I get the tv with it and I literally can't remember the last time I watched anything on there.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1506091477.0,
    "date_created": "2017-09-22",
    "time_created": "02:44:37",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbchr",
    "parent_id": "t1_dncb0p5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "If I had the option of 20 a month for HBO it'd be a done deal.  But here it's part of a tier package that adds more than 60 a month to an already high 95 a month for cable and internet.",
    "controversiality": 0,
    "ups": 1008,
    "downs": 0,
    "score": 1008,
    "created": 1506082636.0,
    "date_created": "2017-09-22",
    "time_created": "00:17:16",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbga0",
    "parent_id": "t1_dncb0p5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "No kidding.  Funny thing is I could get it cheaper separately, but I pay the extra money for convenience.  ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506082808.0,
    "date_created": "2017-09-22",
    "time_created": "00:20:08",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncd1re",
    "parent_id": "t1_dncccop",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Not sure why they don't just direct-stream individual episodes. I'd easily pay $1 for one GoT episode for example",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1506085673.0,
    "date_created": "2017-09-22",
    "time_created": "01:07:53",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncd86o",
    "parent_id": "t1_dncccop",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Or the whole service crashes when GoT premieres. \n\nBut hey, Murdouche would like to finger point at piracy instead of improving accessibility and product offerings. That is, until said 'piracy' suits his agenda or motives.. [example](http://www.smh.com.au/business/pay-tv-piracy-hits-murdoch-20120327-1vxfw.html)",
    "controversiality": 0,
    "ups": 83,
    "downs": 0,
    "score": 83,
    "created": 1506086029.0,
    "date_created": "2017-09-22",
    "time_created": "01:13:49",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncewgc",
    "parent_id": "t1_dncccft",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "What boggles my mind is that this distribution and piracy problem has already been solved... Music and Video Games for the most part have been through this battle a decade ago and come out the other side just fine. Hell, video game production is even more expensive than movies sometimes.  \n\nI don't understand why film and TV can't catch up with the times. Netflix was a good start but now that keeps hitting roadblocks too with accessibility, location specific content and licensing bullshit etc.... \n\nHere's a fucking awesome example. TV show called Bosch. It's an Amazon show. So as far as I can tell it's owned and produced by Amazon. I got Amazon Prime TV... it's pretty good. Not as big as Netflix but there's other benefits....probably even better if you're in the US. \n\nSo I watch Season 1 and Season 2 earlier this year or late last year. Then Season 3 comes along (I think it was April). I don't use Amazon as often as Netflix so I didn't notice until a few months ago. OK no worries. Jump on and go to watch it.... \"Not available in your country (Australia)\".  WTF?   \nTurns out that instead of keeping their own fucking show on their own service, Amazon sold Season 3 (and only season 3) to SBS which is a local Australian channel. Of course, it's now September and there is zero information on when the season will even air. There's literally no information about what's happening with Season 3 locally, 5 months after the US release. Maybe it's already aired? No idea. And by the way, i had to go hunting for this lack of information since Amazon just says \"not available\" and provide no other explanation.     \n\nSo I can't even pay for a service and watch that service's original content anymore. WTF is the point of paying for it?   \nNeedless to say I've already watched Season 3 through other means. Stop making it so fucking hard to pay you for the product or service that I want!!! ",
    "controversiality": 0,
    "ups": 207,
    "downs": 0,
    "score": 207,
    "created": 1506089576.0,
    "date_created": "2017-09-22",
    "time_created": "02:12:56",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncffk6",
    "parent_id": "t1_dncccft",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's not more clear every day. It has been fucking clear for at least a decade and Steam proved it.\n\n\"I used to pirate games I wanted and now I buy games I don't intend to play.\"\n\nAhaha. Imagine having the knowledge that Steam has presented and STILL FUCK IT UP. That's something you have to respect. This is like the only time \"The customer is always right\" is actually a thing and of course companies that espouse that so their employers have dumps taken on them in pursuit of it are completely unwilling to change.\n\nOF COURSE.\n",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1506090788.0,
    "date_created": "2017-09-22",
    "time_created": "02:33:08",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccsz7",
    "parent_id": "t1_dnccpoa",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Stands for virtual private network and as I understand it, it basically just routes all your internet traffic through a computer or server in another country. This other computer or server is what is picked up when they try and see who you are and it will show them the location of that other machine not yours. Sorry if that's a bad explanation I'm on the shitter",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1506085208.0,
    "date_created": "2017-09-22",
    "time_created": "01:00:08",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncc4zt",
    "parent_id": "t1_dncbxzh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 100,
    "downs": 0,
    "score": 100,
    "created": 1506083975.0,
    "date_created": "2017-09-22",
    "time_created": "00:39:35",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncdc31",
    "parent_id": "t1_dnccley",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And let them see the case for those of us that like to run offline media servers.  When the internet is out and the cable company says it won't be fixed for week, it is nice to be able to still stream movies, but that gets a bit difficult with some of the DRM solutions. ",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1506086243.0,
    "date_created": "2017-09-22",
    "time_created": "01:17:23",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncd8vj",
    "parent_id": "t1_dnccley",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">easy and accessible like Netflix\n\nCouldn't have picked a worse example of easy and accessible. 90% of the good shows/movies Netflix has to offer are region-locked. My country doesn't have shit.",
    "controversiality": 0,
    "ups": 124,
    "downs": 0,
    "score": 124,
    "created": 1506086066.0,
    "date_created": "2017-09-22",
    "time_created": "01:14:26",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnce5hx",
    "parent_id": "t1_dnccley",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Don't forget that if I'm paying for a service, you'd better not be including ads with it.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1506087937.0,
    "date_created": "2017-09-22",
    "time_created": "01:45:37",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncd6rb",
    "parent_id": "t1_dnccney",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It costs money to make demo, and if user doesnt like the demo he will be discouraged from buying the game.",
    "controversiality": 0,
    "ups": 116,
    "downs": 0,
    "score": 116,
    "created": 1506085949.0,
    "date_created": "2017-09-22",
    "time_created": "01:12:29",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncdmcr",
    "parent_id": "t1_dnccney",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "If you try a game and don't like it, then you wont buy it.  \nIf you buy a game a don't like it, they get the money",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1506086815.0,
    "date_created": "2017-09-22",
    "time_created": "01:26:55",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncdblw",
    "parent_id": "t1_dnccney",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Open beta is the new demo.",
    "controversiality": 0,
    "ups": 61,
    "downs": 0,
    "score": 61,
    "created": 1506086218.0,
    "date_created": "2017-09-22",
    "time_created": "01:16:58",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncddmq",
    "parent_id": "t1_dnccney",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> Why do so few games these days have demos?\n\nI have a few theroies. One is it caused a decline in sales. I know personally in the past (many many years ago) I would be excited for the fall releases and start writing a Christmas list. Then I'd get a demo disc or play demos at the store or on my PC and it would cause me to cross games off my list because I didn't like them. \n\nIn the early days of the internet. Less reputable but popular gaming sites would play the demo and write a review based on that and hurt sales. \n\nThe biggest reason I tihnk they're gone is cost, for two sub reasons. \n\nOne - it costs money to make a demo and \n\nTwo -  it cost money to make a demo of a near complete game and ship an actually finished game. \n\nNow it's cheaper to ship an unfinished game to get some incoming revnue and then publish an update.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1506086324.0,
    "date_created": "2017-09-22",
    "time_created": "01:18:44",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncfsi5",
    "parent_id": "t1_dnccv7u",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I agree. Look at Steam. The reason they do well is because they have a fuckton of games from different Publishers. Sure, there's a ton of crap there, but also a lot of gold. So because of that I don't use uPlay and I don't use Origin. I might use uPlay if there's a game I really want that I have to use it for, but I'll never open uPlay in the same way I do with Steam. \n\nIf the Movie boys had any brains they'd pool all their shit to one server and you could pay a one time fee for access to movies or series, or just a Subscription for unlimited access. If I could pay a reasonable price for a movie or series I wanted to watch instead of pirating it, I would. But I'm not gonna buy five different Subscriptions. Then I'll buy the one or two that have the most of what I want and pirate the rest. ",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1506091651.0,
    "date_created": "2017-09-22",
    "time_created": "02:47:31",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncdnzz",
    "parent_id": "t1_dnccuwi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> The only one I see sticking around right now is Disney's. CBS's is gonna flop even with trek, I guarantee it.\n\nThis prediction will come true.  Disney has enough content to hold a decent subscriber base, as long as the price isn't absurd.  CBS and DC do not.",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1506086911.0,
    "date_created": "2017-09-22",
    "time_created": "01:28:31",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnceoyo",
    "parent_id": "t1_dnccuwi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I doubt that'll happen, it'll be used as a counter argument to streaming instead. \"See how bad the service did! Nobody want's this!\"\n\nInstead of making a smaller amount of guaranteed money, they'd rather chance it on proprietary bullshit because they aren't putting much in the way of resources into it anyway. They want the whole pie, even if the whole pie is covered in faeces. Every proprietary streaming service I've used is either buggy as fuck, slow as hell, or has horrible UI.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506089117.0,
    "date_created": "2017-09-22",
    "time_created": "02:05:17",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncfz8y",
    "parent_id": "t1_dnceykn",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Dont forget one that tops it all as is worse than all of them combined.. R* Social Club.\n\nUgh!",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1506092114.0,
    "date_created": "2017-09-22",
    "time_created": "02:55:14",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncgx8b",
    "parent_id": "t1_dnceykn",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> Windows Live\n\n\\#1 reason I've missed whole game series. Secondary account aside from steam? fuck off.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1506094560.0,
    "date_created": "2017-09-22",
    "time_created": "03:36:00",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnchy48",
    "parent_id": "t1_dnceykn",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "God fuck windows live. Can't even get my old games that had it to work now.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1506097453.0,
    "date_created": "2017-09-22",
    "time_created": "04:24:13",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnceldc",
    "parent_id": "t1_dncdwb4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is a very common practice in the industry and a legal version of it is called student edition or something along those lines  \n\nUsually you get full access to the tool / software for 1-3 years and you can practice using that software  \nNow that you know the software you need a job  \nThey will ask you what software you wanna use ( because its cheaper for a company to buy a license instead of learning somebody a new type of software )  \nand you will then continue to use their software  \n  \nPiracy is much the same ",
    "controversiality": 0,
    "ups": 73,
    "downs": 0,
    "score": 73,
    "created": 1506088896.0,
    "date_created": "2017-09-22",
    "time_created": "02:01:36",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncf4lw",
    "parent_id": "t1_dncdwb4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "All I want from Adobe is to be able to pay for an older version of Photoshop for a reduced price. Instead they do all they can to scour every trace of the old versions from the web and I would really rather not have to pirate a copy. They recently switched their products to a subscription model and I refuse to pay it because the price is getting a bit egregious. ",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1506090090.0,
    "date_created": "2017-09-22",
    "time_created": "02:21:30",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncd255",
    "parent_id": "t1_dnccqrl",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> Likely because people want to see the movie in their own homes and the film industry doesn’t provide a way for them to do so until 3-4 months after the movie release in theaters.\n\nI'd be interested in a study that looked into this. I wonder how negatively the theater industry would be hit if you could watch from home the same day it came out at the theater.\n\n>otherwise I’ll keep pirating Rick and Morty because you haven’t figured out a reasonable means to give you money for what you produce\n\nPretty sure you can stream that on adultswim for free. Or you can pay per episode or buy a season on a number of streaming services including youtube, amazon, and others.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1506085693.0,
    "date_created": "2017-09-22",
    "time_created": "01:08:13",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncd3q6",
    "parent_id": "t1_dnccqrl",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Most people only pirate it at home when blu ray is released which is way after the release in theatres",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1506085785.0,
    "date_created": "2017-09-22",
    "time_created": "01:09:45",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccadr",
    "parent_id": "t1_dncbxqi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's mostly a bastion of arguing and pettiness. But there's still a lot of good work that gets done and good facts that come from it. As one of my teachers said, \"science is a process, not a result.\"",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1506084244.0,
    "date_created": "2017-09-22",
    "time_created": "00:44:04",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncijx5",
    "parent_id": "t1_dnch27p",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yes, it is german and translated it means politically incorrect (or political incorrectness... to be honest I never thought about what my name exactly means and in german its written the same way). You are right, that would be the reason I am angry about it.  It's that fear of movies breaking a whole culture that gets me too. How could I pretend to be right if anything like bruce almighty could lead to a revolution in my head. Blood boiling, you are right.\n\nedit within the comment",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1506099289.0,
    "date_created": "2017-09-22",
    "time_created": "04:54:49",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnclh5l",
    "parent_id": "t1_dnck9yt",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I think the next step is the route that Netflix and Tidal have taken.\n\n\nTake your paltry little $10 per month fee and bundle it under a larger service like your phone bill. That's the next step in the arms race and I think it'll relieve pressure on cost for the user.\n\n\nRemember we can still illegally stream with devices like firestick. The moment TV gets to greedy people will go back to shameless piracy because that's what the market will dictate.",
    "controversiality": 0,
    "ups": 109,
    "downs": 0,
    "score": 109,
    "created": 1506107397.0,
    "date_created": "2017-09-22",
    "time_created": "07:09:57",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncphnu",
    "parent_id": "t1_dnck9yt",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It might take a slight hit, but as long as people don't start subscribing to individual network's streams, these companies will revert back to putting their shit on aggregators sites like Netflix when they start hemmoraging money from having to support s service no one is paying for",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1506114497.0,
    "date_created": "2017-09-22",
    "time_created": "09:08:17",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncilxd",
    "parent_id": "t1_dnci3gh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's not exactly good for Steam to be a total monopoly though, with complete control over your entire gaming library. Competition like Origin is ultimately good, even if it is annoying.",
    "controversiality": 0,
    "ups": 96,
    "downs": 0,
    "score": 96,
    "created": 1506099465.0,
    "date_created": "2017-09-22",
    "time_created": "04:57:45",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncibj6",
    "parent_id": "t1_dnci3gh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Well, it's not \"getting over themselves\". All storefronts who use steam have to pay 30% of the sales to Valve. But on their own platform, obviously they don't have to do that. 30% is massive, and clearly because they still use Origin, they've found the few less sales they get because it's not on Steam does not make it worth it to take a 30% fee. ",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1506098584.0,
    "date_created": "2017-09-22",
    "time_created": "04:43:04",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncmkq7",
    "parent_id": "t1_dnci3gh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Shout out to GoG (the guys behind The Witcher 3) for offering only DRM free games.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506109678.0,
    "date_created": "2017-09-22",
    "time_created": "07:47:58",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncmots",
    "parent_id": "t1_dncmiqk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's in a month?",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1506109899.0,
    "date_created": "2017-09-22",
    "time_created": "07:51:39",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnchcl9",
    "parent_id": "t1_dncg97k",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Their cracking down on proxies and VPNs was so harsh. ",
    "controversiality": 0,
    "ups": 87,
    "downs": 0,
    "score": 87,
    "created": 1506095758.0,
    "date_created": "2017-09-22",
    "time_created": "03:55:58",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncgkob",
    "parent_id": "t1_dncg97k",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The Indian one ain't great either, missing latest seasons and useless local shows no one watches",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1506093635.0,
    "date_created": "2017-09-22",
    "time_created": "03:20:35",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnchsb3",
    "parent_id": "t1_dncg97k",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Same in Australia. There is barely anything on it. I only use it for the exclusives really. The number of shows and movies it has has dropped a lot recently",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1506096985.0,
    "date_created": "2017-09-22",
    "time_created": "04:16:25",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnchz4i",
    "parent_id": "t1_dncg97k",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yes it fucking is, I'm back to torrenting now, and considering cancelling. Even the UI is annoying and shit now.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1506097535.0,
    "date_created": "2017-09-22",
    "time_created": "04:25:35",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnch7ht",
    "parent_id": "t1_dncgveg",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Good job MPAA and others in the media mafia then :)",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1506095359.0,
    "date_created": "2017-09-22",
    "time_created": "03:49:19",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncnn7m",
    "parent_id": "t1_dncmutw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> What happens if / when the service dies or closes. You don't get that money back and until then you are at the mercy of any price rises they want to make if you want to maintain access to your collection.\n\nYou're paying for a subscription to the service, not for the songs. If the service dies your \"collection\" will be gone, but you can just subscribe to another service or purchase them on iTunes or whatever. I understand what you mean and your argument is valid for services where you *purchase* digital goods (like Steam), but this doesn't apply to Spotify.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1506111613.0,
    "date_created": "2017-09-22",
    "time_created": "08:20:13",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncfk1r",
    "parent_id": "t1_dncf1pz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "At least you get YouTube Red for free with a Google play subscription",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506091084.0,
    "date_created": "2017-09-22",
    "time_created": "02:38:04",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncibqh",
    "parent_id": "t1_dncg0bs",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Absolutely, as a kid the most expensive games I could afford where €15 and that was considered a big expenditure by me. You have a limited budget for media, as a kid this budget wouldn't increase if I stopped pirating games I would have just stuck with my cheap old titles. (Which I got anyway)\n\nNow I'm 24, I can't remember the last time I have pirated a game. I did pirate the latest season of GoT, but that's because it's literally not available in my country unless you take an expensive subscription with a specific cable tv provider. I'm not switching to cable tv for a few hundred euros per year to watch one single show. (A decision I couldn't make anyway, my landlord decided which tv package I got)\n",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1506098601.0,
    "date_created": "2017-09-22",
    "time_created": "04:43:21",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncjgzt",
    "parent_id": "t1_dncg0bs",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "*\"Hey, Dr Jre, would you like this chocolate bar?\"*\n\n\"Sure! Thanks Wizard\"\n\n*\"...That'll be five dollars.\"*\n\n\"Oh, well maybe I won't then...\"\n\n\n\n\nPiracy cannot be 1:1 lost sales because the value is **totally** different",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1506102096.0,
    "date_created": "2017-09-22",
    "time_created": "05:41:36",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncegph",
    "parent_id": "t1_dnce2bq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It'll never drop to $25.00 on steam ",
    "controversiality": 0,
    "ups": 152,
    "downs": 0,
    "score": 152,
    "created": 1506088609.0,
    "date_created": "2017-09-22",
    "time_created": "01:56:49",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnceslo",
    "parent_id": "t1_dnce2bq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Steam doing god's work to make sure you don't spend your hard earn money on regurgitated shit.",
    "controversiality": 0,
    "ups": 58,
    "downs": 0,
    "score": 58,
    "created": 1506089340.0,
    "date_created": "2017-09-22",
    "time_created": "02:09:00",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbxka",
    "parent_id": "t1_dncbkb5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Haha I read that add World of Wanks and thought \"I might have to play a very short session\"",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1506083614.0,
    "date_created": "2017-09-22",
    "time_created": "00:33:34",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnch7iq",
    "parent_id": "t1_dncgsji",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I totally agree. I am just providing a perspective on the other side.  ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1506095360.0,
    "date_created": "2017-09-22",
    "time_created": "03:49:20",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncjnov",
    "parent_id": "t1_dncgsji",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You should care and push for EU wide reform.\n\nPlease, people, be more politically active! ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1506102665.0,
    "date_created": "2017-09-22",
    "time_created": "05:51:05",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccusr",
    "parent_id": "t1_dncc63j",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "!RemindMe 3 years This dude better deliver.",
    "controversiality": 0,
    "ups": 86,
    "downs": 0,
    "score": 86,
    "created": 1506085302.0,
    "date_created": "2017-09-22",
    "time_created": "01:01:42",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncct95",
    "parent_id": "t1_dncc1l4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I've not really kept that up to date with half life news. Has he ever so far said any reason why there won't be a HL3 in the foreseeable future? ",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1506085223.0,
    "date_created": "2017-09-22",
    "time_created": "01:00:23",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccqpv",
    "parent_id": "t1_dncc1l4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[There's still hope, but perhaps not for HL2e3](https://www.youtube.com/watch?v=h3m7Oc08Ur0)",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1506085092.0,
    "date_created": "2017-09-22",
    "time_created": "00:58:12",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnco02i",
    "parent_id": "t1_dncifl9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "On the other hand I want to see it in best quality available and nothing can top the big screen. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1506112216.0,
    "date_created": "2017-09-22",
    "time_created": "08:30:16",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncm5fr",
    "parent_id": "t1_dncirnr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Compared to cable that's still not that bad. Plus amazon prime is worth it IMO even without the streaming. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506108831.0,
    "date_created": "2017-09-22",
    "time_created": "07:33:51",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncfxhj",
    "parent_id": "t1_dncfpxg",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Nahhh man Prime's got some good shit. Just scanning the main Prime page: Moonlight, The Wire, Mr. Robot, Veep, Curb, Transparent, The Americans, Almost Famous, Chef, Creed, Superbad, Man in the High Castle, Manchester by the Sea, Sicario, Inside Llewyn Davis, The Sopranos, Orphan Black, Hannibal, Eastbound and Down...\n\nAmazon's kinda killin it",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1506091994.0,
    "date_created": "2017-09-22",
    "time_created": "02:53:14",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncblul",
    "parent_id": "t1_dncbchr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Are you able to access HBO NOW? (Wasn't yelling... The app is in all caps). It's like $10 or $15 per month, no cable subscription necessary. ",
    "controversiality": 0,
    "ups": 474,
    "downs": 0,
    "score": 474,
    "created": 1506083062.0,
    "date_created": "2017-09-22",
    "time_created": "00:24:22",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbs2d",
    "parent_id": "t1_dncbchr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "$20/mo is crazy even for HBO, IMO.  Netflix has several top quality new shows, and tons of older ones, and is $10/month.",
    "controversiality": 0,
    "ups": 95,
    "downs": 0,
    "score": 95,
    "created": 1506083352.0,
    "date_created": "2017-09-22",
    "time_created": "00:29:12",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncf2j0",
    "parent_id": "t1_dncd1re",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "If they ever made GoT available for direct stream, they'd charge you $5 per episode.",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1506089956.0,
    "date_created": "2017-09-22",
    "time_created": "02:19:16",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccwjq",
    "parent_id": "t1_dnccsz7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Much appreciated, enjoy the shit.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1506085397.0,
    "date_created": "2017-09-22",
    "time_created": "01:03:17",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncgroe",
    "parent_id": "t1_dnccsz7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Great job. That's spot on. VPNs can also be used to make your computer virtually *in* someone else's network. Like your work's/office's network while you're at home. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506094147.0,
    "date_created": "2017-09-22",
    "time_created": "03:29:07",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncccvz",
    "parent_id": "t1_dncc4zt",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Because the big 4 lobbied to the CRTC to forbid any outside investors from entering the communications sector. \n\nWe are stuck with the corp's telling us \" the customer only needs xxx for service \" and have to like it. \n",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1506084371.0,
    "date_created": "2017-09-22",
    "time_created": "00:46:11",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncdvx1",
    "parent_id": "t1_dncd8vj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I don't think that's Netflix's fault. That's the companies that own the licenses not allowing Netflix to use their content in your country.",
    "controversiality": 0,
    "ups": 94,
    "downs": 0,
    "score": 94,
    "created": 1506087362.0,
    "date_created": "2017-09-22",
    "time_created": "01:36:02",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncgdxe",
    "parent_id": "t1_dncd6rb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> if user doesnt like the demo he will be discouraged from buying the game.\n\nIt sounds to me like that user wouldn't have liked the full game either...",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1506093150.0,
    "date_created": "2017-09-22",
    "time_created": "03:12:30",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnceoyf",
    "parent_id": "t1_dncd6rb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Probably has something to do with preorders as well. Most games cover their development budget through it, so why bother making the demo.",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1506089117.0,
    "date_created": "2017-09-22",
    "time_created": "02:05:17",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncdzgj",
    "parent_id": "t1_dncdblw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "pre-ordering is the new new demo.",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1506087572.0,
    "date_created": "2017-09-22",
    "time_created": "01:39:32",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncfk37",
    "parent_id": "t1_dncdblw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Like the Destiny 2 \"beta\" which was nothing at all like the actual game they were \"beta testing\" but was exactly what you'd expect a demo to be.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506091087.0,
    "date_created": "2017-09-22",
    "time_created": "02:38:07",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncjcfb",
    "parent_id": "t1_dncfsi5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Exactly. They're using exclusivity to get people to subscribe to their streaming services, while completely ignoring the fact that pretty much every other streaming service out there is also hinging on exclusivity. The end result is that people have to subscribe to a dozen different services if they want to see a specific movie/serie. What happens instead is that people will subscribe to one or two services that have the most extensive qualilty library, along with some very popular exclusives. Anything that isn't available through the services they're subscribed to, they'll pirate. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1506101711.0,
    "date_created": "2017-09-22",
    "time_created": "05:35:11",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncghav",
    "parent_id": "t1_dncf4lw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The problem is that similar to college textbooks, the base tools are all there, which would make it largely worthless to ever buy the newest versions of photoshop and they make most of their money from businesses that must upgrade to maintain legality.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1506093391.0,
    "date_created": "2017-09-22",
    "time_created": "03:16:31",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncele2",
    "parent_id": "t1_dncd255",
    "subreddit_name_prefixed": "r/worldnews",
    "body": " >Pretty sure you can stream that on adultswim for free. Or you can pay per episode or buy a season on a number of streaming services including youtube, amazon, and others. \n\nNot if you're not American. In fact, there's fuck all you can do if you're not American. \n\n*Some* countries get S3 episodes on Netflix on a week's delay, but not all of them. As a German, I'm shit out of luck if I want to watch new S3 episodes legally - can't legally stream them, can't watch them on Netflix, can't even buy them on YouTube or Amazon (because of region lock). Piracy is *literally* my only option.  ",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1506088897.0,
    "date_created": "2017-09-22",
    "time_created": "02:01:37",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncercf",
    "parent_id": "t1_dncd255",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Or are we at the point with home theaters being what they are that maybe we could just go with a much smaller theater industry?  Nothing says that they have to go on existing.  Drive in theaters mostly died out across the country, if people prefer to watch movies at home, maybe people that make and distribute movies should adapt and make that the first run option.\n\nNo one industry is entitled to forever continuing and growing profits and existence. ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1506089262.0,
    "date_created": "2017-09-22",
    "time_created": "02:07:42",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnco8o1",
    "parent_id": "t1_dnclh5l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah it's completely true you know - I've torrented more in the last year than I have for 5-8 years - because - Netflix is haemorrhaging content and I'm not signing up for Netflix, amazon, hbo, etc, etc. \n\nThey need to work out mutually beneficial way to get us to sign up for one service and give access to everything. Even if it costs a dollar more a month across millions of subscribers to do it; people will not shy away from that kind of user experience. ",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1506112608.0,
    "date_created": "2017-09-22",
    "time_created": "08:36:48",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncmlei",
    "parent_id": "t1_dncilxd",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "GoG.com is where your money should go.  DRM free.",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1506109716.0,
    "date_created": "2017-09-22",
    "time_created": "07:48:36",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnciy78",
    "parent_id": "t1_dncilxd",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah just look at Steam's customer support vs Origin's...\n\n",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1506100485.0,
    "date_created": "2017-09-22",
    "time_created": "05:14:45",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncn7h6",
    "parent_id": "t1_dncilxd",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "GOG is the best competition to steam, old games, no DRM, if I buy a multiplayer game that's usually where I get it so I can install it on my second PC so friends can use it.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1506110866.0,
    "date_created": "2017-09-22",
    "time_created": "08:07:46",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncnv8w",
    "parent_id": "t1_dncmots",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "3 months / 1 season. This was their introduced \"special pricing\" to fight piracy. So it was $25 month for the subscription plus $10 month for the Drama channel which it was on.\n\nThen there was a connection fee which also added hurdles. Our internet at the time was notoriously bad (in part because Foxtel, the only pay tv company in Australia, and specifically Rupert Murdoch, saw fast internet as a direct challenge). - If your internet was fast enough great, get Foxtel Go (online Foxtel). If not, it was over the air, which required a satallite dish to be installed for more $$$.\n\nAnd if you go back further, to say 2014, it was even worse:\n\n> You’ll need to pony up a cool $47 per month for Foxtel’s essentials package, plus another $25 a month for Foxtel’s Movies and Premium Drama offering.\n\nAnd again, PLUS connection fee.\n\nIt's not as bad now. Foxtel have a streaming service which is markedly cheaper, our internet is faster (still sucks, just sucks less), and the price is more realistic.\n\n**tl;dr**\n\nWay expensive in the past. Expensive now, but not as terrible.\n",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1506111990.0,
    "date_created": "2017-09-22",
    "time_created": "08:26:30",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnchgt1",
    "parent_id": "t1_dnchcl9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "We never got around to trying a VPN service because paying extra seemed insane, but it sucks that like for example there's still only one season of crazy ex girlfriend on Netflix Germany. Amazon is even worse in that it *always* goes back to the default German audio track, so you have to change the settings every time you start the next episode of a show. ",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1506096086.0,
    "date_created": "2017-09-22",
    "time_created": "04:01:26",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnche8x",
    "parent_id": "t1_dncgkob",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "American Netflix has tons of Indian content. ",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1506095887.0,
    "date_created": "2017-09-22",
    "time_created": "03:58:07",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncfqsj",
    "parent_id": "t1_dncfk1r",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah, but I don't think Red is worth 5$ extra. \n\nAs a student I have to nickle and dime shit ;)",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1506091535.0,
    "date_created": "2017-09-22",
    "time_created": "02:45:35",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncfr2x",
    "parent_id": "t1_dnceslo",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I really wish there was a way to just pay a nominal fee to play the campaign.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1506091555.0,
    "date_created": "2017-09-22",
    "time_created": "02:45:55",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnck9lt",
    "parent_id": "t1_dncjnov",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I get the content either way. It's on Netflix to sell it to me.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1506104401.0,
    "date_created": "2017-09-22",
    "time_created": "06:20:01",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncdvcq",
    "parent_id": "t1_dnccusr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Preemptive pitchfork gathering?  It'll be three years but time flies when you're angry!",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1506087328.0,
    "date_created": "2017-09-22",
    "time_created": "01:35:28",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncdkfe",
    "parent_id": "t1_dncct95",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "They said there wouldn't be an episode 3 a long time ago, they're jumping straight to Half-Life 3, meaning this story was originally for EPISODE 3, not their next installment. The guy who released the story hasn't worked at Valve for a while now. None of the people who worked on the Half-Life series are. That's why it's been in development hell.",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1506086706.0,
    "date_created": "2017-09-22",
    "time_created": "01:25:06",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncs5kq",
    "parent_id": "t1_dnco02i",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Paying for the facility and experience.  Some people value that and others don't.  Still would like to see something in home though to \"rent\" when a new movie is released.  That will never happen though because people will be able to record it somehow themselves.  It will then become more easily to distribute high quality copies of the new movie for free to the pirates...unless of course, its reasonably priced and would entice a more broad audience to \"rent\" the new release. Hmm..",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1506117934.0,
    "date_created": "2017-09-22",
    "time_created": "10:05:34",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncmnp6",
    "parent_id": "t1_dncm5fr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "If you think it's worth it then that's all that matters. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506109840.0,
    "date_created": "2017-09-22",
    "time_created": "07:50:40",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbnzn",
    "parent_id": "t1_dncblul",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Not in Canada buddy",
    "controversiality": 0,
    "ups": 833,
    "downs": 0,
    "score": 833,
    "created": 1506083160.0,
    "date_created": "2017-09-22",
    "time_created": "00:26:00",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbuqj",
    "parent_id": "t1_dncblul",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Perhaps through a VPN? They're super cheap these days.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1506083479.0,
    "date_created": "2017-09-22",
    "time_created": "00:31:19",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbu9y",
    "parent_id": "t1_dncbs2d",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "But they lose rights to shows all the time, which is a huge drag. Tons of shows and movies that were once on Netflix, no longer are.",
    "controversiality": 0,
    "ups": 115,
    "downs": 0,
    "score": 115,
    "created": 1506083456.0,
    "date_created": "2017-09-22",
    "time_created": "00:30:56",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncfa15",
    "parent_id": "t1_dncf2j0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Per day",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506090431.0,
    "date_created": "2017-09-22",
    "time_created": "02:27:11",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccord",
    "parent_id": "t1_dncccvz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Multimedia prices such as mobile plans, cable plans and internet plans are the biggest ripoffs in Canada. The taxes are fucking bad too but there are other countries with high tax. The monopoly in the multimedia space by the big 4 is a total ripoff. You goto any other country and cable/internet/mobile plans have all gone down in price meanwhile in canada it keeps going up.",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1506084986.0,
    "date_created": "2017-09-22",
    "time_created": "00:56:26",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnceu07",
    "parent_id": "t1_dncdvx1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "well... back to pirating...\n\n",
    "controversiality": 0,
    "ups": 120,
    "downs": 0,
    "score": 120,
    "created": 1506089429.0,
    "date_created": "2017-09-22",
    "time_created": "02:10:29",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncf9gt",
    "parent_id": "t1_dncdvx1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Even if that's true, it doesn't change the end result for many people.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1506090394.0,
    "date_created": "2017-09-22",
    "time_created": "02:26:34",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncguo3",
    "parent_id": "t1_dncgdxe",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yes, but I think it's very likely that the chance of user not buying the game is much higher than him going through the hassle of refunding it after he already bought it. Especially if the game isn't bad, but it's somewhere in the middle in terms of quality.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1506094369.0,
    "date_created": "2017-09-22",
    "time_created": "03:32:49",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncp0jo",
    "parent_id": "t1_dnco8o1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 47,
    "downs": 0,
    "score": 47,
    "created": 1506113811.0,
    "date_created": "2017-09-22",
    "time_created": "08:56:51",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnckjtj",
    "parent_id": "t1_dnciy78",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It says something about the quality of Steam that they can have the world's shittiest customer service (not counting ISPs, they just straight up have no customer service) and still be the go-to platform for PC games.",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1506105143.0,
    "date_created": "2017-09-22",
    "time_created": "06:32:23",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnco5on",
    "parent_id": "t1_dncnv8w",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Hell, I was paying $200/ month Canadian for my net/ cable and that still didn't include hbo.  That would have been another $20 or so for that package.  ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506112472.0,
    "date_created": "2017-09-22",
    "time_created": "08:34:32",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncho5m",
    "parent_id": "t1_dnche8x",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The irony.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1506096659.0,
    "date_created": "2017-09-22",
    "time_created": "04:10:59",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncgilb",
    "parent_id": "t1_dncfqsj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Go a family plan with a few mates. Works out pretty good. You and 5 mates, works out to $2.50 each. I use it solely for Youtube red, it's amazing. Do this with both google play and spotify.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1506093485.0,
    "date_created": "2017-09-22",
    "time_created": "03:18:05",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncfee4",
    "parent_id": "t1_dncdvcq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Only 2 years, 364 days, 23 hours, and 2 minutes left for them to finish! *WILL THEY MAKE IT?!*",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1506090710.0,
    "date_created": "2017-09-22",
    "time_created": "02:31:50",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncepn8",
    "parent_id": "t1_dncdkfe",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You mean thats why it isnt coming.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1506089159.0,
    "date_created": "2017-09-22",
    "time_created": "02:05:59",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncc3al",
    "parent_id": "t1_dncbnzn",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The worst part of being Canadian...not being able to use 'America only' shit.\n\nedit \"usa\"",
    "controversiality": 0,
    "ups": 490,
    "downs": 0,
    "score": 490,
    "created": 1506083891.0,
    "date_created": "2017-09-22",
    "time_created": "00:38:11",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncbt8o",
    "parent_id": "t1_dncbnzn",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I have it on very good authority that signing up for streaming of hbo has never been easier!\n\nThe one thing they forgot at the end of that letter was a /S or trollface",
    "controversiality": 0,
    "ups": 48,
    "downs": 0,
    "score": 48,
    "created": 1506083407.0,
    "date_created": "2017-09-22",
    "time_created": "00:30:07",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncc5q2",
    "parent_id": "t1_dncbuqj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Unless it can tell you're using a VPN and locks you out like Netflix does now.\n\n\nThat, and if I'm going to be paying for a VPN just so I can circumvent geoblocking to pay for your fucking service, I'm probably just gonna download it. \"Shut up and take my money!\"",
    "controversiality": 0,
    "ups": 89,
    "downs": 0,
    "score": 89,
    "created": 1506084013.0,
    "date_created": "2017-09-22",
    "time_created": "00:40:13",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccf02",
    "parent_id": "t1_dncbu9y",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This. I'm very close to unsubbing after they took away Peep Show, South Park and most episodes of Bob's Burgers and Futurama. Also so much stuff on Netflix is straight up filler garbage. If they ever take away PandR and The Office, I will flip two shits.\n\nHBO NOW is also $15 in the U.S. ",
    "controversiality": 0,
    "ups": 84,
    "downs": 0,
    "score": 84,
    "created": 1506084478.0,
    "date_created": "2017-09-22",
    "time_created": "00:47:58",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncp8hq",
    "parent_id": "t1_dncp0jo",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "just like how the Best Buy's in my city price S1 and S2 of GoT for $70 on blue ray... .yet S3, 4, and 5 are $50.... wtf",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1506114134.0,
    "date_created": "2017-09-22",
    "time_created": "09:02:14",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncndel",
    "parent_id": "t1_dnckjtj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Or it says that the publishers don't give a shit about the customer experience, put their titles on Steam and the buyers just have to get on with it",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1506111154.0,
    "date_created": "2017-09-22",
    "time_created": "08:12:34",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccgw5",
    "parent_id": "t1_dncc3al",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"We are coming to Canada for our once in a life time tour\"\n\n*checks location and only sees Toronto*",
    "controversiality": 0,
    "ups": 534,
    "downs": 0,
    "score": 534,
    "created": 1506084574.0,
    "date_created": "2017-09-22",
    "time_created": "00:49:34",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccnng",
    "parent_id": "t1_dncc3al",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's weird--we get American cable TV, American movies, American books...we're saturated in American culture, but then some things are arbitrarily kept out of our grasp. Why?\n\n-----\n\n(Yes, I know the reason is \"because copyright laws are antiquated and byzantine\". I'm not naive, I'm just saying it's weird that these obstacles are easily overcome for most things, but not certain things.)",
    "controversiality": 0,
    "ups": 192,
    "downs": 0,
    "score": 192,
    "created": 1506084928.0,
    "date_created": "2017-09-22",
    "time_created": "00:55:28",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccg4q",
    "parent_id": "t1_dncc3al",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Do vpn not work?",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1506084537.0,
    "date_created": "2017-09-22",
    "time_created": "00:48:57",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnccpvy",
    "parent_id": "t1_dncc3al",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Canada's television sucks honestly. And prices for cable and internet are so high because everything is basically controlled by Rogers and Bell. I don't remember the last time I watched TV. I just use either YouTube, or some free movie/tv websites. Connect it to a TV and boom. Free entertainment on the big screen!",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1506085046.0,
    "date_created": "2017-09-22",
    "time_created": "00:57:26",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncc84j",
    "parent_id": "t1_dncc3al",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I don't know man.  All our free healthcare and general way of life is really making me feel like a good for nothing socialist.",
    "controversiality": 0,
    "ups": 162,
    "downs": 0,
    "score": 162,
    "created": 1506084132.0,
    "date_created": "2017-09-22",
    "time_created": "00:42:12",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncczrd",
    "parent_id": "t1_dncc3al",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "There is a free VPN extension for chrome that lets you change what country it thinks you're in.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1506085569.0,
    "date_created": "2017-09-22",
    "time_created": "01:06:09",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncd4cc",
    "parent_id": "t1_dnccf02",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I cancelled in may because of this. The Aussie catalogue is shit because it is mainly filler ",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1506085819.0,
    "date_created": "2017-09-22",
    "time_created": "01:10:19",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncd6en",
    "parent_id": "t1_dnccf02",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Netflix was basically a $10 a month subscription that allowed me to watch Scrubs on endless repeat every evening before bed.   Seriously, I've seen every episode of every season dozens of times.   I was super bummed when they got rid of it.  ",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1506085929.0,
    "date_created": "2017-09-22",
    "time_created": "01:12:09",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dncf1m2",
    "parent_id": "t1_dnccf02",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I unsubbed the moment they blocked you from using a vpn. There is like 50% available in my country compared to the us. Just so happened to be that everything I want to watch is in the 50% we don't have. Instant unsub the moment they blocked it. I use other streaming sites.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1506089899.0,
    "date_created": "2017-09-22",
    "time_created": "02:18:19",
    "submission_id": "worldnews-71nmck"
  },
  {
    "id": "dnceaay",
    "parent_id": "t1_dnccf02",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Wow I hadn't noticed that Bob's Burgers was gone, that really sucks. Only time I noticed shit disappear was when I couldn't watch Code Lyoko, Doctor Who, and Avatar: The Last Airbender.\n\nHonestly, it's getting really annoying. They hiked the price up but they keep losing content to other streaming services like Amazon, Hulu, and Crunchyroll. I got netflix so I could just chill and watch shit, but if it keeps getting removed what's the point? You already have to wait a shitload of time for a shows season to update on it, and while that isn't really their fault, it's making me a bit jaded about the service as a whole.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1506088224.0,
    "date_created": "2017-09-22",
    "time_created": "01:50:24",
    "submission_id": "worldnews-71nmck"
  }
]