[
  {
    "id": "cudu8gz",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Twitter has a lot of problems internally. ",
    "controversiality": 0,
    "ups": 7061,
    "downs": 0,
    "score": 7061,
    "created": 1440450628.0,
    "date_created": "2015-08-24",
    "time_created": "09:10:28",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxydj",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Developer here.  Never use the Twitter api \n\nIf you have a chance to integrate with them, avoid it.\n\nThey have really nice free Apis and try to seem generous with their data but the second you try to launch anything with it, they ask for $10k per month to license their data.\n\nIt's a total joke.   They are selling the content at this point and not just the technical effort involved in getting it to you.  Beware.",
    "controversiality": 0,
    "ups": 1525,
    "downs": 0,
    "score": 1525,
    "created": 1440457793.0,
    "date_created": "2015-08-24",
    "time_created": "11:09:53",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudvagk",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "What was their method of archiving? Are screenshots not viable options?\n\nForgive me, I do not do The Twitter.\n\nEdit: Well! TIL how to be a HACKER!",
    "controversiality": 0,
    "ups": 1137,
    "downs": 0,
    "score": 1137,
    "created": 1440452903.0,
    "date_created": "2015-08-24",
    "time_created": "09:48:23",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudvn5v",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I wrote this up people who are confused about the websites worked and how they were shut down. Please feel to correct me if I'm wrong. \n\n---\n\nTwitter let those sites use their API, where the site's bots then crawled the pages of politicians and accounting for all their tweets. If a tweet was deleted, they would post the text up and the politician who posted it up on the site. \n\nHowever, Twitter shut them down by closing off their API access, making it virtually impossible to do what they had been doing before. They shut off the API access because they violated the ToS, which was that they couldn't display deleted tweets. \n\nAgain, please feel free to expand on this or to correct me if I'm wrong in any way!\n\nEdit: I doubt that the sites used screenshots, because screenshots are less trustworthy as they're easier to fake, so it probably was a text archive with time stamps, including who tweeted it and when. \n",
    "controversiality": 0,
    "ups": 401,
    "downs": 0,
    "score": 401,
    "created": 1440453600.0,
    "date_created": "2015-08-24",
    "time_created": "10:00:00",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudvipx",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Politicians deserve no special protection beyond that of the average Twitter user. If you done fucked up you done fucked up.",
    "controversiality": 0,
    "ups": 2272,
    "downs": 0,
    "score": 2272,
    "created": 1440453360.0,
    "date_created": "2015-08-24",
    "time_created": "09:56:00",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudvfoh",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This should spark much more outrage than it seems to be sparking. ",
    "controversiality": 0,
    "ups": 2908,
    "downs": 0,
    "score": 2908,
    "created": 1440453191.0,
    "date_created": "2015-08-24",
    "time_created": "09:53:11",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxdn0",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[Twitter API Developer Agreement](https://dev.twitter.com/overview/terms/agreement-and-policy)\n\n>3.b. Take all reasonable efforts to do the following, provided that when requested by Twitter, you must promptly take such actions:\nDelete Content that Twitter reports as deleted or expired;\n\nI don't think they were a bad site, but they *were* breaking the agreement, so Twitter has every right to revoke their access.",
    "controversiality": 0,
    "ups": 107,
    "downs": 0,
    "score": 107,
    "created": 1440456814.0,
    "date_created": "2015-08-24",
    "time_created": "10:53:34",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudy6eo",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is hilarious coming from The Verge. They shut down their comment section, when people started to point out how bad their articles where on certain topics.\n\nhttp://www.theverge.com/2015/7/6/8901115/were-turning-comments-off-for-a-bit\n\nThey tried to blame the hostility on Gamergate: in reality, the people that don't even care about Gamergate were voicing opinions on how shoddy their journalism was.",
    "controversiality": 0,
    "ups": 55,
    "downs": 0,
    "score": 55,
    "created": 1440458171.0,
    "date_created": "2015-08-24",
    "time_created": "11:16:11",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudvfxm",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"Forced?\"\nNo, they dind't force anything.\n\nThey simply blocked them from using their API, because they violated the TOS.  \n\nThe twitter API TOS forbids using it to track and display deleted tweets.\n",
    "controversiality": 0,
    "ups": 525,
    "downs": 0,
    "score": 525,
    "created": 1440453205.0,
    "date_created": "2015-08-24",
    "time_created": "09:53:25",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxcv7",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Not honoring deletes is a violation of Twitter's TOS, and this isn't the first time Twitter has been stingy with their API access.",
    "controversiality": 0,
    "ups": 71,
    "downs": 0,
    "score": 71,
    "created": 1440456776.0,
    "date_created": "2015-08-24",
    "time_created": "10:52:56",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxrh6",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Am I the only one who doesn't see this as a big deal? Everyone has the right to delete posts on the internet, even politicians. The 3rd party sites archiving the data circumvent a Twitter feature. I'm not surprised Twitter shut it down. \n\nIf a particular tweet is relevant, it will be in the media or retweeted enough that it doesn't matter if the original has been deleted. ",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1440457470.0,
    "date_created": "2015-08-24",
    "time_created": "11:04:30",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudvgow",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Twitter right now http://i.imgur.com/kBSnyHk.gif",
    "controversiality": 0,
    "ups": 149,
    "downs": 0,
    "score": 149,
    "created": 1440453246.0,
    "date_created": "2015-08-24",
    "time_created": "09:54:06",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue0asn",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I am sure this is going to be buried but I want to offer my knowledge of having worked with Twitter's and other social networks APIs and have read those boring Terms of Service rules.\n\nFirst off APIs provide an official backdoor for third parties to obtain information from a site about you, most of these are heavily regulated and generally require your authorization in order to obtain that information. Some sites, like Twitter, make all their public activities, in this case tweets, available without authorization. \n\nHowever under the terms of service in using Twitter's, and most others, when an application using the API is notified that an item was deleted they must also remove it from their system.This is where these sites got into trouble and the \"internal debate\" at Twitter took place. Under the terms this means that when a politician deleted a tweet, these site must also remove the tweet, which they don't because their whole purpose is to prevent this for politicians.\n\nThis rule requiring applications to delete tweets is blanket and applies to all Twitter accounts including yours. The spirit of this rule is to try and prevent that tweet you mistakenly made from being stuck out there and you can never take it back. So the debate at Twitter was, should this rule exclude politicians? And judging by the result it was no. With this decision these archiving sites were in violation of Twitter's terms of service, so their API access was revoked and were most likely sent DMCA requests to remove what tweets they had already copied since all tweets are technically copyrighted by Twitter thus shutting down the sites.\n\nWhether or not you agree with Twitter's decision to not classify politicians accounts as exclusions to the deletion rule, Twitter's goal is to protect its users' right to privacy.\n\nOn a side note I have seen people mention that these sites could switch to web crawling to obtain these tweets. The answer is no they could not, probably. This comes back to tweets being copyrighted materials of Twitter, meaning they could make the case that by archiving the tweets without Twitter's permission they are violating the DMCA. Although the sites could argue that they are using the tweets in a review or editorial fashion thus excluding them from the DMCA. It would be an issue settled in court and who knows who would win.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1440461604.0,
    "date_created": "2015-08-24",
    "time_created": "12:13:24",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx2jd",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">\"Imagine how nerve-racking — terrifying, even — tweeting would be if it was immutable and irrevocable?\"\n\nMaybe don't post shit to the web that would cause these feelings, dingus.",
    "controversiality": 0,
    "ups": 93,
    "downs": 0,
    "score": 93,
    "created": 1440456262.0,
    "date_created": "2015-08-24",
    "time_created": "10:44:22",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudw5os",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">keep politicians honest\n\n-\n\n>keep\n\nlol",
    "controversiality": 0,
    "ups": 70,
    "downs": 0,
    "score": 70,
    "created": 1440454596.0,
    "date_created": "2015-08-24",
    "time_created": "10:16:36",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx502",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Am I the only one who thinks there is nothing wrong with Twitter doing this? I mean deleted tweets are meant to be deleted. If Twitter want to make it so their delete button actually works then they need to do things like this. Otherwise they will lose customers who know that no matter what they say it will be there forever and don't want to risk it.",
    "controversiality": 0,
    "ups": 72,
    "downs": 0,
    "score": 72,
    "created": 1440456384.0,
    "date_created": "2015-08-24",
    "time_created": "10:46:24",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue2eis",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Cutting off API Access != \"shut down the site\"\n\nIt may temporarily disable their ability to get data from Twitter, but in no way equates to \"shutting them down\".....",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440464868.0,
    "date_created": "2015-08-24",
    "time_created": "13:07:48",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudv8r9",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Twitter gettin paid!",
    "controversiality": 0,
    "ups": 155,
    "downs": 0,
    "score": 155,
    "created": 1440452809.0,
    "date_created": "2015-08-24",
    "time_created": "09:46:49",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxyfr",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I don't blame Twitter at all. If an agreement on them posting the deleted tweets was made beforehand (which, by this article, looks like it wasn't), then it would be controversial to shut down their API access just like that. But they basically exploited the API access and violated someone's privacy and freedom of voice (politicians need that as well).  \nAlthough I do agree that it is an effective tool to keep politicians honest, Twitter has every right to revoke their access as long as no legal contract on the deleted tweets policy was signed.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440457796.0,
    "date_created": "2015-08-24",
    "time_created": "11:09:56",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue2czo",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "From /u/Browsing_From_Work:\n\n> This is exactly the case. They can't force these sites to shut down, but they can ban them from using Twitter's API which effectively neuters them.\n\n> Last time this flared up[1] , Twitter pointed to their developer agreement and policy[2] which explicitly states:\n\n> I.2.f Only surface Twitter activity as it surfaced on Twitter. For example, your Service should execute the unfavorite and delete actions by removing all relevant Content, not by publicly displaying to other users that the Tweet is no longer favorited or has been deleted.\n\n> Making a site dedicated to pointing out that certain tweets are deleted goes directly against that policy.\n\n> So why not gather the tweets manually and copy/paste them?\n\n> Again, the Terms of Service[3] :\n\n> 8. Except as permitted through the Twitter Services, these Terms, or the terms provided on dev.twitter.com, you have to use the Twitter API if you want to reproduce, modify, create derivative works, distribute, sell, transfer, publicly display, publicly perform, transmit, or otherwise use the Twitter Services or Content on the Twitter Services.\n\n> Everybody has these protections, not just politicians.\n\n> If you see a violation, you can report it[4] .",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440464801.0,
    "date_created": "2015-08-24",
    "time_created": "13:06:41",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cueesqe",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "0000",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1440483891.0,
    "date_created": "2015-08-24",
    "time_created": "18:24:51",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxc6x",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "As another commenter mentions, they do this for everyone, not just politicians. Who are people too.",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1440456742.0,
    "date_created": "2015-08-24",
    "time_created": "10:52:22",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue9tyn",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440476145.0,
    "date_created": "2015-08-24",
    "time_created": "16:15:45",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cueazn6",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Twitter either was threatened or paid off (or they are sucking up)  to do this and if you can and/or could check far and deep enough you just know some heavy weight politicians were behind it.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440477870.0,
    "date_created": "2015-08-24",
    "time_created": "16:44:30",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuebdgn",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">Imagine how nerve-racking — terrifying, even — tweeting would be if it was immutable and irrevocable?\n\nHow about, in this digital age, think twice before posting something to the internet? How about that?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440478425.0,
    "date_created": "2015-08-24",
    "time_created": "16:53:45",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cueefsh",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Wouldn't want politicians to have to be accountable for their own fucking words now would we...",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440483279.0,
    "date_created": "2015-08-24",
    "time_created": "18:14:39",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cueeky8",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm just gonna write a script that polls politician's twitter every few minutes and loads every new tweet into a database and publish that database online and make an app that does nothing but display records from that database.  That way it won't matter if you can't query deleted tweets - I'll have saved it before it even got deleted.  Then write a query to cross reference available tweets with my database to instantly identify deleted ones.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440483524.0,
    "date_created": "2015-08-24",
    "time_created": "18:18:44",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuef7dh",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"WE DEMAND YOU REMOVE THIS FROM THE INTERNET!\" Good luck with that. Now that you've brought attention to it, every single person with open storage space they're not using will be archiving it too.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440484590.0,
    "date_created": "2015-08-24",
    "time_created": "18:36:30",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuefe4d",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">Imagine how nerve-racking — terrifying, even — tweeting would be if it was immutable and irrevocable?  \n\nHow fucking stupid do you have to be to think posting something for everyone to see allows you to just take back whatever you said.  I can't go run through the town screaming obscenities and racial slurs, then say I take it back.  It doesn't work that way.  And even running around yelling shit is less public than putting it on twitter.  It would be like running around with a magical device that lets people everywhere in the world hear what you say.  \nJust like you can't just take back what you say in person you can't just take back what you say online.  Those are still the words you said, live up to them.  \n\nAlso they only shut down the api, basically the easy way to harvest the tweets.  I don't imagine it would be exceedingly difficult to find another way to get the tweets.  It would just obviously not be nearly as efficient as using the api.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440484906.0,
    "date_created": "2015-08-24",
    "time_created": "18:41:46",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cueftcj",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "If these are public tweets then unlucky! They can be archived.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440485642.0,
    "date_created": "2015-08-24",
    "time_created": "18:54:02",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cueg81g",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's interesting how the total votes on this have been dropping throughout the day. At it's peak I saw it had 11,744. Down to 9,394 now.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440486368.0,
    "date_created": "2015-08-24",
    "time_created": "19:06:08",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuejsdw",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"Keep politicians honest\"...? If you delete all politicians' Twitter accounts forever, you'd stop about 0.0001% of all dishonesty committed by those in government. Twitter is a stupid internet toy when compared to the inner workings of super PACs and lobbying firms.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440492512.0,
    "date_created": "2015-08-24",
    "time_created": "20:48:32",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cugqo32",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "censorship is really bad these days!  You can't upload to youtube or even live leak or twitter, or even facebook to share.   I finally found the bryce shooting:\n\nI feel very very sad for the couple, this is terrible and I think we should learn from this.  Looks like everyone is taking down the POV video, I found a version they can't take down:\nhttps://mega.nz/#!PhAjWSCD!_fzb4o3oQc5c087TOrfT4BjXY7emP59BCMomypldhro",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1440653167.0,
    "date_created": "2015-08-26",
    "time_created": "17:26:07",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx5zd",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Should you have to give up your \"right to be forgotten\" just because you are a public figure?  Aren't we all \"public figures\" if we're on Twitter.  ",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1440456436.0,
    "date_created": "2015-08-24",
    "time_created": "10:47:16",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuealx5",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Twitter sucks. Everyone should stop using Twitter. This has nothing to do with this news, I just thought I'd put it out there since we're talking about Twitter.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1440477307.0,
    "date_created": "2015-08-24",
    "time_created": "16:35:07",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudwm5u",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "How about retweets? Could a bot retweet those tweets and keep them even after the original tweet was deleted? Might not have the same credibility, but at least the information would be there.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1440455450.0,
    "date_created": "2015-08-24",
    "time_created": "10:30:50",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cueei3w",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "ive watched this get downvoted from 10k to 9200....theyre watching...",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440483390.0,
    "date_created": "2015-08-24",
    "time_created": "18:16:30",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudy5kd",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I don't quite see the issue. If I feel like I don't want one of my tweets to be seen anymore, I'm able to delete it and (now I'm not sure about this, but as far as I'm aware) no website is gonna archive those deleted tweets of mine. Shouldn't politicians have the same right?\n\nIf Twitter was forcing down websites that archived YOUR deleted tweets, people would probably call it a victory for privacy and free speech or whatnot. Yet when it's the other way around...",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1440458132.0,
    "date_created": "2015-08-24",
    "time_created": "11:15:32",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudykh7",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "So, screen shot?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440458821.0,
    "date_created": "2015-08-24",
    "time_created": "11:27:01",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudzuot",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Forced how?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440460887.0,
    "date_created": "2015-08-24",
    "time_created": "12:01:27",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue36dl",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Twitter, one of the biggest forces of the Arab Spring movement, now succumbing to political pressure. It's so easy to recognize oppression and abuse of power when it's happening somewhere else.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440466054.0,
    "date_created": "2015-08-24",
    "time_created": "13:27:34",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue45m5",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440467554.0,
    "date_created": "2015-08-24",
    "time_created": "13:52:34",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue5qj6",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"Deleting a tweet is an expression of the user's voice\". Really? So if I say something out loud that a roomful of people hear, I can just unsay it, and everyone instantly never heard it?\n\nI don't think so, honey. That's not how it works.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440469984.0,
    "date_created": "2015-08-24",
    "time_created": "14:33:04",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue9gxd",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Let me test something: Why are you guys so crazy about this censorship when on reddit we have the bans for metioning /r/undelete ?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440475591.0,
    "date_created": "2015-08-24",
    "time_created": "16:06:31",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cueam6b",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Twitter right now http://i.imgur.com/kBSnyHk.gif",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440477318.0,
    "date_created": "2015-08-24",
    "time_created": "16:35:18",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cueb9je",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Gross",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440478275.0,
    "date_created": "2015-08-24",
    "time_created": "16:51:15",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuebnpx",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "it's no wonder twitter cant make any money with decisions like these.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440478838.0,
    "date_created": "2015-08-24",
    "time_created": "17:00:38",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuebqzo",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Wow. So Twitter is on the take too. That's really disappointing.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440478977.0,
    "date_created": "2015-08-24",
    "time_created": "17:02:57",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuebsok",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "So twitter is in bed with governments...fuck twitter and the dumbwits using it",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440479048.0,
    "date_created": "2015-08-24",
    "time_created": "17:04:08",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuebznq",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I wonder how much the politicians paid Twitter for this",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440479348.0,
    "date_created": "2015-08-24",
    "time_created": "17:09:08",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuec3m2",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Twitter can \"get rid of these sites\" but you can't \"delete it off the internet.\"  Someone will create a cache of all the tweets and put them up elsewhere.  ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440479519.0,
    "date_created": "2015-08-24",
    "time_created": "17:11:59",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuec542",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "What do you expect? This is what happens when a company gets arrogant, corrupt and inefficient. Twitter needs to die, now.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440479585.0,
    "date_created": "2015-08-24",
    "time_created": "17:13:05",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuecrgx",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Why the FUCK would a politician be allowed to tweet anything? Ever? Their handlers/campaign managers should be the only people who have access to tweets. The fact that twitter would go along with deleting things the politicians VOLUNTARILY tweeted out into the internet... Why? Why twitter? What are they paying you? And why wouldn't you want to be a force for good in your country of origin. Are you WITH US? Or AGAINST US?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440480553.0,
    "date_created": "2015-08-24",
    "time_created": "17:29:13",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cued50y",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "A lot of money was poured into Twitter over a number of years. I'm sure that there's pressure being applied to Twitter for investors to see a return on that investment.  \n\nI'm equally sure that there's more to this story than simply protecting those people on the planet who enact laws on behalf of their respective countries.  \n\nIt's probably not in the best interest of Twitter's investors to get on the wrong side of those who can enact laws that will interfere with Twitter's monetary goals.  \n\nI have no doubt that this change is not arbitrary and is the result of specific events and private conversations.  \n\nOn a side note, there was a time when Twitter was among the best sites on the internet. That has slowly changed over the years as Twitter made changes to attract more users and increase revenue.  \n\nThere is little reason to use Twitter now, except to have and presence to market or as a vehicle for PR. For a user who has no business objectives, I can't fathom why you would want to use Twitter. Particularly given how web media likes to extract obscure Twitter comments to fit their \"news\" narrative and potentially demolish the otherwise clueless Twitter user who had made the mistake of posting a 140 character message without consciously thinking about what would happen if their message was picked up and amplified by the page-view driven web media.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440481144.0,
    "date_created": "2015-08-24",
    "time_created": "17:39:04",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuedrn9",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Why don't these websites compile the deleted tweets into torrents for whoever wants them? Barbara Streisand this shit.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440482155.0,
    "date_created": "2015-08-24",
    "time_created": "17:55:55",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuedxes",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Just save them off of twitter?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440482420.0,
    "date_created": "2015-08-24",
    "time_created": "18:00:20",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cueee6s",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "How about when George W Bush said that terrorists \"Tried to kill my daddy\" on CNN? That was edited out and deleted along time ago.....",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440483204.0,
    "date_created": "2015-08-24",
    "time_created": "18:13:24",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cueflss",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "BUT WHO FORCED TWITTER?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440485276.0,
    "date_created": "2015-08-24",
    "time_created": "18:47:56",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cueftmq",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Twitter sucks.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440485655.0,
    "date_created": "2015-08-24",
    "time_created": "18:54:15",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuehmsk",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "What hashtag do we use to tweet about how we disagree with this?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440488838.0,
    "date_created": "2015-08-24",
    "time_created": "19:47:18",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuehow8",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "At least we know whose side they are on.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440488944.0,
    "date_created": "2015-08-24",
    "time_created": "19:49:04",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuehyuq",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I knew twitter was a problem the moment they start demanding phone numbers. Can't trust giving them private info especially their social justice stance.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440489431.0,
    "date_created": "2015-08-24",
    "time_created": "19:57:11",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cueiqoc",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'd rather my politician chenge their mind and policy when new information arises instead of being restricted to what they said in the past. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440490758.0,
    "date_created": "2015-08-24",
    "time_created": "20:19:18",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuelcbd",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> to keep politicians honest\n\nThis implies that they were honest to begin with.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440495039.0,
    "date_created": "2015-08-24",
    "time_created": "21:30:39",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cueo7xe",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Twitter hasn't learned the lesson, apparently, that it's really impossible to \"fight\" the internet. You won't win when you declare war on the dissemination of information onto the internet.\n\nAsk any artist who has tried to remove videos, music, or images from the internet. Essentially, it can't be done.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440499913.0,
    "date_created": "2015-08-24",
    "time_created": "22:51:53",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cueogj9",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I swear that the upvotes on this was 10k when i first saw it, then 9k a couple of hours ago, now it's down to 8k, odd?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440500331.0,
    "date_created": "2015-08-24",
    "time_created": "22:58:51",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuep9qd",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Fucking twitter. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440501799.0,
    "date_created": "2015-08-24",
    "time_created": "23:23:19",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cueq48a",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I would say this is just as good a  reason as any to boycott twitter into non-existance.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440503489.0,
    "date_created": "2015-08-24",
    "time_created": "23:51:29",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cueq674",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Not saying this doesn't suck, because twitter does. Especially with their API token policy. However couldn't someone with minimal python experience just create a program to scrape texts from the public profile page of those politicians?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440503601.0,
    "date_created": "2015-08-24",
    "time_created": "23:53:21",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cueqqqp",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "How can Twitter force an independent 3rd party to do anything? they don't own the content of those tweets",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440504809.0,
    "date_created": "2015-08-25",
    "time_created": "00:13:29",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuesh3i",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Another win for big government. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440509038.0,
    "date_created": "2015-08-25",
    "time_created": "01:23:58",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuj2fpy",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Politicians are never honest regardless.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440824330.0,
    "date_created": "2015-08-28",
    "time_created": "16:58:50",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue09w2",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">\"Imagine how nerve-racking — terrifying, even — tweeting would be if it was immutable and irrevocable?\" Twitter reportedly told the OSF.\n\nYou mean like it used to be where if something really fucking stupid came out of your mouth in public, you couldn't immediately remove all evidence of you having said it?",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1440461564.0,
    "date_created": "2015-08-24",
    "time_created": "12:12:44",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuf5409",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Reddit has removed the ability to see upvote and downvote balances separately, removing the only effective tool for identifying the vote manipulation corporate and government shills engage in to direct discussion",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440545410.0,
    "date_created": "2015-08-25",
    "time_created": "11:30:10",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudz16t",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">\"Indeed, deleting a tweet is an expression of the user’s voice.\"\n\nKids these days, man.  If you find the idea of what you say online being permanent \"terrifying\", maybe just don't post every goddamned thought that crosses your mind to the Internet, then, regardless of the effect it might have on anyone or anything else.    Like.... really?  You'd prefer a paradigm of corporate censorship to exercising a little self-control once in a while?  Such entitlement; many amaze",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1440459586.0,
    "date_created": "2015-08-24",
    "time_created": "11:39:46",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudwups",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Twitter shouldn't pretend that the internet can forget something a politician said.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1440455882.0,
    "date_created": "2015-08-24",
    "time_created": "10:38:02",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudz3z8",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"Indeed, deleting a tweet is an expression of the user’s voice.\"\n\nI wish I was payed to spout bullshit like this.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440459709.0,
    "date_created": "2015-08-24",
    "time_created": "11:41:49",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudwlha",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Trying to show buyers they can control the system for a better price.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1440455414.0,
    "date_created": "2015-08-24",
    "time_created": "10:30:14",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue06uk",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Title is sensationalist as hell. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440461426.0,
    "date_created": "2015-08-24",
    "time_created": "12:10:26",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue3b9b",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Have fun with the Streisand effect.   All you will do is create a dozen new websites that simply monitor politicians and take screens hots,  uploading pictures to sites you cannot shut down. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440466260.0,
    "date_created": "2015-08-24",
    "time_created": "13:31:00",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyr7p",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "...have they also shut down the Library of Congress? Last I heard they were still archiving all tweets made.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440459126.0,
    "date_created": "2015-08-24",
    "time_created": "11:32:06",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyxtn",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "From the article:\n\n> \"Imagine how nerve-racking — terrifying, even — tweeting would be if it was immutable and irrevocable?\" Twitter reportedly told the OSF.\n\nImagine how idiotic this would have sounded 30 years ago:\n\n\"Imagine how nerve-racking — terrifying, even — ~~tweeting~~ *being quoted in a newspaper* would be if it was immutable and irrevocable?\" Twitter ~~reportedly told the OSF~~ might have said.\n\nEven worse:\n\n> Twitter reportedly told the OSF... the social media site didn't distinguish between politicians and regular users.\n\nWell the rest of us sure as hell do. Politicians are public figures who make public decisions that affect the public. We have a right to know what they have said.\n\nBut at least Twitter's intellectual property was protected. Because obviously that's more important. /s",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440459432.0,
    "date_created": "2015-08-24",
    "time_created": "11:37:12",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxtt5",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I heard Hillary Clinton made them do it",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440457579.0,
    "date_created": "2015-08-24",
    "time_created": "11:06:19",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue0d2g",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Maybe twitter should sell people the right to \"fully delete\" a tweet for $19",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440461702.0,
    "date_created": "2015-08-24",
    "time_created": "12:15:02",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue1rw8",
    "parent_id": "t3_3i73px",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is ironic, coming from The Verge, a website that shut down their comment section to remove an effective tool that could keep them honest.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440463897.0,
    "date_created": "2015-08-24",
    "time_created": "12:51:37",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxdxm",
    "parent_id": "t1_cudu8gz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Twitter has a lot of problems period. Their apps are vastly inferior to the 3rd party apps they are openly hostile towards, no one knows how many users they have, the trending hashtags are obviously manipulated, and millions of their users are fake or non interactive. It's a good idea, ruined by admins.\n\nEdit: kind stranger, my gold was to expire in 12 hours. On this day of market crashings, you rescued me.",
    "controversiality": 0,
    "ups": 4049,
    "downs": 0,
    "score": 4049,
    "created": 1440456829.0,
    "date_created": "2015-08-24",
    "time_created": "10:53:49",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudwb2l",
    "parent_id": "t1_cudu8gz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "i remember when twitter was praised for being transparency and privacy friendly. It was the service for rebels. Then once they got big they sold out. It was all just a ploy to build up cred. Reddits doing the same thing.",
    "controversiality": 0,
    "ups": 3846,
    "downs": 0,
    "score": 3846,
    "created": 1440454884.0,
    "date_created": "2015-08-24",
    "time_created": "10:21:24",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxmos",
    "parent_id": "t1_cudu8gz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 199,
    "downs": 0,
    "score": 199,
    "created": 1440457245.0,
    "date_created": "2015-08-24",
    "time_created": "11:00:45",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxst3",
    "parent_id": "t1_cudu8gz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Reddit is not any different. Shadowbanning users and or their messages. Doesn't it sound like a sophisticated censorship?",
    "controversiality": 0,
    "ups": 45,
    "downs": 0,
    "score": 45,
    "created": 1440457532.0,
    "date_created": "2015-08-24",
    "time_created": "11:05:32",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue23vh",
    "parent_id": "t1_cudu8gz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Reddit has a lot of problems internally.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440464407.0,
    "date_created": "2015-08-24",
    "time_created": "13:00:07",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudvart",
    "parent_id": "t1_cudu8gz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You can't spell Twitter without 'twit'",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1440452920.0,
    "date_created": "2015-08-24",
    "time_created": "09:48:40",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue0jnk",
    "parent_id": "t1_cudxydj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "What's the alternative if the client requires it? Coding a scraper?",
    "controversiality": 0,
    "ups": 174,
    "downs": 0,
    "score": 174,
    "created": 1440461989.0,
    "date_created": "2015-08-24",
    "time_created": "12:19:49",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue12c7",
    "parent_id": "t1_cudxydj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I work for a large tech firm that has a partnership with twitter and you're exactly right, their data is EXPENSIVE.\n\nEven with a partnership dont expect to get all of the data around a certain hashtag, youll get a sizable chunk but never all of it. Also don't expect to be able off load that data somewhere, that will never happen.\n\nThat data is their product and they are very protective of it.",
    "controversiality": 0,
    "ups": 103,
    "downs": 0,
    "score": 103,
    "created": 1440462792.0,
    "date_created": "2015-08-24",
    "time_created": "12:33:12",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuerqqt",
    "parent_id": "t1_cudxydj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Then when you do really well they copy your idea and kill your API access (meerkat / periscope)",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440507133.0,
    "date_created": "2015-08-25",
    "time_created": "00:52:13",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue3bg4",
    "parent_id": "t1_cudxydj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Wait what about Bootstrap?",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440466268.0,
    "date_created": "2015-08-24",
    "time_created": "13:31:08",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue0qnq",
    "parent_id": "t1_cudxydj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1440462290.0,
    "date_created": "2015-08-24",
    "time_created": "12:24:50",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudvtge",
    "parent_id": "t1_cudvagk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Copied and pasted from [an earlier response of mine:] (https://www.reddit.com/r/worldnews/comments/3i73px/twitter_has_forced_30_websites_that_archive/cudvn5v?context=3) I surmise it's probably a text archive based on what I know, BUT it could have been screen shots. I doubt this, because screenshots are less trustworthy as they're easier to fake, so it probably was a text archive with time stamps.\n\n>I wrote this up people who are confused about the websites worked and how they were shut down. Please feel to correct me if I'm wrong. \n\n>---\n\n>Twitter let those sites use their API, where the site's bots then crawled the pages of politicians and accounting for all their tweets. If a tweet was deleted, they would post the text up and the politician who posted it up on the site. \n\n>However, Twitter shut them down by closing off their API access, making it virtually impossible to do what they had been doing before. \n\n>Again, please feel free to expand on this or to correct me if I'm wrong in any way!\n\nEdit: spelling and added link\n",
    "controversiality": 0,
    "ups": 468,
    "downs": 0,
    "score": 468,
    "created": 1440453946.0,
    "date_created": "2015-08-24",
    "time_created": "10:05:46",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudy5f2",
    "parent_id": "t1_cudvagk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Took me 22 seconds:\n\nhttp://imgur.com/n1NtVeE\n\nProper archives usually copy the page as it is received from the server, so no one can mess with it before saving.",
    "controversiality": 0,
    "ups": 174,
    "downs": 0,
    "score": 174,
    "created": 1440458126.0,
    "date_created": "2015-08-24",
    "time_created": "11:15:26",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxzex",
    "parent_id": "t1_cudvagk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "they used an electronic interface to directly access the tweets and store them as text in their own database. that way a computer could do it automatically without the need to interpret a website made for humans or take a screenshot of a website made for humans. very elegant approach.\n\nusing pictures here is suboptimal because:\n\n- expensive to store since pics need more storage than text\n- cumbersome to capture automatically\n- not searchable without extra effort\n- need more bandwidth since showing a pic in browser needs more data to be transmitted than text.\n- all in all more expensive for a NPO and impractical for the users",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1440457841.0,
    "date_created": "2015-08-24",
    "time_created": "11:10:41",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudwlqi",
    "parent_id": "t1_cudvn5v",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 159,
    "downs": 0,
    "score": 159,
    "created": 1440455427.0,
    "date_created": "2015-08-24",
    "time_created": "10:30:27",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudwj3s",
    "parent_id": "t1_cudvn5v",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Sounds like a \"right to be forgotten\" kind of thing.",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1440455297.0,
    "date_created": "2015-08-24",
    "time_created": "10:28:17",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyh0g",
    "parent_id": "t1_cudvn5v",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "So in other words Twitter didn't shut down these sites' access because they were \"protecting politicians\" they shut down access to \"protect their users\".  That ToS clause applies to everyone, if Twitter offers the same service to their other users I don't have a problem with them offering it to these people as well.  Consistency is consistency.",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1440458662.0,
    "date_created": "2015-08-24",
    "time_created": "11:24:22",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudygqb",
    "parent_id": "t1_cudvn5v",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "When you put it like that, I have no issue with what Twitter has done. I do believe people should have some form of a \"right to be forgotten\". ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1440458649.0,
    "date_created": "2015-08-24",
    "time_created": "11:24:09",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue0s14",
    "parent_id": "t1_cudvn5v",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "What you've described is still possible. The API made it easier because it sends a \"delete\" command when a tweet is deleted. An app the uses the API correctly (as outlined in the TOS) complies with that command and silently deletes the tweet from the feed. These sites were doing the opposite… just wait for a delete command, then save and post that tweet.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440462345.0,
    "date_created": "2015-08-24",
    "time_created": "12:25:45",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudw0cz",
    "parent_id": "t1_cudvipx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "From what I understand they blocked anyone from using the API to display any deleted tweets. Most people don't care about non-politicians deleted tweets though.",
    "controversiality": 0,
    "ups": 833,
    "downs": 0,
    "score": 833,
    "created": 1440454316.0,
    "date_created": "2015-08-24",
    "time_created": "10:11:56",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxlb0",
    "parent_id": "t1_cudvipx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> Politicians deserve no special protection beyond that of the average Twitter user. If you done fucked up you done fucked up.\n\nIsn't that EXACTLY what twitter is establishing here? If a average user deleted a tweets it's deleted. twitter would probably also shut down the API for a website that uses it against other users.\n\n\nhttps://www.reddit.com/r/worldnews/comments/3i5m9y/twitter_has_killed_politwoops_which_monitored/cudplcn",
    "controversiality": 0,
    "ups": 111,
    "downs": 0,
    "score": 111,
    "created": 1440457182.0,
    "date_created": "2015-08-24",
    "time_created": "10:59:42",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudynyg",
    "parent_id": "t1_cudvipx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's the whole point. They're protecting all their users from these sites. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1440458978.0,
    "date_created": "2015-08-24",
    "time_created": "11:29:38",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxbgr",
    "parent_id": "t1_cudvipx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm guessing you didn't read this since that is precisely why they are doing this.  Normal users can delete their tweets, so everyone should be able to.  The idea that they think deleting a tweet removes it from the internet is cute.",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1440456706.0,
    "date_created": "2015-08-24",
    "time_created": "10:51:46",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue202x",
    "parent_id": "t1_cudvipx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This guy. This guy right here, did **not** read the article. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1440464250.0,
    "date_created": "2015-08-24",
    "time_created": "12:57:30",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudwnt7",
    "parent_id": "t1_cudvipx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The question is if they deserve as much protection as the average user as they were singled out. Twitter is saying 'yes', I personally consider both views valid.",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1440455532.0,
    "date_created": "2015-08-24",
    "time_created": "10:32:12",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudwwcz",
    "parent_id": "t1_cudvipx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I don't think you should be able to read normal people deletes tweets either. ",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1440455963.0,
    "date_created": "2015-08-24",
    "time_created": "10:39:23",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudvz6j",
    "parent_id": "t1_cudvipx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "What you mean? I got hacked!",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1440454253.0,
    "date_created": "2015-08-24",
    "time_created": "10:10:53",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx4hx",
    "parent_id": "t1_cudvipx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm not sure which side of the discussion you're taking here.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440456358.0,
    "date_created": "2015-08-24",
    "time_created": "10:45:58",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyera",
    "parent_id": "t1_cudvipx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Good on you for not reading between the lines....\n\nThis is for everyone, not simply politicians. How are you people this gullible? How do you get on in life?  Seriously, the information is there in the article.\n\nTwitter squashed the api access to deleted tweets, effectively shutting off the archiving of deleted tweets that can be verified by twitter.\n\nThis isn't just for some politicians, but everyone.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440458556.0,
    "date_created": "2015-08-24",
    "time_created": "11:22:36",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxjsj",
    "parent_id": "t1_cudvfoh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "But the site *was* going against the Developer Agreement by not removing deleted tweets.  I'm certainly no fan of censorship, but it appears Twitter's just enforcing its own rules.",
    "controversiality": 0,
    "ups": 120,
    "downs": 0,
    "score": 120,
    "created": 1440457110.0,
    "date_created": "2015-08-24",
    "time_created": "10:58:30",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudwhdf",
    "parent_id": "t1_cudvfoh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "So should police shooting unarmed civilians, or the NSA logging everything we do. People are too comfortable to care.\n\nEdit: People, these were just examples. There *are* other issues I could have put, but I chose these because that's what came to mind. Everyone who chose to focus on the topics I put are small-minded idiots who completely missed the point. Congrats.",
    "controversiality": 0,
    "ups": 1521,
    "downs": 0,
    "score": 1521,
    "created": 1440455209.0,
    "date_created": "2015-08-24",
    "time_created": "10:26:49",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxvdt",
    "parent_id": "t1_cudvfoh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Outrage? The title is bullshit. The simply fixed their API—deleted tweets are no longer accessible. That they were accessible before was simply an error.\n\nThere's nothing stopping these websites from holding on to their own copies of politicians tweets. They just can't ask Twitter for them any longer after they've been deleted.",
    "controversiality": 0,
    "ups": 233,
    "downs": 0,
    "score": 233,
    "created": 1440457651.0,
    "date_created": "2015-08-24",
    "time_created": "11:07:31",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyam3",
    "parent_id": "t1_cudvfoh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "If you look through the comments (or the article, really), they didn't go in and \"shut down\" any sites at all, but removed those cluster of sites' ability to more-easily get data from Twitter. I was rather outraged too, until I saw the comments, then went to check the article itself. It's kind of like being outraged when Russia stopped selling oil at a discounted price to Ukraine - sure, maybe it was a move motivated by forces outside of the market, but do we get to be mad when somebody takes something away that they had no obligation to provide?",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1440458365.0,
    "date_created": "2015-08-24",
    "time_created": "11:19:25",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx900",
    "parent_id": "t1_cudvfoh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Alright. Tell me what to do.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1440456582.0,
    "date_created": "2015-08-24",
    "time_created": "10:49:42",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudypiu",
    "parent_id": "t1_cudvfoh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "What is it with people on reddit and being outraged?  I swear there's something new I'm suppose to be outraged about on a daily basis.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440459048.0,
    "date_created": "2015-08-24",
    "time_created": "11:30:48",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx8x7",
    "parent_id": "t1_cudvfoh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Why would it? Anything scandalous is screenshotted instantly. And if you are looking for what a politicians policies or beliefs were in the past compared to today, then Twitter probably isn't the best way to access that information in the first place. If anything, this is getting too much press.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1440456578.0,
    "date_created": "2015-08-24",
    "time_created": "10:49:38",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx7m7",
    "parent_id": "t1_cudvfoh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "all outraged out.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1440456515.0,
    "date_created": "2015-08-24",
    "time_created": "10:48:35",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyjgw",
    "parent_id": "t1_cudvfoh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "why should it? They are just enforcing their TOS. I don't see the problem here. Is not that they made the rule last second to try do defend politicians it was there already and the sites were broking it ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440458776.0,
    "date_created": "2015-08-24",
    "time_created": "11:26:16",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue01r2",
    "parent_id": "t1_cudvfoh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Why? Should politicians not be allowed to delete their tweets, like every other person would be able to do?\n\nSometimes people make mistakes and they should be able to rectify that, without being held to something they said that one time.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440461203.0,
    "date_created": "2015-08-24",
    "time_created": "12:06:43",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxkn7",
    "parent_id": "t1_cudvfoh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "People these days rage about everything and anything.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1440457149.0,
    "date_created": "2015-08-24",
    "time_created": "10:59:09",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxd4m",
    "parent_id": "t1_cudvfoh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Why? It's a private company, they can do whatever they want. I'm sure another service exists that will host all the content.\n\nBest way to react is to stop using said service.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440456788.0,
    "date_created": "2015-08-24",
    "time_created": "10:53:08",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxipk",
    "parent_id": "t1_cudvfoh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm an American, sir.  I'll save my outrage for where it belongs:  at the plot points I disagree with on my favorite television shows or my favorite sports team losing.  ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440457059.0,
    "date_created": "2015-08-24",
    "time_created": "10:57:39",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyfra",
    "parent_id": "t1_cudvfoh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "No, it really shouldn't. It's still easy to automate archival of tweets via web scraping. This just makes their job more inconvenient - but it can still be done and it's reasonable for twitter to enforce it's ToS, and it's a reasonable policy for twitter to have in general regarding deleted tweets (personal information may be maliciously or accidentally posted, and in general w/o that policy people would use twitter less which they don't want). ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440458603.0,
    "date_created": "2015-08-24",
    "time_created": "11:23:23",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudwusy",
    "parent_id": "t1_cudvfoh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I think politicians are people too. The issue of 'the right to be forgotten' is not a clear-cut one, but politicians deserve the same consideration in this regard as anyone else does.\n\nPolitics the shittiest lucrative career on earth considering the shit-storm that they are forced to put up with to stay competitive. We should be doing more to make it an appealing profession for the smartest people in the country due to its importance, but as things stand, most smart people wouldn't touch it with a ten foot pole. This mentality you have contributes to that.",
    "controversiality": 1,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1440455886.0,
    "date_created": "2015-08-24",
    "time_created": "10:38:06",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudzd06",
    "parent_id": "t1_cudvfoh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Sensationalist much?  Twitter didn't \"shut down\" the sites.  Twitter simply turned off access to the Twitter API, which they own, because the sites violated the ToS.  \n\nThe sites don't have some right to access all of twitter via convenient API calls.  ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440460109.0,
    "date_created": "2015-08-24",
    "time_created": "11:48:29",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudze86",
    "parent_id": "t1_cudvfoh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "8k> upvotes in 2 hours tells me reddit is pretty outraged",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440460161.0,
    "date_created": "2015-08-24",
    "time_created": "11:49:21",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue09ry",
    "parent_id": "t1_cudvfoh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Because the title is sensationalist and inaccurate.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440461559.0,
    "date_created": "2015-08-24",
    "time_created": "12:12:39",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue0t25",
    "parent_id": "t1_cudvfoh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Honestly, why?\n\nIf I delete a comment on Twitter, or Facebook, or Reddit that I wasn't especially proud of I don't want people or bots to easily find it.\n\nIf a politician or celebrity says something stupid someone can still screenshot it if they care to.  For the people who are outraged, has a deleted twitter comment ever had an effect on an election?  I think people conflate social media's importance.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440462392.0,
    "date_created": "2015-08-24",
    "time_created": "12:26:32",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue8c52",
    "parent_id": "t1_cudxdn0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You'd think a proper news article wouldn't use such a sensationalist (and wrong) title and perhaps mention that they also broke the TOS.\n\nNah, being infuriated about free speech for clicks is first and foremost.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1440473915.0,
    "date_created": "2015-08-24",
    "time_created": "15:38:35",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cueac1z",
    "parent_id": "t1_cudxdn0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I was really kind of pissed off about this until I scrolled 3/4 of the way down this thread to this comment.  And it makes sense.  Will I never stop being a sucker to sensationalist titles?  It's rarely ever true (when it's not about cops).",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440476899.0,
    "date_created": "2015-08-24",
    "time_created": "16:28:19",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuecubk",
    "parent_id": "t1_cudy6eo",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The comments section is currently showing 0. Seems they shut this one down too. http://imgur.com/MI6ZGf4",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440480675.0,
    "date_created": "2015-08-24",
    "time_created": "17:31:15",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx9af",
    "parent_id": "t1_cudvfxm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You are absolutely correct.\n\nIt seems like every worldnews thread is flooded with people who have no idea what they are talking about, but feel very strongly about it anyway.",
    "controversiality": 0,
    "ups": 192,
    "downs": 0,
    "score": 192,
    "created": 1440456597.0,
    "date_created": "2015-08-24",
    "time_created": "10:49:57",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue82hk",
    "parent_id": "t1_cudvfxm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> The twitter API TOS forbids using it to track and display deleted tweets.\n\nThis is the problem people are actually angry about, though OP didn't state it explicitly.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1440473516.0,
    "date_created": "2015-08-24",
    "time_created": "15:31:56",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue5pcd",
    "parent_id": "t1_cudxrh6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "What about a bot that re tweets every politicians tweets?  Then does that count as a violation? ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440469931.0,
    "date_created": "2015-08-24",
    "time_created": "14:32:11",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue5mkl",
    "parent_id": "t1_cudxrh6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Even politicians have the right to change their minds.\n\nThe fact that it's likely an HR group that's changing their minds for them is a shame, but even HR groups have the right to change their minds.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440469814.0,
    "date_created": "2015-08-24",
    "time_created": "14:30:14",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuepsig",
    "parent_id": "t1_cudxrh6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "No, everyone doesn't have the right to delete posts. Some applications give you that ability. But some apps, like Facebook, even track things you type in their text fields. We have the ability to take down posts on a lot of platforms. It's important not to confuse that for real removal. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440502825.0,
    "date_created": "2015-08-24",
    "time_created": "23:40:25",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx51t",
    "parent_id": "t1_cudvgow",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Fantastic gif. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1440456387.0,
    "date_created": "2015-08-24",
    "time_created": "10:46:27",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyvmd",
    "parent_id": "t1_cudx2jd",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "If you put something on the internet expect it to never, ever, go away.",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1440459330.0,
    "date_created": "2015-08-24",
    "time_created": "11:35:30",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyd84",
    "parent_id": "t1_cudx502",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1440458486.0,
    "date_created": "2015-08-24",
    "time_created": "11:21:26",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxjst",
    "parent_id": "t1_cudx502",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "No. Customers (and not just politicians) would likely prefer to have delete actually mean delete. That's what I would want anyway.\n\n",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1440457110.0,
    "date_created": "2015-08-24",
    "time_created": "10:58:30",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudykqm",
    "parent_id": "t1_cudx502",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Upvoted for (probably futile) visibility. When I hit delete, on Twitter, Reddit, or Facebook, I expect it to be deleted. Can you imagine if Reddit pulled something like this?",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1440458833.0,
    "date_created": "2015-08-24",
    "time_created": "11:27:13",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue0q5h",
    "parent_id": "t1_cudv8r9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"Gettin paid\" is no doubt their goal. They are a business, after all. But I doubt they are paid by any politicians as (I guess) you are implying.\n\nThey are upholding their own rules regarding privacy. That privacy is afforded to Joe Politician as well as Joe Schmo. Anyone that uses their API (including these 30 sites) cannot display deleted tweets (which is what these sites were doing). \n\nNot to mention, they didn't \"shut down\" these sites. They revoked these sites' access to their API (an interface provided by Twitter) because these sites broke the end user license agreement.\n\nPut down your pitchforks, people. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440462269.0,
    "date_created": "2015-08-24",
    "time_created": "12:24:29",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx4gl",
    "parent_id": "t1_cudv8r9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yup, you gotta love overt corruption!",
    "controversiality": 1,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1440456356.0,
    "date_created": "2015-08-24",
    "time_created": "10:45:56",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuegfvp",
    "parent_id": "t1_cueg81g",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "higher than I caught it, when it peaked downvotes started piling on. Felt like some automated thing was trying to push it down.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440486747.0,
    "date_created": "2015-08-24",
    "time_created": "19:12:27",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cueekxr",
    "parent_id": "t1_cueei3w",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It topped out around 11,329 and has bounced between 9k and 10,700 all day since the peak. I kinda want to see this happen with other posts on real time now.\n\nedit: according to /u/junglemonkey47 it peaked at 11,744 upvotes.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440483524.0,
    "date_created": "2015-08-24",
    "time_created": "18:18:44",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuekxjz",
    "parent_id": "t1_cueei3w",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's not even downvoted, it's just votes disappearing.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440494375.0,
    "date_created": "2015-08-24",
    "time_created": "21:19:35",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue6ry3",
    "parent_id": "t1_cue5qj6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's not how any of this works.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440471567.0,
    "date_created": "2015-08-24",
    "time_created": "14:59:27",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudysd3",
    "parent_id": "t1_cudwups",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It is their api, they can do anything they like with it.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1440459181.0,
    "date_created": "2015-08-24",
    "time_created": "11:33:01",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudy69r",
    "parent_id": "t1_cudxdxm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "My wife uses Twitter to try to win contests occasionally, so that's my experience with it -- a hashtag-laden, free-advertising scroll of product and pitches. She actually did win a couple of things though; a two night stay in a 4-star resort once, and some art supplies another time. But still, what's the point for users who aren't trying to win something or sell something?",
    "controversiality": 0,
    "ups": 802,
    "downs": 0,
    "score": 802,
    "created": 1440458165.0,
    "date_created": "2015-08-24",
    "time_created": "11:16:05",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyhck",
    "parent_id": "t1_cudxdxm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "sounds like ANOTHER SITE I KNOW\n\njust kidding",
    "controversiality": 0,
    "ups": 184,
    "downs": 0,
    "score": 184,
    "created": 1440458678.0,
    "date_created": "2015-08-24",
    "time_created": "11:24:38",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudz4l5",
    "parent_id": "t1_cudxdxm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">It's a good idea, ruined by admins.\n\nSounds familiar \n\n",
    "controversiality": 0,
    "ups": 65,
    "downs": 0,
    "score": 65,
    "created": 1440459736.0,
    "date_created": "2015-08-24",
    "time_created": "11:42:16",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudz7cp",
    "parent_id": "t1_cudxdxm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I tried to build an app related to gaming on top of twitter once. They shut it down after two weeks. I was just having fun and building something I thought was cool. I didn't make any money off of it. They are just jerks.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1440459857.0,
    "date_created": "2015-08-24",
    "time_created": "11:44:17",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudymd6",
    "parent_id": "t1_cudxdxm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440458908.0,
    "date_created": "2015-08-24",
    "time_created": "11:28:28",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudwkic",
    "parent_id": "t1_cudwb2l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Not sure it's a ploy / something its founders intended at the start,when you don't earn a penny and have a small group of employees all sharing a common vision, it's easy being a tool of transparency and making promises left and right.\n\nYou increase your company size, lots of people jump on board with different views on how to do a business, you need capital to expand your website (and investors won't lend to a company if they can't get some sort of return at some point) then your userbase is in the hundreds of millions and you see how much money other big websites are making and you start wondering how you can monetize your userbase.\n\nThen you start caring more about profits but advertisers and investors aren't huge fans of the whole transparency thing and if you introduce a few things at a time, most users won't notice the difference ... few years later and you're nothing like you used to be.",
    "controversiality": 0,
    "ups": 2690,
    "downs": 0,
    "score": 2690,
    "created": 1440455367.0,
    "date_created": "2015-08-24",
    "time_created": "10:29:27",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxnp2",
    "parent_id": "t1_cudwb2l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[Cartman laid out the blueprint homie](http://i.imgur.com/r0OZZC2.png)",
    "controversiality": 0,
    "ups": 110,
    "downs": 0,
    "score": 110,
    "created": 1440457292.0,
    "date_created": "2015-08-24",
    "time_created": "11:01:32",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudwix1",
    "parent_id": "t1_cudwb2l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Reddit did it way before Twitter. Reddit deletes lots of posts",
    "controversiality": 0,
    "ups": 180,
    "downs": 0,
    "score": 180,
    "created": 1440455287.0,
    "date_created": "2015-08-24",
    "time_created": "10:28:07",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx1lq",
    "parent_id": "t1_cudwb2l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "They literally 'sold out', because the company is now listed on the stock market. This is what happens.\n\nFurthermore Twitter was created at a company funded by venture capital firms. Funding companies precisely so they can eventually 'sell out' and make the VC firms a profit is the sole function and goal of the venture capital business.",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1440456217.0,
    "date_created": "2015-08-24",
    "time_created": "10:43:37",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx0hq",
    "parent_id": "t1_cudwb2l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1440456164.0,
    "date_created": "2015-08-24",
    "time_created": "10:42:44",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx9qm",
    "parent_id": "t1_cudwb2l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[I think I may know why](https://www.youtube.com/watch?v=uQJgAXuz-QI) ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440456620.0,
    "date_created": "2015-08-24",
    "time_created": "10:50:20",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudwrhm",
    "parent_id": "t1_cudwb2l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's what every single social media website does when it becomes popular.",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1440455716.0,
    "date_created": "2015-08-24",
    "time_created": "10:35:16",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxe9d",
    "parent_id": "t1_cudwb2l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm sure the founders of Twitter and Reddit didn't set out to \"fool\" their users. \n\nYeah it's great to start a website and have a specific goal in mind, but when that website blows up in popularity and you start looking at serious opportunities to make real money, your initial ideas tend to take a backseat.\n\nI don't blame any of them. They've put a ton of hard work in to their respective sites and now they've gotta play ball to earn a huge payday. ",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1440456845.0,
    "date_created": "2015-08-24",
    "time_created": "10:54:05",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx5xy",
    "parent_id": "t1_cudwb2l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I remember a few elections where the person running for president also said they would be the most transparent one yet.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1440456434.0,
    "date_created": "2015-08-24",
    "time_created": "10:47:14",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudy63q",
    "parent_id": "t1_cudwb2l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Slightly off-topic, but this is how I feel about Uber. They were great and grass-roots and all this shit while they were small, but now that they not only have a following of people who hate the taxicab industry but that same following is willing to be their personal army of lobbyists, petitioning state governments to loosen regulation on ridesharing, they've gotten full of themselves and poor in customer service. I still hate cabs, but I'm not happy with what Uber's become.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440458158.0,
    "date_created": "2015-08-24",
    "time_created": "11:15:58",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx2qp",
    "parent_id": "t1_cudwb2l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "They didn't sell out, they \"bought in\"! /s",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1440456272.0,
    "date_created": "2015-08-24",
    "time_created": "10:44:32",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxunv",
    "parent_id": "t1_cudwb2l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "*Most companies do the same thing. And you and I would do the same thing. \n\n\nIt turns out money is important to a lot of people. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440457617.0,
    "date_created": "2015-08-24",
    "time_created": "11:06:57",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyhqc",
    "parent_id": "t1_cudxmos",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's funny to imagine the Founder knowing nothing more than a TV host wants an interview and he doesn't know anything about Colbert or his show.  He's having a nice talk with Steven before the show then suddenly they go live and he's dealing with the loud and obnoxious Colbert Report personality.\n\n\nThat would piss anyone off if they didn't know to expect it.\n\nEdit: I know people - anyone going on Colbert will know what to expect.  It was just a funny thought that everyone is taking too seriously.",
    "controversiality": 0,
    "ups": 63,
    "downs": 0,
    "score": 63,
    "created": 1440458697.0,
    "date_created": "2015-08-24",
    "time_created": "11:24:57",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue012q",
    "parent_id": "t1_cudxmos",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1440461172.0,
    "date_created": "2015-08-24",
    "time_created": "12:06:12",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudzaob",
    "parent_id": "t1_cudxmos",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Is there a link to this?",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440460006.0,
    "date_created": "2015-08-24",
    "time_created": "11:46:46",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudy2g2",
    "parent_id": "t1_cudvart",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You can't spell twit without 'wit'",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1440457985.0,
    "date_created": "2015-08-24",
    "time_created": "11:13:05",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue1o36",
    "parent_id": "t1_cue0jnk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah, good luck with that. Short term it will work, but you better have an army of rotating proxies to mask the behavior of the scraper. Even then, it's just a matter of time.",
    "controversiality": 0,
    "ups": 235,
    "downs": 0,
    "score": 235,
    "created": 1440463738.0,
    "date_created": "2015-08-24",
    "time_created": "12:48:58",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue0mj8",
    "parent_id": "t1_cue0jnk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yup",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1440462115.0,
    "date_created": "2015-08-24",
    "time_created": "12:21:55",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue2o5o",
    "parent_id": "t1_cue0jnk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Coding a scraper and selling the results for $9k per month ;)",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1440465281.0,
    "date_created": "2015-08-24",
    "time_created": "13:14:41",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue3o8z",
    "parent_id": "t1_cue3bg4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Bootstrap is MIT license.  There's no taking that back.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1440466814.0,
    "date_created": "2015-08-24",
    "time_created": "13:40:14",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue3lb2",
    "parent_id": "t1_cue0qnq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The old GNIP price I've seen leaked many times from years ago is NOTHING like what it is now.\n\nThey're the only game in town.  Are you shocked the price is now a magnitude larger?\n\n>If it's not your company, then these social networks get to make the rules. That's business.\n\nYep and I can try to bury them and document the fact that they're controlling the the data with a heavy hand.  They're getting away with it because it's crucial to a lot of enterprise's day to day functions but now their true colors are showing.  \n\nThey can try shutting down little things like this all they want but people will still take screenshots, copy the text, crawl them.  They'll find out shortly how scalable this is to a small site.  Their attempt to control stuff to the nth degree is amusing as it will probably fall apart for them.  \n\nIf what I'm saying builds distrust and creates an aversion to working with them properly, that's also business.  What a world.\n\n>I'll be honest this sounds like a bitter response released when a controversial article is trending.\n\nSeems like plenty of people didn't realize how twitter data can be controlled and is controlled.  Their free APIs make it look like they're this huge free and open ecosystem which is absolutely not the case.  Censorship and crazy monetary gateways are pretty similar.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1440466687.0,
    "date_created": "2015-08-24",
    "time_created": "13:38:07",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudwzcq",
    "parent_id": "t1_cudvtge",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "So they hadn't 'shut the sites down' but they removed their API support.\n\nThe sites can still be active and displaying those tweets, right?",
    "controversiality": 0,
    "ups": 391,
    "downs": 0,
    "score": 391,
    "created": 1440456109.0,
    "date_created": "2015-08-24",
    "time_created": "10:41:49",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxr9k",
    "parent_id": "t1_cudvtge",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> screenshots are less trustworthy as they're easier to fake\n\neasier than what? easier than a text archive? come on! that is utter bullshit.\n\n> screenshots are very trustworthy as that is bullshit\n\nsee! I \"faked\" your comment and I didn't even need to *buy* photoshop...\n\nthe real reason for a text archive ober a picture archive: archiving of pictures of tweets is A LOT more effort than archiving 140 characters + name of tweeter + date. you need to capture the pic, store a lot more data, cannot search through it without extra effort, need more bandwidth since pics are more data than text etc...",
    "controversiality": 0,
    "ups": 136,
    "downs": 0,
    "score": 136,
    "created": 1440457460.0,
    "date_created": "2015-08-24",
    "time_created": "11:04:20",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxmr8",
    "parent_id": "t1_cudvtge",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> I doubt this, because screenshots are less trustworthy as they're easier to fake, so it probably was a text archive with time stamps.\n\nIf the text isn't stored on Twitter's servers it is no more trustworthy to be storing text. That said, storing screen caps would be a terrible waste of space.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1440457249.0,
    "date_created": "2015-08-24",
    "time_created": "11:00:49",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxn5w",
    "parent_id": "t1_cudvtge",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Oh.  That's not nearly the same thing.  Tons of websites have crawlers off for various reasons.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440457267.0,
    "date_created": "2015-08-24",
    "time_created": "11:01:07",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudz8el",
    "parent_id": "t1_cudvtge",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "So do web scraping, it's not that hard.\n\nScrape the data, let people download a copy, share your source code, and you're technically unstoppable. Which leaves you with the legal issue. Which is solved by operating anonymously or in some country away from the US where it's too impractical to sue you.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440459903.0,
    "date_created": "2015-08-24",
    "time_created": "11:45:03",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudwco4",
    "parent_id": "t1_cudvtge",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah, I did not consider Photoshop. Thanks, friend.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1440454969.0,
    "date_created": "2015-08-24",
    "time_created": "10:22:49",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyogl",
    "parent_id": "t1_cudy5f2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You have betrayed my trust, sir!",
    "controversiality": 0,
    "ups": 88,
    "downs": 0,
    "score": 88,
    "created": 1440459002.0,
    "date_created": "2015-08-24",
    "time_created": "11:30:02",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudzaub",
    "parent_id": "t1_cudy5f2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> Took me 22 seconds:  \n> My girlfriend doesn't get The Full Sex either\n\nTook me 5 seconds... Programmatically archived images are no less \"verified\" than programmatically archived text.",
    "controversiality": 0,
    "ups": 37,
    "downs": 0,
    "score": 37,
    "created": 1440460014.0,
    "date_created": "2015-08-24",
    "time_created": "11:46:54",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudwn5x",
    "parent_id": "t1_cudwlqi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "What was the case with Netflix and what did those scrapers do, if you don't mind my asking?",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1440455499.0,
    "date_created": "2015-08-24",
    "time_created": "10:31:39",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudwlae",
    "parent_id": "t1_cudwj3s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yes, I think that's what's at the core of the issue here. Perhaps they want to make an example of out those companies who violated the ToS to warn others?",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1440455405.0,
    "date_created": "2015-08-24",
    "time_created": "10:30:05",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue9k9j",
    "parent_id": "t1_cudyh0g",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Correct. The title for this article is very misleading; Twitter is in the right here, even though the result of following their own rules  by effect produced an unfavorable outcome.\n\nBut unfortunately, many won't read passed the title.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440475735.0,
    "date_created": "2015-08-24",
    "time_created": "16:08:55",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxl72",
    "parent_id": "t1_cudw0cz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is exactly the case.  They can't force these sites to shut down, but they can ban them from using Twitter's API which effectively neuters them.\n\n[Last time this flared up](http://www.businessinsider.com/twitter-kills-politwoops-deleted-tweets-politicians-api-access-privacy-sunlight-foundation-2015-6?r=UK&IR=T), Twitter pointed to their [developer agreement and policy](https://dev.twitter.com/overview/terms/agreement-and-policy) which explicitly states:\n\n>**I.2.f** Only surface Twitter activity as it surfaced on Twitter. For example, your Service should execute the unfavorite and delete actions by removing all relevant Content, *not by publicly displaying to other users that the Tweet is no longer favorited or has been deleted.*\n\nMaking a site dedicated to pointing out that certain tweets are deleted goes directly against that policy.\n\n---\n\nSo why not gather the tweets manually and copy/paste them?\n\nAgain, the [Terms of Service](https://twitter.com/tos?lang=en):\n\n> **8.** Except as permitted through the Twitter Services, these Terms, or the terms provided on dev.twitter.com, *you have to use the Twitter API* if you want to reproduce, modify, create derivative works, distribute, sell, transfer, publicly display, publicly perform, transmit, or otherwise use the Twitter Services or Content on the Twitter Services.\n\n---\n\n**Everybody** has these protections, not just politicians.  \nIf you see a violation, [you can report it](https://support.twitter.com/forms).",
    "controversiality": 0,
    "ups": 897,
    "downs": 0,
    "score": 897,
    "created": 1440457177.0,
    "date_created": "2015-08-24",
    "time_created": "10:59:37",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxshc",
    "parent_id": "t1_cudw0cz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "So what I'm hearing is that screen-shotting still works. ",
    "controversiality": 0,
    "ups": 58,
    "downs": 0,
    "score": 58,
    "created": 1440457516.0,
    "date_created": "2015-08-24",
    "time_created": "11:05:16",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxfkt",
    "parent_id": "t1_cudw0cz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440456910.0,
    "date_created": "2015-08-24",
    "time_created": "10:55:10",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue3rm9",
    "parent_id": "t1_cudwnt7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "How are both views valid? It's in their TOS. It'd be weird for them to make everyone follow the rules, unless it's a politician they're dealing with. Everyone, regardless of profession, should have equal protection under a site's TOS. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440466962.0,
    "date_created": "2015-08-24",
    "time_created": "13:42:42",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudytyx",
    "parent_id": "t1_cudwwcz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Thank you, I always get to threads like this too late. Right to be forgotten, anyone?",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1440459257.0,
    "date_created": "2015-08-24",
    "time_created": "11:34:17",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudz4xm",
    "parent_id": "t1_cudxjsj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Definitely makes sense, then, that they'd remove it.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1440459751.0,
    "date_created": "2015-08-24",
    "time_created": "11:42:31",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxfis",
    "parent_id": "t1_cudwhdf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1440456908.0,
    "date_created": "2015-08-24",
    "time_created": "10:55:08",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudwoda",
    "parent_id": "t1_cudwhdf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Tired I think, honestly. We all knew about the NSA, then Snowden happened and now we really know. We used up a lot of fucks in the next year or so. They simply just out lasted us and didn't change a fucking thing. I know there are people still putting up the good fight, but you can only be angsty for so long, and everyday it is a new fucking problem.",
    "controversiality": 0,
    "ups": 535,
    "downs": 0,
    "score": 535,
    "created": 1440455559.0,
    "date_created": "2015-08-24",
    "time_created": "10:32:39",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxa2u",
    "parent_id": "t1_cudwhdf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> People are too comfortable to care.\n\nA couple weeks ago I saw something on Reddits New thread submissions that I had to save that perfectly summarised this. It shocked me so much I had to save it. \n\n[Here] (http://np.reddit.com/r/AskReddit/comments/3gttiy/white_people_of_america_what_is_your_view_on_all/cu1e80t?context=3) ",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1440456636.0,
    "date_created": "2015-08-24",
    "time_created": "10:50:36",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxei4",
    "parent_id": "t1_cudwhdf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "As I heard someone once say: \"While there's bread on the table, people won't walk the streets,\" and I guess it pretty much corresponds to the situation - we've all bought in, and while nothing pushes us, we get distracted with our own little universes. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1440456857.0,
    "date_created": "2015-08-24",
    "time_created": "10:54:17",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudzk7h",
    "parent_id": "t1_cudwhdf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">People are too comfortable to care.\n\nI live paycheck to paycheck and make $12 an hour. I can't afford to be outraged. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440460429.0,
    "date_created": "2015-08-24",
    "time_created": "11:53:49",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudzwxu",
    "parent_id": "t1_cudwhdf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm actually perfectly ok with NSA logging things. My life is so mundane it's not like it matters. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440460989.0,
    "date_created": "2015-08-24",
    "time_created": "12:03:09",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue6tr5",
    "parent_id": "t1_cudxvdt",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> There's nothing stopping these websites from holding on to their own copies of politicians tweets. They just can't ask Twitter for them any longer after they've been deleted.\n\nAs I understand it, that's exactly what they were doing already. Deleted Tweets were never accessible via the API. The sites were diffing the current politician's timeline with a historical record of it and looking for anything that disappeared, thereby implying it had been deleted. \n\nThis violated Twitter's T&C because they were storing deleted Tweets offline. So Twitter blacklisted their API key. And if they try to bypass their API and screenscrape, they'll likely just get IP banned by Twitter. ",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1440471644.0,
    "date_created": "2015-08-24",
    "time_created": "15:00:44",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue6grv",
    "parent_id": "t1_cudxvdt",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1440471094.0,
    "date_created": "2015-08-24",
    "time_created": "14:51:34",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue74wz",
    "parent_id": "t1_cudxvdt",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Damn, from the headline I thought Twitter was suing companies for holding copies (doesn't twitter claim to own the copyright for tweets?  I haven't read the TOS because I don't use Twitter, but that was my impression)",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440472123.0,
    "date_created": "2015-08-24",
    "time_created": "15:08:43",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuedeim",
    "parent_id": "t1_cudxvdt",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Source? I think you've gotten it confused. \n\nIt appears that there is no API fix, but that archiving deleted tweets has not been allowed behavior for a while and now you will be cut off from the Twitter API for doing so even in the pursuit of political transparency. The articles I've read were extremely unclear. [Here](https://dev.twitter.com/overview/terms/agreement-and-policy) are relevant sections from the current Twitter Developer Agreement & Policy that imply this has been the case:\n\n>Only surface Twitter activity as it surfaced on Twitter. For example, your Service should execute the unfavorite and delete actions by removing all relevant Content, not by publicly displaying to other users that the Tweet is no longer favorited or has been deleted.\n\n...\n\n>Take all reasonable efforts to do the following, provided that when requested by Twitter, you must promptly take such actions:\n\n>i. Delete Content that Twitter reports as deleted or expired;\n\n>ii. Change treatment of Content that Twitter reports is subject to changed sharing options (e.g., become protected); and\n\n>iii. Modify Content that Twitter reports has been modified.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440481565.0,
    "date_created": "2015-08-24",
    "time_created": "17:46:05",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue0182",
    "parent_id": "t1_cudxvdt",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "But privacy nsa government free speech outrage outrage -reddit",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1440461180.0,
    "date_created": "2015-08-24",
    "time_created": "12:06:20",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue3jri",
    "parent_id": "t1_cudx900",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Complain on twitter.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440466619.0,
    "date_created": "2015-08-24",
    "time_created": "13:36:59",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyj7z",
    "parent_id": "t1_cudx900",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Go be outraged and tell everyone on the Internet how outraged you are.\n\nBonus points if you link people to an online petition.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1440458766.0,
    "date_created": "2015-08-24",
    "time_created": "11:26:06",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudzziy",
    "parent_id": "t1_cudxipk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You want de good season , but you need de bad pussy",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440461105.0,
    "date_created": "2015-08-24",
    "time_created": "12:05:05",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx23u",
    "parent_id": "t1_cudwusy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> but politicians deserve the same consideration in this regard as anyone else does.\n\nNo they don't.\n\n> We should be doing more to make it an appealing profession for the smartest people in the country\n\nThat's not necessarily wrong, but more importantly, we should be doing more to make it appealing for the most ethical people in the country.  Or at least more unappealing for the unethical.  ",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1440456241.0,
    "date_created": "2015-08-24",
    "time_created": "10:44:01",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxi0b",
    "parent_id": "t1_cudwusy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">they are forced to put up with to stay competitive. \n\n\n>We should be doing more to make it an appealing profession\n\n\nBoo hoo hoo, the political elites are having a tough time controlling their populations because of this new fangled internet thing. \n\nGive me a fucking break. \n\n",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1440457024.0,
    "date_created": "2015-08-24",
    "time_created": "10:57:04",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudy1o5",
    "parent_id": "t1_cudwusy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> I think politicians are people too. The issue of 'the right to be forgotten' is not a clear-cut one, but politicians deserve the same consideration in this regard as anyone else does.\n\nYes, they do.\n\nOnce they are no longer in charge of our laws and country.\n\nOnce they return to private life, sure, delete all you like.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440457948.0,
    "date_created": "2015-08-24",
    "time_created": "11:12:28",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudy7ga",
    "parent_id": "t1_cudx9af",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1440458218.0,
    "date_created": "2015-08-24",
    "time_created": "11:16:58",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cueg5fa",
    "parent_id": "t1_cue82hk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And the people at the top of the thread are complaining about how Twitter doesn't protect privacy rights anymore. Heh. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440486240.0,
    "date_created": "2015-08-24",
    "time_created": "19:04:00",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue00rt",
    "parent_id": "t1_cudyvmd",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Middle school technology class rule #1",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1440461160.0,
    "date_created": "2015-08-24",
    "time_created": "12:06:00",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue00br",
    "parent_id": "t1_cudyd84",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The important thing to note is they blocked API access for violation of the ToS. So it was well within their right to enforce this. There wasn't some preferential treatment here.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1440461140.0,
    "date_created": "2015-08-24",
    "time_created": "12:05:40",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuecnzu",
    "parent_id": "t1_cudykqm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> When I hit delete [...] I expect it to be deleted. Can you imagine if Reddit pulled something like this?\n\nPulled what? Got upset that someone archived and showcased deleted posts? Or that the service didn't actually delete the post, because that isn't the issue.\n\nTwitter deletes the message from public view. Reddit deletes the message from public view. But none of this stops someone from creating a recorder that makes a copy of all posts and then checks back later to see if they were deleted. In fact, I am certain one already exists for Reddit.\n\nIf something is posted online, someone can copy it online. This isn't a matter of what is \"permitted\", it is simply the nature of data.\n",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440480401.0,
    "date_created": "2015-08-24",
    "time_created": "17:26:41",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cueghbi",
    "parent_id": "t1_cuegfvp",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Seems possible.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440486816.0,
    "date_created": "2015-08-24",
    "time_created": "19:13:36",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyerx",
    "parent_id": "t1_cudy69r",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'ts a pretty good tool for sports fanatics who follow their favorite players or favorite sporting news reporters. You definitely get real time up to date info for fantasy football people as well. ",
    "controversiality": 0,
    "ups": 1055,
    "downs": 0,
    "score": 1055,
    "created": 1440458557.0,
    "date_created": "2015-08-24",
    "time_created": "11:22:37",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyjr8",
    "parent_id": "t1_cudy69r",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's easy to follow people in industries you're interested in. It's certainly kinda silly to try and analyze globally because like anything free on the internet, there's a lot of noise but using it a tool to target specifics it's a good alternative to an RSS reader.  For example, the tech sector is very active as well as a good place for insider sports news.",
    "controversiality": 0,
    "ups": 121,
    "downs": 0,
    "score": 121,
    "created": 1440458790.0,
    "date_created": "2015-08-24",
    "time_created": "11:26:30",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudz1x9",
    "parent_id": "t1_cudy69r",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I use it for customer service. Shocked it works but major companies like COMCAST and jet blue respond quickly to my negative experiences and make them right. ",
    "controversiality": 0,
    "ups": 97,
    "downs": 0,
    "score": 97,
    "created": 1440459618.0,
    "date_created": "2015-08-24",
    "time_created": "11:40:18",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyjso",
    "parent_id": "t1_cudy69r",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Twitter is great for following specifics events or people. ",
    "controversiality": 0,
    "ups": 76,
    "downs": 0,
    "score": 76,
    "created": 1440458791.0,
    "date_created": "2015-08-24",
    "time_created": "11:26:31",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudymjx",
    "parent_id": "t1_cudy69r",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Using tweetdeck i pretty much use twitter as a Chatbox.\nI follow a lot of gaming related people, and accounts tied to tv shows i enjoy, and i never ever see adds or anything.\n\nHashtags aren't that big either,  It's all nicely filtered into categories.\n\nI wouldn't use twitter if it wasn't for this third party app, twitter on It's own is pretty garbage worthy.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1440458916.0,
    "date_created": "2015-08-24",
    "time_created": "11:28:36",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyk3a",
    "parent_id": "t1_cudy69r",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I use twitter and I'm not really concerned with how many users are fake considering I follow who I want. I don't look into what's trending so manipulation of hashtags does not affect me. Hostility towards third parties doesn't affect me either. I just use it to keep up and joke with a few buddies and for a couple of accounts I like. That being said I'm 20 and often wonder how long I'll be interested in it. I can't see myself using it at 40 whereas facebook is a a socially accepted way for everyone to stay in touch regardless of age. ",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1440458804.0,
    "date_created": "2015-08-24",
    "time_created": "11:26:44",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyf1j",
    "parent_id": "t1_cudy69r",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1440458569.0,
    "date_created": "2015-08-24",
    "time_created": "11:22:49",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuzwss2",
    "parent_id": "t1_cudy69r",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Is it sad that I spend so much time on reddit that I'm sure I've seen you comment about your wife's Co test winnings before?  Lol",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1442171053.0,
    "date_created": "2015-09-13",
    "time_created": "07:04:13",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudynm9",
    "parent_id": "t1_cudyhck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">just kidding\n\nThat's it.  You're shadowbanned as soon as I find something in your history that offends me. ",
    "controversiality": 0,
    "ups": 228,
    "downs": 0,
    "score": 228,
    "created": 1440458964.0,
    "date_created": "2015-08-24",
    "time_created": "11:29:24",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudymj8",
    "parent_id": "t1_cudyhck",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "What site is that so I can avoid it? /s",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1440458915.0,
    "date_created": "2015-08-24",
    "time_created": "11:28:35",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue2c8q",
    "parent_id": "t1_cudz4l5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Welcome to Earth.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1440464768.0,
    "date_created": "2015-08-24",
    "time_created": "13:06:08",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudwzg5",
    "parent_id": "t1_cudwkic",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You just told the story of Reddit.",
    "controversiality": 0,
    "ups": 1444,
    "downs": 0,
    "score": 1444,
    "created": 1440456113.0,
    "date_created": "2015-08-24",
    "time_created": "10:41:53",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx6nq",
    "parent_id": "t1_cudwkic",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Well there's no free lunch. Either you pay, or some other person. If you foot the bill, the content will be to your liking, if it's not you, well...",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1440456470.0,
    "date_created": "2015-08-24",
    "time_created": "10:47:50",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudz6fp",
    "parent_id": "t1_cudwkic",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The great American question, \"How do I make money from this?\"",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440459817.0,
    "date_created": "2015-08-24",
    "time_created": "11:43:37",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue0bwk",
    "parent_id": "t1_cudwkic",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Well at least wikipedia still have some degree of dignity in that regard, sure the yearly plea for donation gets annoying a little but it could definitely be worse.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440461651.0,
    "date_created": "2015-08-24",
    "time_created": "12:14:11",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxn01",
    "parent_id": "t1_cudwkic",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1440457260.0,
    "date_created": "2015-08-24",
    "time_created": "11:01:00",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxzms",
    "parent_id": "t1_cudwkic",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "These companies present multiple year plans to investors, so its not crazy to think that they had an idea to make it profitable once they had a sizable user base",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440457852.0,
    "date_created": "2015-08-24",
    "time_created": "11:10:52",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudzrws",
    "parent_id": "t1_cudwkic",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "San Francisco Story. The best is when they cash out and suddenly think they are big dick swangin' VC's by default. \n\nNo you're not. Most of you have terrible social and financial skills. Give me POA so you're not broke in 5 years. Pick out an obviously out of your league GF to match your McLaren and head to the Cars and Coffee or Santana Row with the other db's. \n\n...and slow the fuck down on Sand Hill Rd. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440460765.0,
    "date_created": "2015-08-24",
    "time_created": "11:59:25",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxdgk",
    "parent_id": "t1_cudwix1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "But do they restrict 3rd party sites from archiving deleted posts?",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1440456805.0,
    "date_created": "2015-08-24",
    "time_created": "10:53:25",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudwxqv",
    "parent_id": "t1_cudwix1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "They don't delete the right ones.\n\nEdit: as in material related to the sub. ",
    "controversiality": 1,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1440456030.0,
    "date_created": "2015-08-24",
    "time_created": "10:40:30",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxdp9",
    "parent_id": "t1_cudx0hq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "No. When you go public with a statement, you forfeit privacy on that statement. As a politician, you should wear any statement you have made and be able to explain the why and how.",
    "controversiality": 0,
    "ups": 79,
    "downs": 0,
    "score": 79,
    "created": 1440456817.0,
    "date_created": "2015-08-24",
    "time_created": "10:53:37",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudy56o",
    "parent_id": "t1_cudxe9d",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's embarrassing that the defense for turning corrupt is \"You've gotta play ball just like everything else.\" \n\nWhen did being corrupt become the norm and why is it considered something that inevitably happens? \"Oh well they got big so them being corrupt...is just the norm.\"",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1440458115.0,
    "date_created": "2015-08-24",
    "time_created": "11:15:15",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyy47",
    "parent_id": "t1_cudyhqc",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "They're told beforehand how Colbert is going to act. Each guest is briefed that he will \"be an idiot\" and that they should play and expand off of that. ",
    "controversiality": 0,
    "ups": 107,
    "downs": 0,
    "score": 107,
    "created": 1440459445.0,
    "date_created": "2015-08-24",
    "time_created": "11:37:25",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue0aod",
    "parent_id": "t1_cudyhqc",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You really believe a billionaire doesn't have handlers to tell him who Colbert is? Not only that but Colbert briefs every guest he is a dick on the show and apologized beforehand.",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1440461599.0,
    "date_created": "2015-08-24",
    "time_created": "12:13:19",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue512m",
    "parent_id": "t1_cudyhqc",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The guy has been on Colbert several times, he should know what to expect.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440468898.0,
    "date_created": "2015-08-24",
    "time_created": "14:14:58",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue14d3",
    "parent_id": "t1_cudyhqc",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Colbert is not Ali G, they are well prepared for the interview.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1440462880.0,
    "date_created": "2015-08-24",
    "time_created": "12:34:40",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue1p1s",
    "parent_id": "t1_cue012q",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Lets not romanticize it, twitter has always been stupid. Its an app thats basically facebook stripped down to character limited status posts. I never understood how it got so popular.",
    "controversiality": 0,
    "ups": 104,
    "downs": 0,
    "score": 104,
    "created": 1440463778.0,
    "date_created": "2015-08-24",
    "time_created": "12:49:38",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue29a5",
    "parent_id": "t1_cue1o36",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "My old company was doing scraping literally for years before I came in and told them that spending 45 minutes to do what I did with the API in 1 was absurd. Our program was for internal use entirely, so using the API was perfect. But scraping was working undetected all that time. ",
    "controversiality": 0,
    "ups": 127,
    "downs": 0,
    "score": 127,
    "created": 1440464638.0,
    "date_created": "2015-08-24",
    "time_created": "13:03:58",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue3wtq",
    "parent_id": "t1_cue2o5o",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You'd get sued to hell.  Funny thing is the API i wanted to use can be scraped by something within the means of robots.txt's rules.\n\nBut I just said fuck the whole thing and fuck that company.  I'm sure the second I became successful with it they'd show up wanting to \"partner\".",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440467179.0,
    "date_created": "2015-08-24",
    "time_created": "13:46:19",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue41f2",
    "parent_id": "t1_cue3lb2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440467372.0,
    "date_created": "2015-08-24",
    "time_created": "13:49:32",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxkzv",
    "parent_id": "t1_cudwzcq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Maybe, but even if they are still active you would have to have a human posting the tweets. Which is pretty much impossible due to the sheer number and I'm guessing the inability of the sites to pay for that kind of labor force.",
    "controversiality": 0,
    "ups": 76,
    "downs": 0,
    "score": 76,
    "created": 1440457167.0,
    "date_created": "2015-08-24",
    "time_created": "10:59:27",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudztqd",
    "parent_id": "t1_cudwzcq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Even if they remove the API access, the fact that they had API access likely means they agreed to terms of service and they're probably in violation of those terms. So, Twitter might have a case to sue them if they really wanted to.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440460844.0,
    "date_created": "2015-08-24",
    "time_created": "12:00:44",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudzyu8",
    "parent_id": "t1_cudxr9k",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Why would you \"screenshot\", FFS?  You get the data as HTML, why wouldn't you save that?",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1440461075.0,
    "date_created": "2015-08-24",
    "time_created": "12:04:35",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue0n0g",
    "parent_id": "t1_cudxr9k",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[Exactly!](http://imgur.com/ubGFoXa)",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440462134.0,
    "date_created": "2015-08-24",
    "time_created": "12:22:14",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudwzws",
    "parent_id": "t1_cudwco4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Honestly the only reason that's a problem is because people understand that you can use photoshop to fake things. Altering text is much easier, but what it boils down to is that you can fake anything like that, so the only thing backing a claim is your trust in the source.",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1440456137.0,
    "date_created": "2015-08-24",
    "time_created": "10:42:17",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxk5i",
    "parent_id": "t1_cudwco4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Not sure why you would use Photoshop when you can just hammer F12, change the text of a tweet to anything you want, and then take the screenshot.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1440457126.0,
    "date_created": "2015-08-24",
    "time_created": "10:58:46",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue09ej",
    "parent_id": "t1_cudyogl",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "If you don't do The Full Sex you aren't trustworthy anyway! Get out of here, you asexual weirdo!",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1440461541.0,
    "date_created": "2015-08-24",
    "time_created": "12:12:21",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx3by",
    "parent_id": "t1_cudwn5x",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 82,
    "downs": 0,
    "score": 82,
    "created": 1440456300.0,
    "date_created": "2015-08-24",
    "time_created": "10:45:00",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx16r",
    "parent_id": "t1_cudwn5x",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Netflix shut down their public API to stop third party apps (likely because they wanted tighter control of the Netflix brand and the experience of using their product; a third party \"Netflix\" app confuses that). As a result, to get the same data people were using before, these sites built scrapers, which load up the Netflix webpage just like your browser and parse the HTML to get the information they want.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1440456196.0,
    "date_created": "2015-08-24",
    "time_created": "10:43:16",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxysk",
    "parent_id": "t1_cudxl72",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Why is the relevant information always posted as a reply, this hould be a top level comment and should in return be the top comment.",
    "controversiality": 0,
    "ups": 171,
    "downs": 0,
    "score": 171,
    "created": 1440457813.0,
    "date_created": "2015-08-24",
    "time_created": "11:10:13",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudy1l1",
    "parent_id": "t1_cudxl72",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That TOS is only for Twitter Developers (Er, those using their API) right?\n\nSo anyone else could legally go out and write a script that checks every tweet sent by a person, screenshot it and file it away just in case they delete it.\n \nNot saying it's practical, but it's not impossible or illegal, right?\n",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1440457943.0,
    "date_created": "2015-08-24",
    "time_created": "11:12:23",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxxi2",
    "parent_id": "t1_cudxshc",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yes, it can be done manually - but these groups were doing it automatically. This will require significantly more work, but I don't think there is a legal or technical reason why they can't do it.\n\nEdit: There may be a TOS restriction about using screenshots instead of the API, but I have no idea how that would hold up to legal scrutiny.",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1440457752.0,
    "date_created": "2015-08-24",
    "time_created": "11:09:12",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue09mb",
    "parent_id": "t1_cudxshc",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "What I'm hearing is don't use their API. Build your own by web scraping.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440461551.0,
    "date_created": "2015-08-24",
    "time_created": "12:12:31",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue3hut",
    "parent_id": "t1_cudz4xm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "For some reason, people seem to get very angry and think their rights are getting violated when a private company does this. Kind of funny, really.",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1440466538.0,
    "date_created": "2015-08-24",
    "time_created": "13:35:38",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyyqc",
    "parent_id": "t1_cudxfis",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Or they don't know how to make a difference.",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1440459475.0,
    "date_created": "2015-08-24",
    "time_created": "11:37:55",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx21q",
    "parent_id": "t1_cudwoda",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> We all knew about the NSA\n\nReally? Because I'm pretty sure that anyone who claimed that the government was spying on them was called a conspiracy theorist before the Snowden thing.",
    "controversiality": 0,
    "ups": 618,
    "downs": 0,
    "score": 618,
    "created": 1440456239.0,
    "date_created": "2015-08-24",
    "time_created": "10:43:59",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx9x3",
    "parent_id": "t1_cudwoda",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Not tired.  Chay-wow is right: comfortable.  It's the inevitable evolution of dominant empires. Countries with such economic and military power create cultures that expect comfort: welfare, entertainment, and luxury.  Those things cause people to be sufficiently satisfied with life that they lose perspective on what's happening; this is why governments provide such things. Why do you think Trump is so popular? Because he's right or more honest? Certainly not,  he's entertainment and US society now finds comfort in that as it's misleading evidence that everything is okay.  Unfortunately, that cultural trend is also the leading cause of empire's downfall; it happened with Rome, China, Britain, and more.  ",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1440456628.0,
    "date_created": "2015-08-24",
    "time_created": "10:50:28",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuefvmp",
    "parent_id": "t1_cue6tr5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440485753.0,
    "date_created": "2015-08-24",
    "time_created": "18:55:53",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuegt1d",
    "parent_id": "t1_cue6tr5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Right. And this angle makes Twitter seem much more sensible in my opinion: obviously they want their users to be able to delete tweets, and obviously users want that deletion to \"stick\" --- not just on Twitter, but globally. \n\nWe might think that politicians are a special case who lose that right, but who is Twitter to decide who's \"really\" a politician? Why should a social media site involve itself with politics?\n\nIP bans will likely be effective. If you think otherwise, try blocking out a few hours to try and screen scrape Google in a large enough volume to matter. PROTIP: you can't, because Google has extremely smart filters set up to stop you. I had a random one-off job to count the Google results for a bunch of keywords, and I discovered that even when I went through Tor, Google would block me within a few seconds of switching endpoints. When your target has billions of dollars and the best engineers in the country on hand, *you will lose every time*.\n\nIf not, the Twitter TOS is now \"fixed\" so that Twitter has the right to sue any of these sites in to the ground when they pop up.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440487390.0,
    "date_created": "2015-08-24",
    "time_created": "19:23:10",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue7mvp",
    "parent_id": "t1_cue6grv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Like most outrages on Internet forums.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1440472871.0,
    "date_created": "2015-08-24",
    "time_created": "15:21:11",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxk6m",
    "parent_id": "t1_cudx23u",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's only a matter of time before everyone's comments everywhere are archived for all time to be used against you at any moment in the future regardless of context.  If it's okay to run organized \"gotcha\" archives for everything politicians say and do in the moment, how about if, next year, you find everything you ever wrote or said open to download on the internet by someone trying to outcompete you for a contract, a job or a girlfriend?",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1440457127.0,
    "date_created": "2015-08-24",
    "time_created": "10:58:47",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxjen",
    "parent_id": "t1_cudx23u",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "People, regardless of their job, should still be able to take things back, to change their opinion. If we expect our politicians to be perfect, we'll just be constantly disappointed. ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1440457091.0,
    "date_created": "2015-08-24",
    "time_created": "10:58:11",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue1337",
    "parent_id": "t1_cudx23u",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> No they don't.\n\nSo what is your suggestion, having politicians be the sole exception on the Twitter API?\n\nIf you want politicians to be candid on social media then you need to give them the same tools as the rest of us, including deleting comments.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440462824.0,
    "date_created": "2015-08-24",
    "time_created": "12:33:44",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyxoz",
    "parent_id": "t1_cudy7ga",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The clickbait headline doesn't stop people from reading the article or using common sense or doing any googling before forming strong opinions. Most people are just dumb and lazy.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1440459426.0,
    "date_created": "2015-08-24",
    "time_created": "11:37:06",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudypfu",
    "parent_id": "t1_cudyerx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's also good if you are following a project or new product release.",
    "controversiality": 0,
    "ups": 317,
    "downs": 0,
    "score": 317,
    "created": 1440459044.0,
    "date_created": "2015-08-24",
    "time_created": "11:30:44",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudzi7h",
    "parent_id": "t1_cudyerx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Also great for reporters / PR people. News breaks on Twitter much faster. I still remember seeing the Boston bombing photos from users tweeting it before even my friend in Boston, who lived 2 miles away from the bombing, knew anything happened. ",
    "controversiality": 0,
    "ups": 76,
    "downs": 0,
    "score": 76,
    "created": 1440460341.0,
    "date_created": "2015-08-24",
    "time_created": "11:52:21",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudzl58",
    "parent_id": "t1_cudyerx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah, it's a good tool to follow celebrities, public figures, companies, etc. I check out my local police station's Twitter to figure out WTF is going on in my city fairly often actually. *Choppers overhead? Let's see what the PD's Twitter says about it.* It's pretty informative when it comes to certain topics.\n\nBut for me to tweet is pretty useless. No one gives a shit what I have to say because I am not cool.",
    "controversiality": 0,
    "ups": 91,
    "downs": 0,
    "score": 91,
    "created": 1440460469.0,
    "date_created": "2015-08-24",
    "time_created": "11:54:29",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudztuc",
    "parent_id": "t1_cudyerx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Agreed. Jordy Nelson injury rumors hit yesterday, and I hopped on Twitter before checking any sports news sites. Sports news always breaks first on Twitter.",
    "controversiality": 0,
    "ups": 68,
    "downs": 0,
    "score": 68,
    "created": 1440460849.0,
    "date_created": "2015-08-24",
    "time_created": "12:00:49",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue0axx",
    "parent_id": "t1_cudyerx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "People always shit on Twitter because they don't realize they aren't following the right people ",
    "controversiality": 0,
    "ups": 204,
    "downs": 0,
    "score": 204,
    "created": 1440461610.0,
    "date_created": "2015-08-24",
    "time_created": "12:13:30",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudzbqb",
    "parent_id": "t1_cudyerx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This. I pretty much only use Twitter for up-to-the-second info on sports (it's especially fun during a trade deadline for MLB, NBA, and NHL) or to follow artists or labels to get straight-from-the-source info.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1440460053.0,
    "date_created": "2015-08-24",
    "time_created": "11:47:33",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudzmb0",
    "parent_id": "t1_cudyerx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Going to piggyback on this. I run an American football video replay and its quite handy for announcements, release dates, upcoming events, etc. Not everyone checks the sites so twitter is handy in that area.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440460520.0,
    "date_created": "2015-08-24",
    "time_created": "11:55:20",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue1dft",
    "parent_id": "t1_cudyjr8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I use it almost exclusively for sports news.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440463278.0,
    "date_created": "2015-08-24",
    "time_created": "12:41:18",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue0cea",
    "parent_id": "t1_cudz1x9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Ditto. When my LG washer was DOA and the repairmen couldn't figure out what was wrong with it (after 3 in-home visits), a single tweet bitching about LG led to getting a complete replacement unit within 2 days.",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1440461673.0,
    "date_created": "2015-08-24",
    "time_created": "12:14:33",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue65bc",
    "parent_id": "t1_cudz1x9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's kind of ridiculous - had a Skype account I couldn't log into and wanted to recover, but support by email kept denying that I had provided sufficient verification of ownership for the account.  I wasted several days corresponding with them, then I complained on Twitter.  They followed up, had my account back a day later.  I gave both reps the same info, but Twitter support seems to be more empowered to actually fix shit. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440470608.0,
    "date_created": "2015-08-24",
    "time_created": "14:43:28",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue1sts",
    "parent_id": "t1_cudz1x9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Same here. Spotify, Terminix, and UPS all responded to negative tweets when phone calls and emails failed to produce results.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440463938.0,
    "date_created": "2015-08-24",
    "time_created": "12:52:18",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue3mr7",
    "parent_id": "t1_cudyk3a",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Here in Norway it's pretty big amongst \"older\" people (>30). Especially media people like journalists, political commenters, people from entertainment and culture use it all the time. Kids (<30) use Facebook, Snapchat and Instagram.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1440466748.0,
    "date_created": "2015-08-24",
    "time_created": "13:39:08",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyk4h",
    "parent_id": "t1_cudyf1j",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 48,
    "downs": 0,
    "score": 48,
    "created": 1440458806.0,
    "date_created": "2015-08-24",
    "time_created": "11:26:46",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue01vq",
    "parent_id": "t1_cudynm9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You've both been banned from /r/offmychest",
    "controversiality": 0,
    "ups": 104,
    "downs": 0,
    "score": 104,
    "created": 1440461209.0,
    "date_created": "2015-08-24",
    "time_created": "12:06:49",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue2evn",
    "parent_id": "t1_cue2c8q",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Thanks, Will Smith.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440464882.0,
    "date_created": "2015-08-24",
    "time_created": "13:08:02",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx7i3",
    "parent_id": "t1_cudwzg5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 1202,
    "downs": 0,
    "score": 1202,
    "created": 1440456509.0,
    "date_created": "2015-08-24",
    "time_created": "10:48:29",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxgqq",
    "parent_id": "t1_cudwzg5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 469,
    "downs": 0,
    "score": 469,
    "created": 1440456965.0,
    "date_created": "2015-08-24",
    "time_created": "10:56:05",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuee4hv",
    "parent_id": "t1_cudwzg5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Maybe a stupid question, but what does Reddit need increasing capital for? Is it for server things to handle a higher number of users? Design wise the site has stayed consistent and it doesn't appear that there are vast changes being made to the site, so I'm curious if it requires increased capital or if it's monetary requirements have remained relatively stable ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440482747.0,
    "date_created": "2015-08-24",
    "time_created": "18:05:47",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudy9so",
    "parent_id": "t1_cudxn01",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> Anything even slightly unprofitable is also grounds for immediate removal.\n\nThat...can't be true.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1440458328.0,
    "date_created": "2015-08-24",
    "time_created": "11:18:48",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudy9mn",
    "parent_id": "t1_cudxdgk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "IIRC reddit admins got 'unedditreddit' removed from the chrome web store",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1440458320.0,
    "date_created": "2015-08-24",
    "time_created": "11:18:40",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudwz0z",
    "parent_id": "t1_cudwxqv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Who determines whats \"right\"?",
    "controversiality": 0,
    "ups": 60,
    "downs": 0,
    "score": 60,
    "created": 1440456092.0,
    "date_created": "2015-08-24",
    "time_created": "10:41:32",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyynw",
    "parent_id": "t1_cudxdp9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "How about \"the right to be forgotten\" concept?",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440459471.0,
    "date_created": "2015-08-24",
    "time_created": "11:37:51",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue2rtv",
    "parent_id": "t1_cudxdp9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Everybody make mistakes and everybody changes opinion. Politicians are humans like you and me. If you want people that never change their mind, and never make mistakes in your country you are going to elect some psychopathic robots. \n\nThe right to be forgotten from internet should be a human right. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1440465438.0,
    "date_created": "2015-08-24",
    "time_created": "13:17:18",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudzq5x",
    "parent_id": "t1_cudy56o",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> When did being corrupt become the norm \n\nYou really need to study history more. This isn't exactly a new problem.",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1440460690.0,
    "date_created": "2015-08-24",
    "time_created": "11:58:10",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudzctu",
    "parent_id": "t1_cudyy47",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The guest is the straight man to Colbert's hilarity.",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1440460100.0,
    "date_created": "2015-08-24",
    "time_created": "11:48:20",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue3l57",
    "parent_id": "t1_cue1p1s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I might be wrong but I believe Twitter became really popular once celebrities started using it.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1440466679.0,
    "date_created": "2015-08-24",
    "time_created": "13:37:59",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue5lsy",
    "parent_id": "t1_cue1p1s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You're absolutely right. It's destroying reporting too. Anything that can't fit into a tweet is determined to be beyond the scope of what a human being can handle. It's ridiculous.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1440469780.0,
    "date_created": "2015-08-24",
    "time_created": "14:29:40",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue82v2",
    "parent_id": "t1_cue1p1s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The impact it had during the Arab Spring was pretty significant. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1440473532.0,
    "date_created": "2015-08-24",
    "time_created": "15:32:12",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuecccj",
    "parent_id": "t1_cue1p1s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Because it's not Facebook. On Facebook you become friends with someone and that person is then friends with you too.* On Twitter you follow someone and they may choose to follow you back, or not. That makes Twitter good for communication (whether one-way or two-way) between celebrities of various kinds and common people, and also between people who aren't celebrities but just happen to be strangers, so they wouldn't connect on Facebook.\n\n*until Facebook saw how popular Twitter was and added the ability to just follow people without being friends.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440479899.0,
    "date_created": "2015-08-24",
    "time_created": "17:18:19",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue31pf",
    "parent_id": "t1_cue1p1s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "In some scenarios the character limit is good.  Some game developers like getting feedback on twitter because it forces users to be concise and hone in on what they want rather than being like oh and I hate this thing and this other things happened to me once and it was annoying, etc.\n\nNot great for bug reports but great for getting blips of feedback on what is going wrong.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440465857.0,
    "date_created": "2015-08-24",
    "time_created": "13:24:17",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue4xvt",
    "parent_id": "t1_cue1p1s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You're right about the \"I never understood\" part - Twitter is incredible for news, especially sports coverage. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440468762.0,
    "date_created": "2015-08-24",
    "time_created": "14:12:42",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue2g8s",
    "parent_id": "t1_cue29a5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm willing to bet there weren't a lot of butthurt politicians calling up Twitter to complain about your internal site and calling for an immediate remedy. So that doesn't surprise me it went undetected. Scrapers are easy to find and defeat if you have a reason to do so; your company just wasn't a big enough reason.",
    "controversiality": 0,
    "ups": 92,
    "downs": 0,
    "score": 92,
    "created": 1440464939.0,
    "date_created": "2015-08-24",
    "time_created": "13:08:59",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuea1yt",
    "parent_id": "t1_cue41f2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I reached out to the Twitter team to access their API. At the lowest rate, for a 2 person unfunded startup, the lowest they would go is 3k a month and that was the introductory rate. They were clear that that would only work for a few months and we'd either need to go up or end it once they saw what I was using it for.\n\nNow, I am not using Twitter, or SoundCloud, or YouTube. These APIs are scary. They get big letting you use them, then yank them out from under you. It sucks.\n\nTwitter needs to embrace developers and stop holding onto dollars so hard.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440476478.0,
    "date_created": "2015-08-24",
    "time_created": "16:21:18",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxosk",
    "parent_id": "t1_cudxkzv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> Maybe, but even if they are still active you would have to have a human posting the tweets. Which is pretty much impossible due to the sheer number and I'm guessing the inability of the sites to pay for that kind of labor force.\n\nThis isn't true.  Without the API you are back to web page scraping.  Web page scraping are how search engine spider bots work, btw.  A search engine like Google doesn't ask every web site to provide an API for searching content.  Even if it could do so, it shouldn't, because it should look at the same thing people will be looking at later, and analyze that.\n\nSearch bots don't use the API to index pages and page indexing is not a process that's  done by hand.",
    "controversiality": 0,
    "ups": 234,
    "downs": 0,
    "score": 234,
    "created": 1440457345.0,
    "date_created": "2015-08-24",
    "time_created": "11:02:25",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxxcw",
    "parent_id": "t1_cudxkzv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Not really, bots can read text in more than one manner, that's why captcha's look so weird.\n\nHowever, the problem is exponentially harder without the API and this likely pushes it beyond the realm of something that many people will be inclined to do for free.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1440457745.0,
    "date_created": "2015-08-24",
    "time_created": "11:09:05",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue2ei8",
    "parent_id": "t1_cudzyu8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Because then you might be able to crawl with a script instead of pumping everything around with an API.\n\nHonestly, I don't see why text based is ever used, it *is* harder to manipulate a screen shot than it is text.\n\n[08/24/15 01:06PM] /u/maleia: I love everyone\n\nCan easily be turned into:\n\n[08/24/15 01:06PM] /u/maleia: I hate everyone.\n\nSS would just be another layer of annoyance, but totally do-able, yea.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440464867.0,
    "date_created": "2015-08-24",
    "time_created": "13:07:47",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyqvq",
    "parent_id": "t1_cudxk5i",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Forgive me, I also do not do the F12.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440459111.0,
    "date_created": "2015-08-24",
    "time_created": "11:31:51",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyuwq",
    "parent_id": "t1_cudx3by",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The problem with scrapers is that unless it's built pretty robustly, any change in the website's HTML will screw it up and you have to update it. A different name of the field, different structure, anything like that.\n\nWith API you have a \"contract\" with the provider, that the way you call certain functions will not suddenly change. Unless, of course, they remove the API.",
    "controversiality": 0,
    "ups": 45,
    "downs": 0,
    "score": 45,
    "created": 1440459299.0,
    "date_created": "2015-08-24",
    "time_created": "11:34:59",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudznw2",
    "parent_id": "t1_cudxysk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1440460591.0,
    "date_created": "2015-08-24",
    "time_created": "11:56:31",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudzp08",
    "parent_id": "t1_cudxysk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Because mob rule outrage rules Reddit and generates the most upvotes. I'm glad there are people here who are genuinely interested in the story though and the behind-the-scenes details.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1440460640.0,
    "date_created": "2015-08-24",
    "time_created": "11:57:20",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudz7o1",
    "parent_id": "t1_cudy1l1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "There are two separate agreements, one for the API, one for the site itself.\n\nThe site-wide TOS applies to everybody using the site.  By using Twitter, you've agreed to the TOS:\n\n>These Terms of Service (“Terms”) govern your access to and use of our Services, including our various websites, SMS, APIs, email notifications, applications, buttons, widgets, ads, commerce services (the “Twitter Services”), and our other covered services that link to these Terms (collectively, the “Services”), and any information, text, graphics, photos or other materials uploaded, downloaded or appearing on the Services (collectively referred to as “Content”). Your access to and use of the Services are conditioned on your acceptance of and compliance with these Terms. **By accessing or using the Services you agree to be bound by these Terms.**\n\n---\n\nHere's how the rules apply:\n\n1. If you're using Twitter, you agree to the Terms of Service.\n2. If you wish to reproduce a tweet, you must use the Twitter API as per the Terms of Service (I.2.f)\n3. By using the Twitter API, you agree to the developer agreement which prohibits publicly displaying if a tweet is deleted or not\n\nRegardless of how you attempt to display a deleted tweet, you've violated an agreement with Twitter in some shape or form.  You either violated the developer agreement, or you violated the main ToS for not using the Twitter API to reproduce the tweet.\n\n---\n\nIt should be noted that Twitter does not prohibit displaying deleted tweets.  It prohibits displaying deleted or un-favorited tweets that are labeled as such.  \nFor example, if a site mirrors a tweet and that tweet is later deleted, the site itself may have missed that update and still have the tweet on display.  That kind of thing happens all the time on accident.  \nIf the site knows that the tweet has been deleted or un-favorited and marks it as such, now it's in violation of the developer agreement.\n\nAs per your question: you're free to use the Twitter API to copy or mirror as many tweets as you want.  You can even publicly mirror all of those tweets.  However, you cannot relay to the end user which tweets have been deleted or un-favorited.  That means either marking the tweets as such, or leaving the tweets unmarked but only displaying deleted/un-favorited tweets by virtue of the site's purpose.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1440459870.0,
    "date_created": "2015-08-24",
    "time_created": "11:44:30",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyl4f",
    "parent_id": "t1_cudy1l1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Its the terms to using the API, so it would apply to whoever runs said script",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440458851.0,
    "date_created": "2015-08-24",
    "time_created": "11:27:31",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudzqmt",
    "parent_id": "t1_cudxxi2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Well, you could technically rig up a bot that takes screenshots of every tweet a politician makes",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1440460710.0,
    "date_created": "2015-08-24",
    "time_created": "11:58:30",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudy5ib",
    "parent_id": "t1_cudxxi2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1440458130.0,
    "date_created": "2015-08-24",
    "time_created": "11:15:30",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudzns0",
    "parent_id": "t1_cudxxi2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I can see Tweet's without being on Twitter, can't I?\n\nIf that is the case, I don't need to have agreed to Twitter's TOS.\n\nI don't really Twitter, so I could be wrong, but I assume I can go google someone's Twitter feed without being required to login to Twitter, correct?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440460587.0,
    "date_created": "2015-08-24",
    "time_created": "11:56:27",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue7sn4",
    "parent_id": "t1_cue3hut",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Fucking reddit censoring my fat hate. This is literally just like North Korea",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1440473109.0,
    "date_created": "2015-08-24",
    "time_created": "15:25:09",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxt5x",
    "parent_id": "t1_cudx21q",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[Room 641A](https://en.wikipedia.org/wiki/Room_641A), where the NSA was found to have tapped in to internet trunk lines operated by AT&T, was exposed to the public in 2006. PBS did a whole program on it in 2007, so it was definitely known publicly years before the Snowden leaks.",
    "controversiality": 0,
    "ups": 137,
    "downs": 0,
    "score": 137,
    "created": 1440457548.0,
    "date_created": "2015-08-24",
    "time_created": "11:05:48",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx5ls",
    "parent_id": "t1_cudx21q",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "'tis true, our tinfoil hats were pointy and quite shiny.\n",
    "controversiality": 0,
    "ups": 187,
    "downs": 0,
    "score": 187,
    "created": 1440456415.0,
    "date_created": "2015-08-24",
    "time_created": "10:46:55",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyq1f",
    "parent_id": "t1_cudx21q",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Nope, that's incorrect. It was a big, mainstream story in late 2005 to early 2006. [The New York Times revealed the existence of wiretapping](http://www.nytimes.com/2005/12/16/politics/bush-lets-us-spy-on-callers-without-courts.html) on December 16th, 2005; [Bush publicly commented on it](http://www.cnn.com/2006/POLITICS/01/01/nsa.spying/), and there was even [an SNL skit about it](http://www.tv.com/shows/saturday-night-live/watch/peter-sarsgaard-the-strokes-613722/).\n\nThen everybody sort of forgot. Snowden put it back in the news and was able to prove how widespread it was. Then everybody sort of forgot again.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1440459072.0,
    "date_created": "2015-08-24",
    "time_created": "11:31:12",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxllk",
    "parent_id": "t1_cudx21q",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I remember when anyone who said the Iraq War wouldn't go well was called a \"liberal pessimist\" and people angrily yelled \"You think America can't even win a war?!\" (with the implication you didn't even believe in your country).\n\nOh... what a few trillion dollars and thousands of American lives can do to public opinion...",
    "controversiality": 0,
    "ups": 56,
    "downs": 0,
    "score": 56,
    "created": 1440457195.0,
    "date_created": "2015-08-24",
    "time_created": "10:59:55",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxbe8",
    "parent_id": "t1_cudx21q",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[There was a WIRED Magazine that covered exactly what the NSA was doing, three and a half years ago](http://cdn.lolzbook.com/wp-content/uploads/2013/07/Cover-of-Wired-magazine-April-2012.-A-year-before-Snowdens-leaks..jpg), and WIRED isn't really considered tin foil conspiracy theory stuff afaik.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440456702.0,
    "date_created": "2015-08-24",
    "time_created": "10:51:42",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx9jf",
    "parent_id": "t1_cudx21q",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "But we all suspected right?\n\nSame with police racism and brutality.  Hardly anyone believed black Americans were being treated equally by police all across the US. Our tolerance for it has changed, which I think is a good thing.",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1440456609.0,
    "date_created": "2015-08-24",
    "time_created": "10:50:09",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyozd",
    "parent_id": "t1_cudx21q",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "There was lots of substantial evidence supporting the NSA spying thing before Snowden, but it wasn't as well known. Those aware of the evidence knew, but the general populace didn't know and didn't believe it when presented with it. Look up room 641A. There was a 60 minutes thing on it long before Snowden. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440459025.0,
    "date_created": "2015-08-24",
    "time_created": "11:30:25",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyfsy",
    "parent_id": "t1_cudx21q",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Pretty sure anyone with common sense figured out that the Patriot Act could apply to them due to the general definition. And before the Patriot Act (like 1998ish), people knew about Carnivore and the ability to scan emails. Kids everywhere were learning how mom and dad could find their IM chat logs. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440458605.0,
    "date_created": "2015-08-24",
    "time_created": "11:23:25",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue1r80",
    "parent_id": "t1_cudx21q",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Majority of people I talk to now say \"well I've got nothing to hide so why should *I* care",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440463869.0,
    "date_created": "2015-08-24",
    "time_created": "12:51:09",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxtjf",
    "parent_id": "t1_cudx9x3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I hate when people say things like that. When people do ask for a way to change the current situation everyone's like oh call your local congressman and vote for blah blah blah but the point is even when you've got a good local politician (if it's possible) when you start getting up to the big wigs none of the votes will ever matter because there's not enough money to back those votes or lobbyists. So that leaves all of us where? Risking being with our families or being able to keep food on the table because we got shot up by police at a protest?  Comfortable wouldn't be the word; you weigh the risks and make a choice. \n\nEdit: words",
    "controversiality": 0,
    "ups": 37,
    "downs": 0,
    "score": 37,
    "created": 1440457565.0,
    "date_created": "2015-08-24",
    "time_created": "11:06:05",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxkmy",
    "parent_id": "t1_cudx9x3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yea I could see it. I mean life in the states doesn't suck for most. I live very comfortably. I need nothing I don't have. Most of the time I think about things that could make my comfortable life even more comfortable. If you shut the windows we got it real good. Most of our problems are far away, or abstract. But for me, I'm just tired. I care about those far away and abstract problems. Our privacy, our infrastructure, our polices, are all fucked. We just can't do shit. When SOPA/PIPA happened, and the normal ADHD attention span of the internet turned into laser sharp focus and stopped the big money in their tracks, I was hopeful we could do something. Now, it just seems we can argue amongst our selves, and let the civil liberty groups do their job.\n\n\nAs for trump, he is a side show and doesn't stand a chance of winning, just a train wreak you can't turn away from. Distraction is all. I wouldn't worry about him.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1440457149.0,
    "date_created": "2015-08-24",
    "time_created": "10:59:09",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxmnq",
    "parent_id": "t1_cudxjen",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> People, regardless of their job, should still be able to take things back, to change their opinion. If we expect our politicians to be perfect, we'll just be constantly disappointed. \n\nThere's a difference between taking things back and changing one's opinion and trying to pretend that opinion never existed in the first place.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1440457244.0,
    "date_created": "2015-08-24",
    "time_created": "11:00:44",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudz55o",
    "parent_id": "t1_cudyxoz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "They are not dumb and lazy, they just have an agenda.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1440459760.0,
    "date_created": "2015-08-24",
    "time_created": "11:42:40",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue08uh",
    "parent_id": "t1_cudypfu",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "RSS is/was better for this purpose.",
    "controversiality": 0,
    "ups": 244,
    "downs": 0,
    "score": 244,
    "created": 1440461517.0,
    "date_created": "2015-08-24",
    "time_created": "12:11:57",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cueh965",
    "parent_id": "t1_cudzi7h",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah, that's bittersweet at best. The shootings in Connecticut a few month before Boston were blamed on the brother because of Twitter. All kinds of incorrect info comes through Twitter and the news agencies just run with it. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1440488181.0,
    "date_created": "2015-08-24",
    "time_created": "19:36:21",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue8oub",
    "parent_id": "t1_cudzl58",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I used to follow multiple local police scanner users here in LA that broke down the traffic like ELI5.\n\n*\"Homeboy on Wilshire and La brea wilyn out and the Po Po ain't having none of it.\"* \n\nmins later. \n\n*\"He Ded\"*\n",
    "controversiality": 0,
    "ups": 64,
    "downs": 0,
    "score": 64,
    "created": 1440474428.0,
    "date_created": "2015-08-24",
    "time_created": "15:47:08",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue4m0s",
    "parent_id": "t1_cudzl58",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm not cool either on twitter:/",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440468254.0,
    "date_created": "2015-08-24",
    "time_created": "14:04:14",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue0rby",
    "parent_id": "t1_cudztuc",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'll hear about the injury when the Packer Report hits my mailbox on Thursday afternoon.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1440462316.0,
    "date_created": "2015-08-24",
    "time_created": "12:25:16",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue4ap8",
    "parent_id": "t1_cue0axx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I can see how that happens. \n\nI follow Neil deGrasse Tyson, Boing Boing, Lawrence Lessig, Long Now Foundation, MIT Tech Review, Steve Martin, and Ricky Gervais. \n\nGiven this information, Twitter sends me emails noticing that I'm not following much, and suggesting I follow Kim Kardashian, Donald Trump, and Bravo Channel.\n",
    "controversiality": 0,
    "ups": 124,
    "downs": 0,
    "score": 124,
    "created": 1440467769.0,
    "date_created": "2015-08-24",
    "time_created": "13:56:09",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue0x7n",
    "parent_id": "t1_cue0axx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Exactly. I follow a bunch of people who have the same interests as me and chat about stuff with them. Twitter is awesome.",
    "controversiality": 0,
    "ups": 73,
    "downs": 0,
    "score": 73,
    "created": 1440462573.0,
    "date_created": "2015-08-24",
    "time_created": "12:29:33",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue0t5o",
    "parent_id": "t1_cudzbqb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I follow my wife, who never tweets, and a bunch of sports writers. That's it. NBA trade deadline/free agency period is the best. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440462397.0,
    "date_created": "2015-08-24",
    "time_created": "12:26:37",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue2mvc",
    "parent_id": "t1_cudzbqb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Oh my god twitter on NHL trade deadline day is a blast. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440465227.0,
    "date_created": "2015-08-24",
    "time_created": "13:13:47",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuea5mq",
    "parent_id": "t1_cue0cea",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1440476635.0,
    "date_created": "2015-08-24",
    "time_created": "16:23:55",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue42bh",
    "parent_id": "t1_cue0cea",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Noted. Will use twitter when I have issues with products.  ;)",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1440467412.0,
    "date_created": "2015-08-24",
    "time_created": "13:50:12",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue3vfu",
    "parent_id": "t1_cudyk4h",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The bot entered into 165,000 contests to win 1000. So 0.6% to win awesome swag like \n\n-Copy of book On The Surface\n-shirt from Desk.com\n-tickets to Good Guys All American Nationals car show and demolition derby in Indianapolis\n\n[ full list: http://www.hscott.net/winnings.txt ]",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1440467120.0,
    "date_created": "2015-08-24",
    "time_created": "13:45:20",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue1emc",
    "parent_id": "t1_cue01vq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I've been banned from /r/offmychest for posting about rape awareness... When I tried to reason with the mods, they simply said \"No ones gonna read that wall of text, do not contact us again\"",
    "controversiality": 0,
    "ups": 128,
    "downs": 0,
    "score": 128,
    "created": 1440463329.0,
    "date_created": "2015-08-24",
    "time_created": "12:42:09",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue1u67",
    "parent_id": "t1_cue01vq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I never commented there and was banned nonetheless. What a sad bunch. Did you know that they do it for free and take their job very seriously?",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1440463994.0,
    "date_created": "2015-08-24",
    "time_created": "12:53:14",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue61jz",
    "parent_id": "t1_cue01vq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's okay, I'm more of a fan of /r/onmychest anyway.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440470449.0,
    "date_created": "2015-08-24",
    "time_created": "14:40:49",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue1pfu",
    "parent_id": "t1_cue01vq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Lol they ban people from there just for posting in certain subreddits.\n\nThey're just as bad as SRS, FPH, etc.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1440463794.0,
    "date_created": "2015-08-24",
    "time_created": "12:49:54",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxkxj",
    "parent_id": "t1_cudx7i3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The story of *capitalism.",
    "controversiality": 0,
    "ups": 1007,
    "downs": 0,
    "score": 1007,
    "created": 1440457164.0,
    "date_created": "2015-08-24",
    "time_created": "10:59:24",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxhnw",
    "parent_id": "t1_cudx7i3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The Story of Us",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1440457008.0,
    "date_created": "2015-08-24",
    "time_created": "10:56:48",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxm3u",
    "parent_id": "t1_cudxgqq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 169,
    "downs": 0,
    "score": 169,
    "created": 1440457219.0,
    "date_created": "2015-08-24",
    "time_created": "11:00:19",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxpxc",
    "parent_id": "t1_cudxgqq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's interesting because /r/news became a default when /r/worldnews was deleting anything related to the Boston Marathon bombing and the admins wanted a default that had threads related to it.\n\nSo even though the /r/news mods framed it as a censorship issue, that's probably not the case then?",
    "controversiality": 0,
    "ups": 51,
    "downs": 0,
    "score": 51,
    "created": 1440457398.0,
    "date_created": "2015-08-24",
    "time_created": "11:03:18",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxmld",
    "parent_id": "t1_cudxgqq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "We Shadowrun now.",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1440457241.0,
    "date_created": "2015-08-24",
    "time_created": "11:00:41",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyjrm",
    "parent_id": "t1_cudxgqq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I just searched r/news for both \"TPP\" and \"Trans Pacific Partnership\" and there's a lot of articles about it. ",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1440458790.0,
    "date_created": "2015-08-24",
    "time_created": "11:26:30",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudya1m",
    "parent_id": "t1_cudxgqq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "So why is /r/news full of stories about how terrible the TPP is?\n\nIt doesn't seem like a very effective conspiracy.",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1440458339.0,
    "date_created": "2015-08-24",
    "time_created": "11:18:59",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxooe",
    "parent_id": "t1_cudxgqq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Waiiiiiiiiiiit, seriously?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440457339.0,
    "date_created": "2015-08-24",
    "time_created": "11:02:19",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue1m0h",
    "parent_id": "t1_cudxgqq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You should check out Voat",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440463649.0,
    "date_created": "2015-08-24",
    "time_created": "12:47:29",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudzqk2",
    "parent_id": "t1_cudy9so",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's a gross oversimplification. Mine will be too.\n\nIn a corporation, the officers of the corporation report to the board which is elected from the shareholders. The goal of any corporation is to make the shareholder's money. \n\nDepending on the wishes of the board, the officers/corporation can take many avenues to make a profit. It's a judgment area, but the CEO is not empowered to say fuck profits all together. A CEO can say fuck profits this year for the goal of more profits in the next decade. Or the CEO can say we will be green to better build our brand.\n\nSo let's say a CEO wants to spend 100 million dollars of the corporations money to build a new park. That's probably an awesome thing to do, but when justifying the action to the board the CEO will be talking about tax credits, PR, advertising, and permanent park naming rights. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1440460707.0,
    "date_created": "2015-08-24",
    "time_created": "11:58:27",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx0q6",
    "parent_id": "t1_cudwz0z",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Batman",
    "controversiality": 0,
    "ups": 157,
    "downs": 0,
    "score": 157,
    "created": 1440456174.0,
    "date_created": "2015-08-24",
    "time_created": "10:42:54",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxah9",
    "parent_id": "t1_cudwz0z",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "John Cena",
    "controversiality": 0,
    "ups": 45,
    "downs": 0,
    "score": 45,
    "created": 1440456656.0,
    "date_created": "2015-08-24",
    "time_created": "10:50:56",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx2pn",
    "parent_id": "t1_cudwz0z",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "honestly, part of what made reddit so great was freedom of public opinion.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1440456271.0,
    "date_created": "2015-08-24",
    "time_created": "10:44:31",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx0ps",
    "parent_id": "t1_cudwz0z",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The owners.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1440456174.0,
    "date_created": "2015-08-24",
    "time_created": "10:42:54",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue1kca",
    "parent_id": "t1_cudyynw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> How about \"the right to be forgotten\" concept?\n\nIt's Europe's imaginary friend.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1440463578.0,
    "date_created": "2015-08-24",
    "time_created": "12:46:18",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuegnfn",
    "parent_id": "t1_cue2rtv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I think the right to be forgotten has reasonable uses.  Hiding policy-related statements of politicians is absolutely not one of them.  If you change your mind, tell people you changed your mind, don't try to con the world into thinking you never said something you said.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440487119.0,
    "date_created": "2015-08-24",
    "time_created": "19:18:39",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuelm8v",
    "parent_id": "t1_cue2rtv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> Everybody make mistakes and everybody changes opinion. Politicians are humans like you and me. If you want people that never change their mind, and never make mistakes in your country you are going to elect some psychopathic robots.\n\nThat's actually my point. Making mistakes is OK. Trying to bury those mistakes and pretend you never made them is not ok.\n\nI want a politician who's human, who actually thinks about stuff and forms opinions. I want him to be able to explain how and why his opinion changed, not that he never had a different opinion in the first place. If a politician writes \"Jews are the source of all evil on the planet\", I need to know about that and I need to know if he still thinks that way. He can't just delete that and pretend he never said it.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440495503.0,
    "date_created": "2015-08-24",
    "time_created": "21:38:23",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue1gwt",
    "parent_id": "t1_cudzq5x",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Thank you. People act like other people selling their soul for wealth and prosperity is a *new* thing. \n\nLook at freaking Roman history, for one. This shit's been going on for millennia, but people act like corruption is something new that's just *now* eeking its way into society. We just have an economy that condones (and thrives) off of this type of ~~corruption~~ profiteering.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1440463431.0,
    "date_created": "2015-08-24",
    "time_created": "12:43:51",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue64vm",
    "parent_id": "t1_cudzq5x",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "But we're developed enough now that we can call out corruption and be agreed. Some people are holding us back and argue against calling it out, oh well ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440470590.0,
    "date_created": "2015-08-24",
    "time_created": "14:43:10",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuedq03",
    "parent_id": "t1_cue3l57",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Basically this. I hated twitter for a long time, then i started using it so i could interact with [the PR team of] celebrities.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440482084.0,
    "date_created": "2015-08-24",
    "time_created": "17:54:44",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue77ru",
    "parent_id": "t1_cue31pf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You could just have a feedback form that limits the number of characters and drops them into an mailbox\n",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440472242.0,
    "date_created": "2015-08-24",
    "time_created": "15:10:42",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudy0eq",
    "parent_id": "t1_cudxosk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Exactly. I don't see the huge issue. Sure, it's slightly annoying. But this will definitely not stop Twitter posts from being archived.",
    "controversiality": 0,
    "ups": 96,
    "downs": 0,
    "score": 96,
    "created": 1440457889.0,
    "date_created": "2015-08-24",
    "time_created": "11:11:29",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue4rl0",
    "parent_id": "t1_cudxosk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I think you can also pull an RSS feed of a user's tweets.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440468497.0,
    "date_created": "2015-08-24",
    "time_created": "14:08:17",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudzxcb",
    "parent_id": "t1_cudxxcw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's not \"exponentially harder\".  Twitter's page is pretty straightforward - you can basically drop it into some HTML recognizer like `BeautifulSoup` and pop the tweets right out.\n\nThe actual issue is that without an API key, if you hit twitter dot com too many times they'll cut you off - so you'll have to check every few minutes or less frequently and you won't be able to check \"everyone\" from one spot.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440461006.0,
    "date_created": "2015-08-24",
    "time_created": "12:03:26",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue40jv",
    "parent_id": "t1_cudz7o1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Don't have to log in to view tweets, thus don't have to agree to their ToS. I've never logged in and I've never seen a ToS. I wonder what happens in court? For example, twitter, youtube, etc, say \"by using or visiting\". But when I visit the webpage, I've never seen this ToS. So then I guess they go after your webpage with some legal action.\n\nOh man, this is incredibly silly. Technically, we can get around this nonsense. This is the weird ground where it's clearly in public, but it's the property of twitter. \n\nCopy/screenshot of every tweet by some small set of people is not even that difficult. Just use ToR to mask the origin and don't make it scan too often.\n\nAnyways, to test, I went to Bernie Sanders' page on twitter and made sure java script was off, ad block was on, etc. I could pull the text and details.\n\n>  Pinned Tweet\n  Bernie Sanders ‏@BernieSanders Aug 20\nIt makes a lot more sense to me to invest in jobs and education than in jails and incarceration. https://cards.twitter.com/cards/18ce53yz7k6/uifr …\n\n> 12:26 PM - 20 Aug 2015 · Details\n780 retweets 1,055 favorites",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1440467335.0,
    "date_created": "2015-08-24",
    "time_created": "13:48:55",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudzqck",
    "parent_id": "t1_cudz7o1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm curious, so are you allowed to display a screenshot of a deleted tweet?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440460698.0,
    "date_created": "2015-08-24",
    "time_created": "11:58:18",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue2hw7",
    "parent_id": "t1_cudz7o1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> you're free to use the Twitter API to copy or mirror as many tweets as you want. You can even publicly mirror all of those tweets.\n\nOK, so why not have on dev set up a mirror for all tweets, and another dev write code that shows what has been deleted from the mirror?  Presumably there are already mirrors up - why not just use one of them, and accomplish the same end?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440465012.0,
    "date_created": "2015-08-24",
    "time_created": "13:10:12",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue211f",
    "parent_id": "t1_cudzqmt",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah can't be that hard. You only need to point it at politicians accounts, if your website only exposes politicians tweets. If you know how to set this up then twitter removing their API has just given your website an edge over the rest who can't work out how to record all politicians tweets anymore.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440464289.0,
    "date_created": "2015-08-24",
    "time_created": "12:58:09",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue0qki",
    "parent_id": "t1_cudy5ib",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I would expect this has already been done for other purposes.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440462286.0,
    "date_created": "2015-08-24",
    "time_created": "12:24:46",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue2a4x",
    "parent_id": "t1_cudxt5x",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And people were still called lunatics if they thought that the government was spying on them.",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1440464676.0,
    "date_created": "2015-08-24",
    "time_created": "13:04:36",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cueamwj",
    "parent_id": "t1_cudxt5x",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Anyone reading 2600 would have known about carnivore and prism a long long time ago...me being one of them.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440477346.0,
    "date_created": "2015-08-24",
    "time_created": "16:35:46",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxcr5",
    "parent_id": "t1_cudx5ls",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Mine was shaped like a foil duck. Everyone said I was quacking up. ",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1440456770.0,
    "date_created": "2015-08-24",
    "time_created": "10:52:50",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxgtw",
    "parent_id": "t1_cudx5ls",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "* **Are** pointy and quite shiny.",
    "controversiality": 1,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1440456969.0,
    "date_created": "2015-08-24",
    "time_created": "10:56:09",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue241p",
    "parent_id": "t1_cudxllk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The best part is when people try to deny we didn't know that the reason why we went to war was totally made up to begin with.  I was paying close attention to the run up to the war and it was obvious that the guy was making stuff up about the yellowcake. There was no proof to back any of it up. Many knew it back then.  Now they claim that they didn't really know that going into it.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440464414.0,
    "date_created": "2015-08-24",
    "time_created": "13:00:14",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyi7g",
    "parent_id": "t1_cudxllk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And now the new talking point (for people in favor of more wars) is that \"We left too soon, if we had stayed none of this would have happened... (thanks Obama).\" \n\n/facekeyboard /headdesk",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1440458719.0,
    "date_created": "2015-08-24",
    "time_created": "11:25:19",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue14vf",
    "parent_id": "t1_cudxllk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> I remember when anyone who said the Iraq War wouldn't go well was called a \"liberal pessimist\" and people angrily yelled \"You think America can't even win a war?!\" (with the implication you didn't even believe in your country).\n\nIt may not have gone great, but it didn't go *that* bad. They're fighting ISIS (kind of) right now, so in the end that war just might turn out to have been... well, maybe not successful, but at least not a *complete* disaster like Vietnam. Of course, Saddam Hussein would also have been fighting ISIS, so maybe not much gained after all.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440462902.0,
    "date_created": "2015-08-24",
    "time_created": "12:35:02",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyw0k",
    "parent_id": "t1_cudxtjf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "As always, it leaves you with violent uprising or total surrender.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1440459347.0,
    "date_created": "2015-08-24",
    "time_created": "11:35:47",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue11uh",
    "parent_id": "t1_cue08uh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm sure it is but I cannae after these many years figure out how to use RSS feeds.",
    "controversiality": 0,
    "ups": 185,
    "downs": 0,
    "score": 185,
    "created": 1440462770.0,
    "date_created": "2015-08-24",
    "time_created": "12:32:50",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cueaktr",
    "parent_id": "t1_cue08uh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "RSS was the future that never was.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440477261.0,
    "date_created": "2015-08-24",
    "time_created": "16:34:21",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuey3kz",
    "parent_id": "t1_cueh965",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It depends on what time things happen. The final hunt for the surviving Boston bomber happened at something like 4 am eastern, I watched that unfold live because it was just after work here. The coverage of that on Twitter was excellent until the people outside the area woke up and started filling Twitter with retweets of old information and tonnes of stupid.\n\nThe problem with Twitter is the me too mentality drowning out the real information. Not much anyone can do about that though.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440530619.0,
    "date_created": "2015-08-25",
    "time_created": "07:23:39",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue8ws4",
    "parent_id": "t1_cue4ap8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Following Ricky Gervais is a great way to stop liking Ricky Gervais.\n\nYou might as well be subbed to r/atheism ",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1440474745.0,
    "date_created": "2015-08-24",
    "time_created": "15:52:25",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuea01a",
    "parent_id": "t1_cue4ap8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Sounds like you already follow the right people. Why ruin it by adding the people Twitter recommends (read: the people who paid Twitter to recommend them)?",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1440476395.0,
    "date_created": "2015-08-24",
    "time_created": "16:19:55",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue2tls",
    "parent_id": "t1_cue0x7n",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Many years ago when I first made mine (2008) it kinda sucked by since around 2010 on, it's easily my most used social network. Twitter is great.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1440465514.0,
    "date_created": "2015-08-24",
    "time_created": "13:18:34",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue4v73",
    "parent_id": "t1_cue0x7n",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I realised today that I now follow over 1,000 people on Twitter. Way too many to keep track of individually, but all fascinating to see occasional updates from.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440468651.0,
    "date_created": "2015-08-24",
    "time_created": "14:10:51",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuedqjs",
    "parent_id": "t1_cuea5mq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Holy shit haha! That's so insane dude.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440482108.0,
    "date_created": "2015-08-24",
    "time_created": "17:55:08",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuebw97",
    "parent_id": "t1_cue42bh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Calling up customer service makes it between you and them. Posting it to their twitter means potentially everyone can see it, possibly giving them unwanted media attention if they really fucked up/you around.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1440479202.0,
    "date_created": "2015-08-24",
    "time_created": "17:06:42",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue60yj",
    "parent_id": "t1_cue42bh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's pretty much the only reason I use it. Complained about bank of America and had a rep dm me in 5 min",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440470424.0,
    "date_created": "2015-08-24",
    "time_created": "14:40:24",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue2ut1",
    "parent_id": "t1_cue1emc",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "/r/offmychest is one of the most poorly moderated subreddits there is, I don't think anyone really respects them in the modding community.\n\nCheck out the [moddiquette](https://www.reddit.com/wiki/moddiquette) if you haven't before. It's basically reddiquette for modding. It's not enforced or required, it's more of a general guideline on being a decent mod. They can run their sub however they want, but I would recommend everyone to stay away from it. Refusing to hear an explanation because \"it's too long\" is like a textbook example of laziness and ignorance in a position of power of any degree.",
    "controversiality": 0,
    "ups": 113,
    "downs": 0,
    "score": 113,
    "created": 1440465565.0,
    "date_created": "2015-08-24",
    "time_created": "13:19:25",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue8d44",
    "parent_id": "t1_cue1emc",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "/r/trueoffmychest exists as an alternative to /r/offmychest fyi",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440473953.0,
    "date_created": "2015-08-24",
    "time_created": "15:39:13",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue8geh",
    "parent_id": "t1_cue1emc",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Really? That's ridiculous! What did you post?",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1440474085.0,
    "date_created": "2015-08-24",
    "time_created": "15:41:25",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue8xc2",
    "parent_id": "t1_cue1u67",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> I never commented there and was banned nonetheless\n\nwat?",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1440474769.0,
    "date_created": "2015-08-24",
    "time_created": "15:52:49",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxtcm",
    "parent_id": "t1_cudxkxj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yes i was scrolling down, wondering when someone was going to get the the point.  This is the typical result of an over capitalized society.  Monetizing everything and profit as the most important reason for any company bigger than a small town business...\n",
    "controversiality": 0,
    "ups": 507,
    "downs": 0,
    "score": 507,
    "created": 1440457557.0,
    "date_created": "2015-08-24",
    "time_created": "11:05:57",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxp0i",
    "parent_id": "t1_cudxkxj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Pretty close to the story of communism as well, in most cases.",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1440457355.0,
    "date_created": "2015-08-24",
    "time_created": "11:02:35",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxlwp",
    "parent_id": "t1_cudxhnw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "...looks a lot like a tragedy now.",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1440457209.0,
    "date_created": "2015-08-24",
    "time_created": "11:00:09",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxu1s",
    "parent_id": "t1_cudxhnw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "*looks a lot like a tragedy now, now, nowwwwww!*",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440457589.0,
    "date_created": "2015-08-24",
    "time_created": "11:06:29",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxt8w",
    "parent_id": "t1_cudxm3u",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 139,
    "downs": 0,
    "score": 139,
    "created": 1440457552.0,
    "date_created": "2015-08-24",
    "time_created": "11:05:52",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxsab",
    "parent_id": "t1_cudxm3u",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 51,
    "downs": 0,
    "score": 51,
    "created": 1440457509.0,
    "date_created": "2015-08-24",
    "time_created": "11:05:09",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudydp4",
    "parent_id": "t1_cudxpxc",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 47,
    "downs": 0,
    "score": 47,
    "created": 1440458507.0,
    "date_created": "2015-08-24",
    "time_created": "11:21:47",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyffl",
    "parent_id": "t1_cudxmld",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Except without *any* of the cool shit.",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1440458588.0,
    "date_created": "2015-08-24",
    "time_created": "11:23:08",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudz8sn",
    "parent_id": "t1_cudxmld",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Except that crime explosion never happened. And magic still isn't real :(",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440459921.0,
    "date_created": "2015-08-24",
    "time_created": "11:45:21",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue0074",
    "parent_id": "t1_cudyjrm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "A lot of threads are hidden by the mods, so they are effectively deleted but you can still search for them + there is no evidence of deletion since it technically wasn't deleted.\n\nI think it was last week there were a number of posts when a recent chapter of the TPP leaked out, and more than a half dozen TPP threads from /r/news got so many upvotes they were hitting the front page, one of which hit #1 on all of reddit and was hidden only minutes later.",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1440461134.0,
    "date_created": "2015-08-24",
    "time_created": "12:05:34",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue0ksa",
    "parent_id": "t1_cudyjrm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Just search /r/undelete and you'll see tons of threads about removals and bannings.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1440462039.0,
    "date_created": "2015-08-24",
    "time_created": "12:20:39",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudymgg",
    "parent_id": "t1_cudya1m",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> It doesn't seem like a very effective conspiracy.\n\nIt's not. People are reading laziness, ineptitude, or a conscious decision to not interfere with moderation as some shadowy conspiracy. ",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1440458912.0,
    "date_created": "2015-08-24",
    "time_created": "11:28:32",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx3y7",
    "parent_id": "t1_cudx0q6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Not me. ",
    "controversiality": 0,
    "ups": 76,
    "downs": 0,
    "score": 76,
    "created": 1440456331.0,
    "date_created": "2015-08-24",
    "time_created": "10:45:31",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxmj5",
    "parent_id": "t1_cudxah9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "🎺🎺🎺🎺",
    "controversiality": 0,
    "ups": 79,
    "downs": 0,
    "score": 79,
    "created": 1440457238.0,
    "date_created": "2015-08-24",
    "time_created": "11:00:38",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudz1g5",
    "parent_id": "t1_cudxah9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "BRRRRRRRRRRAAAPADOOOOOOOO",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1440459597.0,
    "date_created": "2015-08-24",
    "time_created": "11:39:57",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx81u",
    "parent_id": "t1_cudx2pn",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Nah Reddit was never about freedom of speech. Don't you remember?",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1440456536.0,
    "date_created": "2015-08-24",
    "time_created": "10:48:56",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudz70p",
    "parent_id": "t1_cudy0eq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": " ",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1440459842.0,
    "date_created": "2015-08-24",
    "time_created": "11:44:02",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudzrym",
    "parent_id": "t1_cudy0eq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Huge issue is that it's against the [TOS](https://twitter.com/tos?lang=en):\n\n> scraping the Services without the prior consent of Twitter is expressly prohibited",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1440460767.0,
    "date_created": "2015-08-24",
    "time_created": "11:59:27",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudzt9p",
    "parent_id": "t1_cudy0eq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I don't know about Twitter in particular but many websites' ToS forbid data scraping if you're not going through their API",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1440460823.0,
    "date_created": "2015-08-24",
    "time_created": "12:00:23",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue3js5",
    "parent_id": "t1_cue2hw7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That is kind of what I was thinking, you could easily pull every tweet using google without ever directly interacting with twitter. Never used their site therefore never agreed to their terms. Additionally I would love to see if those terms ever got upheld. I don't agree to shit by viewing a webpage without an account. Their terms could require all kinds of things but the question would be is it something enforceable in a court of law.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1440466620.0,
    "date_created": "2015-08-24",
    "time_created": "13:37:00",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudzjj0",
    "parent_id": "t1_cudyi7g",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"We left too soon\"\n\nOf course, they blame Obama for deciding to leave... when the reason we left is that Iraq kicked us out. They decided not to extend the authorization for our troops to stay there.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440460399.0,
    "date_created": "2015-08-24",
    "time_created": "11:53:19",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue128p",
    "parent_id": "t1_cudyi7g",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Forgetting of course that Mr. Obama actually ended up leaving almost two years _later_ than the final Bush timetable called for!  (And there were many earlier timetables with much earlier dates than that...)",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440462787.0,
    "date_created": "2015-08-24",
    "time_created": "12:33:07",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyr7a",
    "parent_id": "t1_cudyi7g",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Sadly they might be (partially) correct, ISIS was allowed to rise in the mess that we left Iraq.\n\nBut the point is we never should have started the war in the first place. Even if Iraq did have WMDs, confirmed, was it worth going to war over and attempting to change the political system of an entire country? ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1440459125.0,
    "date_created": "2015-08-24",
    "time_created": "11:32:05",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue1yc0",
    "parent_id": "t1_cue11uh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Personally, I feel that Twitter killed the growth of RSS and we are all worse off for it. It is generally useable as a decentralized twitter where you subscribe to your feeds of choice using your browser/client. \n\nIf it weren't for twitter supplanting it, I really feel like the usability would have improved greatly in every browser and on mobile devices. The protocol is certainly capable of being user-friendly, as seen in every podcast app.",
    "controversiality": 0,
    "ups": 326,
    "downs": 0,
    "score": 326,
    "created": 1440464175.0,
    "date_created": "2015-08-24",
    "time_created": "12:56:15",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue293m",
    "parent_id": "t1_cue11uh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "An easy-to-use RSS Web client with interactive feed postings, reader tracking, feed tags, and targeted suggestions is something we need far more than just another social media site.",
    "controversiality": 0,
    "ups": 65,
    "downs": 0,
    "score": 65,
    "created": 1440464630.0,
    "date_created": "2015-08-24",
    "time_created": "13:03:50",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cueag3r",
    "parent_id": "t1_cue8ws4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'd resub to /r/atheism if it could find itself a sense of humor.\n",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1440477066.0,
    "date_created": "2015-08-24",
    "time_created": "16:31:06",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuefajw",
    "parent_id": "t1_cue2ut1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Gonna go ahead and post a link here to /r/whatsbotheringyou for people who are banned from offmychest. ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1440484736.0,
    "date_created": "2015-08-24",
    "time_created": "18:38:56",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue6xfk",
    "parent_id": "t1_cue2ut1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's because they got taken over by shitredditsays a while back. And I'm not saying that like I blame sjws for all of reddit's problems. All the mods on /r/offmychest are legitimately ultra feminists who will ban you for daring to suggest straight white men can be victims of racism or sexism.",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1440471804.0,
    "date_created": "2015-08-24",
    "time_created": "15:03:24",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue8kp8",
    "parent_id": "t1_cue8geh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[Ban notification](http://i.imgur.com/b6H0IFH.png), [my message and their reply](http://i.imgur.com/AOGi5wL.png)",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1440474265.0,
    "date_created": "2015-08-24",
    "time_created": "15:44:25",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue96i2",
    "parent_id": "t1_cue8xc2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Welcome to SJW reddit. I post to /r/KotakuInAction which apparently is a major thoughtcrime in the eyes of some people.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1440475152.0,
    "date_created": "2015-08-24",
    "time_created": "15:59:12",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudy0n5",
    "parent_id": "t1_cudxtcm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "In fact, any publicly traded company has a legal obligation to value profit over everything",
    "controversiality": 0,
    "ups": 200,
    "downs": 0,
    "score": 200,
    "created": 1440457900.0,
    "date_created": "2015-08-24",
    "time_created": "11:11:40",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudzmqu",
    "parent_id": "t1_cudxtcm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> profit as the most important reason for any company bigger than a small town business...  \n\nThe sole objective of a company **is** to earn profit. In many countries, including mine, it's actually stated as so in the laws as well. I don't see your problem.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440460540.0,
    "date_created": "2015-08-24",
    "time_created": "11:55:40",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudzn5s",
    "parent_id": "t1_cudxtcm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's not about \"capitalism\" it's the result of any accumulation of power.  Capitalism is just a system that assumes the powerful will be greedy and tries to make the best of it by pitting then against each other. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440460559.0,
    "date_created": "2015-08-24",
    "time_created": "11:55:59",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue0mg8",
    "parent_id": "t1_cudxtcm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I ask you one question.\n\nIf you make a service, like reddit, or twitter, or anything really, and you can barely make it brake even, then suddenly a big company comes by and is willing to give you a few million dollars for everything you made. would you say no to that? be honest!",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440462111.0,
    "date_created": "2015-08-24",
    "time_created": "12:21:51",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue1lwy",
    "parent_id": "t1_cudxtcm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"The love of money is the root of all kinds of evil.\"",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440463646.0,
    "date_created": "2015-08-24",
    "time_created": "12:47:26",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudy49a",
    "parent_id": "t1_cudxp0i",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The communism that we know of was state capitalism.",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1440458070.0,
    "date_created": "2015-08-24",
    "time_created": "11:14:30",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudybtk",
    "parent_id": "t1_cudxt8w",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 101,
    "downs": 0,
    "score": 101,
    "created": 1440458421.0,
    "date_created": "2015-08-24",
    "time_created": "11:20:21",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudykzf",
    "parent_id": "t1_cudydp4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yes, and even international events taking place in America counted, hence the thread deletion.\n\nThe mods seem to have eased up a bit from that position lately.",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1440458844.0,
    "date_created": "2015-08-24",
    "time_created": "11:27:24",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudzyhp",
    "parent_id": "t1_cudydp4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yes, this was why. It was clearly stated in the rules that it was not meant for US-specific news, but you know people complained about it anyway.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440461058.0,
    "date_created": "2015-08-24",
    "time_created": "12:04:18",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue45gj",
    "parent_id": "t1_cudydp4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "yeah that was hilarious... they kept deleting the threads about Boston with the reasoning that a terrorist attack in the US was not \"World News\" then when people started arguing and saying stuff like \"if its not world news why is it on the front page of the BBC?\" they eventually relented...\n\nbunch of cocksuckers they were being.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440467547.0,
    "date_created": "2015-08-24",
    "time_created": "13:52:27",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudytip",
    "parent_id": "t1_cudyffl",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The future is here, just not distributed evenly.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1440459235.0,
    "date_created": "2015-08-24",
    "time_created": "11:33:55",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue0uc9",
    "parent_id": "t1_cue0074",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> more than a half dozen TPP threads\n\nMost subs delete redundant posts.  If they were all on the same leak, it stands to reason that they'd be deleted.  ",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1440462447.0,
    "date_created": "2015-08-24",
    "time_created": "12:27:27",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx625",
    "parent_id": "t1_cudx3y7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440456440.0,
    "date_created": "2015-08-24",
    "time_created": "10:47:20",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue559g",
    "parent_id": "t1_cudxmj5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "thank mr skeltal",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440469077.0,
    "date_created": "2015-08-24",
    "time_created": "14:17:57",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudx9ic",
    "parent_id": "t1_cudx81u",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Reddit has always been at war with Eastasia.",
    "controversiality": 0,
    "ups": 82,
    "downs": 0,
    "score": 82,
    "created": 1440456608.0,
    "date_created": "2015-08-24",
    "time_created": "10:50:08",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudxgw0",
    "parent_id": "t1_cudx81u",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I usually stay out of these discussions because I don't really care and just ride the wave to the next flavor of the moment. That being said, when homeboy was caught recanting his position (and reddit's position at large) WRT freedom of speech, I was shocked. Glorious, politician-level retconning.",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1440456972.0,
    "date_created": "2015-08-24",
    "time_created": "10:56:12",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue1urj",
    "parent_id": "t1_cudzrym",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And how are they going to stop them from doing it?",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1440464019.0,
    "date_created": "2015-08-24",
    "time_created": "12:53:39",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudzyk9",
    "parent_id": "t1_cudzrym",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "So they'll be banned from twitter? ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1440461061.0,
    "date_created": "2015-08-24",
    "time_created": "12:04:21",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuefnfk",
    "parent_id": "t1_cudzrym",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "TOS doesn't apply if you aren't using the service. They can't hold you to terms you didn't agree to. Also, you're not scraping a service if your scraping their public website. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440485353.0,
    "date_created": "2015-08-24",
    "time_created": "18:49:13",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuebh3q",
    "parent_id": "t1_cudzt9p",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Since when do I have to agree to a website's ToS to view the data on a website? That's absurd. I'll put a ToS on my website that google owes me a bajillion dollars every time their robots index my site.\n\nI'm considering coding an application specifically to scrape twitter data just because of this. I mean it's relatively simple in .net\n\n    System.Windows.Forms.WebBrowser myBrowser = new WebBrowser();\n\nthen have a timer call\n\n    myBrowser.Navigate(https://twitter.com/whomever)\n\nThen compare and store a list of strings/whatever demarcated by\n\n<p class=\"TweetTextSize*> (assuming * is a wildcard)\nthrough </p>\n\nBoom, twitter scraper. I mean sure it would load a lot of unnecessary shit but seriously twitter can't possibly think this is preventable.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1440478566.0,
    "date_created": "2015-08-24",
    "time_created": "16:56:06",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cueh7lg",
    "parent_id": "t1_cudzt9p",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> websites' ToS forbid data scraping\n\nlel",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440488106.0,
    "date_created": "2015-08-24",
    "time_created": "19:35:06",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue18ty",
    "parent_id": "t1_cudyr7a",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> Sadly they might be (partially) correct, ISIS was allowed to rise in the mess that we left Iraq.\n\nThe problem wasn't _leaving_ Iraq - unless you're proposing that the US occupied Iraq forever, which is too awful for words.\n\nIt was _invading_ Iraq in the first place.  Saddam Hussein was a violent torturing tinpot psychopathic dictator - but nowhere near as bad as our \"allies\" Saudi Arabia - and Hussein was also a force for stability in the region.\n\nFor example, the only secular universities in the Middle East outside Israel were in Baghdad - before the war.\n\nOur Lords And Masters learned nothing and did the same thing to Libya.  You don't see Libya on the news these days - guess why?",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1440463077.0,
    "date_created": "2015-08-24",
    "time_created": "12:37:57",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue41va",
    "parent_id": "t1_cue1yc0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Part of the move away from standardized internet protocols.\n\nThank goodness Netscape was able to 'waste' their VC and IPO funding solidifying HTTP and HTTPS before Silicon Valley and the tech industry as a whole reverted to their \"come smell the poppies in our beautiful walled garden!\" form.\n",
    "controversiality": 0,
    "ups": 141,
    "downs": 0,
    "score": 141,
    "created": 1440467392.0,
    "date_created": "2015-08-24",
    "time_created": "13:49:52",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue5ow1",
    "parent_id": "t1_cue1yc0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I think a rss feed reader website with a nice mobile client and push notifications, if competing with Twitter at the same time could have taken some of the contest traffic away. But twitter does two way interactions, whereas rss is basically like an emailing list. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440469913.0,
    "date_created": "2015-08-24",
    "time_created": "14:31:53",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cueatla",
    "parent_id": "t1_cue1yc0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440477627.0,
    "date_created": "2015-08-24",
    "time_created": "16:40:27",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue63dd",
    "parent_id": "t1_cue1yc0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "RIP Google Reader. :(",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1440470527.0,
    "date_created": "2015-08-24",
    "time_created": "14:42:07",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue4qbz",
    "parent_id": "t1_cue1yc0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The problem with RSS is that it had two main issues:\n\n1. publishers either refused or provides shitty RSS feeds and/or hit the URLs.\n\n2. the products for consuming RSS never really took off or were very good or easy to use.  Part of this was related to #1.\n\nSource. I was one of the inventors of RSS and CEO of spinn3r.com (massive web crawler that indexes feed and HTML of live media)",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1440468442.0,
    "date_created": "2015-08-24",
    "time_created": "14:07:22",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue2wra",
    "parent_id": "t1_cue293m",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "NewsBlur has most of that (except for the targeted suggestions).  I love it.",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1440465648.0,
    "date_created": "2015-08-24",
    "time_created": "13:20:48",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue40m5",
    "parent_id": "t1_cue293m",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Have you tried feedly? I've been using it since Google Reader got euthanized.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1440467337.0,
    "date_created": "2015-08-24",
    "time_created": "13:48:57",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue2dwe",
    "parent_id": "t1_cue293m",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yes it is! Now lets get some one to make it.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440464841.0,
    "date_created": "2015-08-24",
    "time_created": "13:07:21",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cueb56p",
    "parent_id": "t1_cue293m",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I've recently discovered inoreader, it's fantastic! I prefer it to feedly personally. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440478099.0,
    "date_created": "2015-08-24",
    "time_created": "16:48:19",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cueca97",
    "parent_id": "t1_cueag3r",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "As if. They have a bigger chance of finding Jesus.",
    "controversiality": 0,
    "ups": 91,
    "downs": 0,
    "score": 91,
    "created": 1440479808.0,
    "date_created": "2015-08-24",
    "time_created": "17:16:48",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue7haa",
    "parent_id": "t1_cue6xfk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "My general rule of thumb is when I see \"safe space\" mentioned, I just back away and find somewhere less likely to be a western middle-class recreation of the Soviet Union.",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1440472638.0,
    "date_created": "2015-08-24",
    "time_created": "15:17:18",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue8uxu",
    "parent_id": "t1_cue8kp8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "What the hell is wrong with those people?",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1440474669.0,
    "date_created": "2015-08-24",
    "time_created": "15:51:09",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyedr",
    "parent_id": "t1_cudy0n5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The question is short term vs long term profit.  Seems short term even at the expense of the company's long term viability has become the norm.  Too many companies go public and it hurts them in the long run.",
    "controversiality": 0,
    "ups": 73,
    "downs": 0,
    "score": 73,
    "created": 1440458538.0,
    "date_created": "2015-08-24",
    "time_created": "11:22:18",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudydbn",
    "parent_id": "t1_cudy0n5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I think that's a frequently propagated meme, and a gross oversimplification. They can certainly justify less-than expected profits for longer term development or stability. Hopefully someone with more knowledge or a desire to search previous threads will shed some light on this.\n\nOr maybe I'm a dirty commie. ",
    "controversiality": 0,
    "ups": 277,
    "downs": 0,
    "score": 277,
    "created": 1440458491.0,
    "date_created": "2015-08-24",
    "time_created": "11:21:31",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyhmz",
    "parent_id": "t1_cudy0n5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 59,
    "downs": 0,
    "score": 59,
    "created": 1440458692.0,
    "date_created": "2015-08-24",
    "time_created": "11:24:52",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue0nxx",
    "parent_id": "t1_cudy0n5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "...only because it's for the good of the investors. Sadly, although we create or propagate the content on Reddit, we do not have ownership.\n\nI'll take a Devils advocate position here: WE sold out.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440462173.0,
    "date_created": "2015-08-24",
    "time_created": "12:22:53",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue11ek",
    "parent_id": "t1_cudy0n5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is repeated ad-naseum and it simply isn't true. Especially in the way that you worded it. It's a terrific crutch though for those that want to justify what they do.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440462751.0,
    "date_created": "2015-08-24",
    "time_created": "12:32:31",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue14au",
    "parent_id": "t1_cudy0n5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Source on that?",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440462878.0,
    "date_created": "2015-08-24",
    "time_created": "12:34:38",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyyb2",
    "parent_id": "t1_cudy49a",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1440459455.0,
    "date_created": "2015-08-24",
    "time_created": "11:37:35",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyj95",
    "parent_id": "t1_cudybtk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 45,
    "downs": 0,
    "score": 45,
    "created": 1440458767.0,
    "date_created": "2015-08-24",
    "time_created": "11:26:07",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue2kth",
    "parent_id": "t1_cue1urj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Probably by tracking hits per IP. If you build a bot that's going to hit every person you want to track every 10m or less, they'll eventually see a pattern, and block that IP. There's ways to avoid detection, but I'm sure if twitter wants API income, they work really hard to beat people at that game.",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1440465139.0,
    "date_created": "2015-08-24",
    "time_created": "13:12:19",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuec3k9",
    "parent_id": "t1_cuebh3q",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Do it! Stick it to the man!",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440479517.0,
    "date_created": "2015-08-24",
    "time_created": "17:11:57",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue539q",
    "parent_id": "t1_cue18ty",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You realize you're agreeing with me, right? If you read the second line of my post I did say we shouldn't have gone in in the first place.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1440468992.0,
    "date_created": "2015-08-24",
    "time_created": "14:16:32",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue5w5v",
    "parent_id": "t1_cue41va",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "AOL Keywords! It was like two different internets.",
    "controversiality": 0,
    "ups": 48,
    "downs": 0,
    "score": 48,
    "created": 1440470224.0,
    "date_created": "2015-08-24",
    "time_created": "14:37:04",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue57rk",
    "parent_id": "t1_cue41va",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Standardization is cyclical. New technology emerges -> gets standardized. Internet/tech world moves at a pace that can cause fragmentation for a while. The internet's paradigm has completely changed in the past 10 years, and we're due for a new round of standards.",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1440469181.0,
    "date_created": "2015-08-24",
    "time_created": "14:19:41",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuehq4g",
    "parent_id": "t1_cue2wra",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Your NewsBlur comment needs more upvotes.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440489002.0,
    "date_created": "2015-08-24",
    "time_created": "19:50:02",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cuem3xq",
    "parent_id": "t1_cue2wra",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "+1 -  I've been using Newsblur since Google Reader shut down. It's great. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440496286.0,
    "date_created": "2015-08-24",
    "time_created": "21:51:26",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue6ple",
    "parent_id": "t1_cue40m5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "AFAIK feedly doesn't have the social and sharing features that Reader did ... but what it DOES have is great and far surpasses what Reader had at the time of its demise.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440471465.0,
    "date_created": "2015-08-24",
    "time_created": "14:57:45",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue3x6w",
    "parent_id": "t1_cue2dwe",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Maybe Google could put something like that together",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1440467195.0,
    "date_created": "2015-08-24",
    "time_created": "13:46:35",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue93ih",
    "parent_id": "t1_cue8uxu",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "They think /r/tumblrinaction (the sub I posted in) harassed/harasses people, thus they ban anyone who supports (/posts in) it with a bot.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1440475027.0,
    "date_created": "2015-08-24",
    "time_created": "15:57:07",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudze7h",
    "parent_id": "t1_cudyedr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You make the mistake of thinking of companies as people, which we all hear about.  That they are run and organized by individuals is too important to keep in mind always - when a company sells out, there are certain massive winners at the top who will cash out.  The long term prospects of a company aren't a huge matter when you personally stand to gain, quite literally, hundreds of millions of dollars if you 'sell out' properly.\n\nIt's fun to call it selling out, but what kind of individual does it take to turn down, personally, hundreds of millions of dollars of personal capital?  It's a nice idea, but when people get tired and see themselves not working anymore, having a few million or (again, if you 'sold out' well enough) a few hundred million in the bank for your children and your children's children.. that's a bit more important than having the reddit community no longer view you as an internet champion.  One is tangible, the other is literally karma.  \n\nYou have to keep in mind how corporations are run, and how someone at the top can claim as much of the pie as they want so long as they don't kill the golden goose too fast.  ",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1440460161.0,
    "date_created": "2015-08-24",
    "time_created": "11:49:21",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue0636",
    "parent_id": "t1_cudydbn",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It is an oversimplification to some degree because companies can do the right thing but what ends up happening is the corporate officers and board have to defend those decisions to the shareholders or they get fired. Especially in cases where the board and top officers don't have a controlling interest of stock in the company. \n\nAnd then of course you have to ask yourself what oil company or pharmaceutical company is going to have a board that will approve the hiring of a CEO or whatever with those sort of moral holdings that they put into action through the policies they employ as CEO and the answer if fucking none.\n\nBecause the board is elected by people who just want ROI and the board members are often major investors so they just want ROI and so then they hire someone who can promise them the biggest ROI and the board feels will take the hit on all the shitty things the executives will have to do to bring that promise to fruition. \n\nHilariously if you then get a senior executive with any kind of conscience or intent to do good with the company that motherfucker gets kicked to the curb faster than you can say \"UNEMPLOYMENT\" because maximizing profits is what the game is all about and if you are there for anything else you are in the wrong place.\n\nSo yeah it's an oversimplification but even though companies aren't specifically legally bound to only pursue profit to any end that's pretty much what happens. \n\nIf you're a car manufacturer and you get a report that a car you've been selling for years has a previously undiscovered defect that is killing and injuring people do you report it to NHTSA and announce a recall or do you run the actuarials, determine how many people are going to come after the company with lawsuits, how much the average judgement will be and then compare that to the cost of a recall? Of course you do the latter first and if the recall is cheaper you immediately do that because you get a bounce on company image which leads to sales but if recall costs substantially more what do you do? \n\nWell you hide it as long as you can and then pay off like a slot machine to anyone who files a claim as long as they are willing to sign a non-disclosure and you don't have to admit liability. \n\nThen when the shit hits the fan you dump your stock, take your golden parachute and let the new guys who take over clean up your mess. It really helps them that they can blame you for everything as it makes them look like the responsible folks cleaning up a problem someone else created. \n\n[Just ask GM.](https://en.wikipedia.org/wiki/2014_General_Motors_recall) Or for that matter pretty much any company that sells a product that kills people.",
    "controversiality": 0,
    "ups": 106,
    "downs": 0,
    "score": 106,
    "created": 1440461391.0,
    "date_created": "2015-08-24",
    "time_created": "12:09:51",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyoze",
    "parent_id": "t1_cudydbn",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Longer term development and stability are only allowed because they represent the promise of future profits.  Even brands that appear to be charitable and altruistic have to justify those charitable contributions to shareholders as a means of brand building, advertising, and ensuring customer loyalty. Short term profit loss designed to increase future profits",
    "controversiality": 0,
    "ups": 128,
    "downs": 0,
    "score": 128,
    "created": 1440459025.0,
    "date_created": "2015-08-24",
    "time_created": "11:30:25",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue0377",
    "parent_id": "t1_cudydbn",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I think its like trying to prove intent. The only thing that really matters is profits. If you are earning profits you can justify any policy you want as \"contributing to our brand and customer loyalty\". Its a very subjective measure and impossible to prove that you weren't valuing profits over politics.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440461265.0,
    "date_created": "2015-08-24",
    "time_created": "12:07:45",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue1bnn",
    "parent_id": "t1_cudydbn",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "By law, unless the company specifies otherwise when it's incorporated or at a later date, the 2 key objectives of the directors are to maximise profits and grow the wealth of shareholders. It is, however, more of a modern phenomenon for the increasing focus on the first part, rather than the second (the reasons for which are long and debatable). ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1440463201.0,
    "date_created": "2015-08-24",
    "time_created": "12:40:01",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudyvnd",
    "parent_id": "t1_cudyhmz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I work in corporate governance, directors are typically required to serve shareholder returns.\n\nThere are exceptions that allow directors to act on behalf of other factors, like the environment, community, society as a whole, etc.  Those provisions are pretty rare though.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1440459330.0,
    "date_created": "2015-08-24",
    "time_created": "11:35:30",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudzm4p",
    "parent_id": "t1_cudyyb2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Tankie, eh?",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440460513.0,
    "date_created": "2015-08-24",
    "time_created": "11:55:13",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cudzhsl",
    "parent_id": "t1_cudyj95",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1440460323.0,
    "date_created": "2015-08-24",
    "time_created": "11:52:03",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue5qfk",
    "parent_id": "t1_cue2kth",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "alright heres an idea: a botnet that uses other peoples' computers to scrape twitter and send that data to some server. this way, twitter cant possibly catch them all",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440469980.0,
    "date_created": "2015-08-24",
    "time_created": "14:33:00",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue7pph",
    "parent_id": "t1_cue2kth",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Twitter can work as hard as they want unfortunately theyre fighting against a larger workforce than they have. This being companies/individuals producing proxy software etc etc which are tools that can easily be used to circumvent any attempts to monitor usage",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1440472990.0,
    "date_created": "2015-08-24",
    "time_created": "15:23:10",
    "submission_id": "worldnews-3i73px"
  },
  {
    "id": "cue4nzh",
    "parent_id": "t1_cue2kth",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's why you'd randomize the times (between 1 and 20 minutes) and spread it across multiple (dozens or more) accounts on a dozen different servers (or through proxy servers). At a certain point, it becomes too difficult for them to block without blocking legitimate users. It just depends on the level of effort they want to go through to sustain their site.\n\nIf enough people care able this issue, they could even provide custom proxy software to hundreds (or thousands) of users who allow them to relay through their system a few times a day. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1440468340.0,
    "date_created": "2015-08-24",
    "time_created": "14:05:40",
    "submission_id": "worldnews-3i73px"
  }
]