[
  {
    "id": "dayfqhy",
    "parent_id": "t3_5h6wr2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Gravity is hoax perpetrated by \"big dairy\" to keep you from getting free cheese on the moon.",
    "controversiality": 0,
    "ups": 1971,
    "downs": 0,
    "score": 1971,
    "created": 1481259790.0,
    "date_created": "2016-12-08",
    "time_created": "16:03:10",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1mzs",
    "parent_id": "t3_5h6wr2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Trump picked Scott Pruitt, opponent of the Environmental Protection Agency, to lead the Environmental Protection Agency.\n\nScott Pruitt has tried (and failed) to sue the EPA on multiple occasions. He rejects climate change.\n\nA corporate stooge who sued Colorado for legalizing weed. He pushed for a law to criminalize filming of factory farm practices.\n\nHas no background in environmental science or science of any kind.\n\nWhen Trump said he'd \"drain the swamp\", maybe he planned on doing that by killing off all wetlands?",
    "controversiality": 0,
    "ups": 824,
    "downs": 0,
    "score": 824,
    "created": 1481243675.0,
    "date_created": "2016-12-08",
    "time_created": "11:34:35",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxyy5v",
    "parent_id": "t3_5h6wr2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "There will always be climate change deniers, as there will always be holocaust deniers or moon landing deniers. \n\nThe real problem is when a moon landing denier becomes a NASA director, a holocaust denier makes it to an ethics commitee or a climate change denier becomes president",
    "controversiality": 0,
    "ups": 7769,
    "downs": 0,
    "score": 7769,
    "created": 1481240517.0,
    "date_created": "2016-12-08",
    "time_created": "10:41:57",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxvu9e",
    "parent_id": "t3_5h6wr2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "People have no trouble believing the scientists when it's the science behind their smartphones or that bleach is toxic, but when it comes to the climate, those eggheaded bastards are greedy liars.\n\n\nEdit: Thank you all for the upvotes and golds. I've made a $25 donation to [The American Association for the Advancement\nof Science](https://www.aaas.org/about/mission-and-history) in your honor. It's the best way I could think of to say 'thank you'.",
    "controversiality": 0,
    "ups": 16751,
    "downs": 0,
    "score": 16751,
    "created": 1481236304.0,
    "date_created": "2016-12-08",
    "time_created": "09:31:44",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxwa0c",
    "parent_id": "t3_5h6wr2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Facts for those who dispute man-made climate chage:\n\nco2 is a greenhouse gas\n\nHistorically, when co2 went up, the planet warmed.\n\nWe are producing a lot of co2.\n\nWe are eliminating much of the plants' and oceans' ability to remove co2\n\nThe earth is getting warmer.\n\nNow, taking all of those into consideration, there's only one logical conclusion.\n",
    "controversiality": 0,
    "ups": 9045,
    "downs": 0,
    "score": 9045,
    "created": 1481236936.0,
    "date_created": "2016-12-08",
    "time_created": "09:42:16",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxwq0s",
    "parent_id": "t3_5h6wr2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "If you want to see people honest to god dispute gravity come on down to /r/flatearth!\n\nSeriously I got into an argument with a guy who said the earth is accelerating and thats what gravity is...\n\nEdit: Turns out this is the sub with die hard flat earthers /r/theworldisflat \n\nNote you will get banned immediately for questioning anything posted. ",
    "controversiality": 0,
    "ups": 779,
    "downs": 0,
    "score": 779,
    "created": 1481237571.0,
    "date_created": "2016-12-08",
    "time_created": "09:52:51",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxutdq",
    "parent_id": "t3_5h6wr2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Except no one is making tons of money pretending gravity doesn't exist. Not counting Blake Griffin\n\nedit - changed the now to no",
    "controversiality": 0,
    "ups": 1671,
    "downs": 0,
    "score": 1671,
    "created": 1481234721.0,
    "date_created": "2016-12-08",
    "time_created": "09:05:21",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day3iao",
    "parent_id": "t3_5h6wr2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is what happens when you turn a scientific issue into a political issue. People lump the problem in with a political party instead of separating it and appealing it to the common person. If you talk only that, more will listen and less will be defensive about what needs to be done. As long as it is a Democrat vs Republican thing, there will always be things like this happening.",
    "controversiality": 0,
    "ups": 158,
    "downs": 0,
    "score": 158,
    "created": 1481245815.0,
    "date_created": "2016-12-08",
    "time_created": "12:10:15",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxx8k9",
    "parent_id": "t3_5h6wr2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is not how you convince the opposition. This is how you convince people already on your side that you are correct.\n\nAnd for the record, it's not like defying gravity.\n\n*I can observe gravity*. If gravity didn't exist, we would all fly into outer space. We don't, therefore therefore.\n\n*I cannot observe global warming*. I have to take people's word for it. Even the huge 1 degree increase and few inches sea level rise isn't something I really notice without data. And it's easy to believe that a government funded organization is faking data. I'm not saying they are faking data. I'm saying it's easy to believe they are.\n\nAnd finally, \"Climate change denier\" is a catch all term for \"Those who disagrees with *anything on this list*. If you think humans are responsible, but it's a self correcting system, you're a denier. If you think it's happening, but the last 10 years have maybe been exaggerated, you're a denier. If you think it's a big problem, but there are no cost effective ways to solve it yet, you're a denier. And calling someone a denier only shuts down the conversation, it doesn't actually get us closer to fixing this damn thing.",
    "controversiality": 0,
    "ups": 4935,
    "downs": 0,
    "score": 4935,
    "created": 1481238292.0,
    "date_created": "2016-12-08",
    "time_created": "10:04:52",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayf4br",
    "parent_id": "t3_5h6wr2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> Sea ice in the Arctic and Antarctic has also reached a record low with an area the size of India melting. \n\n> In response, fossil fuel-powered boats have started to sail through the once famously inaccessible North-West Passage north of Canada, while companies are planning to start to drill for oil.\n\nJesus Harold Christ.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1481259077.0,
    "date_created": "2016-12-08",
    "time_created": "15:51:17",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxttsi",
    "parent_id": "t3_5h6wr2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I can't believe people nowadays with unlimited access to information dare to deny global warming (climate change) like the article says it's like denying gravity. ",
    "controversiality": 0,
    "ups": 1420,
    "downs": 0,
    "score": 1420,
    "created": 1481233017.0,
    "date_created": "2016-12-08",
    "time_created": "08:36:57",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day3oc1",
    "parent_id": "t3_5h6wr2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm an Oklahoman and I hate Scott Pruitt and others like him.  We have more earthquakes than California now due to fracking.  He and others that line their pockets with the oil and gas business, are smiling as houses and schools collapse from something that they can control, but don't want to.  Pruitt and Inhoff are the worst we have to offer and they fit right in with Trump, so it makes sense I suppose.    ",
    "controversiality": 0,
    "ups": 121,
    "downs": 0,
    "score": 121,
    "created": 1481246008.0,
    "date_created": "2016-12-08",
    "time_created": "12:13:28",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxx2hf",
    "parent_id": "t3_5h6wr2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I used to have the energy to argue with people about global warming/climate change. I don't have the energy anymore. It's too stupid.",
    "controversiality": 0,
    "ups": 237,
    "downs": 0,
    "score": 237,
    "created": 1481238058.0,
    "date_created": "2016-12-08",
    "time_created": "10:00:58",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxho4",
    "parent_id": "t3_5h6wr2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "*sorts by controversial*",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1481238635.0,
    "date_created": "2016-12-08",
    "time_created": "10:10:35",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day0pte",
    "parent_id": "t3_5h6wr2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "What does he dispute, exactly? Because every time I see someone labelled as a science-denying cave person there's always nuance to their position. They acknowledge the greenhouse effect and that humans contribute to global warming. They just don't think it's going to cause a catastrophic mass extinction event as depicted by Alan Gore.\n\nIs that the same thing as denying gravity?",
    "controversiality": 0,
    "ups": 67,
    "downs": 0,
    "score": 67,
    "created": 1481242618.0,
    "date_created": "2016-12-08",
    "time_created": "11:16:58",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxuho4",
    "parent_id": "t3_5h6wr2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's a very bad example. Gravity is much easier to observe and predict due to celestial bodies only interacting through it. (If you don't assume dark energy and dark matter to be quirks of gravity). Climate change on the other hand is a mechanism within a chaotic system. New effects can pop up, others can be over or underestimated.\n\nEdit:\nFor those, who think, I'm disputing climate change, an answer to a comment from one of you:\n\nI'm not disputing the change of climate induced by man. I mentioned climate change being an effect in a chaotic system. Chaotic systems are characterized by smallest changes in initial conditions fundamentally changing the macroscopic behaviour. I'm disputing that computational models deployed to QUANTIFY this effect and extrapolate the climate into the future can be accurate as they are flawed by climate being a chaotic system. Gravity does not operate within a chaotic system. Interactions between its agents can be isolated and thus QUANTIFIED (earth's orbit around the sun etc.), while a thermometer can be rising due to multiple reasons.\n\nA better comparison would have been, disputing climate change is like disputing, that airplanes can fly. Both mechanisms operate in a chaotic system and can only be quantifiably understood by accounting for Turbulence via a model in the Navier Stokes equations, in the case of flying.\n\nEdit 2: Those pointing out, that celestial movements are also chaotic, as soon, as multiple bodies are involved: Of course that's true, the entire universe is a chaotic system. However, for the scope of the general public, most relevant questions regarding gravity can be approximated by collapsing it to a 2-body problem, which is non-chaotic (You're not evaluating the moon and the center of the galaxy, when you're calculating, how a dropping apple accelerates). For climate, you have to do that. So comparing it to gravity removes the complexity of the matter for the understanding, that the general public has. And the general public are the ones, they are trying to convince here. Hence, in my opinion, this comparison is misleading.\n\n",
    "controversiality": 0,
    "ups": 327,
    "downs": 0,
    "score": 327,
    "created": 1481234178.0,
    "date_created": "2016-12-08",
    "time_created": "08:56:18",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayfnzp",
    "parent_id": "t3_5h6wr2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Sort this thread by controversial if you were thinking of killing yourself over the holidays and need one last final nudge. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481259707.0,
    "date_created": "2016-12-08",
    "time_created": "16:01:47",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "db22ksy",
    "parent_id": "t3_5h6wr2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Welp, you voted for him. 👍",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481495245.0,
    "date_created": "2016-12-11",
    "time_created": "09:27:25",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "db6dnw4",
    "parent_id": "t3_5h6wr2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "How to elect an extremist:\n\n1. Spend several decades telling everyone their country is \"the best\" despite the lack of evidence.\n\n2. When they realize it's a lie they will naturally be angry.\n\n3. Now that they are angry promise to make them \"Great Again\". ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481727661.0,
    "date_created": "2016-12-14",
    "time_created": "02:01:01",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day7gne",
    "parent_id": "t3_5h6wr2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's even worse. The scientific community has a very clear consensus on what causes climate change, while there are tons of competing theories on what causes gravity. \n\nIn a way, climate change and our role in it is actually more widely accepted than gravity. ",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1481250331.0,
    "date_created": "2016-12-08",
    "time_created": "13:25:31",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxyls5",
    "parent_id": "t3_5h6wr2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This typical line of attack is a total strawman. Almost nobody denies the climate is changing. The data couldn't be clearer on that. The debate is about other things: how much is man made vs natural, how much we can do to fix it, whether the cost of changing is prudent etc.\n\nPersonally I have no idea. I have no qualifications to possibly dispute or confirm any of this. And I guarantee 99% of the people on this board don't either, yet there are some seriously opinionated people none the less. People don't like being lectured to about subjects from people who don't even have the most basic science degrees.\n\nEdit: a lot of responses (appreciated) but they are almost all some forms of \"the evidence is readily available online for anyone to look at, you don't have to be a scientist.\" Sorry, I don't buy that. With a situation as complex as this, I do not trust regular Joe's who are good at searching the Internet to be able to accurately analyze and scrutinze the data in most cases. Of curse I can just read all their conclusions, but 99% of people don't have the knowledge to really look into the foundations of where the data comes from.\n\nEDIT 2: woah my first gold! Thank you stranger! On a less than 100 up voted post saying something controversial about the climate change debate? WHAT WEBSITE IS THIS?!\n\n",
    "controversiality": 0,
    "ups": 213,
    "downs": 0,
    "score": 213,
    "created": 1481240081.0,
    "date_created": "2016-12-08",
    "time_created": "10:34:41",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day6bih",
    "parent_id": "t3_5h6wr2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I forgot where I heard it but someone in the industry said \"you don't have to disprove climate change, that'd be impossible, all you have to do is create doubt in the publics mind around the details and make it look like an argument.\" \n\nParaphrasing but that really made sense to me if I consider what the fossil fuel industry has been investing their money in to slow climate reform. They're not disproving they're just hiring people and politicians to endlessly question it and potential policy.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1481249027.0,
    "date_created": "2016-12-08",
    "time_created": "13:03:47",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day912n",
    "parent_id": "t3_5h6wr2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The Department of Defense knows climate change is real and has been acting accordingly. In Norfolk they have raised docks to accommodate for rising sea levels, for instance.\n\nInsurance companies know climate change is real and have been raising rates to account for increased property damage from weather related events.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1481252109.0,
    "date_created": "2016-12-08",
    "time_created": "13:55:09",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxtji",
    "parent_id": "t3_5h6wr2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "While climate (change) is real, the science is no where near as conclusive as theories of gravity. While the majority of climate scientists have come to consensus, it would be dishonest to suggest its conclusive to the point of law.",
    "controversiality": 0,
    "ups": 91,
    "downs": 0,
    "score": 91,
    "created": 1481239079.0,
    "date_created": "2016-12-08",
    "time_created": "10:17:59",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayxksc",
    "parent_id": "t1_dayfqhy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's FAKE NEWS! GET HIM!",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481283229.0,
    "date_created": "2016-12-08",
    "time_created": "22:33:49",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayp2qd",
    "parent_id": "t1_dayfqhy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Why is this the top comment?",
    "controversiality": 0,
    "ups": 65,
    "downs": 0,
    "score": 65,
    "created": 1481271699.0,
    "date_created": "2016-12-08",
    "time_created": "19:21:39",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daye0tm",
    "parent_id": "t1_day1mzs",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "He wants to get rid of the DOE and EPA. It's not susprirising to pick an opponent of them.",
    "controversiality": 0,
    "ups": 59,
    "downs": 0,
    "score": 59,
    "created": 1481257823.0,
    "date_created": "2016-12-08",
    "time_created": "15:30:23",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day5wtl",
    "parent_id": "t1_day1mzs",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "draining the wetlands was a large contributing factor to Hurricane Katrina being so devastating.... it's unwise  ",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1481248566.0,
    "date_created": "2016-12-08",
    "time_created": "12:56:06",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daygqzi",
    "parent_id": "t1_day1mzs",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "People thought it was a metaphor he was being literal",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1481260978.0,
    "date_created": "2016-12-08",
    "time_created": "16:22:58",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day2uxr",
    "parent_id": "t1_daxyy5v",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Next up: a homeopath for the head of the FDA.",
    "controversiality": 0,
    "ups": 1857,
    "downs": 0,
    "score": 1857,
    "created": 1481245068.0,
    "date_created": "2016-12-08",
    "time_created": "11:57:48",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1uw8",
    "parent_id": "t1_daxyy5v",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "At least with a moon landing denier the worst result would be a poor space program. Sure that blows, but it's far better than a misguided and selfish effort to undo decades of work to protect the only home we have with a single administrative appointment. This is the shit that frightens me. ",
    "controversiality": 0,
    "ups": 596,
    "downs": 0,
    "score": 596,
    "created": 1481243928.0,
    "date_created": "2016-12-08",
    "time_created": "11:38:48",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day352h",
    "parent_id": "t1_daxyy5v",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "If only being a climate denier was as taboo as being a holocaust denier ",
    "controversiality": 0,
    "ups": 626,
    "downs": 0,
    "score": 626,
    "created": 1481245393.0,
    "date_created": "2016-12-08",
    "time_created": "12:03:13",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day13ea",
    "parent_id": "t1_daxyy5v",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Well said!  There will always be nutjobs...we don't have to give them power or authority!",
    "controversiality": 0,
    "ups": 258,
    "downs": 0,
    "score": 258,
    "created": 1481243047.0,
    "date_created": "2016-12-08",
    "time_created": "11:24:07",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1x61",
    "parent_id": "t1_daxyy5v",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Oh cool, so nothing to worry about for a little over a month then.",
    "controversiality": 0,
    "ups": 69,
    "downs": 0,
    "score": 69,
    "created": 1481244002.0,
    "date_created": "2016-12-08",
    "time_created": "11:40:02",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day2mhv",
    "parent_id": "t1_daxyy5v",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "There will not always be deniers at the scale of the US climate change denyers though",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1481244805.0,
    "date_created": "2016-12-08",
    "time_created": "11:53:25",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day2npv",
    "parent_id": "t1_daxyy5v",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Or the head of the EPA. To me that might even be worse.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1481244843.0,
    "date_created": "2016-12-08",
    "time_created": "11:54:03",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day18ny",
    "parent_id": "t1_daxyy5v",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Every morning since Nov. 8th the first thing I have said to myself after reading the news is \"This is so fucked.\"\n\nToday is no different.",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1481243217.0,
    "date_created": "2016-12-08",
    "time_created": "11:26:57",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day4d9x",
    "parent_id": "t1_daxyy5v",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Or the head of the EPA",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481246803.0,
    "date_created": "2016-12-08",
    "time_created": "12:26:43",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day6o65",
    "parent_id": "t1_daxyy5v",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "My only analogy I can think of is it's like the difference between taking your prize winning pig to the veterinarian or butcher.  ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481249427.0,
    "date_created": "2016-12-08",
    "time_created": "13:10:27",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxyink",
    "parent_id": "t1_daxvu9e",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That generally happens when the science is not immediately visible or applicable to one's life. It's pretty easy to understand that the science of drinking bleach is sound after you've tried it once. Something as vast and slow as climate change is ripe with denial potential.",
    "controversiality": 0,
    "ups": 1001,
    "downs": 0,
    "score": 1001,
    "created": 1481239970.0,
    "date_created": "2016-12-08",
    "time_created": "10:32:50",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxapz",
    "parent_id": "t1_daxvu9e",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Selective bias at its finest. ",
    "controversiality": 0,
    "ups": 4351,
    "downs": 0,
    "score": 4351,
    "created": 1481238376.0,
    "date_created": "2016-12-08",
    "time_created": "10:06:16",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxyq6t",
    "parent_id": "t1_daxvu9e",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Also evolution. You cannot find any reasonably educated biologist claiming evolution to be false. People believe in biologists when it is AIDS, cancer etc... But when it's evolution, *hold on a second! That's, like, your opinion.*",
    "controversiality": 0,
    "ups": 1057,
    "downs": 0,
    "score": 1057,
    "created": 1481240238.0,
    "date_created": "2016-12-08",
    "time_created": "10:37:18",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxe4f",
    "parent_id": "t1_daxvu9e",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "EXACTLY! That's my main argument when arguing with a climate denier. You drive cars and fly on planes, ride elevators and sleep in penthouses *assuming* the models that the scientists use to build those systems are correct enough not to have you crashing down to your death. But when it comes to climate change and GMO and vaccines that's where everything turns quantum for them.\n\n**Edit:** My first ever gold and my highest rated post is one where I'm practically just venting my frustration. Ah, the magic of reddit! Thank you for the gold, lovely stranger!\n\n**Edit2:** I believe in quantum mechanics!!! I just made a bad pun about the quantum paradox. Long live the quantum theory! :)",
    "controversiality": 0,
    "ups": 4129,
    "downs": 0,
    "score": 4129,
    "created": 1481238502.0,
    "date_created": "2016-12-08",
    "time_created": "10:08:22",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxykrb",
    "parent_id": "t1_daxvu9e",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Or vaccines. ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1481240046.0,
    "date_created": "2016-12-08",
    "time_created": "10:34:06",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxwqu1",
    "parent_id": "t1_daxwa0c",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "but it still snows\n\n\n/s\n",
    "controversiality": 0,
    "ups": 7587,
    "downs": 0,
    "score": 7587,
    "created": 1481237605.0,
    "date_created": "2016-12-08",
    "time_created": "09:53:25",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxart",
    "parent_id": "t1_daxwa0c",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This isn't about logic, it's about short-sighted self-interest. They literally don't give a fuck because they'll most likely be dead before shit really hits the fan, and in the interim they stand to make more money as fossil fuel industry shills. ",
    "controversiality": 0,
    "ups": 1006,
    "downs": 0,
    "score": 1006,
    "created": 1481238378.0,
    "date_created": "2016-12-08",
    "time_created": "10:06:18",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxo14",
    "parent_id": "t1_daxwa0c",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "WRONG!™ -The President of the United States of America\n\nEDIT: CHINA",
    "controversiality": 0,
    "ups": 240,
    "downs": 0,
    "score": 240,
    "created": 1481238874.0,
    "date_created": "2016-12-08",
    "time_created": "10:14:34",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxy4fj",
    "parent_id": "t1_daxwa0c",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It still baffles me as a non-American that the most powerful country in the world that has produced many great scientists and was shaped by those great scientists is now blatantly ignoring and denouncing scientific facts on an official level and increasing scale.",
    "controversiality": 0,
    "ups": 171,
    "downs": 0,
    "score": 171,
    "created": 1481239466.0,
    "date_created": "2016-12-08",
    "time_created": "10:24:26",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxsx6",
    "parent_id": "t1_daxwa0c",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"But the climate has changed on it's own before. So all your fancy data just proved my point. See, if I kind of squint at the data it looks like it supports my point.\"\n\nUntil you see the changes caused by natural causes and the less than subtle spike based on human co2 production. [Relevant XKCD](https://xkcd.com/1732/)\n\nBut know, why would we want government regulations for cleaner. Had a family member say it was pointless because China pollutes so much more. So lets just contribute to that rather than doing what we can to help the environment.",
    "controversiality": 0,
    "ups": 163,
    "downs": 0,
    "score": 163,
    "created": 1481239056.0,
    "date_created": "2016-12-08",
    "time_created": "10:17:36",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxc04",
    "parent_id": "t1_daxwa0c",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"but in my backyard so far I haven't seen any change, here look at this link of a youtube video debunking climate change\"\n\n-Actual deniers",
    "controversiality": 0,
    "ups": 235,
    "downs": 0,
    "score": 235,
    "created": 1481238424.0,
    "date_created": "2016-12-08",
    "time_created": "10:07:04",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxfjh",
    "parent_id": "t1_daxwa0c",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Don't forget methane, that's a greenhouse gas which is 20x stronger and the permafrost all over the planet is start to thaw too.",
    "controversiality": 0,
    "ups": 89,
    "downs": 0,
    "score": 89,
    "created": 1481238556.0,
    "date_created": "2016-12-08",
    "time_created": "10:09:16",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxmky",
    "parent_id": "t1_daxwa0c",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> We are eliminating much of the plants' and oceans' ability to remove co2\n\nActually for a bit of time this has increased due to how photosynthesis works, this is why rate of increase in CO2 in atmosphere slowed down a bit past few years(though not for long). There is recent article in Economist about this.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1481238820.0,
    "date_created": "2016-12-08",
    "time_created": "10:13:40",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxb4s",
    "parent_id": "t1_daxwa0c",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Those co2 levels also went up A LOT at the start of the industrial revolution.",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1481238392.0,
    "date_created": "2016-12-08",
    "time_created": "10:06:32",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxmum",
    "parent_id": "t1_daxwq0s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I was talking to a guy who turned out to be a flat earther. One of the most jaw-dropping things he said was \"I'm not sure I believe in the Theory of Gravity, I think the Theory of Velocity makes a lot more sense.\"\n\nI didn't have a response for that level of stupid.",
    "controversiality": 0,
    "ups": 251,
    "downs": 0,
    "score": 251,
    "created": 1481238830.0,
    "date_created": "2016-12-08",
    "time_created": "10:13:50",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxe9x",
    "parent_id": "t1_daxwq0s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 155,
    "downs": 0,
    "score": 155,
    "created": 1481238508.0,
    "date_created": "2016-12-08",
    "time_created": "10:08:28",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxy2gr",
    "parent_id": "t1_daxwq0s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "All kidding aside, that's not a completely ridiculous way to describe GR to a layman.  \"What does it mean when you say 'spacetime is curved by gravity'?\"  \"It's kind of like you're always accelerating but not going anywhere.\"",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481239396.0,
    "date_created": "2016-12-08",
    "time_created": "10:23:16",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day2o8c",
    "parent_id": "t1_daxwq0s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"A place with thought provoking flat earth memes\" \n\nClear my schedule ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481244859.0,
    "date_created": "2016-12-08",
    "time_created": "11:54:19",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1vy9",
    "parent_id": "t1_daxutdq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Unexpected NBA",
    "controversiality": 0,
    "ups": 99,
    "downs": 0,
    "score": 99,
    "created": 1481243962.0,
    "date_created": "2016-12-08",
    "time_created": "11:39:22",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxywq8",
    "parent_id": "t1_daxutdq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> Not counting Blake Griffin\n\nAyyy",
    "controversiality": 0,
    "ups": 244,
    "downs": 0,
    "score": 244,
    "created": 1481240468.0,
    "date_created": "2016-12-08",
    "time_created": "10:41:08",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day17o9",
    "parent_id": "t1_daxutdq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah, it is basically EXACTLY the same situation we had with the tobacco companies where they refused for DECADES that cigarettes was any bad, just because science said they were.\n\nOr the time when lead infused gas POISONED THE ENTIRE NATION. A national health catastrophe where the companies kept claiming that lead was fine, and the lead levels in the air was natural despite what scientists said.\n\nThis is not the first time this have happened... and the US is always the last to fix whatever is wrong, because companies have way way too much power there.",
    "controversiality": 0,
    "ups": 142,
    "downs": 0,
    "score": 142,
    "created": 1481243185.0,
    "date_created": "2016-12-08",
    "time_created": "11:26:25",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1ffm",
    "parent_id": "t1_daxutdq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's a tough business denying gravity but I manage to stay floating.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481243433.0,
    "date_created": "2016-12-08",
    "time_created": "11:30:33",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxyktl",
    "parent_id": "t1_daxx8k9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "We need an army of people who reason like this on all sides of every debate. Unfortunately, we're a nation of people who approach politics like they're rooting for their local sports team. This affliction doesn't discriminate between liberals and conservatives, democrats or republicans.",
    "controversiality": 0,
    "ups": 1378,
    "downs": 0,
    "score": 1378,
    "created": 1481240048.0,
    "date_created": "2016-12-08",
    "time_created": "10:34:08",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxytbp",
    "parent_id": "t1_daxx8k9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "If more people had this line of thinking, and would approach most political issues in such a reasonable way, we wouldn't have such a vitriolic divide in politics",
    "controversiality": 0,
    "ups": 180,
    "downs": 0,
    "score": 180,
    "created": 1481240348.0,
    "date_created": "2016-12-08",
    "time_created": "10:39:08",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1heh",
    "parent_id": "t1_daxx8k9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I just tried to read the article with an open mind, I know nothing about the guy.\n\nThe only two bits of info about Pruitt in the article are these:\n\n1. Mr Pruitt has said the science behind climate change is “subject to considerable debate” (which I personally don't believe is a controversial statement)\n2. [He] regularly conspired with the fossil fuel industry to attack EPA protections. (I'm willing to believe this, but they don't really give any details. Kind of lame)\n\nThe rest is basically just climate change copypasta.\n\nEDIT: I completely agree on the \"Climate change denier\" too. I am skeptical, not necessarily of the science, but of politicians who might see this as an opportunity to extend their reach. But people have called me a denier. There was another thread a month or two ago, where I was merely trying to explain why people might be skeptical, and even this got me labeled a denier. In that thread I didn't even say what I thought personally!",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1481243496.0,
    "date_created": "2016-12-08",
    "time_created": "11:31:36",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzzf7",
    "parent_id": "t1_daxx8k9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "So then, how *do* we convince the opposition? Or do we just have to wait until coastal cities are underwater and there are unprecedented humanitarian refugee crises worldwide?",
    "controversiality": 0,
    "ups": 87,
    "downs": 0,
    "score": 87,
    "created": 1481241777.0,
    "date_created": "2016-12-08",
    "time_created": "11:02:57",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxwun",
    "parent_id": "t1_daxx8k9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 181,
    "downs": 0,
    "score": 181,
    "created": 1481239198.0,
    "date_created": "2016-12-08",
    "time_created": "10:19:58",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxv3wl",
    "parent_id": "t1_daxttsi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I would bet that people like Pruitt privately accept climate change as fact but publicly deny climate change because they have vested interest in doing so. He is likely a reasonably intelligent and educated person, I can't see how he wouldn't see the writing on the wall. I think it's far more likely that he just doesn't give a fuck and views it as an opportunity. ",
    "controversiality": 0,
    "ups": 892,
    "downs": 0,
    "score": 892,
    "created": 1481235192.0,
    "date_created": "2016-12-08",
    "time_created": "09:13:12",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxwivm",
    "parent_id": "t1_daxttsi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Upton Sinclair:\n\n\"It is impossible to make a man understand something if his livelihood depends on not understanding it.” ",
    "controversiality": 0,
    "ups": 290,
    "downs": 0,
    "score": 290,
    "created": 1481237288.0,
    "date_created": "2016-12-08",
    "time_created": "09:48:08",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxi4n",
    "parent_id": "t1_daxttsi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "My parents deny climate change, they say the oil wells are actually filling back up. I tried to reason but it didn't work.",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1481238652.0,
    "date_created": "2016-12-08",
    "time_created": "10:10:52",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxx87q",
    "parent_id": "t1_daxttsi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"It is difficult to get a man to understand something, when his salary depends upon his not understanding it!\"",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1481238279.0,
    "date_created": "2016-12-08",
    "time_created": "10:04:39",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxw7dm",
    "parent_id": "t1_daxttsi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "People don't reason, they rationalize. Give someone the facts:\n\n* Continuing with fossil fuels will cause major suffering for a lot of people.\n* Stopping with fossil fuels will cost them money/a good paying job, at least in the short-term.\n\nIf people were rational, they would look at these and either say: I'll sacrifice for the greater good, or my well-being is more important. Well, most people really want to make the selfish choice, but acknowledging that would make them feel like a bad person. They don't think they are a bad person, so the mental gymnastics start to get rid of the inconvenient first fact. Everyone does this, to some degree or another.\n\n\n\n",
    "controversiality": 0,
    "ups": 85,
    "downs": 0,
    "score": 85,
    "created": 1481236832.0,
    "date_created": "2016-12-08",
    "time_created": "09:40:32",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxvnlg",
    "parent_id": "t1_daxttsi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's money/power. Always. And I'm getting literally sick of being so outraged. ",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1481236030.0,
    "date_created": "2016-12-08",
    "time_created": "09:27:10",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxddc",
    "parent_id": "t1_daxttsi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The internet provides as much of a platform for crazy science deniers as it does for sensible people.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1481238475.0,
    "date_created": "2016-12-08",
    "time_created": "10:07:55",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxw7d2",
    "parent_id": "t1_daxttsi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "with ease of access to information due to the internet, ignorance is entirely a choice",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1481236831.0,
    "date_created": "2016-12-08",
    "time_created": "09:40:31",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzmk6",
    "parent_id": "t1_daxx2hf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I shouldn't laugh, but I've got a Masters degree in the subject and suffer from the same now. I think any study of the subject is designed to bring about depression\n\nFWIW, my own suspicion is that the Earth probably has more absorptive capacity than most models suggest, and that feedback loops can forestall some of the immediacy, as tree lines move to new latitudes and new carbon sinks are created. This is only a temporary backstop though. When we pass tipping point that'll be it. The collapse could be relatively sudden and definitely catastrophic. Mercury isn't the hottest planet in the solar system remember. Why?\n\nThe only hope we have is some kind of untested Frankenstein solution like geoengineering, but this is tantamount to a last throw of the dice. Don't tell Trump though, he'll probably think its a backstop solution",
    "controversiality": 0,
    "ups": 72,
    "downs": 0,
    "score": 72,
    "created": 1481241341.0,
    "date_created": "2016-12-08",
    "time_created": "10:55:41",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxdah",
    "parent_id": "t1_daxx2hf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Friend, gather up the strength that you have left and use it. It is now or never.",
    "controversiality": 0,
    "ups": 206,
    "downs": 0,
    "score": 206,
    "created": 1481238472.0,
    "date_created": "2016-12-08",
    "time_created": "10:07:52",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daya5v4",
    "parent_id": "t1_day0pte",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I don't think any nuance of \"climate change is a hoax by the Chinese government\" can sound reasonable. ",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1481253402.0,
    "date_created": "2016-12-08",
    "time_created": "14:16:42",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayb6s8",
    "parent_id": "t1_day0pte",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "He doesn't want any subsidies for alternative energy, no research into fusion, and continued corporate welfare for all oil, coal, and gas.\n\nIt's purely money-for-his-buddies driven.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1481254574.0,
    "date_created": "2016-12-08",
    "time_created": "14:36:14",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxz0gk",
    "parent_id": "t1_daxuho4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Man I know where you are coming from but idiots be attacking you just because they think you are denying climate change. God speed.",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1481240598.0,
    "date_created": "2016-12-08",
    "time_created": "10:43:18",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxz0zr",
    "parent_id": "t1_daxuho4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Add to this Climate Change scientists have to undo all the damage Al Gore and his dumbass movie did by overblowing the projections and creating a scenario where people assume because he was wrong about the speed of Global Warming, it doesn't exist at all in the first place. Gravity never really had a scenario where someone predicted its rate wrong and Newton had to fix it so that people stopped jumping off cliffs ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1481240616.0,
    "date_created": "2016-12-08",
    "time_created": "10:43:36",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzode",
    "parent_id": "t1_daxyls5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">Almost nobody denies the climate is changing. \n\n\nWhere do you live? Some people definitely don't think it is changing. Trump has said it was made up before too.\n\n\nEdit: according to this, about 70% believe climate change is happening, which is the highest it has been, but still way too low\n\nAnd 16% say there is *no* evidence\n\n\nhttp://closup.umich.edu/files/ieep-nsee-2015-fall-climate-belief.pdf",
    "controversiality": 0,
    "ups": 80,
    "downs": 0,
    "score": 80,
    "created": 1481241404.0,
    "date_created": "2016-12-08",
    "time_created": "10:56:44",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzlik",
    "parent_id": "t1_daxyls5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">how much is man made vs natural\n\n\nI never understood why anyone would bother arguing this. Would we be having the same discussion if a meteor came towards the earth? \n\n\nWe can put out a fire even if we don't know the cause.\n\n\nLet's just fix this shit before it's too late.",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1481241309.0,
    "date_created": "2016-12-08",
    "time_created": "10:55:09",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayqo3g",
    "parent_id": "t1_dayp2qd",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Come on... it's obvious. Without gravity it's always going to rise to the top.",
    "controversiality": 0,
    "ups": 165,
    "downs": 0,
    "score": 165,
    "created": 1481273912.0,
    "date_created": "2016-12-08",
    "time_created": "19:58:32",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayqn0b",
    "parent_id": "t1_dayp2qd",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "reddit loves speaking truth to power",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1481273870.0,
    "date_created": "2016-12-08",
    "time_created": "19:57:50",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayqkr9",
    "parent_id": "t1_dayp2qd",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "When comments blow up with a lot of upvotes in a short time they head to the top.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1481273780.0,
    "date_created": "2016-12-08",
    "time_created": "19:56:20",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayu6g1",
    "parent_id": "t1_daye0tm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Basically he wants to turn us all into uneducated idiots dying of heat stroke.",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1481278663.0,
    "date_created": "2016-12-08",
    "time_created": "21:17:43",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayayoy",
    "parent_id": "t1_day2uxr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[*his chakras are fading*](https://youtu.be/bgxzSUxxRzE)",
    "controversiality": 0,
    "ups": 576,
    "downs": 0,
    "score": 576,
    "created": 1481254318.0,
    "date_created": "2016-12-08",
    "time_created": "14:31:58",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daybhxu",
    "parent_id": "t1_day2uxr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "If you outlaw magic water only outlaws will have magic water!",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1481254927.0,
    "date_created": "2016-12-08",
    "time_created": "14:42:07",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayar8e",
    "parent_id": "t1_day2uxr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[I've got a degree in homeopathic medicine!](http://i.imgur.com/Nth7qOT.jpg)",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1481254082.0,
    "date_created": "2016-12-08",
    "time_created": "14:28:02",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayd7sl",
    "parent_id": "t1_day2uxr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Next up: an anti-vaxer as Surgeon General",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1481256894.0,
    "date_created": "2016-12-08",
    "time_created": "15:14:54",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayak72",
    "parent_id": "t1_day2uxr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Might get weed passed I guess. ",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1481253857.0,
    "date_created": "2016-12-08",
    "time_created": "14:24:17",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day29jo",
    "parent_id": "t1_day1uw8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Why would a moon landing denier result in a bad space program? Surely they'd be motivated by landing on the moon for the first time.  ",
    "controversiality": 0,
    "ups": 440,
    "downs": 0,
    "score": 440,
    "created": 1481244394.0,
    "date_created": "2016-12-08",
    "time_created": "11:46:34",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daycmy7",
    "parent_id": "t1_day1uw8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Maybe a good space program is what we need now RIP human Earth",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1481256222.0,
    "date_created": "2016-12-08",
    "time_created": "15:03:42",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayasyi",
    "parent_id": "t1_day352h",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Because climate change has yet to incur as many deaths as the holocaust *directly* and *immediately*, it is not as taboo yet.\n\nWhen suddenly highly irregular weather patterns start killing in the millions or drought brings damages in the billions, then climate change denying will be as taboo as the holocaust. ",
    "controversiality": 0,
    "ups": 290,
    "downs": 0,
    "score": 290,
    "created": 1481254136.0,
    "date_created": "2016-12-08",
    "time_created": "14:28:56",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day6a7p",
    "parent_id": "t1_day352h",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It is pretty taboo in many countries, not as taboo as denying the holocaust though",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1481248985.0,
    "date_created": "2016-12-08",
    "time_created": "13:03:05",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day21sn",
    "parent_id": "t1_day13ea",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "But we just did. And no one will go out and protest it. Maybe a few but not big enough to make the voice be heard.",
    "controversiality": 0,
    "ups": 75,
    "downs": 0,
    "score": 75,
    "created": 1481244149.0,
    "date_created": "2016-12-08",
    "time_created": "11:42:29",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daylgyp",
    "parent_id": "t1_day13ea",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "we voted for someone who is going to appoint all these whackjobs because hillary \"seemed untrustworthy\" ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1481266784.0,
    "date_created": "2016-12-08",
    "time_created": "17:59:44",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day07iq",
    "parent_id": "t1_daxyink",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You hit the nail!\nLot of people don't want to take the time to understand things that are not quick, easy and to the point (ie. drinking bleach). \nAnd having these kind of people as leaders is terrifying! ",
    "controversiality": 0,
    "ups": 389,
    "downs": 0,
    "score": 389,
    "created": 1481242047.0,
    "date_created": "2016-12-08",
    "time_created": "11:07:27",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daya9no",
    "parent_id": "t1_daxyink",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I've never tried drinking bleach. I don't think you need to try it to know it would be bad. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1481253524.0,
    "date_created": "2016-12-08",
    "time_created": "14:18:44",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day17jw",
    "parent_id": "t1_daxyq6t",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Not even mention that HIVs and cancer cells are the ~~living examples~~ figuratively living examples of evolution.\n\nEDIT: I forgot virus is not a living organism.",
    "controversiality": 0,
    "ups": 402,
    "downs": 0,
    "score": 402,
    "created": 1481243181.0,
    "date_created": "2016-12-08",
    "time_created": "11:26:21",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day16xo",
    "parent_id": "t1_daxyq6t",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I mean, AIDs denialism is a thing. And there are crackpots on cancer too. But fortunately they aren't taken as seriously. \n\nhttps://en.wikipedia.org/wiki/HIV/AIDS_denialism",
    "controversiality": 0,
    "ups": 75,
    "downs": 0,
    "score": 75,
    "created": 1481243161.0,
    "date_created": "2016-12-08",
    "time_created": "11:26:01",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day45p7",
    "parent_id": "t1_daxyq6t",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "My college biology professor/advisor doesn't believe in evolution. He taught it to us, but told us that he's Christian and believes God created life. He's very educated, has taught at Yale before, etc. Granted, maybe he just wasn't clear and believes in evolution, but believes God started everything or something like that. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1481246564.0,
    "date_created": "2016-12-08",
    "time_created": "12:22:44",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day64zt",
    "parent_id": "t1_daxyq6t",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Ohhhhh, there are AIDS denialists. Funnily enough, they keep dying off, though...",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481248821.0,
    "date_created": "2016-12-08",
    "time_created": "13:00:21",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day6q5m",
    "parent_id": "t1_daxyq6t",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"Nothing in biology makes sense except in the light of evolution\"\n\n-Theodosius Dobzhansky 1973",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481249490.0,
    "date_created": "2016-12-08",
    "time_created": "13:11:30",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day897r",
    "parent_id": "t1_daxyq6t",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You could say that about a million different things. The scientific community has believed wholeheartedly that certain things were true only to be disproved years later.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481251237.0,
    "date_created": "2016-12-08",
    "time_created": "13:40:37",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxy73a",
    "parent_id": "t1_daxxe4f",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Your oncologist says you have cancer.  Nine oncologists say you have cancer.  One says that he isnt sure if it's malignant.  The insurance company says they wont cover chemo, due to the debate on your cancer.  Thats how i feel about Lamar Smith and Scott Pruitt in charge.",
    "controversiality": 0,
    "ups": 4560,
    "downs": 0,
    "score": 4560,
    "created": 1481239560.0,
    "date_created": "2016-12-08",
    "time_created": "10:26:00",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxmnj",
    "parent_id": "t1_daxxe4f",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "GMO is a bit of a different category, less linked to political and ideological differences and more linked to education.",
    "controversiality": 0,
    "ups": 148,
    "downs": 0,
    "score": 148,
    "created": 1481238823.0,
    "date_created": "2016-12-08",
    "time_created": "10:13:43",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day07ve",
    "parent_id": "t1_daxxe4f",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's a terrible argument.\n\nNot all science is scienced equally. The science that keeps a penthouse apartment in place - engineering, really - is considerably more solid than the science behind, I don't know, string theory or something. (Replace with better example later.)\n\nScience is a method, a discipline, not a label that says \"this here be true\".",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1481242057.0,
    "date_created": "2016-12-08",
    "time_created": "11:07:37",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzm7a",
    "parent_id": "t1_daxxe4f",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I use this argument with my religious friends. They \"believe\" in the science that makes their cell phones work and airplanes fly, but some how, that does not carry over to the science that says the universe is older than 6,000 years old.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1481241331.0,
    "date_created": "2016-12-08",
    "time_created": "10:55:31",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxz3q1",
    "parent_id": "t1_daxxe4f",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "My dad uses that ice age scare back in the 70s to discredit everyone reporting on global warming as some political lunatic. It's ridiculous. We have 40+ years of new data, weather satellites, and evolution of theory on top of the fact that the whole Ice Age thing was unscientific garbage popularized by doomsayers.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481240708.0,
    "date_created": "2016-12-08",
    "time_created": "10:45:08",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxc33",
    "parent_id": "t1_daxwqu1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's actually a common misconception. Global warming means that the winter period is getting harsher and the summer period is getting warmer. Plus the transition between winter and summer is narrowing.",
    "controversiality": 0,
    "ups": 4958,
    "downs": 0,
    "score": 4958,
    "created": 1481238427.0,
    "date_created": "2016-12-08",
    "time_created": "10:07:07",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxfhb",
    "parent_id": "t1_daxwqu1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah, saying that global warming isn't happening because it's cold today is like saying inflation doesn't exist because you bought something on sale.",
    "controversiality": 0,
    "ups": 625,
    "downs": 0,
    "score": 625,
    "created": 1481238554.0,
    "date_created": "2016-12-08",
    "time_created": "10:09:14",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxx574",
    "parent_id": "t1_daxwqu1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Eventually it will just rain",
    "controversiality": 0,
    "ups": 64,
    "downs": 0,
    "score": 64,
    "created": 1481238164.0,
    "date_created": "2016-12-08",
    "time_created": "10:02:44",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxazu",
    "parent_id": "t1_daxwqu1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1481238387.0,
    "date_created": "2016-12-08",
    "time_created": "10:06:27",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxx939",
    "parent_id": "t1_daxwqu1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Check mate.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481238313.0,
    "date_created": "2016-12-08",
    "time_created": "10:05:13",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxvwm",
    "parent_id": "t1_daxxart",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The funny part is, if you really want to make America great again, clean enwrgy is clearly the next big industry. We could rush out to a lead and dominate whats next, but inatead we are burying our head in the sand and protecting a dead end path. \n\nThis is literally how disruption is primed to occur. Stupid legacy companies dont see the writing on the wall and then out of nowhere comes a startup pushing the future. Except this time, it's the entire country that will be left behind.",
    "controversiality": 0,
    "ups": 689,
    "downs": 0,
    "score": 689,
    "created": 1481239165.0,
    "date_created": "2016-12-08",
    "time_created": "10:19:25",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxy51l",
    "parent_id": "t1_daxxart",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "They think \"PC liberals and identity politics are a greater threat\" than climate change \n\n\nhttps://www.reddit.com/r/AskTrumpSupporters/comments/5h2i6q/does_donald_trump_care_about_climate_change_do/dax2rww\n ",
    "controversiality": 0,
    "ups": 232,
    "downs": 0,
    "score": 232,
    "created": 1481239488.0,
    "date_created": "2016-12-08",
    "time_created": "10:24:48",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxt0f",
    "parent_id": "t1_daxxart",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Except its impacting us NOW. ",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1481239059.0,
    "date_created": "2016-12-08",
    "time_created": "10:17:39",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxt5g",
    "parent_id": "t1_daxxart",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's the problem with capitalism.\n\nShort term profit maximization > sustainable economic growth\n\nThat's why we have boom and bust cycles in perpetuity\n\nThat's why environmental degradation is a \"negative externality\" as opposed to a direct cost of doing business",
    "controversiality": 0,
    "ups": 92,
    "downs": 0,
    "score": 92,
    "created": 1481239064.0,
    "date_created": "2016-12-08",
    "time_created": "10:17:44",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxy4oo",
    "parent_id": "t1_daxxo14",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "He's \"President-elect\" until he actually swears in. ",
    "controversiality": 0,
    "ups": 95,
    "downs": 0,
    "score": 95,
    "created": 1481239475.0,
    "date_created": "2016-12-08",
    "time_created": "10:24:35",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxz7yc",
    "parent_id": "t1_daxy4fj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Living in the southern US is interesting. I feel like most people I know here would dispute man-made climate change. I wonder what the general consensus is in other areas of the country ",
    "controversiality": 0,
    "ups": 61,
    "downs": 0,
    "score": 61,
    "created": 1481240854.0,
    "date_created": "2016-12-08",
    "time_created": "10:47:34",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day0rmr",
    "parent_id": "t1_daxy4fj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Greed. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1481242674.0,
    "date_created": "2016-12-08",
    "time_created": "11:17:54",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzcx0",
    "parent_id": "t1_daxy4fj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Change is scary. Being told that you, your father, and your grandfather are all responsible for unleashing horrors on the world is scary. Being out of work because the mines and wells and plants all closed and you never thought you'd have to learn anything else (because this really wasn't easy to learn) is scary. \n\nUnder conditions like that, believing the lie is very easy, especially when it comes from rich people who claim to have your back and that you're getting screwed, and when the scary side is making you feel stupid. (They are getting screwed, of course, but not by the people that they think are doing the screwing.) ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1481241019.0,
    "date_created": "2016-12-08",
    "time_created": "10:50:19",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxyxoc",
    "parent_id": "t1_daxxsx6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah man why be a good country, when we're already not the worst country?",
    "controversiality": 0,
    "ups": 70,
    "downs": 0,
    "score": 70,
    "created": 1481240500.0,
    "date_created": "2016-12-08",
    "time_created": "10:41:40",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxyy6n",
    "parent_id": "t1_daxxsx6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1481240518.0,
    "date_created": "2016-12-08",
    "time_created": "10:41:58",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxznf",
    "parent_id": "t1_daxxc04",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You know, the thing is, that's literally all they have to do is look at their backyard. If it's anything like mine, there are plants that are trying to bloom that should have gone dormant several months ago. And they do it every year now.",
    "controversiality": 0,
    "ups": 143,
    "downs": 0,
    "score": 143,
    "created": 1481239299.0,
    "date_created": "2016-12-08",
    "time_created": "10:21:39",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day07kx",
    "parent_id": "t1_daxxc04",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The funny thing is that there has been changes \"in the backyard.\" The USDA has a hardiness map, that shows which plants grow best in which areas. Most of the country has moved between 0.5 and 1 zones to the south since 1990. eg. Iowa can now grow trees that previously could only survive as far north as Missouri.\n\nhttps://www.arborday.org/media/mapchanges.cfm",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481242049.0,
    "date_created": "2016-12-08",
    "time_created": "11:07:29",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxrzv",
    "parent_id": "t1_daxxb4s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Interesting fact is that they were going up slowly before that. Most likely due to human farming/deforestation. \nThe start of the rise coincides with the invention of agriculture. \n\nBut the skyrocketing starts at the beginning of the industrial revolution as you said. ",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1481239021.0,
    "date_created": "2016-12-08",
    "time_created": "10:17:01",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxy6zb",
    "parent_id": "t1_daxxb4s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Not really. The big change started happening long after the industrial revolution, around 1900 or so. Since then, the rate has been mostly increasing. The industrial revolution is usually something described as happened in a few locations in the world and mostly much earlier. But if your point is that CO2 levels are increasing with the spread of industrialization, then I agree.\n\nEdit: Ok then, sources.\n\nhttp://cdiac.ornl.gov/trends/co2/lawdome-graphics.html\nin particular: http://cdiac.ornl.gov/trends/co2/graphics/lawdome.smooth75.gif\n\nSo if you look att the CO2 levels here, it might at first seem like it was incrasing as early as 1750. But look over the whole thousand year period. You will see that the levels around 1850 are not really that extreme, at most slightly above the peaks of the last 1000 years. In other words, that might be natural. 1850 is late or ending industrial revolution. By 1900 or so, the wavy changes goes away, from there it's just a linear increase to what we have today. The graph sadly does not show how we the last 16 years are getting even faster increase, but you get the picture.",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1481239556.0,
    "date_created": "2016-12-08",
    "time_created": "10:25:56",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxoz7",
    "parent_id": "t1_daxxmum",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I love the velocity guys because when you ask them why we dont see the same behavior on other planets or their satellites their answer is usually \"No only the earth is accelerating\"",
    "controversiality": 0,
    "ups": 112,
    "downs": 0,
    "score": 112,
    "created": 1481238909.0,
    "date_created": "2016-12-08",
    "time_created": "10:15:09",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day23av",
    "parent_id": "t1_daxxmum",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "WTH is the Theory of Velocity?",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481244196.0,
    "date_created": "2016-12-08",
    "time_created": "11:43:16",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxrje",
    "parent_id": "t1_daxxe9x",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That one is fake. There is a real one sub though. Forgot the name.",
    "controversiality": 0,
    "ups": 96,
    "downs": 0,
    "score": 96,
    "created": 1481239004.0,
    "date_created": "2016-12-08",
    "time_created": "10:16:44",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day142e",
    "parent_id": "t1_daxywq8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Lmao",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1481243069.0,
    "date_created": "2016-12-08",
    "time_created": "11:24:29",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day981e",
    "parent_id": "t1_day17o9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Well, y'know, humanity has collectively decided to die off, and I think we shoudl respect that decision.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1481252333.0,
    "date_created": "2016-12-08",
    "time_created": "13:58:53",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day0l6y",
    "parent_id": "t1_daxyktl",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Absolutely. We treat the news like pep rallies at this point. We love it when some talking head rattles off statements we agree with, then we laugh at the opposition along with them. This has just increased the rift between parties and demolished our respect for those with different opinions. ",
    "controversiality": 0,
    "ups": 346,
    "downs": 0,
    "score": 346,
    "created": 1481242472.0,
    "date_created": "2016-12-08",
    "time_created": "11:14:32",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxz02x",
    "parent_id": "t1_daxyktl",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Exactly. Shouting each other down has gotten us nowhere. We need to start humanizing each side again, as hard as that is for some people. We need to be building bridges, not burning them down.\n\nEdit: Before you start piling on the downvotes, I'm not saying I agree with climate change deniers nor should anyone. I'm saying calling them idiots does nothing except solidify their position. It's useless. I know it's futile a lot of the time with many people to try and have this conversation, but trying to understand each other gets you further than insulting each other. ",
    "controversiality": 0,
    "ups": 109,
    "downs": 0,
    "score": 109,
    "created": 1481240585.0,
    "date_created": "2016-12-08",
    "time_created": "10:43:05",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1ob6",
    "parent_id": "t1_daxyktl",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It feels more like a global trend. Political discourse is becoming more and more divisive and standoffish.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481243717.0,
    "date_created": "2016-12-08",
    "time_created": "11:35:17",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day3hvy",
    "parent_id": "t1_daxyktl",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Nah. We treat politics like a strongly held religious belief. Doesn't matter to much if our liberal or conservative views are wrong, we still defend them because they make us feel good.\n",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1481245803.0,
    "date_created": "2016-12-08",
    "time_created": "12:10:03",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day590o",
    "parent_id": "t1_daxzzf7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You can't convince groups, only people. And you can't force anyone to a conclusion, people come to conclusions on their own.\n\nBuild a respectful relationship with *one person*, listen to what they have to say, don't name call, don't offer your opinion without prompting. After a time, they may or may not ask what you believe. If they ask, offer a short concise simple and unoffensive summary, then back off.\n\nPeople don't think \"Well, he's an asshole, but his data checks out\". People think \"He's a good friend, and I know he's smart, so if he disagrees with me he must have a good reason\". Establish good rapport. If you don't have that, you'll get nowhere.",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1481247808.0,
    "date_created": "2016-12-08",
    "time_created": "12:43:28",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day22gq",
    "parent_id": "t1_daxzzf7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "People in this thread seem suspiciously more interested in scolding people who care about climate change for being mean than interested in explaining how to form a consensus on this issue.",
    "controversiality": 0,
    "ups": 109,
    "downs": 0,
    "score": 109,
    "created": 1481244169.0,
    "date_created": "2016-12-08",
    "time_created": "11:42:49",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxwoqd",
    "parent_id": "t1_daxv3wl",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "While it's definitely possible, it doesn't make his actions any less despicable. In fact, I'd argue it makes them more so. ",
    "controversiality": 0,
    "ups": 712,
    "downs": 0,
    "score": 712,
    "created": 1481237520.0,
    "date_created": "2016-12-08",
    "time_created": "09:52:00",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxmik",
    "parent_id": "t1_daxv3wl",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 74,
    "downs": 0,
    "score": 74,
    "created": 1481238817.0,
    "date_created": "2016-12-08",
    "time_created": "10:13:37",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxx7u5",
    "parent_id": "t1_daxv3wl",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "No way man. I've met very intelligent and wealthy climate change deniers. It's a thing.\n\nCognitive dissonance and everything...",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1481238265.0,
    "date_created": "2016-12-08",
    "time_created": "10:04:25",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxx303",
    "parent_id": "t1_daxv3wl",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">  He is likely a reasonably intelligent and educated person\n\nBeing intelligent doesn't mean too much if you use it to think up rationalisations for why you Couldn't Possibly Be Wrong.",
    "controversiality": 0,
    "ups": 47,
    "downs": 0,
    "score": 47,
    "created": 1481238077.0,
    "date_created": "2016-12-08",
    "time_created": "10:01:17",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxuni",
    "parent_id": "t1_daxwivm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is the exact argument some deniers use against climate scientists, saying we can't trust them as their research is just a matter of getting more funding for more research.",
    "controversiality": 0,
    "ups": 54,
    "downs": 0,
    "score": 54,
    "created": 1481239119.0,
    "date_created": "2016-12-08",
    "time_created": "10:18:39",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1ivd",
    "parent_id": "t1_daxxi4n",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> oil wells are actually filling back up\n\nThe oil that we are drilling took [65 million years to form](https://www.reference.com/science/long-oil-form-naturally-f516e26897aef0e), I'm pretty sure these wells aren't filling back up.\n\nThey've probably confused new production techniques that are allowing us to drill previously inaccessible reserves. Once this stuff is gone, it's gone for good.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1481243543.0,
    "date_created": "2016-12-08",
    "time_created": "11:32:23",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxy308",
    "parent_id": "t1_daxw7dm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Here's the difference\n\n- Continuing with fossil fuels will cause major suffering for a lot of people. However, if my family is rich, well off, plan well etc... then we can get through whatever future suffering will happen and come out on top when things normalize.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481239415.0,
    "date_created": "2016-12-08",
    "time_created": "10:23:35",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxz5ry",
    "parent_id": "t1_daxw7dm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Trying to stop use of fossil fuels is a much more complex and potentially disastrous problem than simply looking at it in terms of individual motivations.  Right now the developing world is dependent on fossil fuels for growth.  They have far less capability of harnessing renewables, more dependency on non-renewables, and less ability to regulate.  If you actually got serious about enforcing a transition to renewables globally, you would create an imbalance in which developing nations either get shit on for using non-renewables, or they get away with it and gain a competitive advantage (the latter is what's currently happening to a lesser extent).  That competitive advantage undercuts the incentive for nations to commit to non-renewables, as they give in and turn back to fossil fuels for short-term advantage in the global market or watch their economy suffer.  \n  \nHonestly what it comes down to is lack of global governance.  Without any ability to regulate or enforce on a global scale, this kind of problem is impossible to address.  Some nations will go the way they need to go, others will decide no fuck you, and the world will continue going down the drain.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481240778.0,
    "date_created": "2016-12-08",
    "time_created": "10:46:18",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxx85j",
    "parent_id": "t1_daxw7d2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The double-edged sword of internet publishing is that anyone can reach an audience of millions. To paraphrase If Google Was A Guy, \"Just because it's here doesn't mean it's true.\" ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1481238277.0,
    "date_created": "2016-12-08",
    "time_created": "10:04:37",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzzkv",
    "parent_id": "t1_daxzmk6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Agreed.  We don't know exactly what will happen but we have a pretty good suspicion that something really bad could happen, exactly when or how bad we don't know.  You would think that would be sufficient.....sigh.  Besides we need to wean ourselves off fossil fuels anyway. They're polluting, finite, and a source of national security concerns.  I do agree that we'll probably come up with some bioengineering to soak up the CO2 but I wouldn't count on it. And it might be too late. There's just absolutely no reason not to get on board.  Some short-term financial stress but that's not at all a compelling reason. Besides other jobs can be incorporated into solar, nuclear, wind, etc.  Again this whole topic just hurts my brain it's so dumb.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1481241784.0,
    "date_created": "2016-12-08",
    "time_created": "11:03:04",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day93m6",
    "parent_id": "t1_daxzmk6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "For those wondering, Venus is hotter because it has CO2 on the atmosphere. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1481252192.0,
    "date_created": "2016-12-08",
    "time_created": "13:56:32",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxy9te",
    "parent_id": "t1_daxxdah",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's not now or never, it's every single moments of our lives until this problem is resolved.",
    "controversiality": 0,
    "ups": 78,
    "downs": 0,
    "score": 78,
    "created": 1481239656.0,
    "date_created": "2016-12-08",
    "time_created": "10:27:36",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzbmg",
    "parent_id": "t1_daxxdah",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Is it? I think the time passed. We lost. ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1481240974.0,
    "date_created": "2016-12-08",
    "time_created": "10:49:34",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day08s2",
    "parent_id": "t1_daxz0gk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "As expected. People, in general as well as on this site, seem to have a very hard time separating a criticism of method with a criticism of content. ",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1481242086.0,
    "date_created": "2016-12-08",
    "time_created": "11:08:06",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day7qzl",
    "parent_id": "t1_daxz0gk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's like that one comment above said: it's like people cheering for a sports team. Either you believe a full list of things, or dispute one of the things and get outed as a climate change denier.\n\nIt's not exactly optimal, scientifically speaking.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1481250659.0,
    "date_created": "2016-12-08",
    "time_created": "13:30:59",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day3vnq",
    "parent_id": "t1_daxzlik",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "How are you going to fix a problem if you don't even acknowledge what's causing it? ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1481246242.0,
    "date_created": "2016-12-08",
    "time_created": "12:17:22",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daz3nux",
    "parent_id": "t1_dayu6g1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "So his voters, then.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1481293276.0,
    "date_created": "2016-12-09",
    "time_created": "01:21:16",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayddg5",
    "parent_id": "t1_dayayoy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You should delete this before Trump gets any ideas. I can see it now:\n\n**\"Just the change we need. Modern medicine is a Chinese hoax. Gwyneth Paltrow for FDA. HIGH ENERGY! #MAGA #Homeopath #Healthy #NoMorePills\"** ",
    "controversiality": 0,
    "ups": 361,
    "downs": 0,
    "score": 361,
    "created": 1481257074.0,
    "date_created": "2016-12-08",
    "time_created": "15:17:54",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayd34m",
    "parent_id": "t1_dayak72",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'd rather risk jail time because weed is illegal then to allow homeopath as head of the FDA ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1481256745.0,
    "date_created": "2016-12-08",
    "time_created": "15:12:25",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day2vn5",
    "parent_id": "t1_day29jo",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Well, a lot of those guys don't even think it's possible to land on the moon. ",
    "controversiality": 0,
    "ups": 259,
    "downs": 0,
    "score": 259,
    "created": 1481245090.0,
    "date_created": "2016-12-08",
    "time_created": "11:58:10",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day4bf6",
    "parent_id": "t1_day29jo",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Well it is obviously because the moon is a holograph projected in the sky by the lizardmen.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1481246745.0,
    "date_created": "2016-12-08",
    "time_created": "12:25:45",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day6w33",
    "parent_id": "t1_day29jo",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It just shows a lack of understanding of the science behind it. If they don't understand what is and isn't feasible, how can they accurately focus their resources?",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1481249677.0,
    "date_created": "2016-12-08",
    "time_created": "13:14:37",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daycz4t",
    "parent_id": "t1_dayasyi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">When suddenly highly irregular weather patterns start killing in the millions or drought brings damages in the billions, then climate change denying will be as taboo as the holocaust. \n\nSadly by then, it's way too late. Maybe the instant before he turns in to a puddle, the man who denied gravity will regret jumping off the building.",
    "controversiality": 0,
    "ups": 158,
    "downs": 0,
    "score": 158,
    "created": 1481256615.0,
    "date_created": "2016-12-08",
    "time_created": "15:10:15",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daybnz4",
    "parent_id": "t1_dayasyi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That sucks because it really only takes a few minutes to explain how climate change is at the base of the conflict in Syria, but by the time you get there, they're not interested anymore.\n\nEDIT: everyone's shitting their pants so here's a disclaimer: I'm not an expert on the Syrian conflict, I don't pretend to be, climate change is a factor though not the biggest cause (my bad), I think it's interesting to look at as a factor. Nighty night children!",
    "controversiality": 0,
    "ups": 165,
    "downs": 0,
    "score": 165,
    "created": 1481255120.0,
    "date_created": "2016-12-08",
    "time_created": "14:45:20",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day492q",
    "parent_id": "t1_day21sn",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Well when they do they just get called rioters, and told/physically made to move out of the street told to go protest somewhere quietly. Half the county sees a protest as an occupying army trying to take their freedoms. I agree that if it was a larger number it might make a bigger impact, but it also might lead to Trump supporters taking up arms against the rioters.",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1481246670.0,
    "date_created": "2016-12-08",
    "time_created": "12:24:30",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day3r1i",
    "parent_id": "t1_day07iq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I agree with you. However I'm sure our leaders know that climate change is happening but are making too much money off of denying to really do anything about it. That's why I'm terrified of them. Money is the only kind of green they care about. ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1481246095.0,
    "date_created": "2016-12-08",
    "time_created": "12:14:55",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day39ab",
    "parent_id": "t1_day07iq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Our monkey brains evolved to assess and deal with immediate threats. It's the same reason we prefer instant gratification and procrastination is a huge problem for so many. Delayed gratification and long term planning go against our nature. ",
    "controversiality": 0,
    "ups": 37,
    "downs": 0,
    "score": 37,
    "created": 1481245527.0,
    "date_created": "2016-12-08",
    "time_created": "12:05:27",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1oxn",
    "parent_id": "t1_day17jw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "My favorite is the bacteria which developed the ability to digest nylon, that always draws blank stares.",
    "controversiality": 0,
    "ups": 303,
    "downs": 0,
    "score": 303,
    "created": 1481243737.0,
    "date_created": "2016-12-08",
    "time_created": "11:35:37",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1hu6",
    "parent_id": "t1_day17jw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And MRSA, which everyone freaks out about.",
    "controversiality": 0,
    "ups": 48,
    "downs": 0,
    "score": 48,
    "created": 1481243509.0,
    "date_created": "2016-12-08",
    "time_created": "11:31:49",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day8xup",
    "parent_id": "t1_day17jw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">EDIT: I forgot virus is not a living organism.\n\nYou would find *some* virologists who disagree.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481252008.0,
    "date_created": "2016-12-08",
    "time_created": "13:53:28",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day6ffp",
    "parent_id": "t1_day16xo",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Just read up on Christine Maggore. I'm so angry that her daughter died because of her refusal to believe all the research in regards to HIV and aids!",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1481249152.0,
    "date_created": "2016-12-08",
    "time_created": "13:05:52",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daye8tn",
    "parent_id": "t1_day16xo",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The guy Trump just nominated for Secretary of Health and Human Services belongs to the AAPS, which denies the link between HIV and AIDS.\n\nhttp://scienceblogs.com/insolence/2016/11/30/the-new-secretary-of-health-and-human-services-is-a-member-of-a-fringe-medical-organization-heres-what-that-means/",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1481258074.0,
    "date_created": "2016-12-08",
    "time_created": "15:34:34",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxyvpe",
    "parent_id": "t1_daxy73a",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And the one uncertain oncologist happens to get paid by a think tank that is financed by the insurance company.",
    "controversiality": 0,
    "ups": 2946,
    "downs": 0,
    "score": 2946,
    "created": 1481240431.0,
    "date_created": "2016-12-08",
    "time_created": "10:40:31",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxynj9",
    "parent_id": "t1_daxy73a",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's a terrific analogy.",
    "controversiality": 0,
    "ups": 208,
    "downs": 0,
    "score": 208,
    "created": 1481240143.0,
    "date_created": "2016-12-08",
    "time_created": "10:35:43",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day0bw9",
    "parent_id": "t1_daxy73a",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "More extreme than that. Imagine 99 oncologists say you have cancer, and only 1 refutes that.\n\nEdit: Ahhh man, I got off at the wrong stop on the gold train",
    "controversiality": 0,
    "ups": 353,
    "downs": 0,
    "score": 353,
    "created": 1481242185.0,
    "date_created": "2016-12-08",
    "time_created": "11:09:45",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxyaiv",
    "parent_id": "t1_daxxmnj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah, there's a lot of leftist anti GMO sentiment",
    "controversiality": 0,
    "ups": 131,
    "downs": 0,
    "score": 131,
    "created": 1481239681.0,
    "date_created": "2016-12-08",
    "time_created": "10:28:01",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxy05g",
    "parent_id": "t1_daxxmnj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Monsanto being a shitty company is a good reason to not like GMOs since they're behind a lot of it.\n\nIf they didn't have such shitty practices, I think more people would be open to GMOs\n\nedit: for the record, I'm for GMOs, I'm even for GMOs created by Monsanto. I'm just against their shitty business practices.",
    "controversiality": 0,
    "ups": 276,
    "downs": 0,
    "score": 276,
    "created": 1481239316.0,
    "date_created": "2016-12-08",
    "time_created": "10:21:56",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxnqx",
    "parent_id": "t1_daxxc33",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's why i much prefer the term \"Climate change\"",
    "controversiality": 0,
    "ups": 3868,
    "downs": 0,
    "score": 3868,
    "created": 1481238863.0,
    "date_created": "2016-12-08",
    "time_created": "10:14:23",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxwa9",
    "parent_id": "t1_daxxc33",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Climate change doesn't change the weather in the same way all over the planet. Most areas get hotter. But some are getting cooler. Or they get more extreme weather conditions. Or longer rainly seaons. More hurricanes. \n\nOver here in Germany, the winter has been getting milder. But that may change, if the Gulf Stream changes because of warmin oceans. Without the Gulf Stream, weather will get really cold here.",
    "controversiality": 0,
    "ups": 61,
    "downs": 0,
    "score": 61,
    "created": 1481239179.0,
    "date_created": "2016-12-08",
    "time_created": "10:19:39",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxtn7",
    "parent_id": "t1_daxxc33",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's infuriating because it's about global averages. It's not called \"my backyard warming, on every day of the week all year long\"",
    "controversiality": 0,
    "ups": 100,
    "downs": 0,
    "score": 100,
    "created": 1481239083.0,
    "date_created": "2016-12-08",
    "time_created": "10:18:03",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxoln",
    "parent_id": "t1_daxxc33",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's why they need to get rid of the term global warming. Yes, it's accurate, but people look at all these severe winters and point to that as proof that global warming is wrong. It's maddening, but making the term more general (global climate change) is better than trying to educate people that are unwilling or incapable of learning what it actually means.",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1481238895.0,
    "date_created": "2016-12-08",
    "time_created": "10:14:55",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxmry",
    "parent_id": "t1_daxxc33",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">Plus the transition between winter and summer is narrowing.\n\nCan confirm. It was 18 degrees Celsius and sunny last week here in Vancouver, next week, [well here's the forecast](http://weather.gc.ca/city/pages/bc-74_metric_e.html) yeah...-11 Celsius. That's not....normal for here at all.\n\nEdit: The \"can confirm\" thing is a direct shot at the type of evidence we see used against change. Weather systems individually don't say anything about climate change. We need patterns of evidence for them to become meaningful. We have that information, and it is meaningful now, and it's time for some of these stubborn pundits to realize what's truly at stake. This isn't just \"oh it'll be hotter for our kids, they can turn up the A/C we invented for them\", this is going to be an extinction level event, and not just for humans. If there's other life in the galaxy, they'll find our artifacts, and the legacy of humankind FOREVER will be that we couldn't protect us from ourselves and we died because we're that stupid.",
    "controversiality": 0,
    "ups": 78,
    "downs": 0,
    "score": 78,
    "created": 1481238827.0,
    "date_created": "2016-12-08",
    "time_created": "10:13:47",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxu76",
    "parent_id": "t1_daxxc33",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "People also love to confuse weather and climate in these claims.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1481239103.0,
    "date_created": "2016-12-08",
    "time_created": "10:18:23",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxvy3",
    "parent_id": "t1_daxxfhb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I had a sandwich for lunch. World hunger is ended.",
    "controversiality": 0,
    "ups": 322,
    "downs": 0,
    "score": 322,
    "created": 1481239166.0,
    "date_created": "2016-12-08",
    "time_created": "10:19:26",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxqek",
    "parent_id": "t1_daxxfhb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's an excellent analogy, I'm going to steal that one",
    "controversiality": 0,
    "ups": 104,
    "downs": 0,
    "score": 104,
    "created": 1481238962.0,
    "date_created": "2016-12-08",
    "time_created": "10:16:02",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxx8cf",
    "parent_id": "t1_daxx574",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "How can humans come from apes if there's still apes?? Checkmate, dickwads. ",
    "controversiality": 0,
    "ups": 164,
    "downs": 0,
    "score": 164,
    "created": 1481238284.0,
    "date_created": "2016-12-08",
    "time_created": "10:04:44",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxbtj",
    "parent_id": "t1_daxx574",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I feel terrible saying this but living in Michigan, at least it's convenient. The weather has been fucking fantastic here the past couple years. ",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1481238417.0,
    "date_created": "2016-12-08",
    "time_created": "10:06:57",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxx8zy",
    "parent_id": "t1_daxx574",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "chocolate?\n\nWill we stay dry, or feel the pain?",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1481238309.0,
    "date_created": "2016-12-08",
    "time_created": "10:05:09",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxg2a",
    "parent_id": "t1_daxx574",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "As someone who likes the rain, I am fine with this. Waterworld when?\n\nProbably be dead anyway before it \"happened\"",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1481238576.0,
    "date_created": "2016-12-08",
    "time_created": "10:09:36",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxn48",
    "parent_id": "t1_daxxazu",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "'Global Warming' was a right-wing term [invented by Frank Luntz](http://www.slate.com/blogs/bad_astronomy/2013/04/28/fox_news_global_warming_versus_climate_change.html) to make climate change sound less scary. As usual it ended up getting taken up as the term everybody uses.\n\nedit: inverted my terms. Frank Luntz has made me into a moran",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1481238840.0,
    "date_created": "2016-12-08",
    "time_created": "10:14:00",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxynjz",
    "parent_id": "t1_daxxvwm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Hey, it worked when the music labels refused to acknowledge mp3s.",
    "controversiality": 0,
    "ups": 119,
    "downs": 0,
    "score": 119,
    "created": 1481240143.0,
    "date_created": "2016-12-08",
    "time_created": "10:35:43",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxyvcq",
    "parent_id": "t1_daxxvwm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This. Exactly this. I want to beat my congresswoman over the head with this statement until she sees the light.",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1481240418.0,
    "date_created": "2016-12-08",
    "time_created": "10:40:18",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxymp6",
    "parent_id": "t1_daxxvwm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Not to mention, the long-game is and will always be fusion. Which the US has consistently failed to fund, over and over again, despite outstanding university systems and an obvious demand signal.",
    "controversiality": 0,
    "ups": 185,
    "downs": 0,
    "score": 185,
    "created": 1481240114.0,
    "date_created": "2016-12-08",
    "time_created": "10:35:14",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day02go",
    "parent_id": "t1_daxxvwm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I have this theory for the future that the third or second world villages will be the cities of tomorrow because they don't have the old fossil fuel infrastructure. They get to leap frog straight to renewable energy sources, electric cars, etc. ",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1481241880.0,
    "date_created": "2016-12-08",
    "time_created": "11:04:40",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day3mfh",
    "parent_id": "t1_daxxvwm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The reason the US doesn't want to move to clean energy is it will cause them to lose control over parts of the world. \n\nOur best hope is China challenging the US to a scientific race much like the soviets did with the race to space. Without something like that occurring, I see little hope for the US government to make large strides in the current political environment.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481245947.0,
    "date_created": "2016-12-08",
    "time_created": "12:12:27",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxysmy",
    "parent_id": "t1_daxy51l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That whole post makes my head hurt...\n\nThe guy started out *somewhat* reasonable although I fail to understand why you can't have a Republican president that supports immigration reform AND a basic appreciation for the severity of climate change.\n\nThen I got to the line about anti-fracking/coal groups hating America...",
    "controversiality": 0,
    "ups": 140,
    "downs": 0,
    "score": 140,
    "created": 1481240324.0,
    "date_created": "2016-12-08",
    "time_created": "10:38:44",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day0jz4",
    "parent_id": "t1_daxy51l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Ah yes, the good old \"let's avoid the actual question and be mad at immigrants\" tactic.",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1481242433.0,
    "date_created": "2016-12-08",
    "time_created": "11:13:53",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxyqra",
    "parent_id": "t1_daxy51l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The environment has to take a back seat to some thousands of people who think that they won't have a job if coal and fracking and oil is left behind.\n\n\"they tuk ar jerbs!\"\n\nRidiculous.",
    "controversiality": 0,
    "ups": 82,
    "downs": 0,
    "score": 82,
    "created": 1481240257.0,
    "date_created": "2016-12-08",
    "time_created": "10:37:37",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzanw",
    "parent_id": "t1_daxy51l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I really wish people would stop saying \"identity politics\". It allows people to say things like \"I don't want to talk politics right now, agree to disagree!\" when discussing basic human rights and respect for lgbtq folk. There is nothing political about human rights as far as I'm concerned.\n\nIt would be like saying \"skin tone politics\" and hand waving racism. We don't do that, so why do we label lgbtq rights as \"identity politics\"?",
    "controversiality": 0,
    "ups": 71,
    "downs": 0,
    "score": 71,
    "created": 1481240943.0,
    "date_created": "2016-12-08",
    "time_created": "10:49:03",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxy3kr",
    "parent_id": "t1_daxxt5g",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Laissez-faire capitalism, sure. But you could actually say the same thing about socialism, communism, and fascism.\n\nCapitalism, or any economic model for that matter, that is properly regulated and maintained is environmentally sustainable. ",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1481239435.0,
    "date_created": "2016-12-08",
    "time_created": "10:23:55",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzk8e",
    "parent_id": "t1_daxy4oo",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "He's presumed President-elect until the electoral college votes are tallied on January 6th.",
    "controversiality": 0,
    "ups": 47,
    "downs": 0,
    "score": 47,
    "created": 1481241267.0,
    "date_created": "2016-12-08",
    "time_created": "10:54:27",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxyy8s",
    "parent_id": "t1_daxy4oo",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Still hoping for Meteor2016 to take out the Don and his merry little Puppeteer.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1481240520.0,
    "date_created": "2016-12-08",
    "time_created": "10:42:00",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1ow8",
    "parent_id": "t1_daxz7yc",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">  I wonder what the general consensus is in other areas of the country\n\nI live in Massachusetts, I have never met a human being who didn't fully accept man-made climate change.  I only know a few who don't consider it one of their biggest issues when selecting president, those few people are my libertarian friends who think the market will handle it. ",
    "controversiality": 0,
    "ups": 57,
    "downs": 0,
    "score": 57,
    "created": 1481243736.0,
    "date_created": "2016-12-08",
    "time_created": "11:35:36",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day9ymb",
    "parent_id": "t1_daxz7yc",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Pennsylvania chiming in here. People are very uneducated in my state (that's not a petty insult, it's just stating facts). Despite the fact that we used to be covered in snow from November to April in the 80s and 90s and now are lucky to see one snow a winter means nothing to these people. \n\nThey have this idea that \"scientists are getting rich off of pushing their climate change agenda\", completely ignoring that the oil (and other) industries are the ones that actually get rich from denying its existence. \n\n",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1481253173.0,
    "date_created": "2016-12-08",
    "time_created": "14:12:53",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day6opk",
    "parent_id": "t1_daxyxoc",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is how feel about America being a wealthy industrial nation but the worst of the wealthy industrial nations. Yeah our healthcare sucks compared to Europe but have you seen these kids in the Philippines!",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1481249444.0,
    "date_created": "2016-12-08",
    "time_created": "13:10:44",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day59kg",
    "parent_id": "t1_daxyy6n",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The fluctuation at the bottom is over a span of almost 2 centuries.\n\nWe have annual-scale and decadal-scale data going back millenia in the form of ice cores, tree rings, and limestone deposits in caves, but I'm not sure exactly how far back at that resolution.  At some point you are right that it gets time-averaged over longer periods, but for several thousands of years it's not an issue (I know annual tree rings go back more than 5000 years).  A bigger problem is how variable the data is at an individual site and that the data is typically smoothed even if annual-scale data is available because weather fluctuates so much at that finer scale.  This is why annual-scale data from a variety of sites around the world is normally lined up and \"stacked\" to average out local variability.  It is analogous to what goes on when we take average temperature of the globe today.  We don't take it at one spot.\n\nAs an acknowledgement that you are right in principle, about mid-way through the chart (between 16000BCE and 15500BCE) the presentation makes the same point that you do about the possibility of time-averaging being a factor in whether a transient change is detectable.  However, from that a few years to decades might be possible.  Century-scale, not really.  And more than a century is the scale of what the uptick at the bottom is.\n\nThe [sources](https://www.explainxkcd.com/wiki/index.php/1732:_Earth_Temperature_Timeline#Sources) for the chart are supplied if you want to look at the original data.  Even there, in the \"spikier\" data, the big spike at the end shows up very distinctively different.\n\nAbout the most dramatic thing that shows up is the Little Ice Age or the Younger Dryas, and those are still weak and relatively smoothed out by comparison in the rawer data in the primary sources.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1481247825.0,
    "date_created": "2016-12-08",
    "time_created": "12:43:45",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1hf1",
    "parent_id": "t1_daxyy6n",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Not sure what you mean? Looking at the chart again it looks like every square is 100 years and stays the same throughout.\n\nI would like to see the actual data points he used to make that line to see if there were any areas where these fluctuations could happen. If there are only readings every 300ish years then there is the chance a large fluctuation could have happened. Not sure the likely hood of it, but would love to hear Randall Munroe discuss it.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1481243496.0,
    "date_created": "2016-12-08",
    "time_created": "11:31:36",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1b12",
    "parent_id": "t1_daxyy6n",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "https://www.xkcd.com/605/\n\nIrony.\n\nThat said, I'm not a climate change denier either.  The one issue I have though is the implication by the left that if Trump weren't president Elect we'd be heading into 4-8 years of green energy utopian progress - which IS NOT the case.  Climate change needs to be confronted - the irony is that having Trump in office might bring much needed attention and pressure to it instead of it being on the back burner. \n\nHow do you get the Democrats in congress to agree and push for something?  Make it about being against their opponents. ",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1481243293.0,
    "date_created": "2016-12-08",
    "time_created": "11:28:13",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxy47u",
    "parent_id": "t1_daxxznf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Maybe your plants have gone senile. How old are they?",
    "controversiality": 0,
    "ups": 98,
    "downs": 0,
    "score": 98,
    "created": 1481239458.0,
    "date_created": "2016-12-08",
    "time_created": "10:24:18",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzdbr",
    "parent_id": "t1_daxy6zb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "One person says one thing, you say nearly the opposite.\n\nAnd neither of you used sources :/ so we don't know who is right.  But hey, these aren't the top comments for a reason, eh?\n\nBack up your claims so others can learn, yo!\n\nEdit: Ayyy, thanks for the sources :)",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481241032.0,
    "date_created": "2016-12-08",
    "time_created": "10:50:32",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day8kvh",
    "parent_id": "t1_daxxoz7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "So they believe other planets are spherical but not our own?",
    "controversiality": 0,
    "ups": 47,
    "downs": 0,
    "score": 47,
    "created": 1481251605.0,
    "date_created": "2016-12-08",
    "time_created": "13:46:45",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxz01t",
    "parent_id": "t1_daxxoz7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"So those planets don't have gravity?\"",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1481240584.0,
    "date_created": "2016-12-08",
    "time_created": "10:43:04",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day9xb0",
    "parent_id": "t1_daxxoz7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481253130.0,
    "date_created": "2016-12-08",
    "time_created": "14:12:10",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day5vmg",
    "parent_id": "t1_day23av",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Flat earth folks believe gravity is made up and what we are actually experiencing is the flat earth is accelerating at a steady 9.81m/s",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1481248527.0,
    "date_created": "2016-12-08",
    "time_created": "12:55:27",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxz2bi",
    "parent_id": "t1_daxxrje",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "/r/theworldisflat",
    "controversiality": 0,
    "ups": 115,
    "downs": 0,
    "score": 115,
    "created": 1481240660.0,
    "date_created": "2016-12-08",
    "time_created": "10:44:20",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "days2yx",
    "parent_id": "t1_day981e",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Ahh democracy, I don't want to die yet but I guess the suicide vote won, goodbye cruel world.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1481275872.0,
    "date_created": "2016-12-08",
    "time_created": "20:31:12",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day6y40",
    "parent_id": "t1_day0l6y",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I notice that my facebook feed was just preaching to the choir so I started following some conservative groups. It's very draining but it has given me insight into what people who don't think like me are thinking",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1481249741.0,
    "date_created": "2016-12-08",
    "time_created": "13:15:41",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day6ntv",
    "parent_id": "t1_day0l6y",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I think the mark of the next great president might be one who refuses to attack his opponents. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1481249416.0,
    "date_created": "2016-12-08",
    "time_created": "13:10:16",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayajzb",
    "parent_id": "t1_day0l6y",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> We treat the news like pep rallies at this point.\n\nBeautifully put. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1481253850.0,
    "date_created": "2016-12-08",
    "time_created": "14:24:10",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day32wv",
    "parent_id": "t1_daxz02x",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I've been trying to say this for both sides too (that we need to build bridges), but one side was so tired of having their bridges being burned off and laughed at they feel vindictive enough to attack everyone else now that they're in power.\n\nI'm afraid we'll see a repetitive cycle at this rate: One side keeps winning and laughs at another side, who can sometimes also suffer because of their decisions, but when the mocked side comes up in power, it will get revenge. And thus, we have the cycle of humanity.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1481245324.0,
    "date_created": "2016-12-08",
    "time_created": "12:02:04",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day7j9k",
    "parent_id": "t1_day22gq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "People love being an asshole when its morally justified. From shooting Nazis, laughing at prison rape, and even that whole fat people hate incident on reddit. \n\n\"To be able to destroy with good conscience, to be able to behave badly and call your bad behavior 'righteous indignation' — this is the height of psychological luxury, the most delicious of moral treats.”\n\n― Aldous Huxley",
    "controversiality": 0,
    "ups": 45,
    "downs": 0,
    "score": 45,
    "created": 1481250416.0,
    "date_created": "2016-12-08",
    "time_created": "13:26:56",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day91j1",
    "parent_id": "t1_day22gq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Well there is a reason for that.  Even if there is no consensus on the best way to convince the opposition, there is consensus that insulting the opposition is actively harming our cause, so we should stop that, even if we haven't yet thought of the best way to actively promote the cause.  Does that make sense?  ",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1481252124.0,
    "date_created": "2016-12-08",
    "time_created": "13:55:24",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxx149",
    "parent_id": "t1_daxwoqd",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I completely agree. ",
    "controversiality": 0,
    "ups": 246,
    "downs": 0,
    "score": 246,
    "created": 1481238006.0,
    "date_created": "2016-12-08",
    "time_created": "10:00:06",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxx505",
    "parent_id": "t1_daxwoqd",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Absolutely more despicable in my eyes.",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1481238156.0,
    "date_created": "2016-12-08",
    "time_created": "10:02:36",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxwx3y",
    "parent_id": "t1_daxwoqd",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Oh of course but if you had hundreds of millions of dollars riding on the fact that you deny it, i bet you'd consider it.",
    "controversiality": 0,
    "ups": 89,
    "downs": 0,
    "score": 89,
    "created": 1481237849.0,
    "date_created": "2016-12-08",
    "time_created": "09:57:29",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1cv1",
    "parent_id": "t1_daxxmik",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Or their descendants will be rich enough to not be affected. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481243351.0,
    "date_created": "2016-12-08",
    "time_created": "11:29:11",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxykaf",
    "parent_id": "t1_daxx7u5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Some are very intelligent and people I respect(other than their views on climate change). For the most part, they believe the entire ecosystem is too big for us to impact. They believe scientists who have proof that goes against man made climate Change are immediately ostracized or unfairly dismissed. They think all climate scientists are making money and will get more grants by sticking to their marching orders. Some think they are actually smarter and understand global earth sciences better than the actual career scientists. They often cite the global cooling \"concensus\" from the 80s. All of this stuff is churned out from the right wing news sources and they get in circles and all repeat the same talking points to each other and then there you have it.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1481240030.0,
    "date_created": "2016-12-08",
    "time_created": "10:33:50",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxz2qm",
    "parent_id": "t1_daxx303",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Ben Carson is a (retired) brain surgeon, which by all means would indicate that he has some modicum of intelligence and education.\n\nThat doesn't stop him saying from things that are completely retarded.\n",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1481240675.0,
    "date_created": "2016-12-08",
    "time_created": "10:44:35",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day0ro0",
    "parent_id": "t1_daxxuni",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Imagine how much funding Oil & Gas companies would be willing to spit out if there was legitimate research being produced that disagreed with climate change.",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1481242675.0,
    "date_created": "2016-12-08",
    "time_created": "11:17:55",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxysfe",
    "parent_id": "t1_daxxuni",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's unfortunate but that is a very real issue with the current landscape of research.\n\nNot arguing that results specifically related to climate change are valid/invalid but the way research is funded is causing observable integrity issues across the board in almost all fields.",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1481240317.0,
    "date_created": "2016-12-08",
    "time_created": "10:38:37",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day0s81",
    "parent_id": "t1_daxzzkv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm slightly disappointed that I haven't seen one mention of the 'precautionary principle' applied to a single post in the thread so far. That alone should be enough once people grasp it. \n\nThe whole thing about the PP is it offers deniers a way out if they wanted to get off their own bus without necessarily losing face. They can still hold their sceptic view, but can reconcile it with something akin to \"I'm not 100% certain, and given the consequences, I'm not prepared to risk being wrong. For this reason I'll accept the gravity of consequence outweighs the benefits of the doubt, even if I still think I'm probably likely to be right, but can't be certain that I am\"",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1481242692.0,
    "date_created": "2016-12-08",
    "time_created": "11:18:12",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxymln",
    "parent_id": "t1_daxy9te",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The problem is, even if we got 100% of humans to agree. The solutions are still incredibly complicated and expensive. The entire world economy runs on fossil fuels, we need to replace almost everything and it may not be possible to give everyone the life they're accustomed too on diffuse renewable energy sources. \n\nRemember that discussions about energy renewables vs nuclear vs gas are generally about electricity. Moving things like transport and home heating to renewables is a whole other ball game. \n\nI've been involved in climate change, renewable energy etc for almost a decade and I'm coming to the conclusion that the task is simply too difficult for humans to achieve. When I got into this, I expected that as we approached the 2020's we'd be well underway with a war like effort to change our energy system. Despite great progress with renewables and especially their cost, it simply isn't happening fast enough. At the moment we're just slowing the emissions rise, but it's still rising relentlessly, let alone steeply dropping. This is our end game.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1481240110.0,
    "date_created": "2016-12-08",
    "time_created": "10:35:10",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayclry",
    "parent_id": "t1_daxy9te",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Much better.  Worst comment I've ever seen gilded.\n\nMight as well give up if it's truly now or never.  Due to bureaucracy, it'll never be now. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481256184.0,
    "date_created": "2016-12-08",
    "time_created": "15:03:04",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daydqik",
    "parent_id": "t1_dayddg5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "HAHA! It's funny because if it happens I lose my job! LOL!",
    "controversiality": 0,
    "ups": 147,
    "downs": 0,
    "score": 147,
    "created": 1481257494.0,
    "date_created": "2016-12-08",
    "time_created": "15:24:54",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayex21",
    "parent_id": "t1_dayddg5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I hear his healthcare plan is trump brand magnetic bracelets for everyone. People with preexisting conditions will NOT be denied. And it will be totally free. See for every 50 cent bracelet i give the american people I agree to give myself a $1 tax cut, so yall wont have to pay for anything. its gonna be sooooo great.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1481258848.0,
    "date_created": "2016-12-08",
    "time_created": "15:47:28",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayispp",
    "parent_id": "t1_dayddg5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Oh my goodness HUSH we do NOT need to be giving them ideas ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481263410.0,
    "date_created": "2016-12-08",
    "time_created": "17:03:30",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayet1s",
    "parent_id": "t1_day2vn5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "When I was a little kid (back in the 70s) I overheard a grown man, our neighbor, say \"If it was possible to go to the moon, they would have done it before then.\"\n\nEven as a little kid, the logical fallacy of that statement was obvious. He simply couldn't accept that anything of importance could happen in HIS lifetime. Everything important was history.",
    "controversiality": 0,
    "ups": 319,
    "downs": 0,
    "score": 319,
    "created": 1481258719.0,
    "date_created": "2016-12-08",
    "time_created": "15:45:19",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayedry",
    "parent_id": "t1_day2vn5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Every time this subject comes up, I like to share this excellent video.\n\nhttps://youtu.be/_loUDS4c3Cs",
    "controversiality": 0,
    "ups": 53,
    "downs": 0,
    "score": 53,
    "created": 1481258233.0,
    "date_created": "2016-12-08",
    "time_created": "15:37:13",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayhjzl",
    "parent_id": "t1_daycz4t",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Nah, he'll blame Obama",
    "controversiality": 0,
    "ups": 98,
    "downs": 0,
    "score": 98,
    "created": 1481261932.0,
    "date_created": "2016-12-08",
    "time_created": "16:38:52",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daybye3",
    "parent_id": "t1_daybnz4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Really? That sounds interesting as hell imo. Where can I read about that?",
    "controversiality": 0,
    "ups": 55,
    "downs": 0,
    "score": 55,
    "created": 1481255447.0,
    "date_created": "2016-12-08",
    "time_created": "14:50:47",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayq03s",
    "parent_id": "t1_day3r1i",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And a lot of extremely religious people think God is going to destroy the world and take them all to heaven in a few years anyway.  Those that think they are going to be saved simply by believing have no reason to not plunder the Earth for all it is worth. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1481272981.0,
    "date_created": "2016-12-08",
    "time_created": "19:43:01",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day7zsj",
    "parent_id": "t1_day39ab",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's so ironic that our ability to delay gratification and plan super-long term are also two of the biggest traits that make us human and set us apart from all other life on our planet. ",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1481250939.0,
    "date_created": "2016-12-08",
    "time_created": "13:35:39",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day95o6",
    "parent_id": "t1_day39ab",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Some monkey brains can see climate change as an -immediate threat to our extinction- while other monkey brains can't because they only see immediate threats to their lifestyles and quality of life now.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1481252258.0,
    "date_created": "2016-12-08",
    "time_created": "13:57:38",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day8cf2",
    "parent_id": "t1_day39ab",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And also why it's common to like to throw my poop at people I disagree with at work.  Other people tell me they like it when I throw my poop too.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481251339.0,
    "date_created": "2016-12-08",
    "time_created": "13:42:19",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day2ofm",
    "parent_id": "t1_day1oxn",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "A lot of people who don't believe in evolution say that they don't believe in 'macro-evolution.' They do believe in evolution of bacteria and a few other examples. My aunt is one of the crazies who teaches biology and doesn't believe evolution is real. ",
    "controversiality": 0,
    "ups": 246,
    "downs": 0,
    "score": 246,
    "created": 1481244866.0,
    "date_created": "2016-12-08",
    "time_created": "11:54:26",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day2g57",
    "parent_id": "t1_day1oxn",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I was raised creationist, had my whole worldview shifted while in school away from heavy religious influences and am reasonably knowledgeable about science for not being in any scientific field. \n\nI know enough to know my limits I  guess is the best way to put it. \n\nOne question I don't really know how to phrase is this: Have we seen the development of micro-organisms that forced us to eventually say \"ok this is a new species now.\"?\n\nThe biggest argument against evolution is \"that's adaptation, not evolution\" but there must be an instance where enough adaptation has occurred that it crosses the line in a definitive manner, right? \n\nI don't even know if I'm asking this right.\n",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1481244604.0,
    "date_created": "2016-12-08",
    "time_created": "11:50:04",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day6iji",
    "parent_id": "t1_day1hu6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yep. Before the last few years, research into new antibiotics had ground to a halt. There was no profit in it, since the most dangerous bacterial strains were under control.\n\nGuess what? The bugs evolved. A creationist can deny that all he/she wants, but it doesn't change the facts. ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1481249248.0,
    "date_created": "2016-12-08",
    "time_created": "13:07:28",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day2dam",
    "parent_id": "t1_day1hu6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I only know what MRSA is because I'm a Bucs fan. =(",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481244514.0,
    "date_created": "2016-12-08",
    "time_created": "11:48:34",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day0ega",
    "parent_id": "t1_daxyvpe",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "and that insurance company is owned by friends of people in Congress or the Senate..... who ensure that laws that make this shit illegal don't get passed. ",
    "controversiality": 0,
    "ups": 919,
    "downs": 0,
    "score": 919,
    "created": 1481242265.0,
    "date_created": "2016-12-08",
    "time_created": "11:11:05",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day2tyw",
    "parent_id": "t1_daxyvpe",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "... aaaaand it's a little closer to 9999 oncologists that say it's cancer and one that isn't sure whose name is Nick Riviera.",
    "controversiality": 0,
    "ups": 327,
    "downs": 0,
    "score": 327,
    "created": 1481245038.0,
    "date_created": "2016-12-08",
    "time_created": "11:57:18",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day202h",
    "parent_id": "t1_daxyvpe",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah, now that oncologist is going to be the CEO of that insurance company. And his degree is imaginary. ",
    "controversiality": 0,
    "ups": 191,
    "downs": 0,
    "score": 191,
    "created": 1481244094.0,
    "date_created": "2016-12-08",
    "time_created": "11:41:34",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day68dk",
    "parent_id": "t1_daxyvpe",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The sad part is, i dealt with this exact situation at an insurance company (fuck you providence)... Except it was for back surgery, i destroyed my back in football and had to have a disc replacement and fusion and 3 specialists all said the same thing. The general practitioner at the Insurance company was like \"Nah back surgery is still too experimental\".. I couldnt even really walk, had to get the surgery now i feel great.. i was triple covered and thankfully blue cross blue shield paid for part of it, but we were still left with ~65k bill",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1481248927.0,
    "date_created": "2016-12-08",
    "time_created": "13:02:07",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day72ud",
    "parent_id": "t1_daxyvpe",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Thanks capitalism. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481249890.0,
    "date_created": "2016-12-08",
    "time_created": "13:18:10",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day0j88",
    "parent_id": "t1_daxynj9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Terrific, horrific...same thing.",
    "controversiality": 0,
    "ups": 125,
    "downs": 0,
    "score": 125,
    "created": 1481242411.0,
    "date_created": "2016-12-08",
    "time_created": "11:13:31",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day12oe",
    "parent_id": "t1_day0bw9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And the one that refutes it doesn't say that the tumor doesn't exist, but instead suggests that this is a natural tumor, not a harmful one.  A natural evolution if you will.\n\nEdit:  He also agrees that the other oncologists' treatments would work to combat this possibly natural tumor, but that they are too expensive.  In his opinion, the best option is to sit and wait to see what the tumor does.  Meanwhile, he will debate extensively about whether things you have done in the past could cause tumors, and how well we really understand what causes tumors.  The discussion of whether the tumor could be dangerous, even if natural, never happens.",
    "controversiality": 0,
    "ups": 436,
    "downs": 0,
    "score": 436,
    "created": 1481243025.0,
    "date_created": "2016-12-08",
    "time_created": "11:23:45",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day2kdf",
    "parent_id": "t1_day0bw9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "He still says you have cancer, he just thinks it's not from your 2 pack a day smoking habit.",
    "controversiality": 0,
    "ups": 89,
    "downs": 0,
    "score": 89,
    "created": 1481244740.0,
    "date_created": "2016-12-08",
    "time_created": "11:52:20",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day3df7",
    "parent_id": "t1_day0bw9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And your insurance company says: \"Well, we're not sure if this is a tumor or not. Before we treat it, we should wait a few years to see how things go just in case it's not a tumor. After all, we wouldn't want to start treatment until all oncologists agree that this is cancer. Don't pay any attention to the fact that the one lone oncologist holdout works for us. He's the unbiased one. The other 99 oncologists get their money from Big Cancer.\"",
    "controversiality": 0,
    "ups": 51,
    "downs": 0,
    "score": 51,
    "created": 1481245660.0,
    "date_created": "2016-12-08",
    "time_created": "12:07:40",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzghc",
    "parent_id": "t1_daxyaiv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Companies profit off GMO, companies lose profit on climate change.\n\nThe left has just as many \"anti-science\" people as the right (ok, maybe not quite as many...but still a lot)... They just pick their objections based on their other biases.",
    "controversiality": 0,
    "ups": 167,
    "downs": 0,
    "score": 167,
    "created": 1481241139.0,
    "date_created": "2016-12-08",
    "time_created": "10:52:19",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day5598",
    "parent_id": "t1_daxyaiv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "GMO is a left thing?  Everyone I know whose in to that nonsense is deep red conservative.  Weird.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481247687.0,
    "date_created": "2016-12-08",
    "time_created": "12:41:27",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxycir",
    "parent_id": "t1_daxy05g",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "i have had a convo here on reddit that has expanded my views on this. \n\ni was like \"gmo bad cause monsanto bad\" \n\nnow i'm like \"monsanto bad cause industrial farming bad, gmo or not\"\n\ni think farming in general needs more public education, from fertilizers and pest/herbicides, to soil nutrition depletion, to monoculture and diversity problems, to fossil fuel dependencies, to shelf life of food and wastes\n\nfood is serious business, but like, it's just apples and potatoes on the table at the end of the day so it's hard to take serious",
    "controversiality": 0,
    "ups": 132,
    "downs": 0,
    "score": 132,
    "created": 1481239753.0,
    "date_created": "2016-12-08",
    "time_created": "10:29:13",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxy5e6",
    "parent_id": "t1_daxy05g",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I agree Monsanto has terrible practices and I support criticism of company policies. I am more concerned when people adopt conspiracy theories of the likes \"GMO can cause cancer\", \"we dont know what gene manipulation will ultimately do to the produce\" etc. essentially the idea that scientists are manipulating the genes in a way that they dont know what terrible side effects they might cause.",
    "controversiality": 0,
    "ups": 165,
    "downs": 0,
    "score": 165,
    "created": 1481239500.0,
    "date_created": "2016-12-08",
    "time_created": "10:25:00",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day23gq",
    "parent_id": "t1_daxy05g",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Every time people say Monsanto is evil so we should fight GMOs it seems like a crazy selective argument. \n\nWells Fargo effectively stole money from their most vulnerable costumers by opening fee based accounts without their knowledge. Illegal foreclosures during the housing crisis have been well documented. So banks rob people and take their homes. \n\nI don't see a lot of mainstream support for abolishing money. \n\nNestle has admitted to using slaves. Should we get rid of chocolate?\n\nVW lied and cheated to get past pollution standards in the \"clean\" diesel cars. Nobody suggested we should ban cars. \n\nIn every industry there are bad actors. To suggest that we ban a technology because one company isn't playing nice is beyond crazy.  ",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1481244202.0,
    "date_created": "2016-12-08",
    "time_created": "11:43:22",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxs1k",
    "parent_id": "t1_daxxnqx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Even climate change can lead to the \"the climate is always changing\" defense. \n\nWe need a new phrase that directly links human activity to accelerated climate change. Honestly it needs to be a phrase that is marketable. \n\nEdit: Anthropogenic climate change has been around for a while but it has obviously not gained ground outside of the academic community. We need a term that is more marketable. ",
    "controversiality": 0,
    "ups": 834,
    "downs": 0,
    "score": 834,
    "created": 1481239023.0,
    "date_created": "2016-12-08",
    "time_created": "10:17:03",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxuh2",
    "parent_id": "t1_daxxnqx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "No no no, they changed it from global warming to climate change cause the data wasn't fitting their liberal propaganda! /s",
    "controversiality": 0,
    "ups": 1378,
    "downs": 0,
    "score": 1378,
    "created": 1481239113.0,
    "date_created": "2016-12-08",
    "time_created": "10:18:33",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxx4e",
    "parent_id": "t1_daxxnqx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It needs to be something more attention grabbing than \"Climate Change\" though.\n\nMaybe if we say \"Climate Abortion\" these dipshits will finally pretend to care about it.",
    "controversiality": 0,
    "ups": 138,
    "downs": 0,
    "score": 138,
    "created": 1481239208.0,
    "date_created": "2016-12-08",
    "time_created": "10:20:08",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxyg9g",
    "parent_id": "t1_daxxnqx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is the reason the term Climate Change was introduced, because we learned that \"Global Warming\" is not an accurate descriptor.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1481239886.0,
    "date_created": "2016-12-08",
    "time_created": "10:31:26",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day8cez",
    "parent_id": "t1_daxxwa9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "My father did some research in the 90s that contributed to our understanding of climate change.  He has always said that it was a mistake to talk about the situation as \"global warming\".  He prefers \"climate instability\".  His explanation to people who asked him to describe the problem was \"more extreme weather events, more unpredictable, more often\".",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1481251339.0,
    "date_created": "2016-12-08",
    "time_created": "13:42:19",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxyhzc",
    "parent_id": "t1_daxxtn7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Reminds me of this graphic when The North East was getting epic storms due to the polar vortex\n\nhttp://imgur.com/a/ElTJ1",
    "controversiality": 0,
    "ups": 102,
    "downs": 0,
    "score": 102,
    "created": 1481239947.0,
    "date_created": "2016-12-08",
    "time_created": "10:32:27",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxy0hi",
    "parent_id": "t1_daxxoln",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Let me be clear, I've always believed global warming was real, But I never realized it mint harsher winters also. I never see people talk about that part, but I'm gonna Google it myself now. \n\n\nEdit:I really appreciate all the information, thanks people.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1481239329.0,
    "date_created": "2016-12-08",
    "time_created": "10:22:09",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxrfp",
    "parent_id": "t1_daxxmry",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah I feel like Fall and Spring just did not happen in 2016. I wish I could've joined them in skipping 2016. ",
    "controversiality": 0,
    "ups": 106,
    "downs": 0,
    "score": 106,
    "created": 1481239000.0,
    "date_created": "2016-12-08",
    "time_created": "10:16:40",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxydoy",
    "parent_id": "t1_daxxmry",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "So anecdotes are suddenly meaningful if they support climate change? There's definitely places on the planet experiencing stable weather within the historic normal range of temperatures for the area at this time of year. Weather doesn't equal climate. Don't bring up weather in your neck of the woods and hold it up as evidence. It just gives deniers ammo whenever there's temperate weather. IMO it is one of the big reason there's so much denial in the first place. I see statements like yours comstantly and they absolutely cut both ways. As long as they're commonplace, deniers will just cherry pick their own anecdotes in return and we will get nowhere.",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1481239794.0,
    "date_created": "2016-12-08",
    "time_created": "10:29:54",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzfwk",
    "parent_id": "t1_daxxvy3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I just drank a bottle of water, there is no global water crisis",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1481241120.0,
    "date_created": "2016-12-08",
    "time_created": "10:52:00",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day0gfo",
    "parent_id": "t1_daxxvy3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Another one would be....\n\n\"Racism does't exist because I haven't experienced it.\" - Lil Wayne\n\nThey had a thread in t_d the other day praising him for that idiotic line.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481242326.0,
    "date_created": "2016-12-08",
    "time_created": "11:12:06",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxy4d",
    "parent_id": "t1_daxxqek",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Gravity doesn't exist because you can jump?",
    "controversiality": 0,
    "ups": 88,
    "downs": 0,
    "score": 88,
    "created": 1481239244.0,
    "date_created": "2016-12-08",
    "time_created": "10:20:44",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxjxy",
    "parent_id": "t1_daxx8cf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "How can White Americans come from Europe when there are still Europeans?",
    "controversiality": 0,
    "ups": 169,
    "downs": 0,
    "score": 169,
    "created": 1481238722.0,
    "date_created": "2016-12-08",
    "time_created": "10:12:02",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxmw6",
    "parent_id": "t1_daxx8cf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I wonder if the people who actually say that also have a good rebuttal for why we still have wolves *and* dogs.",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1481238831.0,
    "date_created": "2016-12-08",
    "time_created": "10:13:51",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxy0l1",
    "parent_id": "t1_daxx8cf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Always reminds me of [this](https://cdn.meme.am/cache/instances/folder709/500x/56391709.jpg).",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1481239332.0,
    "date_created": "2016-12-08",
    "time_created": "10:22:12",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxcph",
    "parent_id": "t1_daxx8cf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Something happened to their boners, like they were lost a long time ago",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1481238449.0,
    "date_created": "2016-12-08",
    "time_created": "10:07:29",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxnef",
    "parent_id": "t1_daxxbtj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "As someone who currently lives in the tropics, and as it is now summer, I'm desperately trying to type this response before mmmy keybrd mels thhk hgahg",
    "controversiality": 0,
    "ups": 70,
    "downs": 0,
    "score": 70,
    "created": 1481238850.0,
    "date_created": "2016-12-08",
    "time_created": "10:14:10",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxknk",
    "parent_id": "t1_daxxbtj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Haha yeah. Hasn't been cold at all until December. Was pretty nice. ",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1481238749.0,
    "date_created": "2016-12-08",
    "time_created": "10:12:29",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxj0i",
    "parent_id": "t1_daxxbtj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "As a fellow Michigander, I wholeheartedly agree. However, this also means we get nastier winters and shit like that ice storm like we did in 2014 or 2013. \n\nClimate change also means fucky weather patterns. ",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1481238687.0,
    "date_created": "2016-12-08",
    "time_created": "10:11:27",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day2re0",
    "parent_id": "t1_daxxbtj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "As an Ontarian I agree.  It's a kinda horrible guilty feeling enjoying the much milder weather.  The drought we had this past summer sucked though (for farmers.. was great for sitting at the beach.. I am going to hell..)",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481244958.0,
    "date_created": "2016-12-08",
    "time_created": "11:55:58",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxtfl",
    "parent_id": "t1_daxx8zy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Tay Zonday was ahead of his time",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481239075.0,
    "date_created": "2016-12-08",
    "time_created": "10:17:55",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzdh4",
    "parent_id": "t1_daxxn48",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It was Frank Luntz who changed it, but he changed it from \"Global Warming\" to \"Climate Change,\" to make it sound like it wasn't as big of a deal as it is. \n\nThat's also what your link says.\n\nWe all used to call it Global Warming. Climate Change is the newer term that the republicans switched us to.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1481241037.0,
    "date_created": "2016-12-08",
    "time_created": "10:50:37",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxueg",
    "parent_id": "t1_daxxn48",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Just like the 'big bang'. It was originally invented to criticise and ridicule the big bang theory at the time it was still contested.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481239110.0,
    "date_created": "2016-12-08",
    "time_created": "10:18:30",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxyvao",
    "parent_id": "t1_daxynjz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yup, now cds are more popular than ever ",
    "controversiality": 0,
    "ups": 103,
    "downs": 0,
    "score": 103,
    "created": 1481240416.0,
    "date_created": "2016-12-08",
    "time_created": "10:40:16",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day062t",
    "parent_id": "t1_daxyvcq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I don't think they care.  Truly I do not.  I wrote my senators about funding science (I categorized it under \"fiscal issues\" or something, for lack of anything better).  3 weeks later, I received an email that was clearly an automated message about fiscal responsibility, and more or less blamed democrats for the downgrading of the U.S.'s credit (during the budget crisis...that republicans caused...).  The words \"science\" or \"NIH\" or anything even remotely similar to my email did not appear in the message I got back.\n\nMy big thing is...if its automated, and it clearly was, why the fuck did you wait 3 weeks before it was sent to me?",
    "controversiality": 0,
    "ups": 54,
    "downs": 0,
    "score": 54,
    "created": 1481241999.0,
    "date_created": "2016-12-08",
    "time_created": "11:06:39",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzb8s",
    "parent_id": "t1_daxyvcq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Beating someone over the head has the opposite effect. If you want to open her eyes just murder a couple people that she loves. Put some of her peers in front of a firing squad. Demand change.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481240962.0,
    "date_created": "2016-12-08",
    "time_created": "10:49:22",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxz0ey",
    "parent_id": "t1_daxymp6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Can you explain why fusion is the end game over renewables?",
    "controversiality": 0,
    "ups": 48,
    "downs": 0,
    "score": 48,
    "created": 1481240596.0,
    "date_created": "2016-12-08",
    "time_created": "10:43:16",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day3re3",
    "parent_id": "t1_day3mfh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That is probably exactly how ot needs to be sold to the public. Americans hate losing; just drum up the people by saying, \"you really gonna let China beat your brains in on this??\"",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1481246106.0,
    "date_created": "2016-12-08",
    "time_created": "12:15:06",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day0fia",
    "parent_id": "t1_daxysmy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Seriously, he thinks that people who want regulation to slow climate change only do so because they hate America?\n\nHuh??\n\nBut apparently he's a proud speaker of the Trump supporters, so I guess I'm not surprised.",
    "controversiality": 0,
    "ups": 86,
    "downs": 0,
    "score": 86,
    "created": 1481242298.0,
    "date_created": "2016-12-08",
    "time_created": "11:11:38",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day2tyd",
    "parent_id": "t1_daxyqra",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Not that it's surprising, but I just realized they won't take their advice (again). They continuously call liberals hippies and dead beats. \"Go to school, get a job!\" But now they're out of a job, and they'd rather sit at home, getting triggered about how their old job has moved over seas, instead of getting an education and once again becoming a contributing member of society.\n\nI almost want to start calling them out on it, but it might trigger their economic sensitivity, and they might just re-elect Trump for another term out of spite.",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1481245038.0,
    "date_created": "2016-12-08",
    "time_created": "11:57:18",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day34id",
    "parent_id": "t1_daxyqra",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I mean...let's not pretend that sudden mass unemployment in previously booming sectors won't have really bad effects. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1481245375.0,
    "date_created": "2016-12-08",
    "time_created": "12:02:55",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1fhg",
    "parent_id": "t1_daxyqra",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "We all know how much comfortable americans love picking strawberries for 10 hours straight for less than minimum wage! ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1481243435.0,
    "date_created": "2016-12-08",
    "time_created": "11:30:35",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day0ort",
    "parent_id": "t1_daxzanw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The GOP are absolute masters at rebranding. Neo-nazism and white supremacy are the \"alt-right.\" Human rights are \"identity politics.\" Non-discrimination is \"political correctness.\" And somehow all of their rebranded terms are the ones that stick.",
    "controversiality": 0,
    "ups": 89,
    "downs": 0,
    "score": 89,
    "created": 1481242587.0,
    "date_created": "2016-12-08",
    "time_created": "11:16:27",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day2566",
    "parent_id": "t1_daxzanw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">agree to disagree\n\nThis phrase is becoming the bane of my existence. \n\nSomeone will say something like, \"I don't understand it. Black people are lazy, stupid criminals, but all they do is blame slavery. Slavery was 200 years ago! They had time to get better! It's all their fault!\"\n\nTo which I will reply, \"That's a very under-informed judgement to make. Although slavery is the popular topic, there's been systemic oppression keeping them down for the past 200 years. Since you seem to be interested in the subject, I can point you to all the history that lead to the current situation.\"\n\nThem: \"I know I won't change your ~~mind~~ opinion, and you won't change mine. I Agree to Disagree.\"\n\nMe: *-rage-*\n\nedit: Strike that- \"opinion\" is the word they use. And that's important. Opinion implies that they've made an *informed* judgement, when they haven't.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1481244256.0,
    "date_created": "2016-12-08",
    "time_created": "11:44:16",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day28xg",
    "parent_id": "t1_daxzanw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The unbelievable irony of this is that people like him are the worst offenders  of identity politics. I mean this guy is literally saying the biggest issue of the election was \"PC liberals\", what does that even mean? How are they the biggest issue? How is electing Trump going to change that? There are no answers to these questions. Its just that liberals didn't like Trump and he seemed generally intolerant of things liberals usually think are important so therefore he gets the vote. No need to worry about anything else since SJW feminazi tumblrinas are the most pressing issue in America. You have this guy talking about how he voted for Trump because the biggest issue in America is that people exist who have different beliefs about American culture than him, and then in the same sentence complains about identity politics. The lack of self awareness is mind blowing. \n\nCan you imagine asking someone in real life what they thought the most pressing issue in America was and they said \"well it's far and away PC culture and feminazi tumblrina SJWs who hate America\"? You would laugh in their face if someone tried to have a serious conversation with you that way. These types of posts are pathetically hilarious, and reek of someone who spends too much time reading tumblrinaction and thinking that's how the real world is. What's even more hilarious is now these people think they won the culture war or whatever. Like what do they think Trump is going to do? Ban Tumblr? Shut down gender studies departments? Of course not, the President cannot change how people behave in society. What's sad is that these people have so much hate that Trump could spend the next 4 years personally draining their bank accounts and as long as liberals were upset about it they would be happy. \n\n",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1481244373.0,
    "date_created": "2016-12-08",
    "time_created": "11:46:13",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxys8r",
    "parent_id": "t1_daxy3kr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> Capitalism, or any economic model for that matter, that is properly regulated and maintained is environmentally sustainable.\n\nHas that ever happened before? I thought once human groups get to a certain size, that becomes nearly impossible.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1481240310.0,
    "date_created": "2016-12-08",
    "time_created": "10:38:30",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day7yaw",
    "parent_id": "t1_day1ow8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> those few people are my libertarian friends who think the market will handle it\n\nThis is what frustrates me most about libertarians. They recognize the symptoms and the disease, but refuse to put any plan into action.\n\nNot everything has to conform to some ideal that ultimately relies on trusting humans to not act like mindless dicks. Well, welcome to humanity, a large portion of which are just mindless dicks.\n\nNeo-liberalism is fine in some contexts. In others, you know, like something that requires GLOBAL COOPERATION to mitigate a world-wide disaster or to at least lessen its effects, it's absolute garbage.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1481250891.0,
    "date_created": "2016-12-08",
    "time_created": "13:34:51",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxyueh",
    "parent_id": "t1_daxy47u",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "/r/shittyaskscience",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1481240385.0,
    "date_created": "2016-12-08",
    "time_created": "10:39:45",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day0jh5",
    "parent_id": "t1_daxzdbr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "/u/lokethedog is correct though /u/ramilehti is still semi-correct as well. CO2 levels did start noticeably rising towards the beginning of the Industrial Revolution but it really took off around 1950, coinciding with massive global population growth that began around 1950 and has continued through present day.\n\n[IPCC 2014 Report - it's a PDF just fyi](https://www.ipcc.ch/pdf/assessment-report/ar5/syr/AR5_SYR_FINAL_SPM.pdf) - page 3 has some useful figures to help visualize\n\n[http://www.esrl.noaa.gov/gmd/ccgg/trends/history.html](http://www.esrl.noaa.gov/gmd/ccgg/trends/history.html)",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1481242418.0,
    "date_created": "2016-12-08",
    "time_created": "11:13:38",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day8rzn",
    "parent_id": "t1_day8kvh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "From my scant research it seems to go one of two ways. \n\nGod or Aliens did this. \n\nor\n\nNASA and hundreds of thousands if not millions of people are lying to us. ",
    "controversiality": 0,
    "ups": 47,
    "downs": 0,
    "score": 47,
    "created": 1481251827.0,
    "date_created": "2016-12-08",
    "time_created": "13:50:27",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayeda8",
    "parent_id": "t1_day9xb0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> That doesn't even make sense\n\nShocking.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1481258218.0,
    "date_created": "2016-12-08",
    "time_created": "15:36:58",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day77ay",
    "parent_id": "t1_day5vmg",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Why is it not Theory of Acceleration then? What do they think Earth's velocity would be after all these years? What the fuck.\n\n",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1481250032.0,
    "date_created": "2016-12-08",
    "time_created": "13:20:32",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day0h7x",
    "parent_id": "t1_daxz2bi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's a mind bogglingly ignorant sub",
    "controversiality": 0,
    "ups": 65,
    "downs": 0,
    "score": 65,
    "created": 1481242349.0,
    "date_created": "2016-12-08",
    "time_created": "11:12:29",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day2hvn",
    "parent_id": "t1_daxz2bi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Wtf... I'll send any video camera those idiots will trust to the stratosphere with a weather ballon for free so they can see for themselves that it's a fucking sphere. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481244660.0,
    "date_created": "2016-12-08",
    "time_created": "11:51:00",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day2puc",
    "parent_id": "t1_daxz2bi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I want to fire all of those people into space just to see how they would argue with what would be right in front of their eyes",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481244910.0,
    "date_created": "2016-12-08",
    "time_created": "11:55:10",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day8bk4",
    "parent_id": "t1_day6y40",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I had a similar experience, though it was here on Reddit instead of Facebook. I had filtered out all of the political subs, but still made the occasional visit to /r/politics, which is more or less just a liberal echochamber. I tried stopping by the donald, but that's not really a good place to understand the conservative viewpoint, it's mostly nonesense. /r/conservative is a better place to get some of that side of the story. \n\nI don't really identify as democrat or republican, but I suppose it's fair to say my views lean more to the left. My main takeaway from this election cycle is that we all need to be more respectful to each other, we all need to have more empathy, and love is in need of love today.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1481251311.0,
    "date_created": "2016-12-08",
    "time_created": "13:41:51",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayda5z",
    "parent_id": "t1_day6y40",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I browse the donald but I also go on more liberal subs and sites too. Everybody on both sides simplifies the opposition, makes a strawman them, and then mocks them for having those strawman beliefs. Everyone here jerk ing themselves off about how much smarter they are than their opposition, who they don't truly know anything about, are just as blind as the \"uneducated rednecks\" that they are making fun of.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1481256970.0,
    "date_created": "2016-12-08",
    "time_created": "15:16:10",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzegu",
    "parent_id": "t1_daxx149",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yup. I can forgive stupidity a lot easier than greed ",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1481241071.0,
    "date_created": "2016-12-08",
    "time_created": "10:51:11",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxx4fw",
    "parent_id": "t1_daxwx3y",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Pruitt being older, I can understand why he wouldn't care since the repercussions likely won't affect him in his lifetime. It's a sadistic worldview but people have it. If it were any millennial though, it's going to affect you no matter who you are.",
    "controversiality": 0,
    "ups": 116,
    "downs": 0,
    "score": 116,
    "created": 1481238133.0,
    "date_created": "2016-12-08",
    "time_created": "10:02:13",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day2gke",
    "parent_id": "t1_daxz2qm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I would argue to some degree that is more specialization and doesn't mean the person would have a well rounded intellect.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481244618.0,
    "date_created": "2016-12-08",
    "time_created": "11:50:18",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day474s",
    "parent_id": "t1_day0ro0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "FUCKING RIGHT!? \n\nThat's my response to these people. \n\n>You really think the government pays better than the private sector? ",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1481246611.0,
    "date_created": "2016-12-08",
    "time_created": "12:23:31",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayc4fw",
    "parent_id": "t1_day0ro0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Oil and gas companies have funded research. I Know their studies have found global warming to be real but the ones that are spouted downplay the role of humans. \n\nAnd I guess researchers from around the globe got together and said lets put the oil and gas companies out of business?!?! You can't argue reason with those who argue on belief.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481255640.0,
    "date_created": "2016-12-08",
    "time_created": "14:54:00",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxywrd",
    "parent_id": "t1_daxysfe",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Well, I think I'd be more concerned if there was more of an even split between scientists regarding climate change. ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1481240470.0,
    "date_created": "2016-12-08",
    "time_created": "10:41:10",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day12lj",
    "parent_id": "t1_day0s81",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This seems totally self-evident to me as well.  Apparently this view isn't widely shared amongst the deniers.  Even if we're wrong about climate change, we've still done well to switch.  This is what injures my brain. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1481243022.0,
    "date_created": "2016-12-08",
    "time_created": "11:23:42",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daye6b5",
    "parent_id": "t1_daydqik",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'd probably lose my shit, then lose my mind. At least a job is replaceable.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1481257995.0,
    "date_created": "2016-12-08",
    "time_created": "15:33:15",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daygluc",
    "parent_id": "t1_dayet1s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 152,
    "downs": 0,
    "score": 152,
    "created": 1481260809.0,
    "date_created": "2016-12-08",
    "time_created": "16:20:09",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daykeja",
    "parent_id": "t1_dayet1s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's like... He's stupid, but he thinks he's smart.",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1481265410.0,
    "date_created": "2016-12-08",
    "time_created": "17:36:50",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayg3n7",
    "parent_id": "t1_dayet1s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's like you could hear the loser in him, even then.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1481260210.0,
    "date_created": "2016-12-08",
    "time_created": "16:10:10",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayf0pd",
    "parent_id": "t1_dayedry",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "My favorite: https://www.youtube.com/watch?v=P6MOnehCOUw",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1481258962.0,
    "date_created": "2016-12-08",
    "time_created": "15:49:22",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayq8a6",
    "parent_id": "t1_dayhjzl",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Thanks, O*splut*",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1481273296.0,
    "date_created": "2016-12-08",
    "time_created": "19:48:16",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayee5g",
    "parent_id": "t1_daybye3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is the webcomic that first brought the climate factor to my attention: http://yearsoflivingdangerously.tumblr.com/post/86898140738/this-comic-was-produced-in-partnership-by-years-of",
    "controversiality": 0,
    "ups": 204,
    "downs": 0,
    "score": 204,
    "created": 1481258246.0,
    "date_created": "2016-12-08",
    "time_created": "15:37:26",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayl7yk",
    "parent_id": "t1_daybye3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The comic another user posted is a great start. This is the scientific paper that draws the conclusions that anthropogenic climate change likely contributed to the mass migration we're seeing in Syria http://www.pnas.org/content/112/11/3241.full.\n\nKey points:\n\n* Syria underwent a severe drought in 2007-2010, which included its driest winter (2007/2008) in observed records\n* While multiyear droughts are common in Syrian history, this drought in particular was exacerbated by many things:\n * Disproportionately higher demand for resources\n * Population growth both in Syria and from Iraqi migrants fleeing the Iraq war (2002-2006)\n *These 2 factors combined to grow Syria’s population by over 50% in just 8 years*\n * Steep declines in groundwater supply, unable to be recharged by the low rainfall\n * Syria never fully recovered from its severe drought in the 1990s, and in fact was in moderate-severe drought from 1998-2009, with 7/11 years receiving rainfall below the century-long average\n * Poor government policies that emphasized upping agricultural production without regard to the above factors\n* Up to 1.5 million people were internally displaced by the drought, and the population migrated from farms to already overburdened cities\n* By 2010 internally displaced peoples and Iraqi refugees made up 20% of the urban population\nAssad’s government neglected the decaying, overcrowded, under-resourced urban centers, which developed unrest that escalated to the full out Syrian civil war\n* The authors found strong agreement between observations and climate model simulations in century-long trends in precipitation, temperature, and sea-level pressure. This added confidence to the conclusion that in this region, the anthropogenic precipitation signal has already begun to emerge from the natural “noise” and that the recent drought had a significant anthropogenic component. It also implies that model future projections of continued drying for Syria and the Fertile Crescent are reliable.\n\n\n[Here's another interesting article](http://www.theguardian.com/commentisfree/2015/aug/18/mass-migration-crisis-refugees-climate-change) that references the same paper but also discusses (through opinion) how areas that are being flooded with migrants now are likely to become migration zones themselves once heat/dryness reach them.",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1481266457.0,
    "date_created": "2016-12-08",
    "time_created": "17:54:17",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayik2c",
    "parent_id": "t1_daybye3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I wrote a paper on this for my anthro class. I don't get home for another 9 hours, but when I do I'll see if I can forward you some of my sources. Basically food shortages led to civil unrest led to many new problems and exacerbated existing problems.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1481263118.0,
    "date_created": "2016-12-08",
    "time_created": "16:58:38",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayccj8",
    "parent_id": "t1_daybye3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The general gist of it is that severe droughts in Syria caused a lot of civil unrest, migration, and food shortages. I don't have any links on hand, but that would be a good place to start. ",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1481255898.0,
    "date_created": "2016-12-08",
    "time_created": "14:58:18",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayjqmx",
    "parent_id": "t1_day8cf2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"Jim, I gotta tell ya: The way you leapt on the table in the middle of our budget meeeting, strenuously shat into your own hand and pegged Nancy in the mouth with feces really spoke to me.\"",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1481264565.0,
    "date_created": "2016-12-08",
    "time_created": "17:22:45",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day4312",
    "parent_id": "t1_day2ofm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's misunderstanding what scientific theories are and/or moving the goalposts. We can demonstrate\\*, without a shadow of a doubt, that evolution occurs in short timeframes for bacteria etc. but then these people hold that \"Well that might be true but you can't prove that humans were a result of evolution!\" which stops the argument because, in a literal sense, they're right that short of having access to a time machine it's an impossible claim to \"prove.\" \n\nBut proving things is not the point of scientific theories, the idea is \"Based on all the evidence (observed laws of nature etc.) this is the most likely explanation for how things happened, and we can use this explanation to predict future events.\"",
    "controversiality": 0,
    "ups": 204,
    "downs": 0,
    "score": 204,
    "created": 1481246480.0,
    "date_created": "2016-12-08",
    "time_created": "12:21:20",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day2y8n",
    "parent_id": "t1_day2g57",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I think I know what you're getting at, and imo, there isn't enough of a meaningful definition of species to answer your question in a manner that you'll find satisfying.\n\nWhen I was in school, I was taught that a species is made up of individuals who can reproduce and make fertile offspring. This definition works well enough for animals such as mammals, but when you get down to the level of bacteria, reproduction is usually asexual, but then DNA can be shared between individuals \"sexually,\" but that has been observed to occur between individuals in different genera, which is a level of classification higher than species. \n\nOnce we consider the fact that a \"species\" is more of a man made construct which is useful to us, and less of a natural one that organisms always adhere to, then the adaptation versus evolution distinction becomes less of an important argument. ",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1481245172.0,
    "date_created": "2016-12-08",
    "time_created": "11:59:32",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day3cc3",
    "parent_id": "t1_day2g57",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Isn't that really what Darwin's study of Galapagos finches was all about? He found, I think at least 5 new species of finch that were unique to the island. They were still closely comparable to finches found on mainland Chile, but unique in their adaptation to the closed environment of Galapagos - to the point of speciation.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481245626.0,
    "date_created": "2016-12-08",
    "time_created": "12:07:06",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day7zug",
    "parent_id": "t1_day0ega",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Oh America... ",
    "controversiality": 0,
    "ups": 99,
    "downs": 0,
    "score": 99,
    "created": 1481250940.0,
    "date_created": "2016-12-08",
    "time_created": "13:35:40",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day6m1u",
    "parent_id": "t1_day2tyw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Hi, Everybody! ",
    "controversiality": 0,
    "ups": 114,
    "downs": 0,
    "score": 114,
    "created": 1481249359.0,
    "date_created": "2016-12-08",
    "time_created": "13:09:19",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayhfw6",
    "parent_id": "t1_day2tyw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"Inflammable means flammable? What a country!\"",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481261793.0,
    "date_created": "2016-12-08",
    "time_created": "16:36:33",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day3we9",
    "parent_id": "t1_day202h",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "His medical degree may be imaginary, but he did graduate from Trump University, so he's got that going for him. ",
    "controversiality": 0,
    "ups": 60,
    "downs": 0,
    "score": 60,
    "created": 1481246266.0,
    "date_created": "2016-12-08",
    "time_created": "12:17:46",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day9u1x",
    "parent_id": "t1_day202h",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I have a Theoretical Degree in Physics.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1481253026.0,
    "date_created": "2016-12-08",
    "time_created": "14:10:26",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day90xr",
    "parent_id": "t1_day202h",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And now that CEO of that insurance company will be Trump's new Surgeon General.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481252105.0,
    "date_created": "2016-12-08",
    "time_created": "13:55:05",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1d2q",
    "parent_id": "t1_day0j88",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Terrific and terrible come from the same root word!",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1481243357.0,
    "date_created": "2016-12-08",
    "time_created": "11:29:17",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1eam",
    "parent_id": "t1_day0j88",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "If you think about how the base of horrific is horror, then the base of terrific must be terror.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1481243396.0,
    "date_created": "2016-12-08",
    "time_created": "11:29:56",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day4f2l",
    "parent_id": "t1_day12oe",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "How dare you say the \"e\" word! Climate doesn't evolve! If climate evolved from weather, then why is there still weather?\n",
    "controversiality": 0,
    "ups": 62,
    "downs": 0,
    "score": 62,
    "created": 1481246862.0,
    "date_created": "2016-12-08",
    "time_created": "12:27:42",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day3q6c",
    "parent_id": "t1_day12oe",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Your cancer is part of God's plan.  No soup for you.",
    "controversiality": 0,
    "ups": 126,
    "downs": 0,
    "score": 126,
    "created": 1481246067.0,
    "date_created": "2016-12-08",
    "time_created": "12:14:27",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day2dtf",
    "parent_id": "t1_daxzghc",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Now that I think about it, it makes perfect sense. The left is, in general, wary of big corporations. So they fear big pharma and big agro, and dislike the tools they use to make money like vaccines and GMOs. The right is, in general, wary of big government, and doesn't trust programs that give control over citizens like carbon taxes and environmental initiatives.\n\nI'm sure a lot of you are thinking \"No shit, this is obvious\" but it just occurred to me.",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1481244530.0,
    "date_created": "2016-12-08",
    "time_created": "11:48:50",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day4xf4",
    "parent_id": "t1_daxycir",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Farmer of 10,000 acres in Oregon here.  If you want less herbicides on your food eat GMO.  About a third of what we farm is GMO, the other 2/3 are conventional (non GMO, non organic).  We spray the conventional stuff 2-3 times as much as the GMO.  \n\nIf you REALLY want spray, then buy organic.  I know a raspberry grower who has some organic crops and he says they have to spray it over 10 times a year (as opposed to 2-3 times) because the sprays aren't as potent.  ",
    "controversiality": 0,
    "ups": 45,
    "downs": 0,
    "score": 45,
    "created": 1481247439.0,
    "date_created": "2016-12-08",
    "time_created": "12:37:19",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day2rh1",
    "parent_id": "t1_daxycir",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yes, this is important. I'm glad you realised this. It's really serious stuff but few people realise so destructive practices are fucking everything over. \n\n> http://www.scientificamerican.com/article/only-60-years-of-farming-left-if-soil-degradation-continues/\n\n60 harvests left on average, with current techniques. It's a big issue, yet no one's heard of it. 90% of American corn,  94% Soybeans are GM at the moment, yet there is no uproar, because a) it doesn't actually hurt us,  b) people don't know. \n(https://en.m.wikipedia.org/wiki/Genetically_modified_food) Source [43]\n\nIs rather take GM crops over those produced with excessive pesticide and fertiliser, that shit does so much damage to the environment. It's entirely responsible for the dead zones that surround every continent. ",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1481244961.0,
    "date_created": "2016-12-08",
    "time_created": "11:56:01",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day3yh6",
    "parent_id": "t1_daxycir",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "There is an awesome video by a once anti-GMO activist who is now pro-GMO that really helped me alter my perceptions. Prior to the video I was unsure either way. The anti-GMO groups argument I couldn't refute because there was *maybe* a *chance* (insert bad thing here) might happen. And I'm not a biologist so I don't understand biology extremely well beyond some basic college level science course and whatever was done in K-12 (i.e. I understand basic genetics and how gene splicing is done, but not what happens in future generations for example). But I wasn't completely against them either and if I bought them I didn't have an issue with it. \n\nThen I saw [Mark Lynas](https://www.youtube.com/watch?v=vf86QYf4Suo) talk about why he changed his mind from being anti-GMO and go, \"I never thought of that... but this guy makes some very compelling arguments that I find myself agreeing with.\" It's a long video, but it's very good in the delivery.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1481246333.0,
    "date_created": "2016-12-08",
    "time_created": "12:18:53",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day6es1",
    "parent_id": "t1_daxycir",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I just finished up a course in college about native plants and sustainability and the professor had firsthand experience working with GMOs and even had a short 2 year tenure working for Monsanto. \n\nHe wanted to drive home the point that \"It's not the product that's bad, it's the process by which it's done.\" And it makes a lot of sense with how unsustainable current agriculture practices are.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481249131.0,
    "date_created": "2016-12-08",
    "time_created": "13:05:31",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day05xz",
    "parent_id": "t1_daxy5e6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> \"we dont know what gene manipulation will ultimately do to the produce\"\n\nNot trying to be argumentative, but do they know exactly what will happen in the GMO after the gene splicing? I thought there was still some mystery as to which sequences code for which mechanisms and such. A source too would be great as I'd love to read more about it! ",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1481241994.0,
    "date_created": "2016-12-08",
    "time_created": "11:06:34",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayi65p",
    "parent_id": "t1_daxy5e6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> \"GMO can cause cancer\"\n\nThe thing is, GMOs could cause cancer.  GMOs could produce horrible toxins as well.  GMOs could be the end of life as we know it.\n\nThat is just the thing...GMO means \"Genetically Modified Organism\".  They can be modified to do anything.  \n\nThe ones they are usually referring to absolutely don't cause cancer.  The are modified to be resistant to disease, or produce larger yields.  The genes that were modified are known...they have been tested...there is nothing dangerous about them.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481262658.0,
    "date_created": "2016-12-08",
    "time_created": "16:50:58",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxvh0",
    "parent_id": "t1_daxxs1k",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Climate Molestation",
    "controversiality": 0,
    "ups": 3803,
    "downs": 0,
    "score": 3803,
    "created": 1481239149.0,
    "date_created": "2016-12-08",
    "time_created": "10:19:09",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxx6d",
    "parent_id": "t1_daxxs1k",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The thing is they don't deny air quality. Every policy that increases air quality is in keeping with climate change. You can't deny millions of people dying and suffering from breathing problems even if you do wear a tin hat.",
    "controversiality": 0,
    "ups": 151,
    "downs": 0,
    "score": 151,
    "created": 1481239210.0,
    "date_created": "2016-12-08",
    "time_created": "10:20:10",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxy40l",
    "parent_id": "t1_daxxs1k",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Climate Terrorism\n\nThat's should get their heads spinning.",
    "controversiality": 0,
    "ups": 176,
    "downs": 0,
    "score": 176,
    "created": 1481239451.0,
    "date_created": "2016-12-08",
    "time_created": "10:24:11",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxyifo",
    "parent_id": "t1_daxxs1k",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "We have one: anthropogenic (man made) climate change.  \n  \nhowever, anthropogenic is wayyy too fucking smart sounding to resist anti-intellectual attack.  And there, exactly, is the problem we have getting people on board to reduce emissions.  Make it simple and no one thinks its serious.  Make it smart and it gets attacked for being elitist or contrived.",
    "controversiality": 0,
    "ups": 104,
    "downs": 0,
    "score": 104,
    "created": 1481239963.0,
    "date_created": "2016-12-08",
    "time_created": "10:32:43",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxycst",
    "parent_id": "t1_daxxs1k",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The term is *Anthropogenic climate change*. ",
    "controversiality": 0,
    "ups": 71,
    "downs": 0,
    "score": 71,
    "created": 1481239763.0,
    "date_created": "2016-12-08",
    "time_created": "10:29:23",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxy7b",
    "parent_id": "t1_daxxs1k",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Climate fuckery?",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1481239247.0,
    "date_created": "2016-12-08",
    "time_created": "10:20:47",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxv6g",
    "parent_id": "t1_daxxs1k",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Human Driven Environmental Changes?",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1481239139.0,
    "date_created": "2016-12-08",
    "time_created": "10:18:59",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxxgo",
    "parent_id": "t1_daxxs1k",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "global weirding, because shits about to get weird.",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1481239220.0,
    "date_created": "2016-12-08",
    "time_created": "10:20:20",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxy2p3",
    "parent_id": "t1_daxxuh2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Oh god, my dad basically said this the other day. It's a shame too, because he's a smart person, just brainwashed in certain areas.\n\nEdit: My god, the irony of some of these responses....",
    "controversiality": 0,
    "ups": 586,
    "downs": 0,
    "score": 586,
    "created": 1481239404.0,
    "date_created": "2016-12-08",
    "time_created": "10:23:24",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxy69w",
    "parent_id": "t1_daxxuh2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Average global temperatures are rising so global warming is exactly right.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1481239530.0,
    "date_created": "2016-12-08",
    "time_created": "10:25:30",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzc2g",
    "parent_id": "t1_daxxuh2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That big liberal propaganda! Making them scientist rich! All them scientists cruising in their million-dollar Tesla's!",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481240990.0,
    "date_created": "2016-12-08",
    "time_created": "10:49:50",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxy6gw",
    "parent_id": "t1_daxxx4e",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Climate Same Sex Marriage Abortion Change",
    "controversiality": 0,
    "ups": 159,
    "downs": 0,
    "score": 159,
    "created": 1481239537.0,
    "date_created": "2016-12-08",
    "time_created": "10:25:37",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxy5dv",
    "parent_id": "t1_daxxx4e",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yup. Then they will REALLY be against it. ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1481239500.0,
    "date_created": "2016-12-08",
    "time_created": "10:25:00",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxztrz",
    "parent_id": "t1_daxyg9g",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Its still an accurate description, people just don't interpret it correctly. They key word is \"global\". The world as a whole is warming, just maybe not whatever random location you happen to throw a dart at",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1481241588.0,
    "date_created": "2016-12-08",
    "time_created": "10:59:48",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1f9x",
    "parent_id": "t1_daxy0hi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It only means harsher winters in some regions. Worldwide, average winter temperatures are rising. \n\nHowever, two of the areas most likely to get harsher winters are Eastern North America (due to changes in the jet stream from Arctic ice melting) and Western Europe (due to the possibility that the Gulf Stream could slow/shut down from melting Arctic ice), so it gets a fair bit of attention just by virtue of the fact that a huge percentage of journalists (and redditors) worldwide live in one of those two regions.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1481243428.0,
    "date_created": "2016-12-08",
    "time_created": "11:30:28",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day6eqz",
    "parent_id": "t1_daxy0hi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It doesn't *really* mean harsher winters, but keep in mind they local climates are the result of a lot of factors that are influenced in pretty chaotic ways. England is further north than Minnesota but has far warmer winters due to stuff like the Gulf current. Global warming means that might change the current, which means that England might start facing harsher winters if the current weakens--or more moderate winters if the current improves.\n\nBasically, the climate is complicated, so local trends can be very different--but we can look from a more global view.  \n\nSaying that global warming doesn't exist cause it's getting colder is like saying that the titanic isn't sinking because you happen to be on the part of the ship that is getting raised into the air.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481249130.0,
    "date_created": "2016-12-08",
    "time_created": "13:05:30",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxyt54",
    "parent_id": "t1_daxxrfp",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "exactly.  here in ohio, theres snow falling on trees that havent even dropped their leaves.  things are just... not right",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1481240341.0,
    "date_created": "2016-12-08",
    "time_created": "10:39:01",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day2kbs",
    "parent_id": "t1_daxzfwk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "My end of this boat just went up. We're not sinking!!",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481244739.0,
    "date_created": "2016-12-08",
    "time_created": "11:52:19",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day2sbb",
    "parent_id": "t1_daxzfwk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "If humans are roughly 60% water, that means there's about 78 billion gallons of water out there that we haven't been able to extract. The water's there, people! ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481244986.0,
    "date_created": "2016-12-08",
    "time_created": "11:56:26",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxy0pc",
    "parent_id": "t1_daxxy4d",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You're talking to mostly white guys tho, so this one won't work.\n",
    "controversiality": 0,
    "ups": 147,
    "downs": 0,
    "score": 147,
    "created": 1481239335.0,
    "date_created": "2016-12-08",
    "time_created": "10:22:15",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxzk2",
    "parent_id": "t1_daxxjxy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "o.0 you're right!\n\n\nHOW DEEP DOES THIS GO?",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1481239296.0,
    "date_created": "2016-12-08",
    "time_created": "10:21:36",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzn4j",
    "parent_id": "t1_daxxmw6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Great argument! Can't wait to use it (:",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481241361.0,
    "date_created": "2016-12-08",
    "time_created": "10:56:01",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxyzjv",
    "parent_id": "t1_daxxj0i",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm from Chicago, there has been a blizzard on January 28th every single year since I was born.  ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1481240566.0,
    "date_created": "2016-12-08",
    "time_created": "10:42:46",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzecz",
    "parent_id": "t1_daxzdh4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "dammit all to hell",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481241068.0,
    "date_created": "2016-12-08",
    "time_created": "10:51:08",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1xnw",
    "parent_id": "t1_daxyvao",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And the on-CD DRM has utterly stopped pirating.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1481244017.0,
    "date_created": "2016-12-08",
    "time_created": "11:40:17",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day5bqz",
    "parent_id": "t1_day062t",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Probably a part-time intern who skims the emails and decides which (pre-written) response is most relevant",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1481247894.0,
    "date_created": "2016-12-08",
    "time_created": "12:44:54",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day7yb6",
    "parent_id": "t1_day062t",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "some intern saw it, cataloged the word science and went through the prewritten responses, found nothing, sent that.\n\nCall their state office. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1481250892.0,
    "date_created": "2016-12-08",
    "time_created": "13:34:52",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzbvp",
    "parent_id": "t1_daxz0ey",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Because fusion is the perfect energy solution.  If we can get it working properly, it will generate clean energy with no carbon footprint  using only saltwater as a resource. ",
    "controversiality": 0,
    "ups": 170,
    "downs": 0,
    "score": 170,
    "created": 1481240984.0,
    "date_created": "2016-12-08",
    "time_created": "10:49:44",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzbd4",
    "parent_id": "t1_daxz0ey",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Because it makes a metric buttload with something that covers 70% of the earth",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1481240966.0,
    "date_created": "2016-12-08",
    "time_created": "10:49:26",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzlk1",
    "parent_id": "t1_daxz0ey",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Not an expert but here's my understanding:\n\nRenewables are fantastic, but each one has a limitation on its usefulness as a primary power source- namely, that weather conditions and geography can make them not capable of generating enough power 24/7. That's what fossil fuels are great for - consistent 24/7 power generation.\n\nNuclear power is an alternative for that \"baseload\" power generation without constant CO2 emissions. Fission is pretty good but there are concerns about radioactive waste and accidents like Chernobyl. Fusion has the same benefits, but does not have the same drawbacks. The worst fusion byproducts have half-lives of years and decades instead of centuries and millenia, and \"melting down\" is not possible. Plus, fusion fuel can be extracted from seawater, and estimates have that supply being good for millions, if not billions, of years.\n\nThe problem is that the process of fusion is really hard to sustain. We need more research funding to solve it, but governments have been loathe to commit any more than token resources.    \n\nEdit: Minor clarification",
    "controversiality": 0,
    "ups": 98,
    "downs": 0,
    "score": 98,
    "created": 1481241310.0,
    "date_created": "2016-12-08",
    "time_created": "10:55:10",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day06n2",
    "parent_id": "t1_daxz0ey",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Way the fuck more energy production for the same amount of space, and constant production rate, and no environmental effects. Solar is great, but you need a huge land area, and it only works in the day so you need huge battery packs which aren't exactly the cleanest thing to produce (still many, MANY times better than any fossil fuel though). Wind also needs a lot of space, and some people think turbines are ugly (those people are probably uglier, but whatever), and can't produce in the volumes necessary. Hydro only works in certain areas, and can fuck up waterways and displace populations. Nuclear fission has dangerous longlasting byproducts.",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1481242018.0,
    "date_created": "2016-12-08",
    "time_created": "11:06:58",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day17xc",
    "parent_id": "t1_daxz0ey",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The others have covered it well, but the key points are thus: \n\nFusion provides a reliable, compact, and highly efficient energy process - comparable to the efficiency of fission (aka \"nuclear\" though both processes are technically nuclear reactions) power. The resources are among the most abundant in the universe, depending on what method/design of fusion you use. As humanity expands off of Earth, it's by far the most effective way to power our civilization (in conjunction with storage and solar, which is just a sneaky way to collect the sun's fusion output). On Earth, it means an end to the use of fossil fuels and a permanent, indefinite power source to remediate our environment - most of the blockages in reversing climate change founder on the high energy costs of pulling CO2 out of the air, which winds up creating more CO2. The value is just too huge to pass up. \n\nOn the other hand, the technology is not yet economical. We've been chasing reactor efficiencies and plasma designs for decades on the scraps of money that governments provide for this research. If we invested in fusion with the same determination as we've expended ignoring climate change or destabilizing inconvenient dictators overseas, we'd be well on our way to a Diamond Age of plenty by now. But hey, I guess people have other priorities than that.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481243193.0,
    "date_created": "2016-12-08",
    "time_created": "11:26:33",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day4eta",
    "parent_id": "t1_day34id",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Those sectors are on a clock though. Blame the industry leaders for blind lack of planning in favor of greed than the environmentally proactive policy makers trying to improve the country (and world).",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1481246853.0,
    "date_created": "2016-12-08",
    "time_created": "12:27:33",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day127t",
    "parent_id": "t1_day0ort",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah well they don't stick with me. Call a spade a spade. It's why I don't use \"pro life\" I always use \"anti-choice\". If they get to label left wing movements/rights in a negative tone then they should get the exact same treatment. ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1481243010.0,
    "date_created": "2016-12-08",
    "time_created": "11:23:30",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day12nd",
    "parent_id": "t1_day0ort",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Don't forget women's rights = feminazis! That one has had surprising staying power. ",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1481243024.0,
    "date_created": "2016-12-08",
    "time_created": "11:23:44",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day9rzp",
    "parent_id": "t1_day7yaw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "My problem with libertarianism is that the philosophy can be a good general approach to governance, but there are some very clear places where the opposite approach is more likely to work, and they all happen in well understood cases of either tragedy of the commons (global warming, overfishing, water rights) or severely asymmetrical information / irrational individuals (drug safety, food safety, insurance, etc.) Unsurprisingly these are also all things that governments tend to regulate heavily.\n\nIn \"tragedy of the commons\" cases, you literally have game theory predicting that individuals will make exactly the wrong decision, therefore implying that you need some bigger body out there to keep individuals from killing themselves.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1481252960.0,
    "date_created": "2016-12-08",
    "time_created": "14:09:20",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzen1",
    "parent_id": "t1_daxyueh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You laugh, but even perennial plants  have a life expectancy.  While \"senile\" would not be the word to describe it. A plants growth cycle becomes more unstable as it gets older as it's phytohormone system gets wacky. An effect of this is a plant might start developing an unpredictable growth cycle which will probably lead to its death.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1481241077.0,
    "date_created": "2016-12-08",
    "time_created": "10:51:17",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day9i4t",
    "parent_id": "t1_day8rzn",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Every space agency across the world is lying, even those countries that don't have a favorable relationship with the US. **THAT** makes a lot of sense. *smh*",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1481252650.0,
    "date_created": "2016-12-08",
    "time_created": "14:04:10",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1i8u",
    "parent_id": "t1_day0h7x",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Ignorant is the wrong word.   Clearly there are people on that sub, including the mod, who have done a lot of research. Somehow they've just only believed arguments which support a geocentric, flat, stationary-earth viewpoint. With aether. \n\nI don't know the right term, but \"ignorant\" is not it. ",
    "controversiality": 0,
    "ups": 86,
    "downs": 0,
    "score": 86,
    "created": 1481243522.0,
    "date_created": "2016-12-08",
    "time_created": "11:32:02",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day5acw",
    "parent_id": "t1_day2puc",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Very soon, they will be proven wrong by commercial space flight. Sadly, the climate deniers will be proven wrong soon, as well. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481247850.0,
    "date_created": "2016-12-08",
    "time_created": "12:44:10",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxyvvh",
    "parent_id": "t1_daxx4fw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Ah the Brexit approach. \"We'll be dead before the repercussions come about.\"",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1481240437.0,
    "date_created": "2016-12-08",
    "time_created": "10:40:37",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxaj7",
    "parent_id": "t1_daxx4fw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm not saying this is why we need assassins.\n\nLeague Of Shadows ftw",
    "controversiality": 0,
    "ups": 54,
    "downs": 0,
    "score": 54,
    "created": 1481238369.0,
    "date_created": "2016-12-08",
    "time_created": "10:06:09",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayyecg",
    "parent_id": "t1_daygluc",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Clearly the Wright brothers should have been able to fly their first airplane to the moon.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1481284410.0,
    "date_created": "2016-12-08",
    "time_created": "22:53:30",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayhnmj",
    "parent_id": "t1_dayee5g",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I think people don't realize how this same, actually quite simple dynamic is taking place in the US midwest and California as we speak.",
    "controversiality": 0,
    "ups": 85,
    "downs": 0,
    "score": 85,
    "created": 1481262051.0,
    "date_created": "2016-12-08",
    "time_created": "16:40:51",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayknct",
    "parent_id": "t1_dayee5g",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Years of Living Dangerously creates a good story to fit their narrative. While climate change may have contributed to or amplified some of the factors causing the current violence in Syria, the story told by Years  writes off the brutal track record of the Assad regime, increasing Sunni vs Shia population (Assad is Shia), high unemployment and limited opportunity (especially for sunni's), the Arab spring, and an immense backlash to an attempted government crackdown. Could climate change have been a contributing factor? Certainly...especially when it comes to employment since agriculture is a fairly large industry in the country. It's just silly to point to Syria and scream climate change when there are more factors involved. Add it to the list, but don't try market it as the silver bullet root cause to explain violence in syria.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1481265723.0,
    "date_created": "2016-12-08",
    "time_created": "17:42:03",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daychru",
    "parent_id": "t1_dayccj8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Thanks! I'm gonna do some research.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1481256061.0,
    "date_created": "2016-12-08",
    "time_created": "15:01:01",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayebb3",
    "parent_id": "t1_dayccj8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "woulda helped if Assad wasn't a complete dick tho",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1481258154.0,
    "date_created": "2016-12-08",
    "time_created": "15:35:54",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day4lnv",
    "parent_id": "t1_day4312",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "There's been natural evolution proven in fish, but because they didn't look too different from each other (the two seperate species) my aunt and her people's view was 'it's not really the same thing as evolution.' You're absolutely right about moving the goal posts. I don't engage with anything with her anymore because dinosaur bones one time were a hoax and later were real but that's because dinosaurs roamed the Earth at the same time that humans did. She literally has no explanation for how light can travel from stars for millions of years to get here but the Earth is only 6000 years old. Best explanation was that time was just different in the beginning which allows for things we can't explain.\n\nThe said part is, she's actually pretty smart. She's just brainwashed. She was a very bad kid, she was dealing drugs from 13-14. One day there was some event that my family doesn't really tell anyone that happened but they say she changed then. She eventually married some overly controlling dude who is also extremely intelligent but he's the one who got her into this. He's actually a professor at a university. I eventually stopped talking to her when I was getting multiple Facebook posts every day about hating gays when she knows we have openly gay family members. ",
    "controversiality": 0,
    "ups": 88,
    "downs": 0,
    "score": 88,
    "created": 1481247069.0,
    "date_created": "2016-12-08",
    "time_created": "12:31:09",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day4rv1",
    "parent_id": "t1_day4312",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Wasn't there a post on Reddit the other day saying that women are having a harder time with natural childbirth due to all the c-sections we've performed the last few generations? Wouldn't that be proof of human evolution in a short time frame?",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1481247265.0,
    "date_created": "2016-12-08",
    "time_created": "12:34:25",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day83xu",
    "parent_id": "t1_day6m1u",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "HI DR NIICK!! ",
    "controversiality": 0,
    "ups": 57,
    "downs": 0,
    "score": 57,
    "created": 1481251070.0,
    "date_created": "2016-12-08",
    "time_created": "13:37:50",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day27qb",
    "parent_id": "t1_day1d2q",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Closer in form to terrifying though. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1481244336.0,
    "date_created": "2016-12-08",
    "time_created": "11:45:36",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day74ds",
    "parent_id": "t1_day3q6c",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> Your cancer is part of God's plan.\n\nMonotheists with horrible illnesses have to reconcile that all the time. I can't imagine the cognitive dissonance and partitioning that requires.  \n\n\"God doesn't give us anything we can't handle.\"  \n \nClearly people aren't handling cancer and massive tsunamis well enough.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1481249940.0,
    "date_created": "2016-12-08",
    "time_created": "13:19:00",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day2tb9",
    "parent_id": "t1_day2dtf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "FWIW, I silo the vaccine thing into a whole different category.  Childhood vaccines aren't really a huge profit center for big pharma as far as I know.\n\nThose people are literally just nuts.  The dissenting research is thoroughly discredited, and everyone who doesn't accept that is buying into some sort of conspiracy theory on why it is discredited.\n\nAnd while it often has an association with the left via hippie folk and hollywood liberals...the only big anti-vax person on my facebook feed is a proclaimed \"libertarian\" and trump supporter.  I think a lot of the anti-vax sentiment comes across in the form of \"don't let the government tell us what to do with our children\" which is much more of a right-wing sentiment.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1481245018.0,
    "date_created": "2016-12-08",
    "time_created": "11:56:58",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day56rs",
    "parent_id": "t1_day2rh1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Can confirm.  I farm over 10,000 acres in Oregon and we use 2-3 times as much spray on the conventional fields as we do on the GMO fields.  \n\nChina's ban on GMO crops is the biggest thing preventing us from rolling out more GMO crops, and subsequently using a lot less spray.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1481247736.0,
    "date_created": "2016-12-08",
    "time_created": "12:42:16",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day63g2",
    "parent_id": "t1_day2rh1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's a good thing that GM crops are actually better for the soil as well in a direct manner, especially when compared to organic farming. See the following: http://www.wssajournals.org/doi/abs/10.1614/WT-08-038.1?code=wssa-site",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1481248773.0,
    "date_created": "2016-12-08",
    "time_created": "12:59:33",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day0gvf",
    "parent_id": "t1_day05xz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The short answer is that it depends on exactly what you are doing... The long answer depends on which situation, the biology of that, the pharmacological studies in animals and humans following its use, and follow up studies....",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1481242339.0,
    "date_created": "2016-12-08",
    "time_created": "11:12:19",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxy9w0",
    "parent_id": "t1_daxxvh0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"Show me where humanity touched you, it's okay - you're not in trouble.\"",
    "controversiality": 0,
    "ups": 1226,
    "downs": 0,
    "score": 1226,
    "created": 1481239658.0,
    "date_created": "2016-12-08",
    "time_created": "10:27:38",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxxxhq",
    "parent_id": "t1_daxxvh0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Perfect",
    "controversiality": 0,
    "ups": 82,
    "downs": 0,
    "score": 82,
    "created": 1481239221.0,
    "date_created": "2016-12-08",
    "time_created": "10:20:21",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxy2s2",
    "parent_id": "t1_daxxvh0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "#**SOLAR** **ARMAGEDDON!11!!!1**",
    "controversiality": 0,
    "ups": 47,
    "downs": 0,
    "score": 47,
    "created": 1481239407.0,
    "date_created": "2016-12-08",
    "time_created": "10:23:27",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxytas",
    "parent_id": "t1_daxxvh0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Grabbing the climate by the pussy ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481240347.0,
    "date_created": "2016-12-08",
    "time_created": "10:39:07",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxyhg2",
    "parent_id": "t1_daxxx6d",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is the angle I take when talking to a climate change denier. I talk about smog in Los Angeles, oil spills, and chemical pollution because its all in front of their face and tangible. Even the religious tend to accept this argument because it still fits in with their world view.",
    "controversiality": 0,
    "ups": 109,
    "downs": 0,
    "score": 109,
    "created": 1481239928.0,
    "date_created": "2016-12-08",
    "time_created": "10:32:08",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxyvjz",
    "parent_id": "t1_daxxx6d",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I agree, denying it at this point is frighteningly uneducated. Years ago I was attending an ASE Certification preparation class, this one in particular was for Air Conditioning and Electrical Configuration. If you're familiar with how the process came about to create artificial cooling, then you probably know initially we (as in man) weren't concerned with what gases we let escape out of equipment. My instructor called it Atmospheric Intrusion, we let shit that damaged the atmosphere freely dissipate. I always liked that description because it's a blanket statement that can also be specific, depending on what type of occurrence you're describing. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481240425.0,
    "date_created": "2016-12-08",
    "time_created": "10:40:25",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day0xw8",
    "parent_id": "t1_daxy40l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "War on Terra",
    "controversiality": 0,
    "ups": 189,
    "downs": 0,
    "score": 189,
    "created": 1481242874.0,
    "date_created": "2016-12-08",
    "time_created": "11:21:14",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzntx",
    "parent_id": "t1_daxyifo",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Hence my statement about something that is marketable. ",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1481241385.0,
    "date_created": "2016-12-08",
    "time_created": "10:56:25",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxynyj",
    "parent_id": "t1_daxycst",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Exactly.  anthropogenic means human caused.\n\nAnd it's clear in [this graph](https://www.esr.org/outreach/climate_change/mans_impact/co2_temp.jpg) of atmospheric CO2 concentrations..  It started once mankind started burning fossil fuels in a systematic way to power industry.  And, thanks to trapped air bubbles in ice cores, we can actually [go back 800,000 years](http://assets.climatecentral.org/images/made/5_2_13_news_andrew_co2800000yrs_1050_591_s_c1_c_c.jpg).  The concentration of CO2 was fairly steady until we started burning fossil fuels.  ",
    "controversiality": 0,
    "ups": 74,
    "downs": 0,
    "score": 74,
    "created": 1481240159.0,
    "date_created": "2016-12-08",
    "time_created": "10:35:59",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxy7fn",
    "parent_id": "t1_daxy2p3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That was a direct quote/tweet from our president elect Donald J Trump if I remember correctly. ",
    "controversiality": 0,
    "ups": 87,
    "downs": 0,
    "score": 87,
    "created": 1481239572.0,
    "date_created": "2016-12-08",
    "time_created": "10:26:12",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxyiux",
    "parent_id": "t1_daxy2p3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "My uncle is a fucking engineer and one of the smartest people I know. I had to  pull him up graph after graph to show him how the current warming and changing Co2 ppm is more than double what the historical swings were in the past. Showed him projections based on natural Co2 swings and man made Co2 and how it only matches up when you account for both. \n\nHe just said \" That's a lot of good info, and I'll have to take some time to think on it. I just find it hard to reconcile with what we've been seeing; there have been much hotter years in the 1800s\"\n\nMe:\"uh... What... No\"  and then I had to Google and show him that 2011 was the hottest year on record and then 14 was hotter than 11 and 15 hotter than 14 and how 16 is now the hottest year on record. \n\nGod damn conservative radio, they have no accountability and they'll make shit up that they know their audience will eat up. ",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1481239978.0,
    "date_created": "2016-12-08",
    "time_created": "10:32:58",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day0eum",
    "parent_id": "t1_daxy6gw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "If you can work \"radical\" and \"terrorism\" into that somehow, we've got a winner.",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1481242278.0,
    "date_created": "2016-12-08",
    "time_created": "11:11:18",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxyup7",
    "parent_id": "t1_daxxzk2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's turtles all the way down.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1481240395.0,
    "date_created": "2016-12-08",
    "time_created": "10:39:55",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1cc6",
    "parent_id": "t1_daxzn4j",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Dogs are an example of artificial selection over a period of years. Humans are an example of natural selection over a period of millennia.\n\n>I wonder if the people who actually say that also have a good rebuttal for why we still have wolves and dogs.\n\nGood luck using this argument. If a theist doesn't believe in evolution, this isn't how you're going to convince them. But you can and should certainly try--who knows, maybe you'll have this argument for somebody who was more on the fence than anybody knew.\n\nBut if you've ever heard of Christian Apologetics, then you should know there are books written whose purpose is to rationalize how \"macroevolution\" is bullshit, and those are the sources that many theists are most likely to seek out when their beliefs are challenged.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1481243333.0,
    "date_created": "2016-12-08",
    "time_created": "11:28:53",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daybr5n",
    "parent_id": "t1_day1xnw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Glorious rootkit master race",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481255221.0,
    "date_created": "2016-12-08",
    "time_created": "14:47:01",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxztyy",
    "parent_id": "t1_daxzbvp",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "What happens when we run out of saltwater? *What then?*",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1481241595.0,
    "date_created": "2016-12-08",
    "time_created": "10:59:55",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day3uso",
    "parent_id": "t1_daxzlk1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You're pretty close.  I'm not an expert, but there's a couple points your a little off on.\n\n> The worst fusion byproducts have half-lives of years and decades instead of centuries and millenia, and \"melting down\" is not possible.\n\nMy understanding is that radioactive byproducts of fusion are basically negligible.  In other words, it just doesn't produce enough byproduct to even really worry about, it's not like there's enough of it for us to collect, just a few atoms whizzing around.\n\n> The problem is that the process of fusion is really hard to sustain.\n\nThis is the bigger error.  It's not so much that it's hard to sustain, it's that it's hard to sustain the reaction without putting in more energy than you're getting out.  That's basically why we're stuck right now.  We can create fusion reactions, and they do produce energy, but the energy it costs us to sustain that reaction is more than we're getting out.  The popular tokomak model works by using electromagnetic fields to sustain plasma, but it's under such high pressure that we spend more energy maintaining the field than we can harvest.\n\nThat's why cold fusion was such a big deal back in the 70s.  If cold fusion was possible (i.e. we didn't have to keep the plasma at like 115 million degrees C), we would have a net positive on energy generation.  That's pretty much been debunked though.  So at this point, we either need to find a way to reduce the energy we have to feed in (achieve fusion at lower temperatures and/or lower pressure), or we need to increase our ability to harvest energy from the reaction.  There was an experiment with using lasers to start the reaction, and the energy absorbed by the fuel was less than the energy harvested from the reaction, but the fuel only absorbed a tiny bit of the total energy the laser put out.  If they could make the fuel absorb a higher percentage of the energy the laser was putting out, it could theoretically result in net positive energy generation.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1481246214.0,
    "date_created": "2016-12-08",
    "time_created": "12:16:54",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day14nz",
    "parent_id": "t1_day12nd",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Idk how I could forget! Also being liberal in general = SJW",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1481243089.0,
    "date_created": "2016-12-08",
    "time_created": "11:24:49",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daybaab",
    "parent_id": "t1_day9i4t",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Dont forget every single commercial airline pilot... Every astronaut, every NASA scientist, every person affiliated with satellite design and manufacture, Elon Musk. \n\nThe idea that someone completely made up all of the math is another fascinating one. Like someone would have had to spend the time to very meticulously invent astrophysics. ",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1481254683.0,
    "date_created": "2016-12-08",
    "time_created": "14:38:03",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day23e5",
    "parent_id": "t1_day1i8u",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I can't figure out what their explanation for the edge of the flat earth is. As far as I can tell they're saying Antarctica is actually a massive ice wall surrounding us? ",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1481244199.0,
    "date_created": "2016-12-08",
    "time_created": "11:43:19",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1uwq",
    "parent_id": "t1_day1i8u",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Confirmation bias",
    "controversiality": 0,
    "ups": 72,
    "downs": 0,
    "score": 72,
    "created": 1481243929.0,
    "date_created": "2016-12-08",
    "time_created": "11:38:49",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day21wk",
    "parent_id": "t1_day1i8u",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Biased. People only see what they *want* to see and try to ignore things that doesn't fit their narrative.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1481244152.0,
    "date_created": "2016-12-08",
    "time_created": "11:42:32",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzrp9",
    "parent_id": "t1_daxxaj7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's a good joke but I can't get behind any individual personally deciding another's life should end because of any ideological disagreement, no matter how ridiculous it appears to be. Who watches the Watchmen? ",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1481241516.0,
    "date_created": "2016-12-08",
    "time_created": "10:58:36",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayihhi",
    "parent_id": "t1_dayhnmj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"it's normal and natural\"\n\nIt's terrifying that we aren't doing enough to stop this.",
    "controversiality": 0,
    "ups": 48,
    "downs": 0,
    "score": 48,
    "created": 1481263033.0,
    "date_created": "2016-12-08",
    "time_created": "16:57:13",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daym41e",
    "parent_id": "t1_dayknct",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Sorry, I meant it was a factor, not the sole cause. I just know that it's one of the examples I recalled immediately where climate change was a factor in a world conflict.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1481267638.0,
    "date_created": "2016-12-08",
    "time_created": "18:13:58",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day5etb",
    "parent_id": "t1_day4lnv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I don't mean to sound like a dick, but speaking as a high school science teacher your aunt sounds like an idiot and would be openly mocked in our department.",
    "controversiality": 0,
    "ups": 97,
    "downs": 0,
    "score": 97,
    "created": 1481247989.0,
    "date_created": "2016-12-08",
    "time_created": "12:46:29",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daya6jg",
    "parent_id": "t1_day4lnv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Has she heard about the 100,000 year old plant?\n\nhttp://ideas.ted.com/gallery-the-oldest-living-things-in-the-world/",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1481253424.0,
    "date_created": "2016-12-08",
    "time_created": "14:17:04",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day593z",
    "parent_id": "t1_day4rv1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's not exactly a slam dunk for \"convincing proof for deniers,\" but yea, medical technology is allowing women who have trouble with natural birth to give birth anyway via C-section. Assuming genetic reasons for this difficulty, their daughters would be predisposed to also have trouble giving birth naturally, but still be aided by technology and give birth anyway, etc. Since we have the technology to assist with births in this way, \"Ability to give birth naturally\" is no longer a genetically selected for trait, since it's not leading to the mother/child's deaths and no guy is going to care if a potential partner was born via C-section or not.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1481247811.0,
    "date_created": "2016-12-08",
    "time_created": "12:43:31",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayboi9",
    "parent_id": "t1_day83xu",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"...the red thing's connected to my... wrist watch. Uh oh.\" ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1481255137.0,
    "date_created": "2016-12-08",
    "time_created": "14:45:37",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day8cd6",
    "parent_id": "t1_day74ds",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"God doesn't give us anything we can't handle.\" I hate when they say that. How many people committed suicide just today?",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1481251337.0,
    "date_created": "2016-12-08",
    "time_created": "13:42:17",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayax3b",
    "parent_id": "t1_day74ds",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It gets glossed over with \"God can turn anything to good if you just have faith and trust him.\" So if that tornado that leveled your house after the hurricane and tsunami swept through and your husband got cancer on his cancer doesn't result in something wonderful, you're just harboring some secret sin or don't have enough faith. \n\nIt's a pretty toxic worldview. :( ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1481254266.0,
    "date_created": "2016-12-08",
    "time_created": "14:31:06",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1odt",
    "parent_id": "t1_day0gvf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "On top of that, they wont just splice plant dna together then fire those seeds out into the fields. There will be vast amounts of tests on the new seeds before they are even announced that they are being worked on. ",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1481243719.0,
    "date_created": "2016-12-08",
    "time_created": "11:35:19",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1pls",
    "parent_id": "t1_day0gvf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Do you have any examples or sources you could share? ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1481243759.0,
    "date_created": "2016-12-08",
    "time_created": "11:35:59",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day00fz",
    "parent_id": "t1_daxy9w0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"They....they touched me right in my barrier reef\"",
    "controversiality": 0,
    "ups": 76,
    "downs": 0,
    "score": 76,
    "created": 1481241814.0,
    "date_created": "2016-12-08",
    "time_created": "11:03:34",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxyidv",
    "parent_id": "t1_daxy9w0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"right here where it's warmest and making me moist\"",
    "controversiality": 0,
    "ups": 790,
    "downs": 0,
    "score": 790,
    "created": 1481239961.0,
    "date_created": "2016-12-08",
    "time_created": "10:32:41",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxyvbf",
    "parent_id": "t1_daxy9w0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Show me right here on this geographically-correct model globe.",
    "controversiality": 0,
    "ups": 83,
    "downs": 0,
    "score": 83,
    "created": 1481240417.0,
    "date_created": "2016-12-08",
    "time_created": "10:40:17",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxyg1w",
    "parent_id": "t1_daxxxhq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Not as perfect as you might think. Climate molestation deniers would then ask \"well why did the climate wait so long to speak up\" or \"well did you see what the planet was wearing? It was asking for it. Maybe it should have said no.\"",
    "controversiality": 0,
    "ups": 558,
    "downs": 0,
    "score": 558,
    "created": 1481239878.0,
    "date_created": "2016-12-08",
    "time_created": "10:31:18",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day094s",
    "parent_id": "t1_daxyhg2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I've argued that angle before and the response I got was:\n\n\" CO2 is a natural, life essential gas (I know it is) that hasn't been released in high enough quantities to do any harm.\"\n\nSome people, ya know? ",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1481242099.0,
    "date_created": "2016-12-08",
    "time_created": "11:08:19",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day3cxa",
    "parent_id": "t1_day0xw8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "What we need is the God-Emperor to teleport onto the Arch-heretic Horus's flagship and engage him in single combat.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1481245644.0,
    "date_created": "2016-12-08",
    "time_created": "12:07:24",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daydpyr",
    "parent_id": "t1_daxzntx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It makes me sick to my stomach daily, the fact that we would ever even have to devise a 'marketable' way to force half of the most powerful country on earth to believe in an accepted scientific fact. How has fact become a partisan talking point?",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1481257476.0,
    "date_created": "2016-12-08",
    "time_created": "15:24:36",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzatz",
    "parent_id": "t1_daxynyj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Graphs like these (and the literature/evidence to back them up) are what I feel should be front and center in an argument about human involvement in the climate change. I don't see enough instances in online arguments where this data is presented. It totally changed how I look at the situation. ",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1481240949.0,
    "date_created": "2016-12-08",
    "time_created": "10:49:09",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1jg3",
    "parent_id": "t1_daxynyj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Both of those graphs will receive (valid) criticism because they're not based on a zero y-axis. Without any other information, the look like they're forcing an agenda. You would face less criticism if the graph was scaled to zero as a y-axis. More effectively, you could set the baseline of 280 as 0%, then scale as a measure of percentage, effectively showing we've increased CO2 by 35ish%.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1481243562.0,
    "date_created": "2016-12-08",
    "time_created": "11:32:42",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day08nk",
    "parent_id": "t1_daxy7fn",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "He's asking for permission to build a Sea Wall around his Resort on the coast of Ireland. The reason he's giving; Climate Change. It's there he knows it, but he will go with the argument that it's not man made. Does he really believe that. Nah. ",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1481242082.0,
    "date_created": "2016-12-08",
    "time_created": "11:08:02",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day07fq",
    "parent_id": "t1_daxyiux",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Let me guess, you only showed graphs within the last 1,000-10,000 years? If you want an argument, you have to pull out the 500 millon year graph.  https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/All_palaeotemps.svg/1000px-All_palaeotemps.svg.png",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1481242045.0,
    "date_created": "2016-12-08",
    "time_created": "11:07:25",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day15rj",
    "parent_id": "t1_day0eum",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Climate radical Muslim same sex marriage terrorist equal rights affirmative action civil rights abortion illegal immigrant tolerance PC safe space LGBTQ high taxes regulations sensible gun laws scientific knowledge rational thought critical thinking small hands income equality welfare liberal mainstream media change   ",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1481243123.0,
    "date_created": "2016-12-08",
    "time_created": "11:25:23",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day131q",
    "parent_id": "t1_day0eum",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Throw in \"interracial\" and you'll hit every facet of that ideology.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1481243036.0,
    "date_created": "2016-12-08",
    "time_created": "11:23:56",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day0yg1",
    "parent_id": "t1_day0eum",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "CO2 half-lives matter!",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481242891.0,
    "date_created": "2016-12-08",
    "time_created": "11:21:31",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzwtn",
    "parent_id": "t1_daxyup7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Um, how can there be turtles in the ocean when there's still Great A'Tuin?",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481241693.0,
    "date_created": "2016-12-08",
    "time_created": "11:01:33",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzwl6",
    "parent_id": "t1_daxztyy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Well be on Mars by then, where there's plenty of- oh shit. ",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1481241685.0,
    "date_created": "2016-12-08",
    "time_created": "11:01:25",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1jq7",
    "parent_id": "t1_day14nz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "What's really interesting/disturbing is how many alleged liberals and progressives buy into and start to use this same terminology. ",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1481243570.0,
    "date_created": "2016-12-08",
    "time_created": "11:32:50",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayokn6",
    "parent_id": "t1_daybaab",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "/r/Worldbuilding may enjoy the challenge. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481270992.0,
    "date_created": "2016-12-08",
    "time_created": "19:09:52",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day7q9d",
    "parent_id": "t1_day23e5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Correct. The assumption being that Earth is a disc and the outer edges are an icewall.\n\nOh and we aren't allowed to see the edge because scientists (and NASA) block us from doing so.\n\nIt's uh.. weird.",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1481250636.0,
    "date_created": "2016-12-08",
    "time_created": "13:30:36",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day7yef",
    "parent_id": "t1_day1uwq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Delusional is the word.",
    "controversiality": 0,
    "ups": 55,
    "downs": 0,
    "score": 55,
    "created": 1481250895.0,
    "date_created": "2016-12-08",
    "time_created": "13:34:55",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1py7",
    "parent_id": "t1_daxzrp9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1481243770.0,
    "date_created": "2016-12-08",
    "time_created": "11:36:10",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daymkg5",
    "parent_id": "t1_dayihhi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"It's normal and natural\"\n\nSo is death by smallpox",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1481268248.0,
    "date_created": "2016-12-08",
    "time_created": "18:24:08",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day5vu3",
    "parent_id": "t1_day5etb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "As she should be. ",
    "controversiality": 0,
    "ups": 75,
    "downs": 0,
    "score": 75,
    "created": 1481248534.0,
    "date_created": "2016-12-08",
    "time_created": "12:55:34",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayqcdq",
    "parent_id": "t1_day5etb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I am disturbed by the fact that things like this make me feel better.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481273454.0,
    "date_created": "2016-12-08",
    "time_created": "19:50:54",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayac63",
    "parent_id": "t1_daya6jg",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "One of their go-tos is that the way we date things is scientifically inaccurate. ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1481253602.0,
    "date_created": "2016-12-08",
    "time_created": "14:20:02",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day5rf8",
    "parent_id": "t1_day593z",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481248391.0,
    "date_created": "2016-12-08",
    "time_created": "12:53:11",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day02o5",
    "parent_id": "t1_daxyidv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "*Darling it's better\ndown where it's wetter\nTake it from me*",
    "controversiality": 0,
    "ups": 117,
    "downs": 0,
    "score": 117,
    "created": 1481241887.0,
    "date_created": "2016-12-08",
    "time_created": "11:04:47",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzjxa",
    "parent_id": "t1_daxyidv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 93,
    "downs": 0,
    "score": 93,
    "created": 1481241256.0,
    "date_created": "2016-12-08",
    "time_created": "10:54:16",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxz2na",
    "parent_id": "t1_daxyidv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "/r/jesuschristreddit",
    "controversiality": 0,
    "ups": 188,
    "downs": 0,
    "score": 188,
    "created": 1481240672.0,
    "date_created": "2016-12-08",
    "time_created": "10:44:32",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day0hgv",
    "parent_id": "t1_daxyidv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "*Right in the El Niño*",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1481242357.0,
    "date_created": "2016-12-08",
    "time_created": "11:12:37",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day0whu",
    "parent_id": "t1_daxyvbf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "*Points at Florida*",
    "controversiality": 0,
    "ups": 57,
    "downs": 0,
    "score": 57,
    "created": 1481242828.0,
    "date_created": "2016-12-08",
    "time_created": "11:20:28",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxyod4",
    "parent_id": "t1_daxyg1w",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The planet has mechanisms to shut these things down ;)",
    "controversiality": 0,
    "ups": 349,
    "downs": 0,
    "score": 349,
    "created": 1481240173.0,
    "date_created": "2016-12-08",
    "time_created": "10:36:13",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxyq5j",
    "parent_id": "t1_daxyg1w",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "In the case of genuine molestation, the climate has a way of shutting it down\n\nBy killing all life on earth",
    "controversiality": 0,
    "ups": 179,
    "downs": 0,
    "score": 179,
    "created": 1481240236.0,
    "date_created": "2016-12-08",
    "time_created": "10:37:16",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day0qgd",
    "parent_id": "t1_day094s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "i wonder what the combined diameter of all running car exhaust pipes is, at any given time.\n\nbut that's still tiny compared to industrial output.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1481242638.0,
    "date_created": "2016-12-08",
    "time_created": "11:17:18",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day4fyi",
    "parent_id": "t1_day094s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Of course; plants crave carbon dioxide.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481246891.0,
    "date_created": "2016-12-08",
    "time_created": "12:28:11",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day4yh0",
    "parent_id": "t1_day094s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Water is essential - humans are 70% water\n\nHowever, too much and you can die of hyponatremia\n\nEven more - you can drown.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481247472.0,
    "date_created": "2016-12-08",
    "time_created": "12:37:52",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day7xqb",
    "parent_id": "t1_day094s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "So their solution is to... Keep doing it until it is harmful? ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481250874.0,
    "date_created": "2016-12-08",
    "time_created": "13:34:34",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzsqj",
    "parent_id": "t1_daxzatz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The key is to ignore temperature data and rely on CO2 concentration.  We know CO2 is a greehouse gas.  Venus tells us that.  Venus is also a planet that is a perfect example of a planet with a runaway greenhouse effect.   \n\nMaking Earth more Venus-like bit by bit, year by year, is what we are doing.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1481241552.0,
    "date_created": "2016-12-08",
    "time_created": "10:59:12",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day0rfy",
    "parent_id": "t1_daxzatz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "To anthropogenic climate change deniers, this evidence is either fake, due to the collaboration of scientists worldwide to spread alarmism for no reason, or from a MSM source that's conspiring with the aforementioned scientists to push some \"libertard\" agenda. Seriously there is no winning with them. They will cherry pick data to refute any argument brought against them and will start to call you dumbed down insults until you realize that you can't argue with an idiot and win.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1481242668.0,
    "date_created": "2016-12-08",
    "time_created": "11:17:48",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day6m56",
    "parent_id": "t1_day08nk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah people who think Trump doesn't believe in climate change are delusional. He does, but as a business person who has spent money to fix climate change damage he's likely of mindset \"Climate change exists, but I'll be damed if I pay for it, let the rest of the world fix that shit and bear the cost\"",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1481249363.0,
    "date_created": "2016-12-08",
    "time_created": "13:09:23",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day6858",
    "parent_id": "t1_day07fq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The argument is that once the base line temperature normalized to what we see today in that 10,000 year period the temperature normally fluctuates around the baseline, ergo the uptick we are seeing now is just part of what has been normal for the last 10,000 years. \n\nWhat I pointed out is that the Co2 ppm and the average temp uptick we are seeing isn't comparable to the normal pendulum swing we have seen over the past 10,000 years since the temperature normalized to what we have now.\n\nNo one is arguing that the earth is going where it hasn't gone before, it's just doing it faster than before and while life will survive in general, humans specifically maybe not so much.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481248919.0,
    "date_created": "2016-12-08",
    "time_created": "13:01:59",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day2y3d",
    "parent_id": "t1_day15rj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "How much money do I need to give you before I'll feel better? ",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1481245168.0,
    "date_created": "2016-12-08",
    "time_created": "11:59:28",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day24ei",
    "parent_id": "t1_day0yg1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Oil company CEOs are marrying carbon 14! That's too young!",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1481244231.0,
    "date_created": "2016-12-08",
    "time_created": "11:43:51",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxzyef",
    "parent_id": "t1_daxzwl6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I don't think we need to worry about CO2 emissions on Mars. It's a perfect solution. ",
    "controversiality": 0,
    "ups": 37,
    "downs": 0,
    "score": 37,
    "created": 1481241745.0,
    "date_created": "2016-12-08",
    "time_created": "11:02:25",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day8koe",
    "parent_id": "t1_day7q9d",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "How do they explain the fact that on a clear day you can't see past the horizon? Shouldn't we be able to see Japan from Washington?",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1481251599.0,
    "date_created": "2016-12-08",
    "time_created": "13:46:39",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daytn57",
    "parent_id": "t1_daymkg5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"don't be stupid that's not the same\"\n\nI've had many of these conversations :(",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1481277944.0,
    "date_created": "2016-12-08",
    "time_created": "21:05:44",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daycycu",
    "parent_id": "t1_dayac63",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yes - the funny part is that how we date stuff has the same scientific basis as how cell phones work. \n\nBohr figured out the basics and that led to many modern technologies. Quite literally, if isotope decay is wrong, then a microwave or DVD player shouldn't work. \n\nhttp://scitech.au.dk/en/roemer/apr13/bohrs-model-of-the-atom-explains-science-in-everyday-life/",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1481256590.0,
    "date_created": "2016-12-08",
    "time_created": "15:09:50",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day61cm",
    "parent_id": "t1_day5rf8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Entirely possible. It's possible that in the past, larger babies would have complications in childbirth and thus people predisposed to give birth to larger children weren't able to give birth to as many, but with the medical technology, the larger size isn't a life-ending complication.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1481248708.0,
    "date_created": "2016-12-08",
    "time_created": "12:58:28",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day7d8s",
    "parent_id": "t1_day02o5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You just came from the Goofy AMA didn't you.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1481250222.0,
    "date_created": "2016-12-08",
    "time_created": "13:23:42",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1j70",
    "parent_id": "t1_daxz2na",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "What?!  He's referring to the hole in its O-zon... this isn't sounding any better :D",
    "controversiality": 0,
    "ups": 95,
    "downs": 0,
    "score": 95,
    "created": 1481243553.0,
    "date_created": "2016-12-08",
    "time_created": "11:32:33",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxys82",
    "parent_id": "t1_daxyod4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Bubonic plague?",
    "controversiality": 0,
    "ups": 235,
    "downs": 0,
    "score": 235,
    "created": 1481240310.0,
    "date_created": "2016-12-08",
    "time_created": "10:38:30",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1gp9",
    "parent_id": "t1_daxyod4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "If it's a legitimate climate change.",
    "controversiality": 0,
    "ups": 55,
    "downs": 0,
    "score": 55,
    "created": 1481243473.0,
    "date_created": "2016-12-08",
    "time_created": "11:31:13",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "daxz1si",
    "parent_id": "t1_daxyq5j",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "oh",
    "controversiality": 0,
    "ups": 56,
    "downs": 0,
    "score": 56,
    "created": 1481240642.0,
    "date_created": "2016-12-08",
    "time_created": "10:44:02",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1s7u",
    "parent_id": "t1_day0qgd",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "For fun, I just calculated this: roughly 2,300 feet in *radius*, or 4,600 feet in diameter.\n\nEdit: whoops radius diameter flip.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1481243841.0,
    "date_created": "2016-12-08",
    "time_created": "11:37:21",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day6g4m",
    "parent_id": "t1_day0rfy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Don't forget the part where they accuse tens of thousands of scientists across the globe of being shills to \"Big Green Energy\". ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1481249173.0,
    "date_created": "2016-12-08",
    "time_created": "13:06:13",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day8hgv",
    "parent_id": "t1_day6m56",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Plus he's oldaf so its not HIS problem.\n\nHis kids should be saying something about it.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1481251499.0,
    "date_created": "2016-12-08",
    "time_created": "13:44:59",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayfama",
    "parent_id": "t1_day2y3d",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "All of it. I'll create jobs and trickle it back down to you.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481259275.0,
    "date_created": "2016-12-08",
    "time_created": "15:54:35",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day1w9k",
    "parent_id": "t1_daxzyef",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Quite the contrary to worrying , it'd be beneficial to our colonization.",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1481243973.0,
    "date_created": "2016-12-08",
    "time_created": "11:39:33",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "day9ht2",
    "parent_id": "t1_day8koe",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I don't think they would consider that at all. They are blatantly ignoring easily testable ideas as well as championing easily testable ideas that are completely wrong.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1481252639.0,
    "date_created": "2016-12-08",
    "time_created": "14:03:59",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayb2o8",
    "parent_id": "t1_day8koe",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "They think the atmosphere blocks you from viewing beyond the horizon. Kind of like how fog means you can't see too far but you can see stuff close to you.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1481254444.0,
    "date_created": "2016-12-08",
    "time_created": "14:34:04",
    "submission_id": "worldnews-5h6wr2"
  },
  {
    "id": "dayffg6",
    "parent_id": "t1_day8koe",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "They claim a mix of horizon \"fogging\" things up and something about \"vanishing point physics\" where things just get so small that you can't see them anymore with the naked eye. Nevermind that looking through a telescope doesn't suddenly expand your field of view. They've never had a good answer (or a good attitude) when I bring that up.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1481259430.0,
    "date_created": "2016-12-08",
    "time_created": "15:57:10",
    "submission_id": "worldnews-5h6wr2"
  }
]