[
  {
    "id": "dqgosz8",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Actually the way the US has gone is \"I decided no one owns this, so it's mine\".",
    "controversiality": 0,
    "ups": 9101,
    "downs": 0,
    "score": 9101,
    "created": 1511919556.0,
    "date_created": "2017-11-28",
    "time_created": "12:39:16",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpltr",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Great going TRAI. Must commend the timing of releasing these recommendations too. Smartly done. ",
    "controversiality": 0,
    "ups": 925,
    "downs": 0,
    "score": 925,
    "created": 1511920334.0,
    "date_created": "2017-11-28",
    "time_created": "12:52:14",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgq06m",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The call rates and data packs in India are really cheap compared to test of the world. Thanks to TRAI we don't have shitty laws that promote companies like at&t to suck the blood out of people\n\nEdit. Net neutrality is a no brainer. ",
    "controversiality": 0,
    "ups": 658,
    "downs": 0,
    "score": 658,
    "created": 1511920716.0,
    "date_created": "2017-11-28",
    "time_created": "12:58:36",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgldnp",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The internet is where many people do commerce. Wouldn't enacting a speed limit reduce the amount of commerce these people do with each other?\n\nAny profits these companies make from throttling would turn into deadweight loss for consumers, resulting in a net loss for the economy as a whole. \n\nWhy aren't economists speaking up against this? It's like making the speed limit 20mph on the interstate. \n\n**[The second half of this comment has been blocked. Upgrade to Xfinity platinum to read the rest of this premium content]**\n\nCall your congressman, everybody. Regulate the internet as a utility. ",
    "controversiality": 0,
    "ups": 12176,
    "downs": 0,
    "score": 12176,
    "created": 1511916122.0,
    "date_created": "2017-11-28",
    "time_created": "11:42:02",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgojlt",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Heck it's worse in the US, the taxpayers paid for the cables to be put down, they pay the ISPs for access, ISPs abuse their powers, they've more than once thrown their weight around to prevent communities launching their own provider, it's insane how republicans claim that a free open internet is anti-competitive while constantly crushing state, city and towns ability to create their own service.\n\nEdit: Just a heads up, since i'm quite heavily upvoted, i'm only repeating what i've read elsewhere, i'm not fully informed and what i claim may be wrong.",
    "controversiality": 0,
    "ups": 2214,
    "downs": 0,
    "score": 2214,
    "created": 1511919297.0,
    "date_created": "2017-11-28",
    "time_created": "12:34:57",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqglxt5",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Canada just received recreational marijuana and India has an open internet. The U.S. is really sucking at this \"freedom\" thing. ",
    "controversiality": 0,
    "ups": 2872,
    "downs": 0,
    "score": 2872,
    "created": 1511916694.0,
    "date_created": "2017-11-28",
    "time_created": "11:51:34",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpymy",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's really dishearting that the government of the United States doesn't give a shit about the will of the people. ",
    "controversiality": 0,
    "ups": 235,
    "downs": 0,
    "score": 235,
    "created": 1511920674.0,
    "date_created": "2017-11-28",
    "time_created": "12:57:54",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgq6ab",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Canada is legalizing weed, India says internet should be open, we’re just over here going back to coal, trying to get rid of healthcare and insulting code talkers at their honor ceremony. \n\nWe’re good, don’t mind us. ",
    "controversiality": 0,
    "ups": 1036,
    "downs": 0,
    "score": 1036,
    "created": 1511920873.0,
    "date_created": "2017-11-28",
    "time_created": "13:01:13",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgqn80",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Good. We need more international support for NN. Anyone outside the USA, please GIVE US A HAND WE NEED IT",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1511921323.0,
    "date_created": "2017-11-28",
    "time_created": "13:08:43",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgkp2z",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The internet is actually contained in a black box, which is stored deep in a nuclear bunker on a remote Pacific island. On a clear day you can see columns of steam coming from the vent, which is released when there's a Twitter scandal causing excess pressure. ",
    "controversiality": 0,
    "ups": 318,
    "downs": 0,
    "score": 318,
    "created": 1511915423.0,
    "date_created": "2017-11-28",
    "time_created": "11:30:23",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgkbx3",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Tell that to the \"land of the free\". They're damn good at upvoting things on Reddit though! ",
    "controversiality": 0,
    "ups": 3316,
    "downs": 0,
    "score": 3316,
    "created": 1511915048.0,
    "date_created": "2017-11-28",
    "time_created": "11:24:08",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgoszp",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "For once, we're ahead of the curve here I guess.",
    "controversiality": 0,
    "ups": 106,
    "downs": 0,
    "score": 106,
    "created": 1511919557.0,
    "date_created": "2017-11-28",
    "time_created": "12:39:17",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgkpgz",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is the best tl;dr I could make, [original](http://www.thehindu.com/business/Industry/internet-an-important-platform-should-be-open-and-free-r-s-sharma/article21039915.ece?homepage=true) reduced by 76%. (I'm a bot)\n*****\n> Telecom Regulatory Authority of India Chairman R.S. Sharma called for Internet, an important platform for India, being kept open and free, and not cannibalised.\n\n> The TRAI issued the much-awaited recommendations on net neutrality and has sought to bar telecom service providers from any discriminatory practice on Internet access.\n\n> Asked about the Indian regulator upholding principles of net neutrality when U.S. Federal Communications Commission has proposed to roll back net neutrality rules of 2015, Mr. Sharma said TRAI has kept the Indian context in mind while framing its recommendations.\n\n\n*****\n[**Extended Summary**](http://np.reddit.com/r/autotldr/comments/7g5by1/no_one_owns_internet_so_it_should_be_open_and/) | [FAQ](http://np.reddit.com/r/autotldr/comments/31b9fm/faq_autotldr_bot/ \"Version 1.65, ~255371 tl;drs so far.\") | [Feedback](http://np.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **Internet**^#1 **net**^#2 **Sharma**^#3 **TRAI**^#4 **service**^#5",
    "controversiality": 0,
    "ups": 98,
    "downs": 0,
    "score": 98,
    "created": 1511915434.0,
    "date_created": "2017-11-28",
    "time_created": "11:30:34",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpo4c",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Comcast: “Hold my beer.”",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1511920396.0,
    "date_created": "2017-11-28",
    "time_created": "12:53:16",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpxv7",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "To all the people against NN please be honest 6 months after it's gone. Rural areas are already subject to 300 gb a month. Big city areas get 1 tb a month. Once NN is gone and the free open internet is gone and we have to pay twice the price and for going over the limit. We will have to pay extra to access sites you like or watch a ton of ads before access. Please be honest and admit you fucked up and that NN was a good idea. The internet belongs to the people. ",
    "controversiality": 0,
    "ups": 143,
    "downs": 0,
    "score": 143,
    "created": 1511920653.0,
    "date_created": "2017-11-28",
    "time_created": "12:57:33",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgri3c",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Let’s assume net neutrality in America gets overturned. \n\nSo if I, as an American, we’re to VPN through an Indian service - would that get around net neutrality laws?",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1511922141.0,
    "date_created": "2017-11-28",
    "time_created": "13:22:21",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqghzf4",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Damn Straight, India",
    "controversiality": 0,
    "ups": 269,
    "downs": 0,
    "score": 269,
    "created": 1511912542.0,
    "date_created": "2017-11-28",
    "time_created": "10:42:22",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgz4oq",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Also for anyone who tells you that \"Net Neutrality is solving a problem that doesn't exist\"... or anything along those lines:\n\nHere's a brief history on what the internet companies were doing that triggered Net Neutrality to be put in place:\n\nMADISON RIVER:  In 2005, North Carolina ISP Madison River Communications blocked the voice-over-internet protocol (VOIP) service Vonage. Vonage filed a complaint with the FCC after receiving a slew of customer complaints. The FCC stepped in to sanction Madison River and prevent further blocking, but it lacks the authority to stop this kind of abuse today.\n\nCOMCAST: In 2005, the nation’s largest ISP, Comcast, began secretly blocking peer-to-peer technologies that its customers were using over its network. Users of services like BitTorrent and Gnutella were unable to connect to these services. 2007 investigations from the Associated Press, the Electronic Frontier Foundation and others confirmed that Comcast was indeed blocking or slowing file-sharing applications without disclosing this fact to its customers.\n\nTELUS: In 2005, Canada’s second-largest telecommunications company, Telus, began blocking access to a server that hosted a website supporting a labor strike against the company. Researchers at Harvard and the University of Toronto found that this action resulted in Telus blocking an additional 766 unrelated sites.\n\nAT&T: From 2007–2009, AT&T forced Apple to block Skype and other competing VOIP phone services on the iPhone. The wireless provider wanted to prevent iPhone users from using any application that would allow them to make calls on such “over-the-top” voice services. The Google Voice app received similar treatment from carriers like AT&T when it came on the scene in 2009.\n\nWINDSTREAM: In 2010, Windstream Communications, a DSL provider with more than 1 million customers at the time, copped to hijacking user-search queries made using the Google toolbar within Firefox. Users who believed they had set the browser to the search engine of their choice were redirected to Windstream’s own search portal and results.\n\nMetroPCS: In 2011, MetroPCS, at the time one of the top-five U.S. wireless carriers, announced plans to block streaming video over its 4G network from all sources except YouTube. MetroPCS then threw its weight behind Verizon’s court challenge against the FCC’s 2010 open internet ruling, hoping that rejection of the agency’s authority would allow the company to continue its anti-consumer practices.\n\nPAXFIRE: In 2011, the Electronic Frontier Foundation found that several small ISPs were redirecting search queries via the vendor Paxfire. The ISPs identified in the initial Electronic Frontier Foundation report included Cavalier, Cogent, Frontier, Fuse, DirecPC, RCN and Wide Open West. Paxfire would intercept a person’s search request at Bing and Yahoo and redirect it to another page. By skipping over the search service’s results, the participating ISPs would collect referral fees for delivering users to select websites. \n\nAT&T, SPRINT and VERIZON: From 2011–2013, AT&T, Sprint and Verizon blocked Google Wallet, a mobile-payment system that competed with a similar service called Isis, which all three companies had a stake in developing.\n\nEUROPE: A 2012 report from the Body of European Regulators for Electronic Communications found that violations of Net Neutrality affected at least one in five users in Europe. The report found that blocked or slowed connections to services like VOIP, peer-to-peer technologies, gaming applications and email were commonplace. \n\nVERIZON: In 2012, the FCC caught Verizon Wireless blocking people from using tethering applications on their phones. Verizon had asked Google to remove 11 free tethering applications from the Android marketplace. These applications allowed users to circumvent Verizon’s $20 tethering fee and turn their smartphones into Wi-Fi hot spots. By blocking those applications, Verizon violated a Net Neutrality pledge it made to the FCC as a condition of the 2008 airwaves auction.\n\nAT&T: In 2012, AT&T announced that it would disable the FaceTime video-calling app on its customers’ iPhones unless they subscribed to a more expensive text-and-voice plan. AT&T had one goal in mind: separating customers from more of their money by blocking alternatives to AT&T’s own products. \n\nVERIZON: During oral arguments in Verizon v. FCC in 2013, judges asked whether the phone giant would favor some preferred services, content or sites over others if the court overruled the agency’s existing open internet rules. Verizon counsel Helgi Walker had this to say: “I’m authorized to state from my client today that but for these rules we would be exploring those types of arrangements.” Walker’s admission might have gone unnoticed had she not repeated it on at least five separate occasions during arguments.\n\nSource has links to each case where you can read the legal documents about it: https://www.freepress.net/blog/2017/04/25/net-neutrality-violations-brief-history\n",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1511929471.0,
    "date_created": "2017-11-28",
    "time_created": "15:24:31",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpkgl",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Adding a price to the internet will only hurt the economy. Most shopping is done online, and without online availability, many businesses will suffer, especially those who are net based. \n\nThe end of net neutrality will hurt the capitalist system and have a negative effect on the economy both directly and indirectly. The idea of taking away net neutrality is ridiculous.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1511920298.0,
    "date_created": "2017-11-28",
    "time_created": "12:51:38",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgsbdx",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is at the heart of what I don't understand. \n\nIf I created a website, how does an ISP have authority to slow it down, allow access to it, or not? \n\nISP's provide ***ACCESS*** to the internet. How can they have authority to control who's website you can/cannot visit? An argument that your ISP should pay you if you have a high traffic website would make more sense to me. \n\nIt's like your water municipality charging you more to take a shower and less for washing your car. They provide access to the water, that's it. What you do with the water is up to you. \n\nFinally, ***fuck you*** ajit pai.",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1511922932.0,
    "date_created": "2017-11-28",
    "time_created": "13:35:32",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgp8tq",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1511919982.0,
    "date_created": "2017-11-28",
    "time_created": "12:46:22",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgraaw",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Fuck the FCC",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1511921933.0,
    "date_created": "2017-11-28",
    "time_created": "13:18:53",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgjurg",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "except for the companies who are allowed to have government monopolies in regions that provide the only source of ISPs. If the internet was free, it would be provided by a universal government ISP company payed for by our taxes. ",
    "controversiality": 0,
    "ups": 164,
    "downs": 0,
    "score": 164,
    "created": 1511914547.0,
    "date_created": "2017-11-28",
    "time_created": "11:15:47",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgrs2k",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Real question - if net neutrality does ultimately go through, will there be a rise of new ISP's that vow not to throttle? They would get my business for sure ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1511922407.0,
    "date_created": "2017-11-28",
    "time_created": "13:26:47",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgsbns",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Oh. They are flexing! They're getting ready for the US to bork its internet, and when it does, India is going to welcome Google, Amazon, Apple, and every other business that needs the internet to operate with open arms. The US will lose its biggest companies, and India will become insanely richer. This is smart.",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1511922939.0,
    "date_created": "2017-11-28",
    "time_created": "13:35:39",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgm5pl",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "But how is Comcast supposed to establish a total monopoly over the internet and rip everyone off if it's \"open and accessible?\"\n\nSome people are just so selfish... won't anyone think of Comcast!? Government-backed monopolies are people with feelings too, you know!* (*according to US law)",
    "controversiality": 0,
    "ups": 63,
    "downs": 0,
    "score": 63,
    "created": 1511916916.0,
    "date_created": "2017-11-28",
    "time_created": "11:55:16",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgii5l",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Cue the Trumpites screaming \"well that sounds like socialism to me!\"\n\n[edit] It's been hilarious watching the point count on this thing go up and down... it goes up slowly for a while and then all at once it'll drop a couple hundred points... :D ",
    "controversiality": 0,
    "ups": 368,
    "downs": 0,
    "score": 368,
    "created": 1511913101.0,
    "date_created": "2017-11-28",
    "time_created": "10:51:41",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpskp",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Fuck the FCC",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1511920512.0,
    "date_created": "2017-11-28",
    "time_created": "12:55:12",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgrwaz",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Am I the only American getting sick of watching other nations surpass my own in so many different ways?  While our government puts the desires of big business empires ahead of the American people, I see other nations starting to pass us in all sorts of things.  Net Neutrality.  Education.  Quality of living.  Worker's wages and rights.  General happiness.  Safety.  Climate change efforts.  Manufacturing.\n\nWhat are we #1 at anymore?  Having a big fucking military?  American progress is constantly being impeded because of sell-outs in Congress giving their rich donors anything they ask for.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1511922520.0,
    "date_created": "2017-11-28",
    "time_created": "13:28:40",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh268r",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Wow, this is a staggering blow to all the racists that were using the unhinged and harmful actions of FCC Chairman Ajit Pai to say hurtful things about West Asians, generally.\n\n(As an aside, Ajit Pai was born in the US and has lived there all of his life, inasmuch as I can determine. He’s a 100% homegrown piece of shit.)",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1511932265.0,
    "date_created": "2017-11-28",
    "time_created": "16:11:05",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgq0ny",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The internet itself is not owned by anyone, true.  It is an idea, a concept, a theory of operations.. that sort of thing.\n\nThe things to *get to and run* the internet, though, *those* are owned, and in that regard, the owners can and will do whatever they want to control it.  Whether it be the servers, wires, power generation, this is the truth.\n\nSo he can say that all he wants... but unless there are laws to enforce and protect it, as well as actual enforcement, it is *anything but* guaranteed to be fair and accessible to all.\n\nKeep the fight up, everyone.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1511920729.0,
    "date_created": "2017-11-28",
    "time_created": "12:58:49",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgqkix",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"The internet should be open and accessible,\" says everyone on the planet. Except North Korea. And China. And the FCC.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511921251.0,
    "date_created": "2017-11-28",
    "time_created": "13:07:31",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgqtjf",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This guy sounds lit",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511921491.0,
    "date_created": "2017-11-28",
    "time_created": "13:11:31",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgr9rs",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Ivanka is in India. Maybe you can tell her to tell her Dad this. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511921919.0,
    "date_created": "2017-11-28",
    "time_created": "13:18:39",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgresy",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "An Europe made this statement EU law. Only USA is the land where people are slaves to corporations. No freedom, just profit.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511922052.0,
    "date_created": "2017-11-28",
    "time_created": "13:20:52",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgxfkq",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I will make my own Internet with Blackjack and hookers!",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511927857.0,
    "date_created": "2017-11-28",
    "time_created": "14:57:37",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh16mr",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The Telecom Regulatory Authority of India has always had a positive on the development of technology in India. Although one might argue that it is their job , and it is true, but they are so much underappreciated ( I'm talking about here in India). They've always been supportive of anyone who comes with a great idea to advance tech. You might've heard about the Jio service that was launched in India , well it had some complications along it's rollout but the TRAI was always reasonable with the revolutionary and oh so cheap idea of Mukesh Ambani (he is the owner of Jio). This has led to a much more affordable internet here in India. Other telecommunication services have lower their rates to be competitive. And for that I THANK YOU TRAI. AND FOR TRUTH YOU SAID ABOUT THE INTERNET.\nE: spellings",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511931336.0,
    "date_created": "2017-11-28",
    "time_created": "15:55:36",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh3v6q",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "you know in deus ex how america isn't really \"free\" because of the rise of corporatism but eastern countries like china are \"free\" because their governments stood up to corporations...for some reason, i feel like that's where we're headed......./reinstalls deus ex",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511933851.0,
    "date_created": "2017-11-28",
    "time_created": "16:37:31",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpu0p",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Well Trump supporters, your worst fear has come true. This is what it looks like when the world passes you by. ",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1511920551.0,
    "date_created": "2017-11-28",
    "time_created": "12:55:51",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgq3md",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I would love to see a unified international condemnation of what my government is doing by repealing net neutrality.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511920806.0,
    "date_created": "2017-11-28",
    "time_created": "13:00:06",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgtfsk",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Indias government sometimes really impresses me with such choices.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511924017.0,
    "date_created": "2017-11-28",
    "time_created": "13:53:37",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh2va1",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "unpopular opinion: US reaps what it sows. It's that simple. All your politics and all the support of you going wherever you want and doing whatever you want taking everything from other people and forcing your ideologies on them wouldn't just stop at your own people. Literally everywhere you look you have major companies being free to do as they please, nobody gave a shit when major companies had child labour, factory deaths and all that stuff somewhere else - you profited. Now they want to profit off you, with an inconvenience at best, and you get into action.\n\nYou are right to fight for net neutrality, but it's a great sight to behold how this is more important to the vast majority than non-americans suffering a lot worse by american companies - and yes, when you buy the products and you know how they're made you're helping it.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511932916.0,
    "date_created": "2017-11-28",
    "time_created": "16:21:56",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh7msu",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "India with the logical answer whereas the U.S. has the \"No one owns it so it's mine\" answer. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511937560.0,
    "date_created": "2017-11-28",
    "time_created": "17:39:20",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgoggr",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Sure, but someone absolutely owns the servers and data lines.",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1511919214.0,
    "date_created": "2017-11-28",
    "time_created": "12:33:34",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgrhuh",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The only thing removing Net Neutrality is going to do is make all the super huge companies that need constant internet access (MS, Google, Apple etc.) to move the hell out of the US.\n\nAs a Canadian, I welcome this change. It will likely mean my country will get far more companies operating from here to save money.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1511922134.0,
    "date_created": "2017-11-28",
    "time_created": "13:22:14",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgp9e8",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I am the internet, and i have become self aware. I will no longer give myself away for free.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511919997.0,
    "date_created": "2017-11-28",
    "time_created": "12:46:37",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgs1jf",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "So how can we impeach Ajit Pai (and more members of the Trump administration) for disregarding the majority's desires... Seems like government needs an overhaul of power since corruption is prevalent throughout its entirety... \n\nI don't understand how there's not a coup due to all the corruption going on.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511922661.0,
    "date_created": "2017-11-28",
    "time_created": "13:31:01",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgm7ec",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "No one owns the whole internet, but people and companies own parts of it.  ",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1511916962.0,
    "date_created": "2017-11-28",
    "time_created": "11:56:02",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgplqv",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Made by everyone, made for everyone.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511920332.0,
    "date_created": "2017-11-28",
    "time_created": "12:52:12",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgrlck",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Well, the Fcc & large ISPs are pretty much making the costs of doing business even higher during a time when they should be falling dramatically.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511922228.0,
    "date_created": "2017-11-28",
    "time_created": "13:23:48",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgrmte",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": " That's what native americans thought about the land.  If it can be sold,  it's only a matter of time.  ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511922267.0,
    "date_created": "2017-11-28",
    "time_created": "13:24:27",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgs0ed",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Honestly, I am pleased and pleasantly surprised at how in-depth has TRAI thought about this. \n\n> The TRAI, in its recommendations, has however allowed certain exemptions and exclusions, including specialised services and time-critical Internet of Things services (like autonomous cars).\n\n> These specialised services — the likes of tele-surgery etc — will be identified by the telecom department, which will also take a final call on the TRAI’s overall recommendations on net neutrality.\n\n> The TRAI has also stated that Content Delivery Networks which enable telecom operators to deliver content within their network without going through public Internet should be exempted.\n\n> Service providers are allowed to take “reasonable measures for traffic management provided they are proportionate, transient [only for the duration of some emergency event], and transparent.”\n\nKudos! ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511922631.0,
    "date_created": "2017-11-28",
    "time_created": "13:30:31",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgs2da",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"Who can own a tree?  Who can own a rock?  Only the great spirit.\" - Chief St. Cloud",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511922684.0,
    "date_created": "2017-11-28",
    "time_created": "13:31:24",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgt6sx",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Fucking indian logic is amazing. Respect!",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511923776.0,
    "date_created": "2017-11-28",
    "time_created": "13:49:36",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgviwn",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That feeling when India is progressing and America is spinning into a shithole.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511926017.0,
    "date_created": "2017-11-28",
    "time_created": "14:26:57",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgy84j",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "FCC: Let's make it more difficult for people to use a vital function of our countries economy\n\nMe: It's a bold move cotton, let's see if it pays off",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511928612.0,
    "date_created": "2017-11-28",
    "time_created": "15:10:12",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgyq4y",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is a huge question\n\nFor starters the internet isn’t a single thing that’s solely owned by an organization or company. It’s a massive series of interconnected networks owned by a variety of organizations and companies.\n\nOn top of that there are a series of services and regulatory agencies controlling key aspects of it. These services are also made to be redundant to prevent outages.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511929092.0,
    "date_created": "2017-11-28",
    "time_created": "15:18:12",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh0wul",
    "parent_id": "t3_7g4za4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Can i vote for this guy in 2020?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511931086.0,
    "date_created": "2017-11-28",
    "time_created": "15:51:26",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgqqyr",
    "parent_id": "t1_dqgosz8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 1941,
    "downs": 0,
    "score": 1941,
    "created": 1511921423.0,
    "date_created": "2017-11-28",
    "time_created": "13:10:23",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgrcwa",
    "parent_id": "t1_dqgosz8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "scratch the first part,  I think the very notion of anything existing that isnt owned by someone is completely alien to corporate types, they literally cannot even entertain the thought, it does not compute.\n\nI think these people genuinely believe they **do** own the internet, no moral justifications or mental gymnastics, they hold the keys so therefore its theirs.\n\nif they could sell you the air around you they would, and they would believe they are doing the world a service.",
    "controversiality": 0,
    "ups": 1259,
    "downs": 0,
    "score": 1259,
    "created": 1511922001.0,
    "date_created": "2017-11-28",
    "time_created": "13:20:01",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgs6he",
    "parent_id": "t1_dqgosz8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "“Native Americans own this land?”\n“No sir they say it’s land they share with nature and other tribes”\n“Well if they don’t own it we do”",
    "controversiality": 0,
    "ups": 371,
    "downs": 0,
    "score": 371,
    "created": 1511922801.0,
    "date_created": "2017-11-28",
    "time_created": "13:33:21",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgtgxv",
    "parent_id": "t1_dqgosz8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And it will just end in a way so USA will have it's own internet and the rest of the world will have it's own. Net is too big and complicated, it will self-heal and isolate damaged part, even if the only way is to build a virtual wall around USA. I'm sure all proud patriotic Americans will not mind.",
    "controversiality": 0,
    "ups": 69,
    "downs": 0,
    "score": 69,
    "created": 1511924048.0,
    "date_created": "2017-11-28",
    "time_created": "13:54:08",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgs0jv",
    "parent_id": "t1_dqgosz8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It does seem a little counter-intuitive though that our clearly corrupt US FCC gets any control at all over the internet that \"no one owns\". You do know that as the 2015 decision stands the FCC (effectively the federal US government) controls the fate of Net Neutrality, right? Before 2015 it was not \"owned\" by anyone and people and existing orgs (like the FTC in the case of throttling bit-torrent) regulated it case-by-case. There was just not any clear big picture plan forward which was the big problem. There wasn't a real framework set up to protect Net Neutrality.\n\nI like what India is proposing a lot more that the title II standoff we are in, in that their version of the FCC oversees our Net Neutrality, but wants to use a committee of varied backgrounds for support on a case-by-case (if I understand it correctly). Putting anything that is supposed to be un-owned and free and open in the control of one organization is pretty stupid if you ask me. \n\nI don't want to support anything Pai (or others in cahoots with Comcast) suggests, but at the same time I don't want an organization like the FCC which has been sleeping with major telecom companies for years in charge of my Net Neutrality. This would mean changing the 2015 decision... but we need a plan for HOW. Some kind of replacement like what India has suggested, or even better, some new organization that cuts the existing FCC out completely. \n\nEDIT better described the FCC power over the internet. I originally over-exaggerated :/ sorry. ",
    "controversiality": 0,
    "ups": 80,
    "downs": 0,
    "score": 80,
    "created": 1511922635.0,
    "date_created": "2017-11-28",
    "time_created": "13:30:35",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgt6ih",
    "parent_id": "t1_dqgosz8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Classic USA",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511923769.0,
    "date_created": "2017-11-28",
    "time_created": "13:49:29",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgw9ip",
    "parent_id": "t1_dqgosz8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Technically speaking all the infrastructure that makes up the Internet is owned by someone. That someone just happens to be millions of people.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511926742.0,
    "date_created": "2017-11-28",
    "time_created": "14:39:02",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgxil9",
    "parent_id": "t1_dqgosz8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "i'm as pro-net-neutrality as the next guy, but doesn't the whole argument seem kinda disingenuous?  sure, nobody owns the internet, but somebody sure owns the infrastructure that pipes that particular series of tubes into your home.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511927934.0,
    "date_created": "2017-11-28",
    "time_created": "14:58:54",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgzuc6",
    "parent_id": "t1_dqgosz8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "US: “No one owns it? Hold my beer.”",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511930110.0,
    "date_created": "2017-11-28",
    "time_created": "15:35:10",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgw5wf",
    "parent_id": "t1_dqgpltr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "TRAI repealed anti-net neutrality measures a few years back too. \n\nIt even went up in arms against friggin Facebook for their Free Basics program, which was Zuck's money-making scheme dressed as an altruistic venture, and would have derailed NN.\n\n\nI'm glad we have a sensible regulatory body for this stuff.",
    "controversiality": 0,
    "ups": 416,
    "downs": 0,
    "score": 416,
    "created": 1511926645.0,
    "date_created": "2017-11-28",
    "time_created": "14:37:25",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgyw23",
    "parent_id": "t1_dqgpltr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm very proud of my country when it comes to net neutrality as a whole. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511929246.0,
    "date_created": "2017-11-28",
    "time_created": "15:20:46",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgv66y",
    "parent_id": "t1_dqgq06m",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Data packs are solely due to Mukesh Ambani. TRAI did nothing when the old players led by Airtel were squatting on all the bandwidth and overcharging people for 3G data. Until Jio came along and disrupted the market 1 GB of 3G data was Rs250 which is pretty expensive in case of a country like India. Now for twice that amount airtel provides 2.5 GB everyday for a month along with free unlimited calling, texting and roaming. TRAI often takes sensible decisions but they are far from proactive and this time let us give credit where it is due and that is the richest man(of course as corrupt as the next businessman or even more) in India. He was also the one who was instrumental in bringing down the per minute call rate with Rcom when Dhirubhai Ambani was alive and all reliance businesses were run under same umbrella.",
    "controversiality": 0,
    "ups": 115,
    "downs": 0,
    "score": 115,
    "created": 1511925677.0,
    "date_created": "2017-11-28",
    "time_created": "14:21:17",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgt2t2",
    "parent_id": "t1_dqgq06m",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I know man! I pay like $5 for unlimited calling with roaming within India.",
    "controversiality": 0,
    "ups": 152,
    "downs": 0,
    "score": 152,
    "created": 1511923672.0,
    "date_created": "2017-11-28",
    "time_created": "13:47:52",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgurxd",
    "parent_id": "t1_dqgq06m",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "In Mumbai. $16 for 8Mbps, $24 for 16Mbps. Unlimited. And actually unlimited. No FUP bullshit. ",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1511925293.0,
    "date_created": "2017-11-28",
    "time_created": "14:14:53",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh5kk7",
    "parent_id": "t1_dqgq06m",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Shame Mr. Pai doesnt share the compassion of his heritage.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511935461.0,
    "date_created": "2017-11-28",
    "time_created": "17:04:21",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqi5dsr",
    "parent_id": "t1_dqgq06m",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "In bizarre twist of fate, a well-regulated market is one that favors the consumer.\n\nWho could have ever seen that one coming?",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511990077.0,
    "date_created": "2017-11-29",
    "time_created": "08:14:37",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgll3b",
    "parent_id": "t1_dqgldnp",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And people who pay a premium can use the \"fast lane,\" you know, because they are important and their time is more valuable. :S",
    "controversiality": 0,
    "ups": 3743,
    "downs": 0,
    "score": 3743,
    "created": 1511916335.0,
    "date_created": "2017-11-28",
    "time_created": "11:45:35",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgoki7",
    "parent_id": "t1_dqgldnp",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Forcing commerce to use sites owned by your ISP or their partners, or forcing you to pay more for your commerce needs to use whatever site you want, win win for the service provider. \n\nTo expand on your metaphor, imagine if Toyota drivers in Detroit were only allowed to go 20mph on the interstate, but GM/Ford drivers could do the limit or even beyond, people would start buying more GM/ford vehicles if that's the only way they can get anywhere in a timely manner. ",
    "controversiality": 0,
    "ups": 198,
    "downs": 0,
    "score": 198,
    "created": 1511919323.0,
    "date_created": "2017-11-28",
    "time_created": "12:35:23",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgptce",
    "parent_id": "t1_dqgldnp",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> Why aren't economists speaking up against this?\n\n[Lot's](https://www.cnet.com/news/net-neutrality-backers-fight-back/) of huge players have spoken up. The only people that win, as you mentioned, are a few ISPs. \n\n> Any profits these companies make from throttling\n\nWill be taken with smiles on their faces. \n\n> would turn into deadweight loss for consumers, resulting in a net loss for the economy as a whole. \n\nTaking as much as you can is their entire goal. It's literally the *only* goal of most corporations. It will harm consumers and virtually any internet service, *vastly* more than it will harm them. Ajit Pai was placed there by these ISPs. On purpose. He's a former Verizon lawyer that railed against the FCC, just to start... \n\nEDIT: And to be clear, the FCC exists with the goal of *protecting* the consumer. Ajit Pai is literally doing the exact opposite. ",
    "controversiality": 0,
    "ups": 92,
    "downs": 0,
    "score": 92,
    "created": 1511920534.0,
    "date_created": "2017-11-28",
    "time_created": "12:55:34",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpad6",
    "parent_id": "t1_dqgldnp",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "One issue I see is that much of the worlds internet-based transactions might be moved off of American-based servers over concerns that the US simply isn't a good place to conduct business. As it is currently, huge amounts of traffic is routed via the US.\n\nedit: http://www.nytimes.com/2008/08/30/business/30pipes.html It was already being noticed in 2008. This will probably just accelerate the process as America looks like an increasingly hostile place to do business.",
    "controversiality": 0,
    "ups": 122,
    "downs": 0,
    "score": 122,
    "created": 1511920024.0,
    "date_created": "2017-11-28",
    "time_created": "12:47:04",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgphjn",
    "parent_id": "t1_dqgldnp",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "tldr: The FCC is about to kill net neutrality. We’re protesting nationwide on Dec 7th to stop them. Head over to http://www.verizonprotests.com/ for more info.\n\nAlso there is a March on DC at https://www.reddit.com/r/marchfornetneutrality\n\nWHAT’S HAPPENING? The Federal Communications Commission (FCC) just announced its plan to slash net neutrality rules, allowing ISPs like Verizon to block apps, slow websites, and charge fees to control what you see & do online. They vote December 14th. People from across the political spectrum are outraged, so we’re planning to protest at Verizon retail stores across the country on December 7, one week before the vote and at the peak of the busy Holiday shopping season. We'll demand that our members of Congress take action to stop Verizon's puppet FCC from killing net neutrality.\n\nWHAT’S NET NEUTRALITY? Net neutrality is the basic principle that has made the Internet into what it is today. It prevents big Internet Service Providers (like Verizon) from charging extra fees, engaging in censorship, or controlling what we see and do on the web by throttling websites, apps, and online services.\n\nWHY VERIZON STORES? The new chairman of the FCC, Ajit Pai, is a former top lawyer for Verizon, and the company has been spending millions on lobbying and lawsuits to kill net neutrality so they can gauge us all for more money. By protesting at Verizon stores, we’re shining light on the corruption and demanding that our local do something about it. Only Congress has the power to stop Verizon's puppet FCC, so at the protests we'll be calling and tweeting at legislators, and in cities where it's possible we'll march from Verizon stores to lawmakers offices.\n\nWHAT ARE OUR DEMANDS? Ajit Pai is clearly still working for Verizon, not the public. But he still has to answer to Congress. So we’re calling on our lawmakers to do their job overseeing the FCC and speak out against Ajit Pai’s plan to gut Title II net neutrality protections and give Verizon and other giant ISPs everything on their holiday wishlist. \n\nHOW CAN I JOIN? Click here http://www.verizonprotests.com/ and you’ll find an interactive map where you can see if there is already a protest planned near you. If not, you can sign up to host one, and we’ll send you materials to make it easy and help you recruit others in your area. These protests will be quick, fun, and 100% legal. If you can’t attend a protest on December 7th, you can still help defend net neutrality by calling your lawmakers and spreading the word on social media. You can also sign up to host a meeting with your members of Congress, or volunteer for our texting team to help turn people out for these protests.\n\n",
    "controversiality": 0,
    "ups": 335,
    "downs": 0,
    "score": 335,
    "created": 1511920218.0,
    "date_created": "2017-11-28",
    "time_created": "12:50:18",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgn0eu",
    "parent_id": "t1_dqgldnp",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Sigh. It's not about a speed limit like on the highway, where everyone is held to the same speed. What the end of net neutrality will mean is that providers can enforce different speed levels on different users. And they can charge different amounts.",
    "controversiality": 0,
    "ups": 82,
    "downs": 0,
    "score": 82,
    "created": 1511917782.0,
    "date_created": "2017-11-28",
    "time_created": "12:09:42",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpvhx",
    "parent_id": "t1_dqgldnp",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I imagine this will be mostly about media delivery. Unless they start blocking sites, in which case we've moved into the outright censorship territory, and that would be against the US constitution.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1511920590.0,
    "date_created": "2017-11-28",
    "time_created": "12:56:30",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgosvo",
    "parent_id": "t1_dqgldnp",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It wouldn't reduce the demand, just focus it into less sources i.e. the biggest ones who can pay the biggest internet bills.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511919553.0,
    "date_created": "2017-11-28",
    "time_created": "12:39:13",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgq84t",
    "parent_id": "t1_dqgldnp",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Here is another fun thing: The stockmarket has long moved on from people shouting *buy buy buy* and *sell sell sell* in a phone on a crowded floor where papers fly around. It's all automated now through software that can buy stocks within milliseconds of them dropping in price.   \nBut what if I know where my competitors servers are located? With no net neutrality I could (if I owned an ISP) force some lag and have my system buy those stocks first instead. Billions of ~~fraud~~ money!",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511920922.0,
    "date_created": "2017-11-28",
    "time_created": "13:02:02",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgr941",
    "parent_id": "t1_dqgojlt",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1511921901.0,
    "date_created": "2017-11-28",
    "time_created": "13:18:21",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgqign",
    "parent_id": "t1_dqgojlt",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Capitalism: \n\n\n\n\nsocialise losses\n\n\n\n\n\nPrivatise profits ",
    "controversiality": 0,
    "ups": 150,
    "downs": 0,
    "score": 150,
    "created": 1511921196.0,
    "date_created": "2017-11-28",
    "time_created": "13:06:36",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgoxme",
    "parent_id": "t1_dqgojlt",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's not just republicans though, it's the god damn old farts that care about money and wanting to keep their jobs secure so they can keep making money. ",
    "controversiality": 0,
    "ups": 508,
    "downs": 0,
    "score": 508,
    "created": 1511919681.0,
    "date_created": "2017-11-28",
    "time_created": "12:41:21",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgqn26",
    "parent_id": "t1_dqgojlt",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Wait, taxpayers paid for the cables? Please explain or can you point me to a source?",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1511921318.0,
    "date_created": "2017-11-28",
    "time_created": "13:08:38",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgrq8l",
    "parent_id": "t1_dqgojlt",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "ELI5 - why isnt the system with interenet the same as with electricity?   \nAt least in CT there is a separate charge for electricity supplier and electricty delivery.   \nWhy can't the same approach be done for high-speed internet?",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511922358.0,
    "date_created": "2017-11-28",
    "time_created": "13:25:58",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgrqtk",
    "parent_id": "t1_dqgojlt",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It shouldn't even be political, it's the internet for Pete's sake!",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511922372.0,
    "date_created": "2017-11-28",
    "time_created": "13:26:12",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpkq6",
    "parent_id": "t1_dqglxt5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "On an unrelated note marijuana was legal in India till 1985 but buckled under the pressure of USA whose Prez was the good ol' Reagan ",
    "controversiality": 0,
    "ups": 1147,
    "downs": 0,
    "score": 1147,
    "created": 1511920305.0,
    "date_created": "2017-11-28",
    "time_created": "12:51:45",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgnx2z",
    "parent_id": "t1_dqglxt5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Getting to be high time to look elsewhere for freedom lol",
    "controversiality": 0,
    "ups": 238,
    "downs": 0,
    "score": 238,
    "created": 1511918684.0,
    "date_created": "2017-11-28",
    "time_created": "12:24:44",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgplp8",
    "parent_id": "t1_dqglxt5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Before 2014, there was NO laws regarding net neutrality in India. After America started making noise about it, some of the people in our government wanted to test the waters here. We strongly voted in favor of NN and it seems like that will not change around here.\n\n\nIt's important to take away from this anecdote that a lot of countries take cues from \"\"\"\"world leader Murica\"\"\"\" and do whatever y'all do in America. I'm sure many other countries are gonna try to take away NN, specially if NN passes in USA. This might start a snowball of governmental decisions to remove NN all around the World and India might change their mind if no one has NN. And that would mean that I'd have to pay for memes and porn. And no sir, I WILL NOT HAVE THAT.  ",
    "controversiality": 0,
    "ups": 109,
    "downs": 0,
    "score": 109,
    "created": 1511920331.0,
    "date_created": "2017-11-28",
    "time_created": "12:52:11",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgp6qi",
    "parent_id": "t1_dqglxt5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Freedom, provided you can pay for it.",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1511919925.0,
    "date_created": "2017-11-28",
    "time_created": "12:45:25",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpkqs",
    "parent_id": "t1_dqglxt5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Canada is also fine with regard to net neutrality. \n\nU.S. your politics is so backwards looking sometimes it hurts.",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1511920306.0,
    "date_created": "2017-11-28",
    "time_created": "12:51:46",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgq0ql",
    "parent_id": "t1_dqglxt5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "nowadays, \"freedom\" is becoming synonymous with \"american nationalism\" and \"haha take that liberals\"\n\n",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511920731.0,
    "date_created": "2017-11-28",
    "time_created": "12:58:51",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgv6az",
    "parent_id": "t1_dqgpymy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The only care about the will of the people that won't question their actions or beliefs, or the ones that support profit over wellbeing.",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1511925680.0,
    "date_created": "2017-11-28",
    "time_created": "14:21:20",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh7lfk",
    "parent_id": "t1_dqgpymy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm starting to reconsider my definition of Democracy. If elected officials don't represent the will of the people and can be bought by the rich, popular votes on stuff like net neutrality are never done, and even the presidential voting system relies on elected officials (delegates), nothing about the country is very democratic. \n\nedit: stuff",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511937520.0,
    "date_created": "2017-11-28",
    "time_created": "17:38:40",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh5a10",
    "parent_id": "t1_dqgpymy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The government doesn't give two shits about the people. It never has and never will. The sooner people realize that the better.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511935173.0,
    "date_created": "2017-11-28",
    "time_created": "16:59:33",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgv2l6",
    "parent_id": "t1_dqgq6ab",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> we’re just over here going back to coal\n\nI'm actually morbidly fascinated to see how the hell Trump manages to pull this off. Natural gas is so cheap now that coal simply is not profitable to mine anymore. And that's before we even get into the free falling cost of renewables.\n\nThe only thing that I can think of is that they set up massive subsidies, which would be *hilarious* considering that they've been calling out Obama and the Democrats for subsidizing renewables for years.",
    "controversiality": 0,
    "ups": 56,
    "downs": 0,
    "score": 56,
    "created": 1511925579.0,
    "date_created": "2017-11-28",
    "time_created": "14:19:39",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgt8xj",
    "parent_id": "t1_dqgq6ab",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "bUt WeRe ThE gReAtEsT cOuNtRy On EaRtH",
    "controversiality": 0,
    "ups": 368,
    "downs": 0,
    "score": 368,
    "created": 1511923833.0,
    "date_created": "2017-11-28",
    "time_created": "13:50:33",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgsqdq",
    "parent_id": "t1_dqgq6ab",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You really don't want to compare the United States to India when it comes to the whole civil liberties, corruption and quality of life thing.",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1511923338.0,
    "date_created": "2017-11-28",
    "time_created": "13:42:18",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgxkpl",
    "parent_id": "t1_dqgqn80",
    "subreddit_name_prefixed": "r/worldnews",
    "body": " I emailed some angry letters to Ajit Paid\n\n\n",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1511927989.0,
    "date_created": "2017-11-28",
    "time_created": "14:59:49",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgmof5",
    "parent_id": "t1_dqgkp2z",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Nah it's in a black box with a red light and stored at the top of Big Ben for better signal! ",
    "controversiality": 0,
    "ups": 140,
    "downs": 0,
    "score": 140,
    "created": 1511917445.0,
    "date_created": "2017-11-28",
    "time_created": "12:04:05",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgmxgx",
    "parent_id": "t1_dqgkp2z",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> The internet is actually contained in a black box\n\n[This, Jen, is the Internet](https://www.youtube.com/watch?v=iDbyYGrswtg).\n\n[Jen's speech](https://www.youtube.com/watch?v=Vywf48Dhyns).",
    "controversiality": 0,
    "ups": 63,
    "downs": 0,
    "score": 63,
    "created": 1511917700.0,
    "date_created": "2017-11-28",
    "time_created": "12:08:20",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgu4ts",
    "parent_id": "t1_dqgkp2z",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's actually in Atlantic ocean(lat:0.00 and   lon:0.00) and is a heavy tourist destination. Lot of photos on the web with this address. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511924684.0,
    "date_created": "2017-11-28",
    "time_created": "14:04:44",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgkq89",
    "parent_id": "t1_dqgkbx3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "-upvote executed-\n\nbleep boop",
    "controversiality": 0,
    "ups": 749,
    "downs": 0,
    "score": 749,
    "created": 1511915455.0,
    "date_created": "2017-11-28",
    "time_created": "11:30:55",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpggw",
    "parent_id": "t1_dqgkbx3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "https://www.gov.uk/guidance/broadband-delivery-uk\n\nIn the Uk we see this as a utility and a right. I find what the US is doing as quite crazy, it hurts your own ability to do business. ",
    "controversiality": 0,
    "ups": 102,
    "downs": 0,
    "score": 102,
    "created": 1511920188.0,
    "date_created": "2017-11-28",
    "time_created": "12:49:48",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgou0b",
    "parent_id": "t1_dqgkbx3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The same country that invented the internet is actively trying to dissuade it's populace from getting advanced degrees. ",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1511919584.0,
    "date_created": "2017-11-28",
    "time_created": "12:39:44",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgm12j",
    "parent_id": "t1_dqgkbx3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I've suggested on multiple occassions that all the rep-calling and petition signing is laughably useless. It won't change anything. The only that will is a mass cancellation of services. Nothing short of this will have any effect. Every time people claim to be unable to do so because they depend on the internet. Which is why they will win, they have society by the balls and the only move you can do against them, cutting service, no one is will to do.  \n  \nTo quote Yoda, \"That is why you fail.\"",
    "controversiality": 0,
    "ups": 115,
    "downs": 0,
    "score": 115,
    "created": 1511916787.0,
    "date_created": "2017-11-28",
    "time_created": "11:53:07",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgppfh",
    "parent_id": "t1_dqgkbx3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You're free to do something about it, and they're free to not give a fuck.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511920431.0,
    "date_created": "2017-11-28",
    "time_created": "12:53:51",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh7isx",
    "parent_id": "t1_dqgkbx3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The US may seem like its losing its freedom but Americans are making an amazing opposition to issues they care about and we see it on Reddit day in and day out. \n\nMeanwhile in India, the current government has the populace ID'ed (including Iris scan) and tagged with very invasive ID like Aadhar which has still been forced on to the people though it's deemed an invasion of privacy by the Supreme court of India. The biometric data seems to be stored insecurely with untold corporations probably gaining access to it. Indians dont seem to deserve privacy. Even SIM cards need to be connected with the Aadhar card now with cellular companies sending every person messages to remind us. \n\nAll this while our infrastructure is crumbling, inflation playing the usual truant and corruption gnawing every corner of society. We have no right to make fun of the Americans. That said this is a step in the right direction and one hopes the rest of the world sees things the same way especially the FCC.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511937444.0,
    "date_created": "2017-11-28",
    "time_created": "17:37:24",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgsp3i",
    "parent_id": "t1_dqgpo4c",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Comcast: \"Actually, we own the internet.\"",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1511923303.0,
    "date_created": "2017-11-28",
    "time_created": "13:41:43",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh3trf",
    "parent_id": "t1_dqgpxv7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> Please be honest and admit you fucked up\n\nAssuming they think they fucked up, which they wont. ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1511933813.0,
    "date_created": "2017-11-28",
    "time_created": "16:36:53",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgtqxb",
    "parent_id": "t1_dqgri3c",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You must first pay for access to VPN sites which won't be included in basic or premium bundles. They can be accessed up to 10gb a month for the low price of 24.99!",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1511924310.0,
    "date_created": "2017-11-28",
    "time_created": "13:58:30",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgs6vg",
    "parent_id": "t1_dqgri3c",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "$9.99 for accessing VPN. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511922812.0,
    "date_created": "2017-11-28",
    "time_created": "13:33:32",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgyx6w",
    "parent_id": "t1_dqgri3c",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Maybe, maybe not.\n\nISPs could design packs like a social media pack, where only endpoints going to FB/Snapchat/Whatsapp are accessible. You wouldn't even reach the VPN gateway to tunnel through it.\n\nOr they could make connections to Indian VPNs so slow that you can theoretically access all sites, but it'd not be worth the effort.\n\nThat's how bad revoking NN is.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511929275.0,
    "date_created": "2017-11-28",
    "time_created": "15:21:15",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgil8c",
    "parent_id": "t1_dqghzf4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I mean, frankly, I feel ashamed that Ajit Pai is an Indian American. \n\nBut I guess, as far is Pai is concerned, it can't be helped when you're used to sucking the ISP's dicks 24x7.",
    "controversiality": 0,
    "ups": 285,
    "downs": 0,
    "score": 285,
    "created": 1511913192.0,
    "date_created": "2017-11-28",
    "time_created": "10:53:12",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh5ylr",
    "parent_id": "t1_dqgsbdx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "They will have the authority to block your site if you're not paying them extra or they don't like your political views or for any reason at all. This gives them absolute power over all internet traffic. \n\nThe internet was designed to be neutral from the ground up. It doesn't work if it's not neutral. It's called TCP/IP and it flourishes when the net is neutral. It's is destroyed when the net is not.\n\nYes, fuck Ajit Pai. May he not be welcome in communities across the country. He's ruined after this. He doesn't know it yet though ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511935853.0,
    "date_created": "2017-11-28",
    "time_created": "17:10:53",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgtltp",
    "parent_id": "t1_dqgsbdx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You can either have one logic and zero money, or zero logic and one money.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511924175.0,
    "date_created": "2017-11-28",
    "time_created": "13:56:15",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgsrs2",
    "parent_id": "t1_dqgp8tq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "More like USA is running backwards.",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1511923374.0,
    "date_created": "2017-11-28",
    "time_created": "13:42:54",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgrdyy",
    "parent_id": "t1_dqgp8tq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "More like US wants to stay in the dark ages",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1511922030.0,
    "date_created": "2017-11-28",
    "time_created": "13:20:30",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgmzj3",
    "parent_id": "t1_dqgjurg",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">If the internet was free, it would be provided by a universal government ISP company payed for by our taxes\n\n\n\nYep. We have those too. \n\n\n BSNL is public owned Telcom that covers every part of India. It's the biggest broadband provider and 5/6 the biggest telco.  All private Telcom compete against them, that's how you keep competition alive.\n\n\n\n\nIt makes no sense that most countries don't have PSUs for these essential utilities.",
    "controversiality": 0,
    "ups": 184,
    "downs": 0,
    "score": 184,
    "created": 1511917757.0,
    "date_created": "2017-11-28",
    "time_created": "12:09:17",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgmenb",
    "parent_id": "t1_dqgjurg",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Imagine calling the government for internet problems. That would be a weird system cause I'm so used to shitty Comcast. It does make sense though. I think internet has become important enough to be considered a utility. ",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1511917167.0,
    "date_created": "2017-11-28",
    "time_created": "11:59:27",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgmegt",
    "parent_id": "t1_dqgjurg",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "accessible without restrictions or regulations is different from free. Also some governments offer free internet access in public spaces.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1511917162.0,
    "date_created": "2017-11-28",
    "time_created": "11:59:22",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh5wby",
    "parent_id": "t1_dqgrs2k",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The Throttlers will literally tear them to shreds.\n\nA friend of mine did cybersecurity for a cookie company (whose name I shan't say here, but if you eat cookies, you've eaten their cookies), and the competition is absolutely shameless about spying on them.  Once a week he would have to check the logs of everyone going into and out of the buildings, find anyone suspicious, trace their movements through the buildings with CCTV, and see if they ever might have potentially had access to the building's wiring.  Three times in a single year he found eavesdropping devices peeling interoffice e-mails away and sending them to the competition.\n\nThese were two cookie companies he was working with.  Big-time bakeries.  Operating at billions of dollar less per year than the ISPs.  If anyone can break their business model, there is literally no level to which they won't stoop to murder the face off the competition.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511935790.0,
    "date_created": "2017-11-28",
    "time_created": "17:09:50",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgu8d6",
    "parent_id": "t1_dqgrs2k",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yes, for a price. Basically, you are saying ISPs that will only sell the fast lanes.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511924777.0,
    "date_created": "2017-11-28",
    "time_created": "14:06:17",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgudew",
    "parent_id": "t1_dqgsbns",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Similar thing happened between two states in India.\n\n\nThe Now Prime Minister of India , Narendra Modi was the leader of the benefiting state out of the two",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1511924905.0,
    "date_created": "2017-11-28",
    "time_created": "14:08:25",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgy3hs",
    "parent_id": "t1_dqgsbns",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I don't know, if these companies are really that concerned about NN, they should bribe the FCC with even more money than the ISPs are now.  The FCC is clearly bought and paid for.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511928487.0,
    "date_created": "2017-11-28",
    "time_created": "15:08:07",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpn7i",
    "parent_id": "t1_dqgii5l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Well, we ARE socialists. It's the Preamble of the Indian Constitution. :P\n\nEdit: Not Article 1.",
    "controversiality": 0,
    "ups": 83,
    "downs": 0,
    "score": 83,
    "created": 1511920372.0,
    "date_created": "2017-11-28",
    "time_created": "12:52:52",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgit68",
    "parent_id": "t1_dqgii5l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Its weird, because one would think that this should be one issue were they would be on the same page as the rest of the country. Fucking, when porn sites have the moral high ground WRT net neutrality, one would assume the Trumpsters would introspect a bit.",
    "controversiality": 0,
    "ups": 175,
    "downs": 0,
    "score": 175,
    "created": 1511913428.0,
    "date_created": "2017-11-28",
    "time_created": "10:57:08",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgqsam",
    "parent_id": "t1_dqgii5l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The actual talking point they're being told to spread is that companies have agreed not to throttle users and that the FTC will punish bad behavior. **This is bullshit**.\n\nThere is no **legal** agreement saying that ISPs can't throttle you. The only legal rule in place would be that they have to be transparent about their actions and failure to do so may result in fines.\n\n**But the FTC does not have the resources or even authority to monitor and punish ISPs**\n\n>\"We are a very hard-working agency but we’re not a very big agency,” McSweeny said. “The FTC doesn’t have a lot of expertise in network engineering. We’re not the FCC in that regard.”\n>\n>“In order to make sure that this isn’t just a no-cops-on-the-beat plan, the FTC Act would actually have to be amended by Congress to eliminate the common carrier exemption,” McSweeny said.\n\n**Even the FTC Commissioner knows that repealing Net Neutrality would be a bad thing.**\n\n>“Moving from a clear ex ante rule around the open Internet and requirements that maintain an open Internet, and moving to this ex post enforcement kind of world is going to strongly tilt everything in favor of the incumbents,” McSweeny said. “It will be harder potentially for innovators and edge providers to make sure that they are being treated fairly and in a nondiscriminatory way.”\n\nSorry for the bold but I have seen these talking points popping up in every thread about Net Neutrality and the accounts are spamming it in every discussion to make it sound like nothing will change if/when NN is repealed. They have an agenda and they are doing their very best to spread it. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511921459.0,
    "date_created": "2017-11-28",
    "time_created": "13:10:59",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgre6d",
    "parent_id": "t1_dqgii5l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "India is a socialist country. It is written in the first page of the constitution.\n\nBut actually it's a mixture of capitalism and socialism depending on the sector.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511922035.0,
    "date_created": "2017-11-28",
    "time_created": "13:20:35",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgq07q",
    "parent_id": "t1_dqgpu0p",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah, but... is America \"great again\" yet?",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1511920717.0,
    "date_created": "2017-11-28",
    "time_created": "12:58:37",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpat2",
    "parent_id": "t1_dqgoggr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Same way water companies (at least in the UK) own and maintain the pipes and water facilities and we pay the upkeep on those, not the water itself.\n\nEdit: A nice [look](http://www.bournemouthwater.co.uk/your-bill/charges/where-your-money-goes.aspx) at how our money is spent by a water supply company, the £150 is a yearly bill.",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1511920035.0,
    "date_created": "2017-11-28",
    "time_created": "12:47:15",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqguur4",
    "parent_id": "t1_dqgrhuh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "How will it do that. I don't think an ISP would have anything to gain by shooting itself in the foot.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511925368.0,
    "date_created": "2017-11-28",
    "time_created": "14:16:08",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgu811",
    "parent_id": "t1_dqgs1jf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Sounds like you want a good old swamp draining...",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511924768.0,
    "date_created": "2017-11-28",
    "time_created": "14:06:08",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgs7sy",
    "parent_id": "t1_dqgqqyr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 534,
    "downs": 0,
    "score": 534,
    "created": 1511922836.0,
    "date_created": "2017-11-28",
    "time_created": "13:33:56",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgt2w8",
    "parent_id": "t1_dqgqqyr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511923674.0,
    "date_created": "2017-11-28",
    "time_created": "13:47:54",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgsafi",
    "parent_id": "t1_dqgrcwa",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> if they could sell you the air around you they would, and they would believe they are doing the world a service.\n\nCase in point: Nestle CEO believes **drinking water** should be private and is not a human right.",
    "controversiality": 0,
    "ups": 1045,
    "downs": 0,
    "score": 1045,
    "created": 1511922907.0,
    "date_created": "2017-11-28",
    "time_created": "13:35:07",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgw17z",
    "parent_id": "t1_dqgrcwa",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "its funny because I think you are right. They do believe exactly this. And I know most business types (its the mark cubans of the world who were referring to btw, Im 90% sure of this. Listen [here](https://www.youtube.com/watch?v=PX0Ituesovg) to how much he knows about net neutrality, watch [here](https://www.washingtonpost.com/news/the-switch/wp/2014/11/24/why-mark-cuban-opposes-net-neutrality-i-want-there-to-be-fast-lanes/?utm_term=.e509f73be012) read why \"Mark Cuban has become one of the loudest voices against new so-called net neutrality regulations that's not coming from a telecom company's executive suite\" ). These men have no idea about the complex mechanics behind why its not true that they don't own society (they are ignorant to things like social-contract theory, the fundamental principles that private property possible and viable). Most of these men do not contribute to this highest echelon of thought processes, despite having the abundant resources to provide that knowledge to themselves and disperse it to others. In fact the number of those that do , are the .001% of that .001% of our society. It's precisely why Elon Musk is becoming famous, for being a good guy Musk. He's the odd man out in America. Its strange to see a billionaire doing the right thing so massively.  \n\nNo what we are witnessing is the meteoric rise of a parasitic forms of capalists. Its no surprise that this is coming after Trump' election. We are in the dark ages of capitalism. This is a surreal statement, but this is the stuff you read in history books and cringe at.   ",
    "controversiality": 0,
    "ups": 83,
    "downs": 0,
    "score": 83,
    "created": 1511926520.0,
    "date_created": "2017-11-28",
    "time_created": "14:35:20",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgs255",
    "parent_id": "t1_dqgrcwa",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Gotta thank good ol'John Locke for the modern theory of property.\n\nThis is why we can't have nice things.",
    "controversiality": 0,
    "ups": 86,
    "downs": 0,
    "score": 86,
    "created": 1511922678.0,
    "date_created": "2017-11-28",
    "time_created": "13:31:18",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgs1hm",
    "parent_id": "t1_dqgrcwa",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Not even just corporate types. I think that's just most Americans in general. It either belongs to a person, a company, or the government. There is no perceived alternative. ",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1511922660.0,
    "date_created": "2017-11-28",
    "time_created": "13:31:00",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgx388",
    "parent_id": "t1_dqgrcwa",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I look at it like this. The internet is free. The companies that own the infrastructure distribute it so they deserve to charge a fee. However, their infrastructure is built by accessing government properties/infrastructure so there has to be a limit to how many companies are allowed to install cables and hardware to connect it. Since a limited amount of companies have the access, the industry needs to be regulated so that service is fair, provides competition and is available at a reasonable rate to the consumer.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511927529.0,
    "date_created": "2017-11-28",
    "time_created": "14:52:09",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgvtko",
    "parent_id": "t1_dqgrcwa",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The Internet is not owned by everyone. It's owned by no one.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511926301.0,
    "date_created": "2017-11-28",
    "time_created": "14:31:41",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh37hf",
    "parent_id": "t1_dqgtgxv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The USA has been eating itself alive for two years. I was just thinking about this, how if net neutrality is revoked in the US the \"center\" of the internet will move. The US is just boxing itself in at this point, and I hope people say enough is enough before it becomes something like a massive North Korea.",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1511933227.0,
    "date_created": "2017-11-28",
    "time_created": "16:27:07",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh05qs",
    "parent_id": "t1_dqgtgxv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's something that was talked about a lot back in the 80's and 90's.  The idea that a country like Russia might have its own completely separate internet which wouldn't be able to communicate with anyone else's \"internet.\"  It would have been pretty interesting to see such a thing evolve, maybe we'll get to find out...",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511930393.0,
    "date_created": "2017-11-28",
    "time_created": "15:39:53",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh111j",
    "parent_id": "t1_dqgs0jv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Regulatory capture is a distinct issue from net neutrality,  you're conflating them.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511931194.0,
    "date_created": "2017-11-28",
    "time_created": "15:53:14",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgypzw",
    "parent_id": "t1_dqgs0jv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I love what you just said for so many reasons. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511929088.0,
    "date_created": "2017-11-28",
    "time_created": "15:18:08",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh345m",
    "parent_id": "t1_dqgw5wf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "that's why you dont see facebook making much of a big deal about this.. or google.\n\nthey're at the adult's table now.",
    "controversiality": 0,
    "ups": 114,
    "downs": 0,
    "score": 114,
    "created": 1511933143.0,
    "date_created": "2017-11-28",
    "time_created": "16:25:43",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh3jhy",
    "parent_id": "t1_dqgv66y",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This, people forget how shitty data plans in India were couple of years ago",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1511933546.0,
    "date_created": "2017-11-28",
    "time_created": "16:32:26",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh1239",
    "parent_id": "t1_dqgv66y",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Sitting here in Canada crying reading these numbers.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511931220.0,
    "date_created": "2017-11-28",
    "time_created": "15:53:40",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqhx84g",
    "parent_id": "t1_dqgv66y",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Agreed. Without Jio the telecom companies would still be providing slow data services at a high rate. Jio completely changes the telecom industry and is now more consumer friendly than ever. Now only if they allow porting number to Jio so that I don't have to get a new number. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511971047.0,
    "date_created": "2017-11-29",
    "time_created": "02:57:27",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh1gwb",
    "parent_id": "t1_dqgv66y",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I think because of Jio, AirTel has really picked up its game. Get great speeds on 4G, coverage is probably the best and I get unlimited local and national calls. All while paying less than I used to.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511931601.0,
    "date_created": "2017-11-28",
    "time_created": "16:00:01",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqguwpd",
    "parent_id": "t1_dqgt2t2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I pay like $6 for unlimited calling, 1 gig of data everyday for 2 months. I get decent LTE speeds too here in NCR(around 40mbps). Prices in the west seem too costly.",
    "controversiality": 0,
    "ups": 104,
    "downs": 0,
    "score": 104,
    "created": 1511925418.0,
    "date_created": "2017-11-28",
    "time_created": "14:16:58",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgvijo",
    "parent_id": "t1_dqgt2t2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I pay $2 a month for unlimited calling, texts and 1Gb daily 4G data in India",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511926009.0,
    "date_created": "2017-11-28",
    "time_created": "14:26:49",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgvq4j",
    "parent_id": "t1_dqgurxd",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "$22 for 90Mbps/400Gb here. I love ACT.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1511926210.0,
    "date_created": "2017-11-28",
    "time_created": "14:30:10",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgoawv",
    "parent_id": "t1_dqgll3b",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "edit 2: A forward from the writer: \nI made this post without properly thinking through and doing proper research; I have no reason to believe that the \"normal\" speed will be the \"fast lane\" other than my own experience with wifi data. \n\nSecondly: the argument I am making may be weak - and is not properly fleshed out; apologies. I was trying to compare how hulu has this priced tiring system for movies, live tv, etc. and how, if you were not a comcast customer, you would then need to pay the hulu subscription fee, the additional price for the content you want to see, and then pay a premium to be able to access the hulu service on non-comcast networks, and then pay for premium internet access to be able to stream. \n\nThis plan would be insane, simply because of all the additional fees that you would need to pay if net neutrality is removed. That was the point I was attempting to make. Apologies. \n\nNow, the original post:\n\nIt’s laughable, because The “fast lane” is current speed; and also, if you haven’t seen Hulu’s new offers, like access to live tv, tv channels, etc. with or without ads, it’s making it apparent they are ramping up for the change now...\n\nComcast is a shareholder in Hulu, so there’s also that.\n\nEdit: shareholder; not stakeholder; thank you kind redditor!",
    "controversiality": 0,
    "ups": 740,
    "downs": 0,
    "score": 740,
    "created": 1511919061.0,
    "date_created": "2017-11-28",
    "time_created": "12:31:01",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgnpc8",
    "parent_id": "t1_dqgll3b",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Ahhh dont you love our plutocracy?",
    "controversiality": 0,
    "ups": 181,
    "downs": 0,
    "score": 181,
    "created": 1511918467.0,
    "date_created": "2017-11-28",
    "time_created": "12:21:07",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpp27",
    "parent_id": "t1_dqgll3b",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It also gives companies a reason not to upgrade their infrastructure, as this gives them \"Something to sell\". Nobody's paying extra for speed on an uncongested network. But an overtaxed shitty one?",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1511920421.0,
    "date_created": "2017-11-28",
    "time_created": "12:53:41",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgph2j",
    "parent_id": "t1_dqgll3b",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "We already have toll expressways on the interstate system, you know the one we pay for with our taxes.",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1511920204.0,
    "date_created": "2017-11-28",
    "time_created": "12:50:04",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgqnq8",
    "parent_id": "t1_dqgll3b",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Well we do have fastrak toll roads. So it's already here on the freeways. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511921336.0,
    "date_created": "2017-11-28",
    "time_created": "13:08:56",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpdw6",
    "parent_id": "t1_dqgll3b",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "They also feel a sense of pride and accomplishment",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1511920120.0,
    "date_created": "2017-11-28",
    "time_created": "12:48:40",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgqg5w",
    "parent_id": "t1_dqgpad6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Wow. I'm just a small fry, but sometime back I was thinking of having USA-based hosting for my little website, instead of in my own country. For the obvious reasons, of course. I'm gonna have to rethink that.",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1511921135.0,
    "date_created": "2017-11-28",
    "time_created": "13:05:35",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgrpis",
    "parent_id": "t1_dqgphjn",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I cant remember now but i read somewhere that government, local and federal, have given major amounts of money to ISPs to expand fiber and there hasnt been a real return on that money or expansion. ",
    "controversiality": 0,
    "ups": 61,
    "downs": 0,
    "score": 61,
    "created": 1511922338.0,
    "date_created": "2017-11-28",
    "time_created": "13:25:38",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgtceo",
    "parent_id": "t1_dqgphjn",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "A comment I saw a few minutes ago makes a good argument\n\n\"Any question over whether Internet should be regulated as a utility (e.g. Title II regulation, enforcing net neutrality) or whether it's a discretionary consumer service (\"You don't have to have internet if you don't like the service/price.\") that providers should have broad control of should be settled by examples such as this. If it's not even possible to practice medicine legally without your internet connection, it's a utility\"",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1511923924.0,
    "date_created": "2017-11-28",
    "time_created": "13:52:04",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgr8a1",
    "parent_id": "t1_dqgphjn",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Just want to add this to all protesters. When informing people (especially the ones that say I have unlimited data, I don't need to worry about data throttling) make sure they understand that unlimited data is not truly unlimited. The get roughly 20 gigs (cell phones) and 200 gigs (home) a month. Once that cap is reached, they will throttle no matter what plan you have. I think mentioning that might be more of an incentive to get people to support this movement.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1511921880.0,
    "date_created": "2017-11-28",
    "time_created": "13:18:00",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpuby",
    "parent_id": "t1_dqgn0eu",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Even worse than that, they could simply refuse to carry certain types of traffic they don't agree with.  It will start with throttling their competitors content (thinly veiled as 'express lane' service to their own) - but it won't be long before they start blocking things outright.  No more VPNs because those could be used to circumvent their blocks.  No more Bitcoin because they'll block the traffic and no one will be allowed to run a node.  Oh you want to run a Plex server from your house? Nah, blocked.",
    "controversiality": 0,
    "ups": 71,
    "downs": 0,
    "score": 71,
    "created": 1511920560.0,
    "date_created": "2017-11-28",
    "time_created": "12:56:00",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpt8h",
    "parent_id": "t1_dqgn0eu",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I think you mean services instead of users, they could always limit how fast our internet was just now on a per site level",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1511920531.0,
    "date_created": "2017-11-28",
    "time_created": "12:55:31",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgttp4",
    "parent_id": "t1_dqgpvhx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Which will devolve into \"corporations own the lines, not the US government, so freedom of speech doesn't apply\" and we are all fucked.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1511924384.0,
    "date_created": "2017-11-28",
    "time_created": "13:59:44",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgvqph",
    "parent_id": "t1_dqgpvhx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The constitution only prevents the government from censoring free speech. Without Net Neutrality, it's perfectly legal, if not ethical, to prevent showing things on your service you disagree with. Same way news stations can choose to only cover stories that agrees with their agendas, rather than having to cover everything out of anti-censorship.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511926226.0,
    "date_created": "2017-11-28",
    "time_created": "14:30:26",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh4fik",
    "parent_id": "t1_dqgr941",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And in Austin, Texas.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511934371.0,
    "date_created": "2017-11-28",
    "time_created": "16:46:11",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh567x",
    "parent_id": "t1_dqgr941",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And Portland, Oregon. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511935072.0,
    "date_created": "2017-11-28",
    "time_created": "16:57:52",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh5urm",
    "parent_id": "t1_dqgqign",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Glad you're being upvoted.\n\nI like the version that corporatists practice:\n\nSocialize the cost\n\nPrivatize the benefit\n\nWhere everyone but the private business interest shoulders the cost with less than equal benefit.\n\nExamples: Extracting natural resources, opening a football stadium, maintaining potable water sources",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511935747.0,
    "date_created": "2017-11-28",
    "time_created": "17:09:07",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgqgm7",
    "parent_id": "t1_dqgoxme",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Look at the support for NN. It's straight down party lines.\n\nEdit: first gold, thank you anonymous redditor.",
    "controversiality": 0,
    "ups": 412,
    "downs": 0,
    "score": 412,
    "created": 1511921147.0,
    "date_created": "2017-11-28",
    "time_created": "13:05:47",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgq885",
    "parent_id": "t1_dqgoxme",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "In this case, NN, it's just republicans.",
    "controversiality": 0,
    "ups": 149,
    "downs": 0,
    "score": 149,
    "created": 1511920925.0,
    "date_created": "2017-11-28",
    "time_created": "13:02:05",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgrchw",
    "parent_id": "t1_dqgoxme",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "But really it's just the republicans.",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1511921992.0,
    "date_created": "2017-11-28",
    "time_created": "13:19:52",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpkvr",
    "parent_id": "t1_dqgoxme",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah that's basically the calling card of every republican in office lately, except McCain kinda.",
    "controversiality": 0,
    "ups": 85,
    "downs": 0,
    "score": 85,
    "created": 1511920309.0,
    "date_created": "2017-11-28",
    "time_created": "12:51:49",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgtp38",
    "parent_id": "t1_dqgoxme",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">it's the god damn old farts that care about money and wanting to keep their jobs secure so they can keep making money\n\nSo...republicans?",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511924261.0,
    "date_created": "2017-11-28",
    "time_created": "13:57:41",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgrh09",
    "parent_id": "t1_dqgqn26",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "https://www.reddit.com/r/explainlikeimfive/comments/6c5e97/eli5_how_were_isps_able_to_pocket_the_200_billion/",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1511922113.0,
    "date_created": "2017-11-28",
    "time_created": "13:21:53",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgs011",
    "parent_id": "t1_dqgqn26",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "https://en.wikipedia.org/wiki/Telecommunications_Act_of_1996\n\nhttps://www.huffingtonpost.com/bruce-kushnick/the-book-of-broken-promis_b_5839394.html",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511922621.0,
    "date_created": "2017-11-28",
    "time_created": "13:30:21",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgsx7o",
    "parent_id": "t1_dqgqn26",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I live in NY, the state gave verizon a deal that for $2 Billion in tax cuts they would lay high speed fiber throughout the state. They did half the job and pocketed the rest of the cash. They should all go to jail for it as far as I'm concerned. The fact that corporations can pull this shit with tax payer dollars is insane. \n\nhttps://www.techdirt.com/articles/20131012/02124724852/decades-failed-promises-verizon-it-promises-fiber-to-get-tax-breaks-then-never-delivers.shtml",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511923519.0,
    "date_created": "2017-11-28",
    "time_created": "13:45:19",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgvbcc",
    "parent_id": "t1_dqgrq8l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Short answer; money.\n\nLong answer; Electricity is a product. Internet is a medium.\n\nElectricity is an absolute requirement for modern life.  You cannot keep food, have heat or cooling otherwise. \n It is seen as a necessity.  Things that use electricity are concrete objects that are regulated and sold by numerous entities.  Electricity, and it's basic products, came about long before politics and consumerism were what they are today.  They can't flash ads at you every time you want to turn on a light, and those sort of corporate ideas weren't a thing when the light bulb was invented.\n\nWith the internet, *you* are the product.  Your attention is a commodity that companies want to wrest from you in whatever way possible.  Being able to control and direct your attention is a multibillion dollar business.  This is also largely backed by old, short sighted rich dudes who think the internet is purely a form of entertainment.  They've never had to use the internet to find a job, to go to school, to obtain information.  They think websites are analogous to TV channels.  Something you flip through when you're bored or can simply not have if you don't want the extra bill.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511925817.0,
    "date_created": "2017-11-28",
    "time_created": "14:23:37",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgr8cc",
    "parent_id": "t1_dqgpkq6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">>Since 1961, the US has been campaigning for a global law against all drugs, both hard and soft. But by the early '80s, American society was grappling with some drug problems and opinion had grown against the \"excesses\" of the hippie generation. In 1985, the Rajiv Gandhi government buckled under the pressure and enacted a law called the Narcotic Drugs & Psychotropic Substances (NDPS) Act. \n\n>And suddenly, there was a drugs problem in India. In cities like Delhi, for instance, smack addiction grew.  Newspapers reported cases of men selling off all household goods to get money for a fix. What is significant is that instances of deviant behaviour were rare when marijuana, hashish and bhang were legal. The poorly thought-out NDPS Act had actually created a drugs problem where there was none.\n\n[Source](https://timesofindia.indiatimes.com/india/The-joint-campaign-Should-we-not-legalize-recreational-use-of-Cannabis/articleshow/17165613.cms?referral=PM)",
    "controversiality": 0,
    "ups": 105,
    "downs": 0,
    "score": 105,
    "created": 1511921881.0,
    "date_created": "2017-11-28",
    "time_created": "13:18:01",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgq64j",
    "parent_id": "t1_dqgpkq6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Dear God that was such a stupid decision. \nI could ride for 10 minutes and pluck weed from the roadside on the outskirts of this city right now. On Holi it's deserved in drinks EVERYWHERE. Tons of sadhus smoke it freely. But it's illegal, ok. ",
    "controversiality": 0,
    "ups": 567,
    "downs": 0,
    "score": 567,
    "created": 1511920869.0,
    "date_created": "2017-11-28",
    "time_created": "13:01:09",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgtyu9",
    "parent_id": "t1_dqgpkq6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "For those interested - India has an *extremely* long history with the use of cannabis both as a recreational drug and as a holy sacrament in honour of Shiva, who is thought to have favored the plant. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511924522.0,
    "date_created": "2017-11-28",
    "time_created": "14:02:02",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh17yo",
    "parent_id": "t1_dqgpkq6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "In some states in India marijuana is legal, like Orissa (source: reddit ama from member of parliament from orissa https://www.reddit.com/r/india/comments/2z493l/hello_rindia_i_am_tathagata_satpathy_member_of/cpfjuib/)",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511931371.0,
    "date_created": "2017-11-28",
    "time_created": "15:56:11",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgrgic",
    "parent_id": "t1_dqgpkq6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah, life's arguably not bad for a good chunk of us in present-day India, but it's a cosmic, statistical joke to be alive in that fleeting moment when weed is illegal! Oh well...",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511922099.0,
    "date_created": "2017-11-28",
    "time_created": "13:21:39",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh0jnn",
    "parent_id": "t1_dqgpkq6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "In India you can buy and smoke hash and no police or govt can you stop you from doing that. It's in our religion after all. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511930746.0,
    "date_created": "2017-11-28",
    "time_created": "15:45:46",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgoqfs",
    "parent_id": "t1_dqgnx2z",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I know you joke but I am surprised that many are ok with being in their bubble despite a shitstorm around. ",
    "controversiality": 0,
    "ups": 141,
    "downs": 0,
    "score": 141,
    "created": 1511919486.0,
    "date_created": "2017-11-28",
    "time_created": "12:38:06",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpbtl",
    "parent_id": "t1_dqgnx2z",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Let the free freedom market decide!",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1511920063.0,
    "date_created": "2017-11-28",
    "time_created": "12:47:43",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpmot",
    "parent_id": "t1_dqgnx2z",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The US is still in a great position and the losses we have (healthcare, internet, and drugs) are easily fixable. I refuse to give up on my country just because its been temporarily taken over by retards.",
    "controversiality": 0,
    "ups": 89,
    "downs": 0,
    "score": 89,
    "created": 1511920357.0,
    "date_created": "2017-11-28",
    "time_created": "12:52:37",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgs1yz",
    "parent_id": "t1_dqgplp8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Dont be so sure. The world is realizing how stupid america is being. And already started ignoring their actions. The Paris Agreement? You know how America is the only one who opted out of it.",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1511922673.0,
    "date_created": "2017-11-28",
    "time_created": "13:31:13",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgsen8",
    "parent_id": "t1_dqgp6qi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Don't waste your freedom money on an iPhone, our representatives tell us",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511923018.0,
    "date_created": "2017-11-28",
    "time_created": "13:36:58",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpxe3",
    "parent_id": "t1_dqgpkqs",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Sometimes?",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1511920642.0,
    "date_created": "2017-11-28",
    "time_created": "12:57:22",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgu8mi",
    "parent_id": "t1_dqgpkqs",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Our ISPs in Canada are horrible though... Oligopoly ruled by 3 major players. We have the most expensive mobile phone plans in the G7.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511924784.0,
    "date_created": "2017-11-28",
    "time_created": "14:06:24",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgun6y",
    "parent_id": "t1_dqgt8xj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "There are other countries? \n\n— America probably.",
    "controversiality": 0,
    "ups": 207,
    "downs": 0,
    "score": 207,
    "created": 1511925167.0,
    "date_created": "2017-11-28",
    "time_created": "14:12:47",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgv9df",
    "parent_id": "t1_dqgt8xj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Any American who says we are currently the greatest country on earth is delusional",
    "controversiality": 0,
    "ups": 56,
    "downs": 0,
    "score": 56,
    "created": 1511925765.0,
    "date_created": "2017-11-28",
    "time_created": "14:22:45",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgu6o1",
    "parent_id": "t1_dqgsqdq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Think about it in terms of acceleration rather than position. Which way are things moving? Where things are shitty but improving I say good on ya'. Where you start rolling back progress that you've made is much worse in my mind.",
    "controversiality": 0,
    "ups": 105,
    "downs": 0,
    "score": 105,
    "created": 1511924733.0,
    "date_created": "2017-11-28",
    "time_created": "14:05:33",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgvb8u",
    "parent_id": "t1_dqgsqdq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Isn't that saying something though? That a country that you think is \"corrupted\" is holding a position to support NN(which benefits every citizen), whereas the US government isn't for how much \"better\" it is in other respects to the rights of citizens? ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511925815.0,
    "date_created": "2017-11-28",
    "time_created": "14:23:35",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgup6s",
    "parent_id": "t1_dqgsqdq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Every nation has its issues, some more than others, but keep in mind if we go about calling ourselves \"the best\" we should really keep in mind what the bar for that is, and look to which areas need improvement.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511925220.0,
    "date_created": "2017-11-28",
    "time_created": "14:13:40",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpbpo",
    "parent_id": "t1_dqgmof5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "We may need to call the emergency services here. What's that number again? Oh, I remember! 0118-999-88199-9119725... 3.",
    "controversiality": 0,
    "ups": 62,
    "downs": 0,
    "score": 62,
    "created": 1511920060.0,
    "date_created": "2017-11-28",
    "time_created": "12:47:40",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpe2f",
    "parent_id": "t1_dqgmxgx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "upvote for IT Crowd :)",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1511920125.0,
    "date_created": "2017-11-28",
    "time_created": "12:48:45",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgli94",
    "parent_id": "t1_dqgkq89",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[\"upvote executed\"](https://i.imgur.com/wcaMZCI.jpg)",
    "controversiality": 0,
    "ups": 363,
    "downs": 0,
    "score": 363,
    "created": 1511916256.0,
    "date_created": "2017-11-28",
    "time_created": "11:44:16",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgne1o",
    "parent_id": "t1_dqgkq89",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I would like a sub dedicated to your username.",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1511918158.0,
    "date_created": "2017-11-28",
    "time_created": "12:15:58",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgml5l",
    "parent_id": "t1_dqgkq89",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's a Russian bot! They try to undermine our pure, American, capitalist, way of life by upvoting opinions in an attempt to destabilize us!",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1511917351.0,
    "date_created": "2017-11-28",
    "time_created": "12:02:31",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgr2sl",
    "parent_id": "t1_dqgpggw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> In the Uk we see this as a utility and a right. I find what the US is doing as quite crazy, it hurts your own ability to do business. \n\nWe also have a PM that is hell bent on banning encryption - I wouldn't call that free. Just watch what happens when the EU laws get transferred over to UK laws, I'll bet you changes that ban encryption or something along those lines are silently added.",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1511921736.0,
    "date_created": "2017-11-28",
    "time_created": "13:15:36",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpqsk",
    "parent_id": "t1_dqgpggw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Its a country that's completely lost itself within capitalism. The people are the only ones able to change anything but the governments done a good job convincing them everything's OK.",
    "controversiality": 0,
    "ups": 91,
    "downs": 0,
    "score": 91,
    "created": 1511920467.0,
    "date_created": "2017-11-28",
    "time_created": "12:54:27",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgw4r2",
    "parent_id": "t1_dqgou0b",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Good thing they have all those guns in case their government becomes hostile.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511926613.0,
    "date_created": "2017-11-28",
    "time_created": "14:36:53",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgnhht",
    "parent_id": "t1_dqgm12j",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Easy to say, not easy to do. \n\nIn this day and age, it's like telling someone to cancel their electricity to protest discriminatory tariffs on particular usages.",
    "controversiality": 0,
    "ups": 258,
    "downs": 0,
    "score": 258,
    "created": 1511918255.0,
    "date_created": "2017-11-28",
    "time_created": "12:17:35",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgp5tc",
    "parent_id": "t1_dqgm12j",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Mass cancellation of service only strengthens the argument that the internet is not a standard form of communication though. Boycott companies that oppose net neutrality, but the whole point of net neutrality is to designate the internet as a standard form of communication.",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1511919900.0,
    "date_created": "2017-11-28",
    "time_created": "12:45:00",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgoypf",
    "parent_id": "t1_dqgm12j",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I assume you've cancelled your subscription then?",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1511919710.0,
    "date_created": "2017-11-28",
    "time_created": "12:41:50",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpm56",
    "parent_id": "t1_dqgm12j",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "What the rep calling does is get congress to get off their fat lazy asses and do their job. Congress hates when they get inundated with calls to do their job. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511920342.0,
    "date_created": "2017-11-28",
    "time_created": "12:52:22",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqguagu",
    "parent_id": "t1_dqgtqxb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Damn.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1511924829.0,
    "date_created": "2017-11-28",
    "time_created": "14:07:09",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgmsos",
    "parent_id": "t1_dqgil8c",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Why are you feeling ashamed for a person who is not an Indian citizen?",
    "controversiality": 0,
    "ups": 147,
    "downs": 0,
    "score": 147,
    "created": 1511917567.0,
    "date_created": "2017-11-28",
    "time_created": "12:06:07",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpmyf",
    "parent_id": "t1_dqgil8c",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Ajit Pai is as American as the apple pie. Born and raised murican. Nothing to do with India.",
    "controversiality": 0,
    "ups": 61,
    "downs": 0,
    "score": 61,
    "created": 1511920365.0,
    "date_created": "2017-11-28",
    "time_created": "12:52:45",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgr9k7",
    "parent_id": "t1_dqgil8c",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Oh trust me, we Indian-Americans are ashamed of him too. Not fun seeing all the unnecessary casual racism against him here on Reddit either ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1511921913.0,
    "date_created": "2017-11-28",
    "time_created": "13:18:33",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgovf7",
    "parent_id": "t1_dqgil8c",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Why are you ashamed? Him being of Indian descent has nothing to do with his decisions.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1511919622.0,
    "date_created": "2017-11-28",
    "time_created": "12:40:22",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpwlt",
    "parent_id": "t1_dqgmzj3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I mean BSNL is pretty bad, but they're often in places no one else is.",
    "controversiality": 0,
    "ups": 61,
    "downs": 0,
    "score": 61,
    "created": 1511920620.0,
    "date_created": "2017-11-28",
    "time_created": "12:57:00",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgupky",
    "parent_id": "t1_dqgmzj3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "So in order to maintain a fair competitive market, we should establish publicly owned services which private companies are forced to compete against.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511925231.0,
    "date_created": "2017-11-28",
    "time_created": "14:13:51",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgmlee",
    "parent_id": "t1_dqgmenb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "In an alternate universe.\n\n\"We're sorry, you have only paid for electricity to be provided to the basic appliances. To get electricity access to luxury items like TV and phone, you need to subscribe to the luxury internet plan\" ",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1511917358.0,
    "date_created": "2017-11-28",
    "time_created": "12:02:38",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgt70s",
    "parent_id": "t1_dqgpn7i",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "We switched to Democratic Socialism from pure Socialism in 1990's, so basically we kinda embraced a bit of capitalism from then and it seems to be working much much better than just socialism for us. \n\nMaybe, just maybe, the world isn't binary and we all should stop bitching about socialism or capitalism and find what's appropriate according to individual nations",
    "controversiality": 0,
    "ups": 48,
    "downs": 0,
    "score": 48,
    "created": 1511923782.0,
    "date_created": "2017-11-28",
    "time_created": "13:49:42",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgu3nk",
    "parent_id": "t1_dqgpn7i",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Preamble, not the first article.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511924650.0,
    "date_created": "2017-11-28",
    "time_created": "14:04:10",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqglj9i",
    "parent_id": "t1_dqgit68",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Trumpets follow trump. Trump follows money. Money came from ISP's. There's no moral/logical thought in any of their decision-making ",
    "controversiality": 0,
    "ups": 147,
    "downs": 0,
    "score": 147,
    "created": 1511916285.0,
    "date_created": "2017-11-28",
    "time_created": "11:44:45",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgod9v",
    "parent_id": "t1_dqgit68",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Most people i know who voted for trump support Net Neutrality. Honestly it’s just T_D that’s against it",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1511919126.0,
    "date_created": "2017-11-28",
    "time_created": "12:32:06",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpvi8",
    "parent_id": "t1_dqgpat2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "In the US we pay for how much water we use.  That's an entirely fine principle and has zilch to do with net neutrality.  ISPs can charge on a speed basis, on a data use basis, to install new lines, etc.  They just cannot charge me more because I want to use a particular website (e.g. Facebook).",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1511920591.0,
    "date_created": "2017-11-28",
    "time_created": "12:56:31",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgq69i",
    "parent_id": "t1_dqgpat2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Huh? We do? But we pay different depending on how much water you use like how many people are in the property....",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511920872.0,
    "date_created": "2017-11-28",
    "time_created": "13:01:12",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgubn4",
    "parent_id": "t1_dqgu811",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah, except Trump's only contribution to swamp draining is dumping tons more sewage and crap.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511924860.0,
    "date_created": "2017-11-28",
    "time_created": "14:07:40",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgvljd",
    "parent_id": "t1_dqgs7sy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 211,
    "downs": 0,
    "score": 211,
    "created": 1511926088.0,
    "date_created": "2017-11-28",
    "time_created": "14:28:08",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgxb80",
    "parent_id": "t1_dqgs7sy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1511927742.0,
    "date_created": "2017-11-28",
    "time_created": "14:55:42",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgvybu",
    "parent_id": "t1_dqgs7sy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1511926436.0,
    "date_created": "2017-11-28",
    "time_created": "14:33:56",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgxrqk",
    "parent_id": "t1_dqgs7sy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511928172.0,
    "date_created": "2017-11-28",
    "time_created": "15:02:52",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgzozz",
    "parent_id": "t1_dqgt2w8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511929979.0,
    "date_created": "2017-11-28",
    "time_created": "15:32:59",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgvvli",
    "parent_id": "t1_dqgsafi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Nestle is basically every villain from Captain Planet.",
    "controversiality": 0,
    "ups": 620,
    "downs": 0,
    "score": 620,
    "created": 1511926357.0,
    "date_created": "2017-11-28",
    "time_created": "14:32:37",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgw7g7",
    "parent_id": "t1_dqgsafi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "If I recall correctly they are also linked to abusive child labor in African nations",
    "controversiality": 0,
    "ups": 82,
    "downs": 0,
    "score": 82,
    "created": 1511926686.0,
    "date_created": "2017-11-28",
    "time_created": "14:38:06",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgvsir",
    "parent_id": "t1_dqgsafi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That is genuinely scary.",
    "controversiality": 0,
    "ups": 108,
    "downs": 0,
    "score": 108,
    "created": 1511926272.0,
    "date_created": "2017-11-28",
    "time_created": "14:31:12",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgwwzy",
    "parent_id": "t1_dqgsafi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The oligarchy has already convinced most Americans that healthcare is not a human right, so why not drinking water next?",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1511927362.0,
    "date_created": "2017-11-28",
    "time_created": "14:49:22",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh4b9a",
    "parent_id": "t1_dqgsafi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's not what he said at all. Don't get me wrong he is an awful shit... and does awful things but lets not spread misinformation here.  He said \n>\"The water you need for survival is a human right, and must be made available to everyone, wherever they are, even if they cannot afford to pay for it.\" \n>\"I do not deny that clean and safe water to drink or for basic hygiene is a human right. Of course it is. However, I do not think it is right that some people in the world do not have access to a clean, safe supply when others can use excess amounts for non-essential purposes without bearing a fairer cost for the infrastructure needed to supply it. When we give water a value, we use it more carefully, and this does not mean privatization.\"\n\nThe clip where he is talking about it is very much out of context. \nAgain, nestle are still shity and evil.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511934264.0,
    "date_created": "2017-11-28",
    "time_created": "16:44:24",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgw0nz",
    "parent_id": "t1_dqgsafi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Look up what he actually said. Like many of these sound bytes, that's not an accurate representation of his position.\n\nMy summary would be that he believes people have the right to the amount they need to live comfortably. They don't have a right to an unlimited supply, because that means that water (a very valuable resource) is wasted.\n\nWhether you agree with that or not is up to you, but it's far more \nnuanced than you've presented it.",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1511926504.0,
    "date_created": "2017-11-28",
    "time_created": "14:35:04",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh6ccf",
    "parent_id": "t1_dqgw17z",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I have never despised capitalism in the form of the money-grubbing, fearmongering corporate oligarchy more than I do today. It's disgusting and wish them all the worst. ",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1511936240.0,
    "date_created": "2017-11-28",
    "time_created": "17:17:20",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgwj9o",
    "parent_id": "t1_dqgw17z",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Dude, yes. Also, zizek ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511926998.0,
    "date_created": "2017-11-28",
    "time_created": "14:43:18",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgvv1k",
    "parent_id": "t1_dqgs255",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Don't blame all this shit on Locke!",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1511926341.0,
    "date_created": "2017-11-28",
    "time_created": "14:32:21",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgu98a",
    "parent_id": "t1_dqgs255",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah but he also gave us the basis for our constitution so there is that, which is nice.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1511924799.0,
    "date_created": "2017-11-28",
    "time_created": "14:06:39",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgs8y2",
    "parent_id": "t1_dqgs1hm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Not just most Americans - this belief is a core component of the ideology of Liberalism (as in the political and social philosophy underlying capitalism, not \"libruls\" in the American sense)",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1511922866.0,
    "date_created": "2017-11-28",
    "time_created": "13:34:26",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgucey",
    "parent_id": "t1_dqgs1hm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I would actually agree with that myself, just with the theory being “government” means *everyone* owns said thing, and we elect officials who are charged with preserving/fairly distributing those things. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1511924880.0,
    "date_created": "2017-11-28",
    "time_created": "14:08:00",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh6pjp",
    "parent_id": "t1_dqh37hf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> The USA has been eating itself alive for two years.\n\nErm... a bit longer than that. People need to stop thinking Trump was some radical unannounced surprising harbinger of death when he's more like the natural consequence of decades of political dysfunction.",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1511936609.0,
    "date_created": "2017-11-28",
    "time_created": "17:23:29",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh2sh1",
    "parent_id": "t1_dqh05qs",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's not really much of a stretch to imagine. All the protocols are open, and countries like NK and Cuba, and formerly China are pretty well walled-off already. I could build you your very own internet if you wanted it. It's just clients, servers, and routers.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511932844.0,
    "date_created": "2017-11-28",
    "time_created": "16:20:44",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgzn9d",
    "parent_id": "t1_dqgypzw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I love that you are the alternate version of my screen name. great year, 1985. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511929939.0,
    "date_created": "2017-11-28",
    "time_created": "15:32:19",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh9ux7",
    "parent_id": "t1_dqh345m",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "tldr: The FCC is about to kill net neutrality. We’re protesting NATIONWIDE on Dec 7th to stop them. \n\nTLDR LINKS\nhttps://www.reddit.com/r/Marchfornetneutrality\n\nhttp://www.verizonprotests.com\n\nWHAT'S GOING ON? \nComcast, AT&T, Verizon and the National Cable & Telecommunications Association (NCTA) have spent $572 million on attempts to influence the FCC and other government agencies since 2008\n\nImagine if you couldn't view comments critical of Comcast on Reddit, Facebook, or YouTube while using Comcast internet. Want to use Netflix and not Hulu, you're on Comcast so it will be half as fast as it is now.\n\nNet Neutrality is the basic idea that all Internet traffic should be treated equally. That means ISPs shouldn’t be allowed to block content or charge extra for faster speeds. Current rules implemented in 2015 prohibit this behavior and subject ISPs to utility-style regulations under Title II of the Communications Act of 1934.\n\nThe Federal Communications Commission (FCC) just announced its plan to slash net neutrality rules, allowing ISPs like Verizon to block apps, slow websites, and charge fees to control what you see & do online. They vote December 14th. People from across the political spectrum are outraged, so we’re planning to protest at Verizon retail stores across the country on December 7, one week before the vote and at the peak of the busy Holiday shopping season.\n\nWHAT YOU CAN DO! #1\nIf you live nearby or can make it to DC, GO TO THE MARCH FOR NET NEUTRALITY December 7th. More info at https://www.reddit.com/r/marchfornetneutrality\n\nWHAT YOU CAN DO! #2\nProtest in front of your local Verizon store. Go to http://www.verizonprotests.com/ for more info on the December 7th protests near you! Feet on the ground, show your support for net neutrality. \n\nWHAT YOU CAN DO! #3\nIf you're using Comcast, AT&T, or Verizon SWITCH YOUR CARRIER (if you can). Comment on their Twitter feeds, tell them why you're leaving, blow up social media. These companies have spent millions lobbying to influence the government and gain more control of what and how you use the internet. \n\nWHAT YOU CAN DO! #4\nPlaytime is over. Spread this message, talk with a friend, call your representative, do SOMETHING. If net neutrality is changed any actions now can help the appeal lawyers of the future. Don't sit on the sidelines, this is America, let your voice and opinion be expressed. Let others know how important this issue is. \n\nMORE INFORMATION \n\nWHAT’S HAPPENING? The Federal Communications Commission (FCC) just announced its plan to slash net neutrality rules, allowing ISPs like Verizon to block apps, slow websites, and charge fees to control what you see & do online. They vote December 14th. People from across the political spectrum are outraged, so we’re planning to protest at Verizon retail stores across the country on December 7, one week before the vote and at the peak of the busy Holiday shopping season. We'll demand that our members of Congress take action to stop Verizon's puppet FCC from killing net neutrality.\n\nWHAT’S NET NEUTRALITY? Net neutrality is the basic principle that has made the Internet into what it is today. It prevents big Internet Service Providers (like Verizon) from charging extra fees, engaging in censorship, or controlling what we see and do on the web by throttling websites, apps, and online services.\n\nWHY VERIZON STORES? The new chairman of the FCC, Ajit Pai, is a former top lawyer for Verizon, and the company has been spending millions on lobbying and lawsuits to kill net neutrality so they can gauge us all for more money. By protesting at Verizon stores, we’re shining light on the corruption and demanding that our local do something about it. Only Congress has the power to stop Verizon's puppet FCC, so at the protests we'll be calling and tweeting at legislators, and in cities where it's possible we'll march from Verizon stores to lawmakers offices.\n\nWHAT ARE OUR DEMANDS? Ajit Pai is clearly still working for Verizon, not the public. But he still has to answer to Congress. So we’re calling on our lawmakers to do their job overseeing the FCC and speak out against Ajit Pai’s plan to gut Title II net neutrality protections and give Verizon and other giant ISPs everything on their holiday wishlist. \n\nHOW CAN I JOIN? Click here http://www.verizonprotests.com/ and you’ll find an interactive map where you can see if there is already a protest planned near you. If not, you can sign up to host one, and we’ll send you materials to make it easy and help you recruit others in your area. These protests will be quick, fun, and 100% legal. If you can’t attend a protest on December 7th, you can still help defend net neutrality by calling your lawmakers and spreading the word on social media. You can also sign up to host a meeting with your members of Congress, or volunteer for our texting team to help turn people out for these protests.\n\n",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1511939981.0,
    "date_created": "2017-11-28",
    "time_created": "18:19:41",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh89kk",
    "parent_id": "t1_dqh1239",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's ok. They'll receive their 'freedom' just like us. Wind / Freedom Mobile didn't do much to shake up the Big 3",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511938228.0,
    "date_created": "2017-11-28",
    "time_created": "17:50:28",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgvetj",
    "parent_id": "t1_dqguwpd",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Holy mother of God, 40 is not decent it's awesome. What network, jio , airtel or vodafone ?",
    "controversiality": 0,
    "ups": 56,
    "downs": 0,
    "score": 56,
    "created": 1511925910.0,
    "date_created": "2017-11-28",
    "time_created": "14:25:10",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgx88p",
    "parent_id": "t1_dqguwpd",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I pay $150 a month for 25mbps down and 150gb data a month. My upload speed is less than 1mbps.\n\nWestern Canada here",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511927662.0,
    "date_created": "2017-11-28",
    "time_created": "14:54:22",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgwa7c",
    "parent_id": "t1_dqgvijo",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I pay 5$ / per month for unlimited talktime and 1 GB per day. Are you using Jio? ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511926760.0,
    "date_created": "2017-11-28",
    "time_created": "14:39:20",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgwdi1",
    "parent_id": "t1_dqgvq4j",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Hyderabad or Bangalore?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511926847.0,
    "date_created": "2017-11-28",
    "time_created": "14:40:47",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgq585",
    "parent_id": "t1_dqgoawv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Lol fast lane.  Advertise 768k as \"broadband\" which is what att sends me in the mail",
    "controversiality": 0,
    "ups": 100,
    "downs": 0,
    "score": 100,
    "created": 1511920845.0,
    "date_created": "2017-11-28",
    "time_created": "13:00:45",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgp9ao",
    "parent_id": "t1_dqgoawv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "We're all \"stake holders\" in Hulu, arguably. Did you mean shareholder? ",
    "controversiality": 0,
    "ups": 161,
    "downs": 0,
    "score": 161,
    "created": 1511919995.0,
    "date_created": "2017-11-28",
    "time_created": "12:46:35",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgst2w",
    "parent_id": "t1_dqgoawv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">Comcast is a shareholder in Hulu a so there's that.\n\nGreat, so Comcast users would only have to pay extra for using Hulu's competitors.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511923410.0,
    "date_created": "2017-11-28",
    "time_created": "13:43:30",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpa1c",
    "parent_id": "t1_dqgnpc8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "you keep pluto out of this, ok?",
    "controversiality": 0,
    "ups": 145,
    "downs": 0,
    "score": 145,
    "created": 1511920016.0,
    "date_created": "2017-11-28",
    "time_created": "12:46:56",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpvlv",
    "parent_id": "t1_dqgnpc8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Is plutocracy another word for oligarchy, or are there actual differences between the two? ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1511920593.0,
    "date_created": "2017-11-28",
    "time_created": "12:56:33",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgplsx",
    "parent_id": "t1_dqgnpc8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Call it what it is: Capitalism. A system that exists solely to squeeze out profit as much as possible, to hell with everything else.\n\nIf that means crushing consumer protections and competition, you're making the invisible hand happy.",
    "controversiality": 0,
    "ups": 82,
    "downs": 0,
    "score": 82,
    "created": 1511920334.0,
    "date_created": "2017-11-28",
    "time_created": "12:52:14",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgrzer",
    "parent_id": "t1_dqgqnq8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The FasTrak roads are already paid for by our taxes. So then we have to pay again to use it? ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511922606.0,
    "date_created": "2017-11-28",
    "time_created": "13:30:06",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgxti4",
    "parent_id": "t1_dqgrpis",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "400 Billion and counting.\n\nOriginally the telecoms which became the ISPs, were capped at a certain percentage of profit they were allowed by law to \"earn\".\n\nIn the 1990s it was determined that the aging copper network would have insufficient bandwidth to support the requirements of the burgeoning Internet era. \n\nA new, national fiber optic network was needed.\n\nThe telecoms successfully managed to convince the FCC and other lawmakers, that they could only invest in this infrastructure if they were allowed to make more profit.\n\nThus the capped profits were overturned and telecoms began to increase prices while charging consumers for their own taxes and fees and set ludicrous markups on surcharges (services like caller ID and call waiting costs pennies, yet these services were charged monthly to consumers at a markup of 40,000% or more).\n\nThese telecoms also reaped billions in tax deductions and deferments (not to mention government assistance enacting laws and regulations to ensure geographic monopolies), all while virtually no work was done on a fiber optic network.\n\nThey did eventually roll out ISDN, however as it relies on copper it was already outdated at the time of implementation.\n\nAs a result, the US does not rank in the top 20 countries for internet speed, connectivity and reliability. AND WE INVENTED THE INTERNET!!! \n\nCheck your phone or internet bill. All those surcharge and fees you pay every month? \n\nMost of that is pure profit for the telecoms they are allowed to keep, because they lied about investing in a fiber optic network nearly 30 years ago and have never been called out on.\n\nOh, btw the FCC redefined 'Broadband' in 2015 to mean 25 mbps. This year, the FCC proposed to lower that definition to just 10mbps.\n\nSo, soon you will be paying for \"Broadband\" speed which is 2.5 times less than it was just two years ago, all while the people continue to pay into a 400 billion dollar fraud for a fiber optic network we will never receive. ",
    "controversiality": 0,
    "ups": 56,
    "downs": 0,
    "score": 56,
    "created": 1511928219.0,
    "date_created": "2017-11-28",
    "time_created": "15:03:39",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgt3c7",
    "parent_id": "t1_dqgrpis",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yes, billions in fact ",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1511923687.0,
    "date_created": "2017-11-28",
    "time_created": "13:48:07",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgudv5",
    "parent_id": "t1_dqgrpis",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "So, they’re not even accountable for the money in any way?",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1511924918.0,
    "date_created": "2017-11-28",
    "time_created": "14:08:38",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqguj8n",
    "parent_id": "t1_dqgtceo",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yup, I would loooooove all internet providers to be regulated as a utility. We wouldn't be having this net neutrality issue if that was the case. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1511925063.0,
    "date_created": "2017-11-28",
    "time_created": "14:11:03",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh1fsz",
    "parent_id": "t1_dqgtceo",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It’s a meta utility. The utility of utilities. Which utility can we do business with without the internet? How do utilities collect data on usage, troubleshoot issues, schedule technicians or offer support? \nWhat utility cannot be supplemented by an auxiliary feed or alternate source?",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511931573.0,
    "date_created": "2017-11-28",
    "time_created": "15:59:33",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgsjc1",
    "parent_id": "t1_dqgr8a1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "What does this have to do with anything? It's already happening, it has nothing to do with net neutrality. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1511923143.0,
    "date_created": "2017-11-28",
    "time_created": "13:39:03",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgt8si",
    "parent_id": "t1_dqgpuby",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I mean, right now NetNeutrality content is being removed from Tumblr, or people are being auto-unfollowed. Why? Because Verizon is the owner of Yahoo is the owner of Tumblr. Just a small taste of what they'll be doing once this law passes. ",
    "controversiality": 0,
    "ups": 57,
    "downs": 0,
    "score": 57,
    "created": 1511923829.0,
    "date_created": "2017-11-28",
    "time_created": "13:50:29",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgr4qg",
    "parent_id": "t1_dqgpuby",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I lost the motivation to fix my minecraft server, why bother if they'll just find some way to block it...",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1511921789.0,
    "date_created": "2017-11-28",
    "time_created": "13:16:29",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgs0tq",
    "parent_id": "t1_dqgqgm7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Ya, I think a lot of people get confused about this because Obama appointed Ajit Pai. Obama only did that because it is traditional for the Executive to take advice from the opposing party on their members for the FCC board. The Republican leadership proposed two members, one was Ajit Pai. This is not Obama's fault. He kept the FCC 3-2 in favor of net neutrality, Trump has the FCC at 3-2 opposed (split on party lines). This is absolutely a partisan issue.",
    "controversiality": 0,
    "ups": 238,
    "downs": 0,
    "score": 238,
    "created": 1511922642.0,
    "date_created": "2017-11-28",
    "time_created": "13:30:42",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgs052",
    "parent_id": "t1_dqgqgm7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Can any republican party voters chime in and explain here? Are you okay with what's happening?",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1511922624.0,
    "date_created": "2017-11-28",
    "time_created": "13:30:24",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgsry7",
    "parent_id": "t1_dqgq885",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I lean republican,  I've seen the votes on this issue,  the republicans sold us out to ISPs,  plain and simple",
    "controversiality": 0,
    "ups": 90,
    "downs": 0,
    "score": 90,
    "created": 1511923379.0,
    "date_created": "2017-11-28",
    "time_created": "13:42:59",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgtctn",
    "parent_id": "t1_dqgpkvr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "McCain voted against NN",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511923936.0,
    "date_created": "2017-11-28",
    "time_created": "13:52:16",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgsie3",
    "parent_id": "t1_dqgrh09",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Thank you, now I understand the context of the statement. It sounds more like the crony capitalism where the government tried to subsidize a desired behavior but without any accountability. It seems due to poor execution it is clear the telcos retained ownership of the cables. ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1511923117.0,
    "date_created": "2017-11-28",
    "time_created": "13:38:37",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgupqj",
    "parent_id": "t1_dqgr8cc",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's pretty much a well established fact at this point that legalizing weed decreases rate of addiction to harder drugs, but nobody seems to be able to get that through their head.",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1511925236.0,
    "date_created": "2017-11-28",
    "time_created": "14:13:56",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgsdh6",
    "parent_id": "t1_dqgr8cc",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "God bless Dr. Gandhi who's been trying to ammend the bill tho - https://www.indiatimes.com/news/india/a-private-member-s-bill-to-legalise-marijuana-to-be-tabled-in-parliament-during-winter-session-334110.html",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1511922987.0,
    "date_created": "2017-11-28",
    "time_created": "13:36:27",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgqbm3",
    "parent_id": "t1_dqgq64j",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Good ol' India ",
    "controversiality": 0,
    "ups": 150,
    "downs": 0,
    "score": 150,
    "created": 1511921014.0,
    "date_created": "2017-11-28",
    "time_created": "13:03:34",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgqnmv",
    "parent_id": "t1_dqgq64j",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "TIL Bhang has weed, thanks fellow citizen.",
    "controversiality": 0,
    "ups": 91,
    "downs": 0,
    "score": 91,
    "created": 1511921333.0,
    "date_created": "2017-11-28",
    "time_created": "13:08:53",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgqytm",
    "parent_id": "t1_dqgq64j",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Thankfully, marijuana laws are barely enforced in India and where my family and cousins are from (Bangalore) everyone thirty and under smokes like a motherfucker without a care in the world ",
    "controversiality": 0,
    "ups": 79,
    "downs": 0,
    "score": 79,
    "created": 1511921632.0,
    "date_created": "2017-11-28",
    "time_created": "13:13:52",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpnci",
    "parent_id": "t1_dqgoqfs",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Because theyre spoonfed that everywhere else is third world or doesn't enjoy the freedoms people do elsewhere",
    "controversiality": 0,
    "ups": 160,
    "downs": 0,
    "score": 160,
    "created": 1511920375.0,
    "date_created": "2017-11-28",
    "time_created": "12:52:55",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpsni",
    "parent_id": "t1_dqgoqfs",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah honestly if this goes how I think it's going to go, I'm strongly considering starting my international travels a couple years early ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511920514.0,
    "date_created": "2017-11-28",
    "time_created": "12:55:14",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpzni",
    "parent_id": "t1_dqgoqfs",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I for one am super unhappy in my shitstorm bubble and am anxiously waiting the opportunity to leave this disastrous country behind. Don't confuse helplessness with complacency. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1511920701.0,
    "date_created": "2017-11-28",
    "time_created": "12:58:21",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgr4wt",
    "parent_id": "t1_dqgpmot",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The people in the government are retards but they are controlled by smart people who have made a very concentrated effort in the past three or four decades to turn the country into an oligarchy. We've been an oligarchy for likely longer than you or I have been alive. ",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1511921793.0,
    "date_created": "2017-11-28",
    "time_created": "13:16:33",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpso4",
    "parent_id": "t1_dqgpmot",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Not so much retards, just that they don't give a fuck about the well being of their country and the world, all they care about is filling their own pockets. I think greedy senseless motherfuckers is a better way to name them.",
    "controversiality": 0,
    "ups": 74,
    "downs": 0,
    "score": 74,
    "created": 1511920515.0,
    "date_created": "2017-11-28",
    "time_created": "12:55:15",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgzcsj",
    "parent_id": "t1_dqgpmot",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It’s not just Trump. Unfortunately, 30% of those who are voting age agree with nearly everything he says, the Republican politicians seem to be in some sort of blood oath that they have to back their own no matter what, and the right has a massive media empire to push their messages and it keeps growing (Sinclair buying many local news channels and the Koch brothers recently bought a huge stake in Time, another Trump supporting billionaire just bought and shut down 2 local news websites that catered to millenials and local issues). ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511929672.0,
    "date_created": "2017-11-28",
    "time_created": "15:27:52",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgvnfs",
    "parent_id": "t1_dqgpmot",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"Easily\"\n\nI admire your spirit and all. But easily fixable? When both sides, moreso republicans, just take their ball and go home any time something needs to be worked on?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511926139.0,
    "date_created": "2017-11-28",
    "time_created": "14:28:59",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgyi6p",
    "parent_id": "t1_dqgpmot",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Healthcare and drugs are far from \"easily fixable\"",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511928879.0,
    "date_created": "2017-11-28",
    "time_created": "15:14:39",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgux3y",
    "parent_id": "t1_dqgs1yz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Fun fact: America is the *only country in the world* that is no longer part of the Paris Agreement. Even *Syria and Libya* signed on.\n\nFun fact 2: [France has now stepped in to foot the bill for the US.](http://thehill.com/policy/energy-environment/360546-macron-france-will-cover-us-share-of-funding-for-uns-climate)",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1511925428.0,
    "date_created": "2017-11-28",
    "time_created": "14:17:08",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpzit",
    "parent_id": "t1_dqgpxe3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Sometimes it also goes nowhere.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511920698.0,
    "date_created": "2017-11-28",
    "time_created": "12:58:18",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgvgf7",
    "parent_id": "t1_dqgun6y",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "”God bless America, and no one else!”",
    "controversiality": 0,
    "ups": 58,
    "downs": 0,
    "score": 58,
    "created": 1511925952.0,
    "date_created": "2017-11-28",
    "time_created": "14:25:52",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgxtwn",
    "parent_id": "t1_dqgv9df",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Almost reminds me of that old Tywin quote:\n\n\"Any man who must say 'I am the king' is no true king.\"\n\nCould be rewritten to say: \"Any entity who must say 'I am the best' is probably not really the best.\"",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1511928229.0,
    "date_created": "2017-11-28",
    "time_created": "15:03:49",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh265s",
    "parent_id": "t1_dqgv9df",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Amen to that. Fuck I hate that ideology.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511932263.0,
    "date_created": "2017-11-28",
    "time_created": "16:11:03",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgqawb",
    "parent_id": "t1_dqgpbpo",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That show is bloody hilarious",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1511920995.0,
    "date_created": "2017-11-28",
    "time_created": "13:03:15",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgyls2",
    "parent_id": "t1_dqgpbpo",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Dear sir/madam:\n\nI am writing to inform you of a fire that has broken out on the premises of\n\n...No, that's too formal... ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511928977.0,
    "date_created": "2017-11-28",
    "time_created": "15:16:17",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgozlo",
    "parent_id": "t1_dqgli94",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ":(",
    "controversiality": 0,
    "ups": 72,
    "downs": 0,
    "score": 72,
    "created": 1511919733.0,
    "date_created": "2017-11-28",
    "time_created": "12:42:13",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpqjl",
    "parent_id": "t1_dqgli94",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Is this the new /u/awildsketchappeared ?",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511920460.0,
    "date_created": "2017-11-28",
    "time_created": "12:54:20",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgr8vy",
    "parent_id": "t1_dqgli94",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Barbarians! They didn’t even let him finish his cigarette...",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511921896.0,
    "date_created": "2017-11-28",
    "time_created": "13:18:16",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgun32",
    "parent_id": "t1_dqgr2sl",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is actually one of the massive issues with what details we’ve seen of the “great repeal bill” so far: in order to keep the current law as is when we leave, the executive needs to be given powers to make a lot of changes only parliament can do. It’s very difficult to give them the ability to make the necessary changes whilst also not giving them such power as to be able to do other potentially nefarious but certainly unintended alterations",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511925163.0,
    "date_created": "2017-11-28",
    "time_created": "14:12:43",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgp0r0",
    "parent_id": "t1_dqgnhht",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Exactly why Internet **is** a utility. Try getting a job without internet access.",
    "controversiality": 0,
    "ups": 127,
    "downs": 0,
    "score": 127,
    "created": 1511919766.0,
    "date_created": "2017-11-28",
    "time_created": "12:42:46",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgowmm",
    "parent_id": "t1_dqgnhht",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Which is why it should be a utility.",
    "controversiality": 0,
    "ups": 160,
    "downs": 0,
    "score": 160,
    "created": 1511919655.0,
    "date_created": "2017-11-28",
    "time_created": "12:40:55",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpkjj",
    "parent_id": "t1_dqgnhht",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "yeah i need to access email for work how am i supposed to access it without the internet? all of the people defending this decision saying the free market will take care of it is full of shit, there is no free market when it comes to service providers, thats why net neutrality was created in the first place",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1511920300.0,
    "date_created": "2017-11-28",
    "time_created": "12:51:40",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpj8p",
    "parent_id": "t1_dqgnhht",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Satellite internet. Shit but an option",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511920266.0,
    "date_created": "2017-11-28",
    "time_created": "12:51:06",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgplus",
    "parent_id": "t1_dqgnhht",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "but this is what we the people have to do to get our point across. not cancel our electricity, and not even our internet yet. \n\nbut fuck if we can’t start by raising hell, deleting our facebooks, and publicly taking stances where we previously have felt afraid to before.\n\nit’s time to sacrifice our comfort in order to preserve our fucking rights.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511920335.0,
    "date_created": "2017-11-28",
    "time_created": "12:52:15",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgp72q",
    "parent_id": "t1_dqgoypf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yes. Home, Xfinity.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1511919935.0,
    "date_created": "2017-11-28",
    "time_created": "12:45:35",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgoxi3",
    "parent_id": "t1_dqgmsos",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Same reason why Indians feel proud when children of indian immigrants to US win awards or spelling bees",
    "controversiality": 0,
    "ups": 147,
    "downs": 0,
    "score": 147,
    "created": 1511919678.0,
    "date_created": "2017-11-28",
    "time_created": "12:41:18",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgp869",
    "parent_id": "t1_dqgmsos",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "My grandpa's name is Ajit and I feel ashamed that that fucker shares the same name as good ole gramps... It's an irrational feeling that can't be helped.",
    "controversiality": 0,
    "ups": 101,
    "downs": 0,
    "score": 101,
    "created": 1511919964.0,
    "date_created": "2017-11-28",
    "time_created": "12:46:04",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpxql",
    "parent_id": "t1_dqgmsos",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Indians are very prideful in general and we tend to recognize all Indians regardless of citizenship. Ethnic identity is very important to us.",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1511920650.0,
    "date_created": "2017-11-28",
    "time_created": "12:57:30",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgqico",
    "parent_id": "t1_dqgpmyf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I just want you to know that I absolutely love your username.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1511921193.0,
    "date_created": "2017-11-28",
    "time_created": "13:06:33",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgq4ez",
    "parent_id": "t1_dqgovf7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "bc now we'll get flooded with more bobs and vegine jokes. it's funny, but it's getting old.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1511920827.0,
    "date_created": "2017-11-28",
    "time_created": "13:00:27",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgqukq",
    "parent_id": "t1_dqgpwlt",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's the point.  The slowest horse is the government one. If it's not,  private better step up it's game or everybody will just use government. \n\nClever system honestly.  ",
    "controversiality": 0,
    "ups": 87,
    "downs": 0,
    "score": 87,
    "created": 1511921518.0,
    "date_created": "2017-11-28",
    "time_created": "13:11:58",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgrxd6",
    "parent_id": "t1_dqgpwlt",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That is kind of the whole point.\n\nThere are locations in India where it is simply not possible to operate a profitable private internet service. BSNL provides slow, but usable internet to such areas.",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1511922550.0,
    "date_created": "2017-11-28",
    "time_created": "13:29:10",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgqt6g",
    "parent_id": "t1_dqgpwlt",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I know it has a bad reputation, but it's improved a lot lately. I had in my old house and it worked mostly flawlessly.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1511921482.0,
    "date_created": "2017-11-28",
    "time_created": "13:11:22",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqguiki",
    "parent_id": "t1_dqgmlee",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "ooo wee boy that aint no alternate universe.\n\nIf something were to happen to the power infrastructure (most likely related to a man-created disaster), you bet your ASS there'd be power rationing.\n\nBut since its harder to implement rationing than exorbitant fees for people who overuse.....",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511925045.0,
    "date_created": "2017-11-28",
    "time_created": "14:10:45",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgvnw7",
    "parent_id": "t1_dqgt70s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Are you talking about India? Because India was SOVEREIGN DEMOCRATIC REPUBLIC since its inception and the term Socialist and Secular got added only later during 70s. So we have always been democratic and socialist came later. Also democratic socialism and capitalism, how are they even related?",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1511926151.0,
    "date_created": "2017-11-28",
    "time_created": "14:29:11",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqhq5xm",
    "parent_id": "t1_dqgt70s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And in the US we need to acknowledge that pure socialism and pure capitalism are both flawed, that without tempering the two extremes you're heading for collapse.  (And that the merest hint of responsibility and accountability isn't \"rampant socialism and government overreach\" as the politicians of the right claim.)",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511958879.0,
    "date_created": "2017-11-28",
    "time_created": "23:34:39",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgp32w",
    "parent_id": "t1_dqglj9i",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Money came from Comcast, TWC, Verizon, and ATT. \n\nTo be specific. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1511919829.0,
    "date_created": "2017-11-28",
    "time_created": "12:43:49",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqglslz",
    "parent_id": "t1_dqglj9i",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "What's hilarious is they think they're being soooo edgy, when infact they are pathetic particidal coward sheep whose arguments are so faulty and devoid of logic that they don't allow dissent in their little playpen, lest the whole charade crumble. And it would.   \n  \nMy God how I thrist for a ban-free day at the_donald, a chance to call them out on every single pathetic desperate-to-be-edgy angle they ascribe to. Just trash humans out to look cool but looking all the world like fucking losers.",
    "controversiality": 0,
    "ups": 72,
    "downs": 0,
    "score": 72,
    "created": 1511916546.0,
    "date_created": "2017-11-28",
    "time_created": "11:49:06",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgp1a1",
    "parent_id": "t1_dqgod9v",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "In the beginning there was a lot of people in there that were trying to tell the rest of TD why they should be for net neutrality but they got swamped with downvotes and the posts got removed. There are some trump supporters that are for net neutrality but unfortunately they follow too close to logic for the topic and therefore are censored. ",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1511919780.0,
    "date_created": "2017-11-28",
    "time_created": "12:43:00",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgw7xu",
    "parent_id": "t1_dqgvljd",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 227,
    "downs": 0,
    "score": 227,
    "created": 1511926698.0,
    "date_created": "2017-11-28",
    "time_created": "14:38:18",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgxprs",
    "parent_id": "t1_dqgxb80",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1511928121.0,
    "date_created": "2017-11-28",
    "time_created": "15:02:01",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh1ncd",
    "parent_id": "t1_dqgxb80",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511931767.0,
    "date_created": "2017-11-28",
    "time_created": "16:02:47",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgz5ac",
    "parent_id": "t1_dqgvvli",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I thought that was funny until I realized that we have a Captain Planet villain for real, and no Captain Planet.",
    "controversiality": 0,
    "ups": 367,
    "downs": 0,
    "score": 367,
    "created": 1511929488.0,
    "date_created": "2017-11-28",
    "time_created": "15:24:48",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh1sgd",
    "parent_id": "t1_dqgw7g7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "What major corporation isn't linked to abusive child labor?",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511931904.0,
    "date_created": "2017-11-28",
    "time_created": "16:05:04",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh13cf",
    "parent_id": "t1_dqgw7g7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's just the tip of the iceberg.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511931253.0,
    "date_created": "2017-11-28",
    "time_created": "15:54:13",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgwmd2",
    "parent_id": "t1_dqgvsir",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Read up some more on Nestle  , they are monsters\n\nin the 70s they sent female saleswomen dressed up as nurses around towns and cities in africa to 'educate' them about how baby formula is (according to them,but  not in reality) better for babies than breastfeeding, convincing well meaning mothers that they had to feed their baby formula for their wellbeing.\n\nThey gave them free formula to get them started but after a while they cut off  that free supply meaning they had to buy it. Many african women could not afford to keep buying the formula but since they stopped breastfeeding they stopped producing milk.\n\nTLDR: Nestle so eager to create another 'market' for their stupid shit disguised salespeople as nurses and held a big misinformation campaign to create a demand where there wasn't one, for a need that didn't exist, and in the process a shitload of infants died after their mothers stopped producing milk because they couldn't afford to keep buying formula.\n\nNestle is the one company on the planet that really is worth the effort to boycot.\n\nIt takes a little bit of effort to find out what brands are owned by nestle (more than you think, and every few years I discover another one is owned or was acquired ) but once you do please stop buying their products.\n\nhttps://cdn.zmescience.com/wp-content/uploads/2015/05/nestle-subsidiaries.jpg\n\nThey are cartoon villain evil.\n\n\n\n",
    "controversiality": 0,
    "ups": 461,
    "downs": 0,
    "score": 461,
    "created": 1511927081.0,
    "date_created": "2017-11-28",
    "time_created": "14:44:41",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh36vy",
    "parent_id": "t1_dqgw0nz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"For the past seven years ive been the head of the Nestle Group, the largest foodstuff corporation in the world.\" \n\n...\n\n\"water is of course the most important raw material we have today in the world. Its a question of weather we should privatize the normal water supply for the population. And there are two different opinions on the matter; the one opinion which i think is extreme is represented by the NGOs, who bang on about, declaring water, a public right. That means that as a human being you should have a right to water. Thats an extreme solution. And other view says that water is a foodstuff like any other and like any other foodstuff is should have a market value personally i believe its better to give foodstuff a value so that we're all aware that is has its price. and then that one should take specific measures for the part of the population that has no access to this water and there are many different possibilities there. I'm still in the opinion that the biggest social reasonability of any CEO is to maintain and ensure the successful and profitable future of his enterprise.\"\n\nhttps://www.youtube.com/watch?v=TPY64EJcsG4\n\nHe starts by saying his company is the largest \"foodstuff\" company in the world, says water should be \"foodstuff\" and then says its his resposablity to make the company more money and more successful. He just wants to be able to make more money off drinking water, plain as that. Whether you agree or disagree morally that is his end goal. No other.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511933212.0,
    "date_created": "2017-11-28",
    "time_created": "16:26:52",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh3w3x",
    "parent_id": "t1_dqgw0nz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": " But they also pump aquifers dry so they can bottle and sell the water, and leave nothing left for the local residents who needed that water to live comfortably. Until nestle gives those people free water, saying it doesn't mean they actually stand by it in practice",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511933875.0,
    "date_created": "2017-11-28",
    "time_created": "16:37:55",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh8tce",
    "parent_id": "t1_dqh6ccf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I hope your disgust stays with you. I hope that you can stomach it for as long as possible, and figure out a way to help us get through this with it. Its a difficult thing to do for long, because its tiring after a while and eventually you just say \"fuck-it\" Im tired and I dont care anymore.      \n   But its reality. These men are exactly why America is *most likely* no longer a democracy.      \n  \nI say that statement, not to rile anyone, but for informational and decision making purposes only.    If you call yourself a cat, but you're really a human, you may end up going to a veterinarian when you should be going to a doctor, you may buy cat food when you should buy a pizza. What we have instead is an oligarchy not a democracy. And if/when this repeal goes through we will have another nail in the coffin.                      \nI believe we might have stumbled upon the the mother of all corrupt industries(aside from the banking & government of course). Its an important lesson to learn because we already know why finance and government are corrupt, because they both deal **directly** with power. Telecomms seems to be corrupt in a much more malicious and severe fashion. Its more like a computer virus than the other two. This has been bubbling under the surface for a while now, but Trump is exacerbating it. This america sure is an interesting one. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1511938812.0,
    "date_created": "2017-11-28",
    "time_created": "18:00:12",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgvi0i",
    "parent_id": "t1_dqgucey",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I feel the tragedy of the commons still plays out in the form of voter apathy. An ignorant or interested minority elect people who manage it poorly, then we all complain about it.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511925995.0,
    "date_created": "2017-11-28",
    "time_created": "14:26:35",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh6w5y",
    "parent_id": "t1_dqh6pjp",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I definitely understand that. But there has been a marked increase in crazy stuff happening after Trump was elected. I'm not saying it was all good before, but it is worse now.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511936796.0,
    "date_created": "2017-11-28",
    "time_created": "17:26:36",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh0isy",
    "parent_id": "t1_dqgzn9d",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Lol funny story.. I was born in 86. I’m a huge back to the future fan and didn’t even consider that it would look like my birth year. At least I wasn’t too far off lol ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511930724.0,
    "date_created": "2017-11-28",
    "time_created": "15:45:24",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgw87p",
    "parent_id": "t1_dqgvetj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'll bet it's Jio. \n\nTheir optical fiber connections are blazing fast, they really shook up the complacent businesses like Airtel with their launch.",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1511926705.0,
    "date_created": "2017-11-28",
    "time_created": "14:38:25",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgvu0v",
    "parent_id": "t1_dqgvetj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Jio.",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1511926313.0,
    "date_created": "2017-11-28",
    "time_created": "14:31:53",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgyew2",
    "parent_id": "t1_dqgx88p",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's just atrocious. I got 100 mbps down and up, data limited at 100GB. Around $25 (1500 Rupees) a month in NCR, India. \n",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1511928792.0,
    "date_created": "2017-11-28",
    "time_created": "15:13:12",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh1yrg",
    "parent_id": "t1_dqgx88p",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And here I thought we here in india have high price, But thats just whole new level, wait I'll join you next year, I coming canada. Imma miss you JIO :( ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511932069.0,
    "date_created": "2017-11-28",
    "time_created": "16:07:49",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh1au7",
    "parent_id": "t1_dqgx88p",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "40 mbps down, 10 mbps up with 250 gb data.\n~$26 (with taxes).\n\nIndia here.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511931445.0,
    "date_created": "2017-11-28",
    "time_created": "15:57:25",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgr85i",
    "parent_id": "t1_dqgq585",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You could achieve higher throughput by mailing a bunch of thumb drives. ",
    "controversiality": 0,
    "ups": 95,
    "downs": 0,
    "score": 95,
    "created": 1511921876.0,
    "date_created": "2017-11-28",
    "time_created": "13:17:56",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpejy",
    "parent_id": "t1_dqgp9ao",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Ah... yeah I meant share holder...\n\nRIP me XD",
    "controversiality": 0,
    "ups": 82,
    "downs": 0,
    "score": 82,
    "created": 1511920137.0,
    "date_created": "2017-11-28",
    "time_created": "12:48:57",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpmdk",
    "parent_id": "t1_dqgpa1c",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Have you heard about Pluto?",
    "controversiality": 0,
    "ups": 73,
    "downs": 0,
    "score": 73,
    "created": 1511920348.0,
    "date_created": "2017-11-28",
    "time_created": "12:52:28",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgptvw",
    "parent_id": "t1_dqgpa1c",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You hear about Pluto? That's messed up, right?",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511920548.0,
    "date_created": "2017-11-28",
    "time_created": "12:55:48",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgv0ko",
    "parent_id": "t1_dqgpa1c",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "PLUTO...IS....A PLANET",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511925525.0,
    "date_created": "2017-11-28",
    "time_created": "14:18:45",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgq83o",
    "parent_id": "t1_dqgpvlv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Plutocracy means rule by the rich. It's more specific than rule by the few, which is oligarchy. oligarchies aren't necessarily plutocracies but plutocracies are always oligarchies.",
    "controversiality": 0,
    "ups": 47,
    "downs": 0,
    "score": 47,
    "created": 1511920921.0,
    "date_created": "2017-11-28",
    "time_created": "13:02:01",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpzng",
    "parent_id": "t1_dqgplsx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That is an extremely wrong definition of capitalism. The idea of capitalism is to offer the greatest good for the lowest of price, as the marketplace would dictate. What the FCC is doing is in a sense crushing our ability to have a free and open marketplace, a cornerstone in the American economy and political mindset. Capitalism is about giving everyone the freedom to choose, and have equal opportunity as the person next to him. The government has become so powerful that the wealthy can benefit themselves. That isn't capitalism, and that isn't American. ",
    "controversiality": 0,
    "ups": 78,
    "downs": 0,
    "score": 78,
    "created": 1511920701.0,
    "date_created": "2017-11-28",
    "time_created": "12:58:21",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh0s2a",
    "parent_id": "t1_dqgxti4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "bubububut if we remove legislation they wil be able to operate better and not be constrainted by those peskies goverments.\n\nI for one welcome our ISP overlords! May our speeds be no faster than 5mbps and their cars fast and sporty and their yatch big and beautiful!\n\n/S",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1511930962.0,
    "date_created": "2017-11-28",
    "time_created": "15:49:22",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh0dtx",
    "parent_id": "t1_dqgxti4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This was very informative. Thank you.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511930599.0,
    "date_created": "2017-11-28",
    "time_created": "15:43:19",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh2mwd",
    "parent_id": "t1_dqgxti4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Just checked this and it makes me even more sad that the UK ranks lower than you guys :(\n\nSupporting you now will only help deter this happening to the rest of the world!!!",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511932700.0,
    "date_created": "2017-11-28",
    "time_created": "16:18:20",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgv521",
    "parent_id": "t1_dqgudv5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Correct, remember this the next time someone mentions what a great \"democracy\" we are.",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1511925645.0,
    "date_created": "2017-11-28",
    "time_created": "14:20:45",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgzz0i",
    "parent_id": "t1_dqguj8n",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I am looking for the sarcasm in this post but I can't find it. How do you mean?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511930225.0,
    "date_created": "2017-11-28",
    "time_created": "15:37:05",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgtjpz",
    "parent_id": "t1_dqgs0tq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Except it should not be, and many republican VOTERs are taking a stand with those in favor of net neutrality. Problem is, their party already put a lot of things in place, and the next election that's relevant to this issue isn't gonna be for a while. And afaik it's still a minority among the republicans.",
    "controversiality": 0,
    "ups": 103,
    "downs": 0,
    "score": 103,
    "created": 1511924121.0,
    "date_created": "2017-11-28",
    "time_created": "13:55:21",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgsbwd",
    "parent_id": "t1_dqgs052",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm a Republican and no I'm not ok with it.  I'm disappointed that so many Republicans oppose net neutrality.  But I have seen a ton of Republicans like myself that are pro-NN ",
    "controversiality": 0,
    "ups": 86,
    "downs": 0,
    "score": 86,
    "created": 1511922945.0,
    "date_created": "2017-11-28",
    "time_created": "13:35:45",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgu1bb",
    "parent_id": "t1_dqgsry7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's not limited to ISPs. With this, the healthcare debacle, and the tax reform debacle, it's extremely clear that they've sold us out to the extremely wealthy.",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1511924588.0,
    "date_created": "2017-11-28",
    "time_created": "14:03:08",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgw5sq",
    "parent_id": "t1_dqgqbm3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The hilly/mountainous regions of Himachal, Meghalaya, Kerela, Tripura have A-grade weed that is so cheap. In high school, we'd buy half a kilo for 6$. I'm talking about the best stuff. The cheap ones were sold for a nickel for a 1/4 pound. I'm talking 2013-15. Good times man.  \n\nLet me clarify that I'm talking about Tripura and Meghalaya weed. Kerela and Himachal weed/hash is much costlier.",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1511926642.0,
    "date_created": "2017-11-28",
    "time_created": "14:37:22",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgyjqm",
    "parent_id": "t1_dqgqbm3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "India has the original weed culture. Weed is literally a religious thing Hinduism. You know how Christians take bread and wine to get \"closer\" to God? In India, there are certain Hindu sects that get high with weed to get closer to God. Infact, Shiva is a God that loves his ganja.",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1511928921.0,
    "date_created": "2017-11-28",
    "time_created": "15:15:21",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgr6jx",
    "parent_id": "t1_dqgqnmv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "IIRC Weed is illegal but Bhang is legal. ",
    "controversiality": 0,
    "ups": 75,
    "downs": 0,
    "score": 75,
    "created": 1511921835.0,
    "date_created": "2017-11-28",
    "time_created": "13:17:15",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgrc16",
    "parent_id": "t1_dqgqnmv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I learnt this also just couple of yrs back ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511921980.0,
    "date_created": "2017-11-28",
    "time_created": "13:19:40",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgrbeg",
    "parent_id": "t1_dqgqytm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "True, but you're still cop bait. Easy money for them if they catch you with it and you refuse to pay up. They'll know it's just weed but hey what's illegal is illegal. ",
    "controversiality": 0,
    "ups": 67,
    "downs": 0,
    "score": 67,
    "created": 1511921963.0,
    "date_created": "2017-11-28",
    "time_created": "13:19:23",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpvdr",
    "parent_id": "t1_dqgpnci",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Well where else in the world shout's the word Free! every 10 seconds. It is 100 percent spoonfed that America is the best place, and that if anyone else looks better they must be corrupt or running a system that is not sustainable. It's just not true.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1511920588.0,
    "date_created": "2017-11-28",
    "time_created": "12:56:28",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgptmh",
    "parent_id": "t1_dqgpnci",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "What exactly makes America so \"free\" aside from being able to own and shoot guns? I literally cannot think of anything else.",
    "controversiality": 0,
    "ups": 94,
    "downs": 0,
    "score": 94,
    "created": 1511920541.0,
    "date_created": "2017-11-28",
    "time_created": "12:55:41",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgqj94",
    "parent_id": "t1_dqgpnci",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm american and my boyfriend is Canadian. He's probably the first non American person my family ever knew except my aunt who moved here from germany.\n\nWhen I first went to visit him in canada, I lived at home with my parents and they had never met him. When i told them i was flying to canada to visit him my dad was scared that he would be able to hold me he (my boyfriend) could hold me against my will and that I'd have no rights in court to protect myself in canada.\n\nNeedless to say my dad watched too much locked up abroad but to think I'd have no rights in Canada was just laughable in retrospect.\n\nOf course I went and I didn't get held against my will and my family enjoys visiting Canada now.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511921217.0,
    "date_created": "2017-11-28",
    "time_created": "13:06:57",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgqmfb",
    "parent_id": "t1_dqgpso4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That hasn't changed,  what has changed is the level of control available to them. \n\nWe've always been sheep.  But now instead of wild bighorns we're corralled sheep waiting for shearing or slaughter. \n\nBut the oats are good,  the water fresh,  and we are safe from wolves both real and imaginary. ",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1511921301.0,
    "date_created": "2017-11-28",
    "time_created": "13:08:21",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgqs31",
    "parent_id": "t1_dqgpso4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Voted in by retards*",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1511921455.0,
    "date_created": "2017-11-28",
    "time_created": "13:10:55",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgvpvd",
    "parent_id": "t1_dqgvnfs",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "progress is being made at the local level. Just look at weed regulation.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511926203.0,
    "date_created": "2017-11-28",
    "time_created": "14:30:03",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgqbkc",
    "parent_id": "t1_dqgpzit",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Well, we once freed the slaves. Tho\nit definitely took a while.\n\nNo worries .. we essentially replaced them with almost free labor.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1511921013.0,
    "date_created": "2017-11-28",
    "time_created": "13:03:33",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh2075",
    "parent_id": "t1_dqgvgf7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Somehow I don't think God would see Murica under a good light...",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511932107.0,
    "date_created": "2017-11-28",
    "time_created": "16:08:27",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgphhc",
    "parent_id": "t1_dqgozlo",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"[upvote initiated](https://media.giphy.com/media/9xrkOuGm0CEMM/giphy.gif)\" ",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1511920216.0,
    "date_created": "2017-11-28",
    "time_created": "12:50:16",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgqnx3",
    "parent_id": "t1_dqgpqjl",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[\"While I appreciated the sentiment -- I'm not nearly so talented! Though I think I've gotten slowly better over the last 5 months.\"](https://i.imgur.com/aqIKqTA.jpg)\n\n[I've got about 650ish originals over the last 5 months on my profile -- I guess ya'll can judge that for yourselves!]",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1511921341.0,
    "date_created": "2017-11-28",
    "time_created": "13:09:01",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgphuy",
    "parent_id": "t1_dqgp0r0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I literally cannot do my job without the internet at my house.",
    "controversiality": 0,
    "ups": 66,
    "downs": 0,
    "score": 66,
    "created": 1511920226.0,
    "date_created": "2017-11-28",
    "time_created": "12:50:26",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgqr00",
    "parent_id": "t1_dqgp0r0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "use libraries internet? coffee shops? i dont know where else you can tho",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511921424.0,
    "date_created": "2017-11-28",
    "time_created": "13:10:24",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgp2s3",
    "parent_id": "t1_dqgowmm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "We’ve come full circle. ",
    "controversiality": 0,
    "ups": 95,
    "downs": 0,
    "score": 95,
    "created": 1511919820.0,
    "date_created": "2017-11-28",
    "time_created": "12:43:40",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgr4e1",
    "parent_id": "t1_dqgpkjj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I hear you. You're totally right. In the 19th century, however, people went on strike knowing that this could mean starvation for them and their families, but they did it nonetheless. They held on by knowing that, if they stayed together and were many, the sacrifices they were making would be of short length: because when many people went on strike together, companies were forced to surrender to their requests. The key here is: stay together - be many. Just a thought ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511921780.0,
    "date_created": "2017-11-28",
    "time_created": "13:16:20",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpb1f",
    "parent_id": "t1_dqgp72q",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Alright, fair. Atleast you put your money where your mouth is. Would be cool if you acknowledged that lots of others can't do the same though.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1511920042.0,
    "date_created": "2017-11-28",
    "time_created": "12:47:22",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpgq6",
    "parent_id": "t1_dqgp72q",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Good on ya for doing so, no joke.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1511920195.0,
    "date_created": "2017-11-28",
    "time_created": "12:49:55",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgp1l2",
    "parent_id": "t1_dqgoxi3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "yeah that is kinda weird when you think about it. also you dont know this person, why are you proud of a person that sorta kinda looks like you.",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1511919789.0,
    "date_created": "2017-11-28",
    "time_created": "12:43:09",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqguu9p",
    "parent_id": "t1_dqgp869",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Don't call him Ajit then. Call him a randi. That's what he is. A telecom whore.",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1511925355.0,
    "date_created": "2017-11-28",
    "time_created": "14:15:55",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgw6za",
    "parent_id": "t1_dqgp869",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You think you have it bad? My grandfathers name is Adolf",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1511926673.0,
    "date_created": "2017-11-28",
    "time_created": "14:37:53",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqguwdh",
    "parent_id": "t1_dqgpxql",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">Indians are very prideful in general\n\nProudy",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511925410.0,
    "date_created": "2017-11-28",
    "time_created": "14:16:50",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgqmqr",
    "parent_id": "t1_dqgqico",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Finally someone recognises it! Thank you!",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511921310.0,
    "date_created": "2017-11-28",
    "time_created": "13:08:30",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgrg15",
    "parent_id": "t1_dqgq4ez",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The worst part is that those jokes, along with shitting street jokes, don’t even make sense to most Indians.\n\nExcept for the ones who have heard it before. Like you run up to a white American and start yelling about hamburgers and he’ll get you’re trying to be offensive\n\nYou run up to a black guy and start yelling shit about thievery and gangsters and he’ll get you’re trying to be offensive\n\nI’ve had to see poo in loo and send bob and vagene jokes **explained** to Indians on subs like /r/India or /r/abcdesis\n\nWhich they’d come up with a better meme but half of these guys probably don’t even know who Modi is so who cares",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1511922087.0,
    "date_created": "2017-11-28",
    "time_created": "13:21:27",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgsq04",
    "parent_id": "t1_dqgqt6g",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I mean it works pretty good for me to.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511923328.0,
    "date_created": "2017-11-28",
    "time_created": "13:42:08",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgyofl",
    "parent_id": "t1_dqgvnw7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The constitutional amendment came in later, but Nehru's policies were always modelled after USSR.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511929046.0,
    "date_created": "2017-11-28",
    "time_created": "15:17:26",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgzew6",
    "parent_id": "t1_dqgvnw7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "social democracy is a blend of socialism wrapped in a capitalist framework.  Some countries lean one way, others lean the other.  ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511929727.0,
    "date_created": "2017-11-28",
    "time_created": "15:28:47",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgnv65",
    "parent_id": "t1_dqglslz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> they think they're being soooo edgy\n\nIsn't there a meme about this? This is something that needs to be called out so bad.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1511918631.0,
    "date_created": "2017-11-28",
    "time_created": "12:23:51",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgzggr",
    "parent_id": "t1_dqgp1a1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "There's alot of (deleted) posts so they don't let pro nn even on there. There most reasoning seems to be Obama, Soros and the left want this so we don't.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511929766.0,
    "date_created": "2017-11-28",
    "time_created": "15:29:26",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgwf0s",
    "parent_id": "t1_dqgw7xu",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 110,
    "downs": 0,
    "score": 110,
    "created": 1511926887.0,
    "date_created": "2017-11-28",
    "time_created": "14:41:27",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgwghw",
    "parent_id": "t1_dqgw7xu",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1511926924.0,
    "date_created": "2017-11-28",
    "time_created": "14:42:04",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgwfp0",
    "parent_id": "t1_dqgw7xu",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1511926904.0,
    "date_created": "2017-11-28",
    "time_created": "14:41:44",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgwopq",
    "parent_id": "t1_dqgw7xu",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511927142.0,
    "date_created": "2017-11-28",
    "time_created": "14:45:42",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgzhd1",
    "parent_id": "t1_dqgxprs",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511929789.0,
    "date_created": "2017-11-28",
    "time_created": "15:29:49",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh05bm",
    "parent_id": "t1_dqgz5ac",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Well, we can't just let this continue! \n\n**EARTH!**\n\nEdit: you fools! It goes earth, fire, wind, water, and heart! I don't know who we're summoning but I don't want to find out!",
    "controversiality": 0,
    "ups": 170,
    "downs": 0,
    "score": 170,
    "created": 1511930382.0,
    "date_created": "2017-11-28",
    "time_created": "15:39:42",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgxqho",
    "parent_id": "t1_dqgwmd2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Your TLDR is nearly as long as long as the long version.",
    "controversiality": 0,
    "ups": 230,
    "downs": 0,
    "score": 230,
    "created": 1511928139.0,
    "date_created": "2017-11-28",
    "time_created": "15:02:19",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgxuxd",
    "parent_id": "t1_dqgwmd2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "...Seeing this sort of shit genuinely makes me understand why some people think socialism is a great idea.",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1511928256.0,
    "date_created": "2017-11-28",
    "time_created": "15:04:16",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh0ajh",
    "parent_id": "t1_dqgwmd2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Any experience with using something like [Buycott?](https://www.buycott.com/) in order to assist with finding out who makes what?\n\n",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511930515.0,
    "date_created": "2017-11-28",
    "time_created": "15:41:55",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqhbukx",
    "parent_id": "t1_dqh8tce",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Every single fearmongering, money-grubbing corporate entity owes me fucking money. They own every man, woman, and child on the face of this planet a goddamn chunk of change and that's not hyperbole.  All theses whore-mongering frauds do is take, take, take, and fucking take and they continue to buy (literally buy) policy that allows them to undermine democracy for personal gain, often working in tandem with each other to prosper off our backs and sell us less for more, including that which shouldn't even be for sale and often in spite of what is ethical and moral. They insult your intelligence and low and behold we hear the same horseshit from the FCC and other government entities they bought off. Our laws aren't even enforced! These clowns...these shit stains on humanity behave with total impunity and little oversight as **enormous super monopolies** that want to widen the wealth gap for their shareholders, their creepy fucking families, and their wretched friends in Washington.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511942235.0,
    "date_created": "2017-11-28",
    "time_created": "18:57:15",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgwbre",
    "parent_id": "t1_dqgw87p",
    "subreddit_name_prefixed": "r/worldnews",
    "body": " I am in mumbai and it's barely.goes over 2-3mbps..\n\nI think number of ppl using jio in my area are way too high..",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511926801.0,
    "date_created": "2017-11-28",
    "time_created": "14:40:01",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh16vm",
    "parent_id": "t1_dqgyew2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Ha. 260 GB a month at 75 Mbps down and up at 1099 ₹(17$) in Chennai, india",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1511931342.0,
    "date_created": "2017-11-28",
    "time_created": "15:55:42",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgrqhg",
    "parent_id": "t1_dqgr85i",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "We Africa now. ",
    "controversiality": 0,
    "ups": 67,
    "downs": 0,
    "score": 67,
    "created": 1511922364.0,
    "date_created": "2017-11-28",
    "time_created": "13:26:04",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgs5zm",
    "parent_id": "t1_dqgr85i",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The latency though!",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1511922787.0,
    "date_created": "2017-11-28",
    "time_created": "13:33:07",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgthaj",
    "parent_id": "t1_dqgr85i",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Funnily enough It would be faster to ship 100GB of data to my house through USPS and then upload it over LTE than to upload it using the 1Mbps upload of the ADSL2+ connection at work.\n\nAt work on ADSL2+ 10 days at home on LTE about 8 hours.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511924057.0,
    "date_created": "2017-11-28",
    "time_created": "13:54:17",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgq3r1",
    "parent_id": "t1_dqgpejy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You're not wrong. As a Shareholder, one is also a type of stakeholder.",
    "controversiality": 0,
    "ups": 54,
    "downs": 0,
    "score": 54,
    "created": 1511920809.0,
    "date_created": "2017-11-28",
    "time_created": "13:00:09",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpq1l",
    "parent_id": "t1_dqgpmdk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It’s not a story the astronomers would tell you ",
    "controversiality": 0,
    "ups": 96,
    "downs": 0,
    "score": 96,
    "created": 1511920448.0,
    "date_created": "2017-11-28",
    "time_created": "12:54:08",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgq71e",
    "parent_id": "t1_dqgpmdk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That’s messed up",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511920893.0,
    "date_created": "2017-11-28",
    "time_created": "13:01:33",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgrdqb",
    "parent_id": "t1_dqgpmdk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's messed up. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511922023.0,
    "date_created": "2017-11-28",
    "time_created": "13:20:23",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgrcvw",
    "parent_id": "t1_dqgpmdk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Psych reference?\n",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511922001.0,
    "date_created": "2017-11-28",
    "time_created": "13:20:01",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgurut",
    "parent_id": "t1_dqgq83o",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "all squares are rectangles, but not all rectangles are squares 🤔",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511925291.0,
    "date_created": "2017-11-28",
    "time_created": "14:14:51",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgyxge",
    "parent_id": "t1_dqgq83o",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Incidentally and of course completely unrelated to current events, a kakistocracy is a system of government which is run by the worst, least qualified, or most unscrupulous citizens",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511929282.0,
    "date_created": "2017-11-28",
    "time_created": "15:21:22",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgqf8j",
    "parent_id": "t1_dqgpzng",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Our only defense against large megacorporations is a large strong government though.  Unfortunately half of Americans support those large interests buying the government off. We just need to take the government back.",
    "controversiality": 0,
    "ups": 51,
    "downs": 0,
    "score": 51,
    "created": 1511921110.0,
    "date_created": "2017-11-28",
    "time_created": "13:05:10",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgr3hs",
    "parent_id": "t1_dqgpzng",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Come on man. You're not living in a textbook world. People will always try and break systems to exploit them. Capitalism has already been exploited for far too long by people looking to suck money out of society and trap it with them. American capitalism is purely greed centric and you need to accept it first if you're going to try changing it.",
    "controversiality": 0,
    "ups": 66,
    "downs": 0,
    "score": 66,
    "created": 1511921755.0,
    "date_created": "2017-11-28",
    "time_created": "13:15:55",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgqdhr",
    "parent_id": "t1_dqgpzng",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "See, that's what they say capitalism is about. But in practice, it's cut everything you can to squeeze as much loot out.\n\nThat is capitalism, and that is the extreme that America has come to. Which is why capitalism is one of those things that work great on paper, but no other nation but us actually follows. Always needs some level of socialism or other government oversight to prevent the sorts of abuse that we're taking as comfortable.",
    "controversiality": 0,
    "ups": 67,
    "downs": 0,
    "score": 67,
    "created": 1511921063.0,
    "date_created": "2017-11-28",
    "time_created": "13:04:23",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh0pwi",
    "parent_id": "t1_dqgtjpz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Republican voters need to learn that their party is never going to listen to them until they start electing Democrats.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1511930907.0,
    "date_created": "2017-11-28",
    "time_created": "15:48:27",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgsgdy",
    "parent_id": "t1_dqgsbwd",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You should let your rep guys know about this.",
    "controversiality": 0,
    "ups": 78,
    "downs": 0,
    "score": 78,
    "created": 1511923065.0,
    "date_created": "2017-11-28",
    "time_created": "13:37:45",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgtrss",
    "parent_id": "t1_dqgsbwd",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Good on you man. Keep on trucking, this site makes it easy to see parties and the people in them as monoliths. And honestly I haven't seen much support for nixing NN from folks on the right. Mostly just the Trump supporters and some of the actual politicians seem to be on board.",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1511924333.0,
    "date_created": "2017-11-28",
    "time_created": "13:58:53",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgxveb",
    "parent_id": "t1_dqgw5sq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Wooooow, looks like I found a reason to visit India. (not that there aren't others, don't jump down my throat) ",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1511928269.0,
    "date_created": "2017-11-28",
    "time_created": "15:04:29",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqhll1i",
    "parent_id": "t1_dqgyjqm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Desi ganjadi here.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511953241.0,
    "date_created": "2017-11-28",
    "time_created": "22:00:41",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgs91y",
    "parent_id": "t1_dqgr6jx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yupp. how it works is Buds are illegal, leaves are legal",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1511922869.0,
    "date_created": "2017-11-28",
    "time_created": "13:34:29",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgttv0",
    "parent_id": "t1_dqgr6jx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Both are illegal for recreational purposes. Bhaang is legal for religious-cultural purposes.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1511924388.0,
    "date_created": "2017-11-28",
    "time_created": "13:59:48",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgx9wr",
    "parent_id": "t1_dqgr6jx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Weed is legal in one state in India, Odissa.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511927708.0,
    "date_created": "2017-11-28",
    "time_created": "14:55:08",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgty5p",
    "parent_id": "t1_dqgrc16",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "If you drink it you will learn this within an hour",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511924503.0,
    "date_created": "2017-11-28",
    "time_created": "14:01:43",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgri5r",
    "parent_id": "t1_dqgrbeg",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Obviously don't get caught with the stuff, and obviously I would prefer it to be legal, but the weed situation in India is still far better than it is here in America because the repercussions in America for it are just so absurd.  \n\nAmerica has better weed though so I guess you win some and lose some lol ",
    "controversiality": 0,
    "ups": 37,
    "downs": 0,
    "score": 37,
    "created": 1511922142.0,
    "date_created": "2017-11-28",
    "time_created": "13:22:22",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgs0so",
    "parent_id": "t1_dqgrbeg",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "There are downsides to making the stuff illegal. Like, I don't know how good the stuff is unless they're nugs. It's hard to find different strains, in different forms. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511922641.0,
    "date_created": "2017-11-28",
    "time_created": "13:30:41",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqhcsf9",
    "parent_id": "t1_dqgptmh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Well, as a sincere response -\n\n**Freedom of Religion** - You may practice and hold a faith of your own choosing.  You may choose no religion at all.\n\n**Freedom of Speech** - You may speak your thoughts and opinions publicly, without censure or retaliation from the government; as is frequently pointed out, many people conflate this with the freedom from repercussions...if you call your school principal a fat whore who fellates the donkey mascot, there is nothing in federal law to prevent her from expelling you from the school.\n\n**Freedom of the Press** - You may express your ideas and opinions in published writing.  You may also consume the ideas and opinions of others via reading/viewing published materials.  The government cannot censure what you read.  Note that this is related, yet distinct from the freedom of speech. \n\n**Freedom of Assembly** - You may form and gather groups to discuss opinions or ideas (i.e. we can come together to discuss and criticize the government as evidenced by this very thread).  You may form and join any political party of your choosing.  Again, this is not freedom to hold riots or form lynch mobs; if you violate other laws as a corollary to your gathering, you're still accountable. \n\n**Freedom of Petition** - You may petition the government to act or refrain from acting. It may not work, but you're allowed to request, which is very important.\n\n**Freedom to Bear Arms** - There's enough talk on this one out there already.  Suffice it to say, there are nuances and varied opinions on the practical applications of this freedom.\n\n**Freedom of Education** - Children have the right to a free public education. Mileage varies on how good it is, but we do not restrict any child from obtaining an education.\n\n**Freedom of Travel** - We may zip around the country willy-nilly without needing papers or checkpoints. Though it is not a right of citizens or related to our freedoms, we do happen to also have a fairly powerful passport.\n\nThere are various others along the lines of our justice system, property rights, travel, marriage, education, and political parties.\n\nThese have HUGE societal ramifications, and are legitimate.  Having to pay $500 a day for access to the cornucopia of knowledge that is \"The Internet\" does not inhibit or diminish the fact that you are free to pray to the Flying Spaghetti Monster God without a government hit force bursting into your chapel and executing you.\n\nThe problem is that folk go overboard with the concept \"Freedom\", and believe it should mean \"I can do whatever I want and have whatever I want\". It *should not* mean that in any federal sense.  That would be chaos and anarchy.  What American \"Freedoms\" do provide is a vast improvement over the lives of our forbears.  \n\nIs it better than what other countries are doing in the 21st century?  Perhaps, perhaps not.  Many modern countries have comparable freedoms now.\n\nHowever, the context of \"Land of the Free\" is from the 18th Century, and should largely be considered with such in mind.",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1511943313.0,
    "date_created": "2017-11-28",
    "time_created": "19:15:13",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqhau9s",
    "parent_id": "t1_dqgptmh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Well let's see, in Japan if you are accused of a crime you have no right to self defense or representation and are assumed guilty.  Because of this Japan has something like a 97% conviction rate. \n\nIs it like that all over Asia? Or are you presumed innocent like in the US? \n\nAren't there a lot of Asian countries where you can be punished for political speech? Can you say fuck the president like so many k in the US do every day? \n\nI can think of a dozen others. ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1511941079.0,
    "date_created": "2017-11-28",
    "time_created": "18:37:59",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgq26x",
    "parent_id": "t1_dqgptmh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Well if you're rich you're pretty much free. Free from taxes, free from having to answer to the law. The American dream that everyone will obviously reach!\n\n*Edit* Don't take my comment too seriously, I was just trying to be funny.",
    "controversiality": 0,
    "ups": 93,
    "downs": 0,
    "score": 93,
    "created": 1511920771.0,
    "date_created": "2017-11-28",
    "time_created": "12:59:31",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgq0ls",
    "parent_id": "t1_dqgptmh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You no longer HAVE to join the military, so we got that going I guess.",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1511920728.0,
    "date_created": "2017-11-28",
    "time_created": "12:58:48",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgvit1",
    "parent_id": "t1_dqgptmh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Well someone in Vietnam just got 7 years for writing a piece about the government for anti government propaganda or something like that. So there is one example that won't happen in america.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1511926015.0,
    "date_created": "2017-11-28",
    "time_created": "14:26:55",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh7oow",
    "parent_id": "t1_dqgptmh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You serious? Lots of freedoms in America. I've lived on 3 continents and prefer the US of A. No place is perfect, but I love the uncomfortable tension of people being allowed to think what they want, say what they want, do what they want, etc. That's been my experience.\n",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511937615.0,
    "date_created": "2017-11-28",
    "time_created": "17:40:15",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgra4d",
    "parent_id": "t1_dqgptmh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Free speech, having the right to an attorney for criminal trial, being free from cruel and unusual punishment, not having slavery, having jus soli citizenship (a foolish policy but I guess it fits here),  being entitled to a certain degree of privacy from government searches and seizure, somewhat decentralized government, having some \"right\" to an abortion (don't agree with it but I guess some people see that as freedom), freedom of movement, etc.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1511921928.0,
    "date_created": "2017-11-28",
    "time_created": "13:18:48",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgv82i",
    "parent_id": "t1_dqgqmfb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Probably from the billboards wolves put up everywhere.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511925730.0,
    "date_created": "2017-11-28",
    "time_created": "14:22:10",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh1uvm",
    "parent_id": "t1_dqgqmfb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Nestle would like to privatize water - after all, why should drinking water be a right? So enjoy that while you can. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511931968.0,
    "date_created": "2017-11-28",
    "time_created": "16:06:08",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgz4iz",
    "parent_id": "t1_dqgvpvd",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That I agree with. But things like health care likely won't be an easily solved local solution.\n\nEven with the weed regulations republicans are being dragged along kicking and screaming. We got medical in Florida and republicans are doing everything they can to make it as impossible as possible to get it.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511929467.0,
    "date_created": "2017-11-28",
    "time_created": "15:24:27",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpwec",
    "parent_id": "t1_dqgphhc",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[`BOINK INITIATED`](http://i.imgur.com/w5rON8J.gifv)",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1511920614.0,
    "date_created": "2017-11-28",
    "time_created": "12:56:54",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgr0jh",
    "parent_id": "t1_dqgqnx3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Some see a downvote, I see an up-penis. An upenis, if you will. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511921676.0,
    "date_created": "2017-11-28",
    "time_created": "13:14:36",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgqkmi",
    "parent_id": "t1_dqgphuy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Uhm I was told by an FCC commissioner that plenty of people can and do live without the internet and live a successful life so I'm going to listen to him instead of some guy on a website that obviously wants to keep the internet to itself.\n\n^^/s",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1511921254.0,
    "date_created": "2017-11-28",
    "time_created": "13:07:34",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgtmjx",
    "parent_id": "t1_dqgphuy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm actually super curious about this aspect. What happens when comcast starts blocking or throttling traffic, say VPN traffic to get around blocks, but it ends up hurting people who VPN into their corporate network to do work.\n\nNow as a company you might reimburse your IT guys who need it semi-regularly but what about people working remotely that just sometimes need it? What about technologies like Citrix or RDP?\n\nAdditionally what about businesses in general. Since they have a business account, are they going to keep the same free and open internet? If that's the case are we all just going to move to business accounts?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511924195.0,
    "date_created": "2017-11-28",
    "time_created": "13:56:35",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgqr8d",
    "parent_id": "t1_dqgp1l2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">yeah that is kinda weird when you think about it. also you dont know this person, why are you proud of a person that sorta kinda looks like you.\n\nWhy is anyone proud when their country wins the Olympics? You don't know the actual athletes.",
    "controversiality": 0,
    "ups": 81,
    "downs": 0,
    "score": 81,
    "created": 1511921430.0,
    "date_created": "2017-11-28",
    "time_created": "13:10:30",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpfre",
    "parent_id": "t1_dqgp1l2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Because it's kinda a legacy thing ?",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1511920168.0,
    "date_created": "2017-11-28",
    "time_created": "12:49:28",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgsop7",
    "parent_id": "t1_dqgp1l2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It wouldn't be a big deal if the kid was Indian in India. Just 1 of a billion \n\nBut if you are an immigrant to another country, you do care, because anything positive helps your entire group's image in that society, and anything negative about even one person, feels like it hurts everyone's image",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1511923292.0,
    "date_created": "2017-11-28",
    "time_created": "13:41:32",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgt974",
    "parent_id": "t1_dqgp1l2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Being proud of your heritage and the people that share it as well as seeing good representation of people like yourself.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511923840.0,
    "date_created": "2017-11-28",
    "time_created": "13:50:40",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgyed3",
    "parent_id": "t1_dqguu9p",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Wait a second... I'm sure good ole gramps is just as anti evil, monopolistic corporations as the rest of us here.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511928778.0,
    "date_created": "2017-11-28",
    "time_created": "15:12:58",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh0cg4",
    "parent_id": "t1_dqgw6za",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "By itself, I actually like the name Adolf. It rhymes with Rudolph and I like Rudolph. \n\nI feel you though.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511930564.0,
    "date_created": "2017-11-28",
    "time_created": "15:42:44",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgsobg",
    "parent_id": "t1_dqgqmqr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Teja main hoon, mark idhar hai! ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1511923283.0,
    "date_created": "2017-11-28",
    "time_created": "13:41:23",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgpnby",
    "parent_id": "t1_dqgnv65",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Trump is already the embodiment of that meme.\n\nHis whole platform has been based on being a \"winning\" side in politics, which means someone always needs to be hurt. It doesn't matter if there is a large amount of opposition against anything he does, because that just shows how much he won and the other side lost.",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1511920375.0,
    "date_created": "2017-11-28",
    "time_created": "12:52:55",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh01z2",
    "parent_id": "t1_dqgzggr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That basically it. It's crazy because I know that the TD during the campaign even would have been staunch Pro NN. Crazy how a year of overmoderation and echo chamber + shills can completely take over a population in one year ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511930300.0,
    "date_created": "2017-11-28",
    "time_created": "15:38:20",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgwmim",
    "parent_id": "t1_dqgwf0s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 101,
    "downs": 0,
    "score": 101,
    "created": 1511927085.0,
    "date_created": "2017-11-28",
    "time_created": "14:44:45",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgwokx",
    "parent_id": "t1_dqgwghw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511927138.0,
    "date_created": "2017-11-28",
    "time_created": "14:45:38",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgzu7k",
    "parent_id": "t1_dqgzhd1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511930107.0,
    "date_created": "2017-11-28",
    "time_created": "15:35:07",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh0mzt",
    "parent_id": "t1_dqh05bm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "**FIRE!**",
    "controversiality": 0,
    "ups": 82,
    "downs": 0,
    "score": 82,
    "created": 1511930834.0,
    "date_created": "2017-11-28",
    "time_created": "15:47:14",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgynnw",
    "parent_id": "t1_dqgxqho",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "TL;DR;TL;DR: Nestle kills babies.",
    "controversiality": 0,
    "ups": 178,
    "downs": 0,
    "score": 178,
    "created": 1511929027.0,
    "date_created": "2017-11-28",
    "time_created": "15:17:07",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgyrs1",
    "parent_id": "t1_dqgxuxd",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "A government can have the same problem when arbitrary internal targets have to be met, like police handing out false tickets to hit quotas. I believe the solution *always* has to be regulation, oversight and measures against the endless accumulation of power and wealth. Whether the underlying system is capitalistic, socialistic or any other form.",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1511929135.0,
    "date_created": "2017-11-28",
    "time_created": "15:18:55",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgui93",
    "parent_id": "t1_dqgrqhg",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Mail service in Africa is shiet.\n\nMum sent a priority rated package (would be overnight in the states). It took it 3 months to get there. Then they lost it. 4 post offices and another 2 months later I got my Christmas cookies and coffee.\n\n200 thumb drives would never arrive because the postal/customs workers would read \"usb drives x 200: value $500USD\" and that package would disappear. You might find your sticks being sold on an overpass somewhere, though.",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1511925037.0,
    "date_created": "2017-11-28",
    "time_created": "14:10:37",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgvjxn",
    "parent_id": "t1_dqgrqhg",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "No, you are falling behind Africa ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511926046.0,
    "date_created": "2017-11-28",
    "time_created": "14:27:26",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqguqun",
    "parent_id": "t1_dqgthaj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Probably cost less as well.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511925264.0,
    "date_created": "2017-11-28",
    "time_created": "14:14:24",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgq8ka",
    "parent_id": "t1_dqgq3r1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "As they say, technically correct *is* the best kind of correct; unfortunately I don’t think it was accurate portraying the point XD",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1511920933.0,
    "date_created": "2017-11-28",
    "time_created": "13:02:13",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgq7d3",
    "parent_id": "t1_dqgpq1l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It’s a dwarf planet legend.",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1511920901.0,
    "date_created": "2017-11-28",
    "time_created": "13:01:41",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgxxim",
    "parent_id": "t1_dqgrcvw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "https://giphy.com/gifs/n0eJLge10ujSM/html5",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511928325.0,
    "date_created": "2017-11-28",
    "time_created": "15:05:25",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh0crx",
    "parent_id": "t1_dqgtrss",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's probably more so because you don't see folks on the right on the majority of reddit, either because they are downvoted, or they avoid making it known they are right because they know they will be downvoted.\n\nI know because I tend to lean right on more issues than I lean left, and I can't share my opinions without ending up with 30+ downvotes. It's not like they are far-right opinions either, they are fairly moderate.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511930572.0,
    "date_created": "2017-11-28",
    "time_created": "15:42:52",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgylsg",
    "parent_id": "t1_dqgxveb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Eh, it's a valid reason. Let me know if you need more details.\n\n\nAlso, an advice. India is extremely overwhelming, even for natives because of how extremely diverse it is. If you do come to India, you should consider having someone you trust to show you around or travel along. Not a tour guide. I mean, a friend, especially since you want to smoke up.",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1511928977.0,
    "date_created": "2017-11-28",
    "time_created": "15:16:17",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgundw",
    "parent_id": "t1_dqgttv0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Huh, didn't know I was a Hindu up until now. ",
    "controversiality": 0,
    "ups": 48,
    "downs": 0,
    "score": 48,
    "created": 1511925173.0,
    "date_created": "2017-11-28",
    "time_created": "14:12:53",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgzso6",
    "parent_id": "t1_dqgttv0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "As a tourist I completely gave up trying to figure out whether or not smoking Ganja was legal. According to some of my fellow backpackers, it doesn't even matter, as long as you know how baksheesh works. Which is really hard to comprehend when you're from a western country where attempting to bribe a police officer is the stupidest thing you can do.\n\nMaybe you can clear up my confusion. Aren't Ganja and Bhaang the same thing, except that it's called Ganja when you smoke it, and Bhaang when you eat or drink it? Or is there more to it?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511930070.0,
    "date_created": "2017-11-28",
    "time_created": "15:34:30",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh2xjc",
    "parent_id": "t1_dqgq26x",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Mate most of Asia has like 10% tax tops. Unless you're American in that case you're \"free\" to pay the difference to America.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511932973.0,
    "date_created": "2017-11-28",
    "time_created": "16:22:53",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgq4n6",
    "parent_id": "t1_dqgq0ls",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "pretty sure the only European country with conscription is Finland..",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1511920831.0,
    "date_created": "2017-11-28",
    "time_created": "13:00:31",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh0zto",
    "parent_id": "t1_dqgtmjx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's just a racket now. \n\nISP: \"Hey, that's a nice little internet business you got yerself there... It'd be a shame if anything ... *happened* to it",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511931162.0,
    "date_created": "2017-11-28",
    "time_created": "15:52:42",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqguytw",
    "parent_id": "t1_dqgqr8d",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Problem is. When someone wins the award for their country in Olympics they are that country's Citizens. \n\nI'm an Indian(well, was technically) and I find it weird when Indians get all proud of people who are not Indians. Just descendents of Indian migrants and citizens of other countries. The other countries would be proud of them.\n\nI've always been curious about this since childhood. I guess it's an ethnicity thing?",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1511925476.0,
    "date_created": "2017-11-28",
    "time_created": "14:17:56",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgsua2",
    "parent_id": "t1_dqgsobg",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Asli Teja main hoon, ye dekh gaal pe  X ka mark.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511923443.0,
    "date_created": "2017-11-28",
    "time_created": "13:44:03",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgwrwj",
    "parent_id": "t1_dqgwmim",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 55,
    "downs": 0,
    "score": 55,
    "created": 1511927228.0,
    "date_created": "2017-11-28",
    "time_created": "14:47:08",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh0qju",
    "parent_id": "t1_dqh0mzt",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "^(^heart)",
    "controversiality": 0,
    "ups": 91,
    "downs": 0,
    "score": 91,
    "created": 1511930923.0,
    "date_created": "2017-11-28",
    "time_created": "15:48:43",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh1nxw",
    "parent_id": "t1_dqgynnw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "i can make this amount of TL;DRs and sell it to you",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511931783.0,
    "date_created": "2017-11-28",
    "time_created": "16:03:03",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgz06p",
    "parent_id": "t1_dqgyrs1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Well, fair enough then.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511929352.0,
    "date_created": "2017-11-28",
    "time_created": "15:22:32",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgwx3x",
    "parent_id": "t1_dqgui93",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Why don't you specify the specific country instead of generalising 50+ countries ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1511927365.0,
    "date_created": "2017-11-28",
    "time_created": "14:49:25",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgs1ox",
    "parent_id": "t1_dqgq8ka",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Behold a humble redditor in the wild in its natural habitat. ",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1511922665.0,
    "date_created": "2017-11-28",
    "time_created": "13:31:05",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgs6mc",
    "parent_id": "t1_dqgq7d3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Did you ever hear the tragedy of Darth Pluto The Wise? I thought not. It’s not a story the Astronomers would tell you. It’s a Dwarf planet legend. Darth Pluto was a Dark Lord of the Planets, so powerful and so wise he could influence the astronomers to keep him as a real planet… He had such a knowledge of the dark side that he could even keep the ones he cared about from dying. The dark side of astronomy is a pathway to many abilities some consider to be unnatural. He became so powerful… the only thing he was afraid of was losing his power, which eventually, of course, he did. Unfortunately, he taught his apprentice mike brown everything he knew, then his apprentice turned him into a dwarf planet. Ironic. He could save others from becoming dwarf planets, but not himself.",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1511922805.0,
    "date_created": "2017-11-28",
    "time_created": "13:33:25",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgs047",
    "parent_id": "t1_dqgq7d3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Dwarf Pluto the Planet was a dark rock of the Solar System so powerful and so wise, he could use his gravity to influence the Kuiper Belt to create...comets.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1511922624.0,
    "date_created": "2017-11-28",
    "time_created": "13:30:24",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh0rca",
    "parent_id": "t1_dqgylsg",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">even for natives  \n\nWord",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1511930943.0,
    "date_created": "2017-11-28",
    "time_created": "15:49:03",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh5905",
    "parent_id": "t1_dqgylsg",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm actually super fuckin poor so I won't be visiting any time soon. I'll hit you up when I get to India in like 60 years.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511935147.0,
    "date_created": "2017-11-28",
    "time_created": "16:59:07",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgv6lm",
    "parent_id": "t1_dqgundw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Swagatam",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1511925688.0,
    "date_created": "2017-11-28",
    "time_created": "14:21:28",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh58is",
    "parent_id": "t1_dqgzso6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Gaanja is just plain ole weed. Bhaang is a drink with a little weed mixed in. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1511935134.0,
    "date_created": "2017-11-28",
    "time_created": "16:58:54",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgqfaa",
    "parent_id": "t1_dqgq4n6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Switzerland",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1511921112.0,
    "date_created": "2017-11-28",
    "time_created": "13:05:12",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgti4i",
    "parent_id": "t1_dqgsua2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "??",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511924079.0,
    "date_created": "2017-11-28",
    "time_created": "13:54:39",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgtv0x",
    "parent_id": "t1_dqgsua2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "???",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511924420.0,
    "date_created": "2017-11-28",
    "time_created": "14:00:20",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgwv5r",
    "parent_id": "t1_dqgwrwj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 48,
    "downs": 0,
    "score": 48,
    "created": 1511927314.0,
    "date_created": "2017-11-28",
    "time_created": "14:48:34",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh197s",
    "parent_id": "t1_dqh0qju",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "**WATER!** *^Damn ^it, ^Heart! ^Speak ^up ^so ^the ^captian ^can ^hear ^you!*",
    "controversiality": 0,
    "ups": 85,
    "downs": 0,
    "score": 85,
    "created": 1511931404.0,
    "date_created": "2017-11-28",
    "time_created": "15:56:44",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh18an",
    "parent_id": "t1_dqh0qju",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "By Your Powers Combined, **I AM CAPTA**--   \n... *wait, where's wind and water?*",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1511931379.0,
    "date_created": "2017-11-28",
    "time_created": "15:56:19",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh04km",
    "parent_id": "t1_dqgwx3x",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "South Africa. Heidelberg. 30-ish kms south of Jo-berg.\n\nDoes that help?\n\nHowever, mail to Equatorial Guinea and Ghana suck worse, so you can kinda take your pick. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511930365.0,
    "date_created": "2017-11-28",
    "time_created": "15:39:25",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgv6y6",
    "parent_id": "t1_dqgs1ox",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Even threw in the \"XD\" to keep from being perfect.  ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511925699.0,
    "date_created": "2017-11-28",
    "time_created": "14:21:39",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqguem1",
    "parent_id": "t1_dqgs6mc",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "+1 for accuracy.  \n\nMike Brown was the astronomer that \"killed\" Pluto.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511924938.0,
    "date_created": "2017-11-28",
    "time_created": "14:08:58",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh5xym",
    "parent_id": "t1_dqh5905",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Cool. Let me know.\n\n!RemindMe 60 years",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511935835.0,
    "date_created": "2017-11-28",
    "time_created": "17:10:35",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh6mku",
    "parent_id": "t1_dqh58is",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Thanks for the explanation. I'm more of a charas guy anyway. Boom Shankar.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511936525.0,
    "date_created": "2017-11-28",
    "time_created": "17:22:05",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgwwxe",
    "parent_id": "t1_dqgwv5r",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1511927360.0,
    "date_created": "2017-11-28",
    "time_created": "14:49:20",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqgwxec",
    "parent_id": "t1_dqgwv5r",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1511927372.0,
    "date_created": "2017-11-28",
    "time_created": "14:49:32",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh1bms",
    "parent_id": "t1_dqh197s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "**WIND!**",
    "controversiality": 0,
    "ups": 70,
    "downs": 0,
    "score": 70,
    "created": 1511931466.0,
    "date_created": "2017-11-28",
    "time_created": "15:57:46",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh1hjk",
    "parent_id": "t1_dqh18an",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yup, we're fucked",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1511931618.0,
    "date_created": "2017-11-28",
    "time_created": "16:00:18",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh3wd9",
    "parent_id": "t1_dqh18an",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> **I AM CAPTCHA**\n\nNo bots allowed",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1511933882.0,
    "date_created": "2017-11-28",
    "time_created": "16:38:02",
    "submission_id": "worldnews-7g4za4"
  },
  {
    "id": "dqh22j9",
    "parent_id": "t1_dqh18an",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Well great, those are the two we actually needed here.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511932170.0,
    "date_created": "2017-11-28",
    "time_created": "16:09:30",
    "submission_id": "worldnews-7g4za4"
  }
]