[
  {
    "id": "dij696k",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "I think in the areas where Google Fiber is available, they should use this as an opportunity to steal customers from traditional ISP's.\n\n\"We will not throttle your traffic, but here is a list of the ISPs in your area that will.  And here is a list of those that contributed and cash lobbied congress, the senate, and the fcc to get net neutrality revoked.\"\n\nIf you can't stop the end of net neutrality then at least take business away from those entities that benefit from its demise.",
    "controversiality": 0,
    "ups": 700,
    "downs": 0,
    "score": 700,
    "created": 1496788153.0,
    "date_created": "2017-06-06",
    "time_created": "10:29:13",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5n3k",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "I wrote my senator asking him to keep net neutrality he wrote me back and says he doesn't support net neutrality giving some ridiculous excuse that doesn't make any sense to me. Here ya go check it out http://i.imgur.com/cDCWZmu.jpg",
    "controversiality": 0,
    "ups": 2767,
    "downs": 0,
    "score": 2767,
    "created": 1496787463.0,
    "date_created": "2017-06-06",
    "time_created": "10:17:43",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "diizphm",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "gonna be interesting with amazon on board\n\nEDIT: since some good info is buried down on this page:\n\nfrom user /u/Brightlight247\n\nJuly 12th is the day of protest. To me this is significant for a couple reasons. Obviously net neutrality is critical, but also there is something so important about putting spoiled rotten idiotic jerks in their place. Don't be fooled by this administration, the USA still has incredible individuals fighting for progress. Be the change, and together we will win. \n\nfrom user /u/ourari:\n\nCampaign site for that day: https://www.battleforthenet.com/july12/",
    "controversiality": 0,
    "ups": 6227,
    "downs": 0,
    "score": 6227,
    "created": 1496778699.0,
    "date_created": "2017-06-06",
    "time_created": "07:51:39",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij52e6",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "Where is netflix?  Oh that's right, they think they are too fucking big to care anymore!",
    "controversiality": 0,
    "ups": 1987,
    "downs": 0,
    "score": 1987,
    "created": 1496786811.0,
    "date_created": "2017-06-06",
    "time_created": "10:06:51",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij41f2",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "FYI all you non article readers: July 12th is the day of protest. To me this is significant for a couple reasons. Obviously net neutrality is critical, but also there is something so important about putting spoiled rotten idiotic jerks in their place. Don't be fooled by this administration, the USA still has incredible individuals fighting for progress. Be the change, and together we will win. ",
    "controversiality": 0,
    "ups": 2185,
    "downs": 0,
    "score": 2185,
    "created": 1496785497.0,
    "date_created": "2017-06-06",
    "time_created": "09:44:57",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij580p",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "ajit pai is a piece of shit. \n",
    "controversiality": 0,
    "ups": 1000,
    "downs": 0,
    "score": 1000,
    "created": 1496787000.0,
    "date_created": "2017-06-06",
    "time_created": "10:10:00",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij617k",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "Disappointed not seeing Netflix in this group ",
    "controversiality": 0,
    "ups": 169,
    "downs": 0,
    "score": 169,
    "created": 1496787905.0,
    "date_created": "2017-06-06",
    "time_created": "10:25:05",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij4lib",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "That's because Amazon, Netflix, Google and most other websites we take for granted wouldn't be allowed to exist if cable companies like Comcast get to pick winners and losers. Comcast would make deals with it's advertising partners and simply block data to companies that compete, either directly with Comcast or with advertisers. Imagine having to go to the mall to buy things again, because big players from the 80's like Sears in collaboration with Comcast could control what businesses are allowed to succeed online. ",
    "controversiality": 0,
    "ups": 417,
    "downs": 0,
    "score": 417,
    "created": 1496786216.0,
    "date_created": "2017-06-06",
    "time_created": "09:56:56",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij1khd",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "Fight the power.\n\nThe cable lobby spends almost as much as Northrop-Grumman lobbying for favors. ",
    "controversiality": 0,
    "ups": 461,
    "downs": 0,
    "score": 461,
    "created": 1496781925.0,
    "date_created": "2017-06-06",
    "time_created": "08:45:25",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6cyi",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "Could we literally just make a kickstarter to bribe congress ourselves?",
    "controversiality": 0,
    "ups": 136,
    "downs": 0,
    "score": 136,
    "created": 1496788269.0,
    "date_created": "2017-06-06",
    "time_created": "10:31:09",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5vzl",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "Tech companies need to stand together on this the way that ISPs are. \nThey're literally trying to neuter the internet - establish themselves as gateways aka barriers of entry to internet companies. There is no better verb.",
    "controversiality": 0,
    "ups": 66,
    "downs": 0,
    "score": 66,
    "created": 1496787740.0,
    "date_created": "2017-06-06",
    "time_created": "10:22:20",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5qa8",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "I can't believe this is still a conversation. It's like denying wether the government should be allowed to kidnap kids and raise them as child soldiers. \n\nFor those wondering, you shouldn't be allowed to steal kids and raise them as soldiers, it's obviously the wrong thing to do.",
    "controversiality": 0,
    "ups": 304,
    "downs": 0,
    "score": 304,
    "created": 1496787562.0,
    "date_created": "2017-06-06",
    "time_created": "10:19:22",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij4xnh",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "I wonder if Amazon could technically throttle their services to certain regions with certain Ip addresses or subnets.",
    "controversiality": 0,
    "ups": 220,
    "downs": 0,
    "score": 220,
    "created": 1496786644.0,
    "date_created": "2017-06-06",
    "time_created": "10:04:04",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij1gx1",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "Amazon not going to change the minds of Congress. You got ISP's paying premium lobbying dollars to make this happen. Hopefully it will be able to be rolled back in 2020\n\nThe FCC’s Open Internet Policy Statement of 2005 affirmed consumers’ rights to access the lawful content, services, and applications of their choice in a competitive marketplace. No one wants broadband providers blocking or throttling traffic.",
    "controversiality": 0,
    "ups": 511,
    "downs": 0,
    "score": 511,
    "created": 1496781769.0,
    "date_created": "2017-06-06",
    "time_created": "08:42:49",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij516e",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "Republicans love the free market except when companies like Netflix and amazon primes streaming options take away cable providers revenues by offering on demand ad free services for just a fraction of a cost of even a basic cable plan",
    "controversiality": 0,
    "ups": 216,
    "downs": 0,
    "score": 216,
    "created": 1496786768.0,
    "date_created": "2017-06-06",
    "time_created": "10:06:08",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij61vh",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "I had a question, if net neutrality is killed and ISPs can clamp down on the internet, what is stopping someone like an Amazon or Google from starting their own \"Truly Free\" internet service? Feel like whoever did that would make a ton of money. ",
    "controversiality": 0,
    "ups": 134,
    "downs": 0,
    "score": 134,
    "created": 1496787926.0,
    "date_created": "2017-06-06",
    "time_created": "10:25:26",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5an8",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "This make me overwhelmed that one major online retailers and biggest names on the net is supporting this. Makes me have a little hope, was just explaining to my gf the other day how London was wanting to start monitoring or regulating their Internet in the wake of the terrorist attacks.\n\nTime will tell ",
    "controversiality": 0,
    "ups": 63,
    "downs": 0,
    "score": 63,
    "created": 1496787080.0,
    "date_created": "2017-06-06",
    "time_created": "10:11:20",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5f13",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "Why not just work on getting the IP address of every Congressman representative and other senior politician in the country. Basically lock them out of the internet for the day. Show them that we mean business",
    "controversiality": 0,
    "ups": 66,
    "downs": 0,
    "score": 66,
    "created": 1496787212.0,
    "date_created": "2017-06-06",
    "time_created": "10:13:32",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dije8rh",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "The saddest thing about this to me is how much this is evidence that we don't live in a representative democracy anymore but a plutocratic oligarchy. What the citizens of the US want is completely irrelevant at this point. It's going to be a battle of power between a few wealthy interests that govern out fate. Here we are cheering on our wealthy champions to hopefully beat the wealthy champions of the other side. None of this is about what the electorate wants. We're in need of a complete revolution at this point.",
    "controversiality": 0,
    "ups": 64,
    "downs": 0,
    "score": 64,
    "created": 1496796784.0,
    "date_created": "2017-06-06",
    "time_created": "12:53:04",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5j8q",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "\"Day of action\" ... anything we non-Amazon-executives can do on this day of action? Just the usual phone calls and letters?",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1496787341.0,
    "date_created": "2017-06-06",
    "time_created": "10:15:41",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijc633",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "I really don't understand how anyone could be against Net Neutrality. Do they enjoy being able to go to any website and use any internet based service without interruption and without having to pay additional costs? Well, without Net Neutrality ISP's can charge you based on your traffic and lock out access to websites unless you pay for them much like a cable subscription. Like Netflix at fast speeds? Well your ISP can throttle bandwidth as they see fit without Net Neutrality. Have a startup business that is internet based? Well unless you pay a premium fee to your ISP they will block people from using your website and throttle your bandwidth for other websites that have paid for a premium service without Net Neutrality.",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1496794598.0,
    "date_created": "2017-06-06",
    "time_created": "12:16:38",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij28x9",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "but... but... FCC chairman claims violation of open internet will better the lives of the American public.",
    "controversiality": 0,
    "ups": 182,
    "downs": 0,
    "score": 182,
    "created": 1496782966.0,
    "date_created": "2017-06-06",
    "time_created": "09:02:46",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5zmw",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "netflix, of course, no longer gives a fuck",
    "controversiality": 0,
    "ups": 74,
    "downs": 0,
    "score": 74,
    "created": 1496787856.0,
    "date_created": "2017-06-06",
    "time_created": "10:24:16",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5ynu",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "I can't wait for Elon Musk to start sending his free internet satellites into orbit.",
    "controversiality": 0,
    "ups": 55,
    "downs": 0,
    "score": 55,
    "created": 1496787826.0,
    "date_created": "2017-06-06",
    "time_created": "10:23:46",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij71s5",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "Gee, Netflix, Amazon isn't too big to fight Net Neutrality...",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1496789037.0,
    "date_created": "2017-06-06",
    "time_created": "10:43:57",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij1rmr",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "Its funny that Republicans voted Trump to be against the establishment but thw establishment don't support net neutrality because out of greed.",
    "controversiality": 0,
    "ups": 193,
    "downs": 0,
    "score": 193,
    "created": 1496782240.0,
    "date_created": "2017-06-06",
    "time_created": "08:50:40",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5are",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "this is a protest I would actually consider going to ",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1496787084.0,
    "date_created": "2017-06-06",
    "time_created": "10:11:24",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6twl",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "The important thing to remember is that the Chairman of the FCC, Ajit Pai, was put there thanks to Verizon, and all of his irrational decisions (seriously, bitching about FCC procedures that have been in place for decades is the only thing that has come out of his mouth based on fact or logic) can be interpreted as benefiting Verizon directly.\n\nAjit Pai is the worst kind of human being, and the very worst person that could possibly have been made Chairman of the FCC. I guess Trump could have gone ahead and made an ISP CEO Chairman, and that might've been worse, but at least it would have been more obvious.\n\nEven worse? Ajit Pai is a monster. Not the metaphorical kind either. He is literally an undead dingo the size of a mid-sized sedan that goes around eating children under the age of three, all without causing the slightest disquiet to those around him. Those following Ajit's career have labelled this \"the Derry Effect.\" We've reviewed over 50,000 police reports involving children under the age of five between 2010 up to the present date, for Maryland and the District of Columbia, analyzed them with a deep-learning algorithm trained on confirmed Ajit kills, and discovered that he's been devoured nearly 12,300 infants, children, and unborn feti since he was made commissioner in 2012, almost all of which were falsely flagged as kidnapping or SIDS, even when factual evidence (like the presence of bones or disembodied appendages) made these conclusions unlikely.\n\nWe've lost at least three investigators trying to get close to him. He appears to live in the tunnels beneath central D.C., and we've had at least one report that he keeps the heads and spines of his victims down there somewhere, spinal cords wrapped around disused utility pipes, allowing the brains to 'ripen' with rot, which Ajit Pai, Chairman of the FCC, appears to prefer.\n\nSo yeah. Real-life horror show. Trump put a literal monster into power at the FCC.\n\nAlso? He's a shitty lawyer. Almost every legal conclusion he's ever advanced ('almost' because I haven't reviewed his pre-FCC work yet) is hilariously wrong, and his rhetoric is garbage too. You can see him fumbling standard Republican rhetoric very badly recently, too.",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1496788799.0,
    "date_created": "2017-06-06",
    "time_created": "10:39:59",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5gly",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "so I get the current  head of the fcc has his own agenda with net neutrality repeal. but I feel it doesn't matter how many companies back it. for Trump and his cronies it's about a total repeal of everything Obama did and a total dismantling of the federal government aside from the military. at this point if the could resurrect Osama and put him back in power they would just because he died under Obama. ",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1496787260.0,
    "date_created": "2017-06-06",
    "time_created": "10:14:20",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7kg8",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "If you don't know what this is all about, Trump's FCC chairman, Ajit Pai, wants to make it legal for ISP monopolies to create artificial barriers between customers and websites, so they can then charge a fee to remove those barriers. In other words, he wants to decriminalize extortion for internet providers. \n\n\nHis reasoning is that ISPs would never do this because everyone would just switch to an internet provider that didn't charge artificial fees. \n\n\nThat's right, Trump's FCC chairman is pretending that we live in a world where there's more than just one ISP to choose from. \n\nSo either Pai is the most delusional or the most dishonest man on the planet. I'm guessing it's the latter. At least Trump is honest about not giving a fuck about a free market. ",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1496789617.0,
    "date_created": "2017-06-06",
    "time_created": "10:53:37",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij1q5p",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "This is a symptom of a bigger problem, which is blindly believing whatever what the padlrty you support says. If you say what net neutrality is without saying what its called, most people would support it.\n\n",
    "controversiality": 0,
    "ups": 73,
    "downs": 0,
    "score": 73,
    "created": 1496782174.0,
    "date_created": "2017-06-06",
    "time_created": "08:49:34",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij80bo",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "This is a corporatist's wet dream. On one side you have cable companies seeking to control the flow of information through their networks, and on the other you have corporations like Amazon and Google trying to expand their control over the flow of information on the internet. \n\nIt doesn't matter who wins, we lose. ",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1496790104.0,
    "date_created": "2017-06-06",
    "time_created": "11:01:44",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij30p0",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "Never forget, Trump voters: you voted *against* net neutrality.",
    "controversiality": 0,
    "ups": 309,
    "downs": 0,
    "score": 309,
    "created": 1496784100.0,
    "date_created": "2017-06-06",
    "time_created": "09:21:40",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij9woj",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "tbh i dont think they realize how easily microsoft, google and yahoo could shut down the internet. imagine if those search engines went offline for a day, theyre big enough for it not to be suicide. throw in the major social networks and gaming platforms, aws and you have a recipe for chaos.  \n  \nit would be a nice demonstration that isp's have nothing without them....actually this sounds like it would be really fucking entertaining to see happen",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1496792165.0,
    "date_created": "2017-06-06",
    "time_created": "11:36:05",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5k6j",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "While they're at it, could they help us if May gets in with her draconian sounding regulation fetish?",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1496787370.0,
    "date_created": "2017-06-06",
    "time_created": "10:16:10",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7me4",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "So much for republicans loving the \"free market\". ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496789675.0,
    "date_created": "2017-06-06",
    "time_created": "10:54:35",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijo27y",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "If only we could have elected Bernie and avoided all the issues of the past 5 months. Such a shame.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1496807003.0,
    "date_created": "2017-06-06",
    "time_created": "15:43:23",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij1mwe",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "Seems out of place for Greenpeace to be involved in this. ",
    "controversiality": 0,
    "ups": 78,
    "downs": 0,
    "score": 78,
    "created": 1496782030.0,
    "date_created": "2017-06-06",
    "time_created": "08:47:10",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5i0k",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "Mark my words:  This removal of net neutrality and undermining of consumer protections is a ploy to allow the big ISP to screw up badly enough to allow the Fed to nationalize control of the internet and thus no longer need a warrant to access anything.",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1496787302.0,
    "date_created": "2017-06-06",
    "time_created": "10:15:02",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij8hb2",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "The Internet is like air, it should be clean and free.\nImagine someone giving you a straw and saying you had to breathe through it and if you wanted more air you had keep paying for as long as you use the larger straw :(",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1496790625.0,
    "date_created": "2017-06-06",
    "time_created": "11:10:25",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij64kf",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "Keep your hands off my internet!",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1496788010.0,
    "date_created": "2017-06-06",
    "time_created": "10:26:50",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7gqp",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "Anything good in the next 4 years is going to have to come from the people because Trump is destroying the governments ability to operate in an effective way. Thanks for nothing Mr Trump!",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496789503.0,
    "date_created": "2017-06-06",
    "time_created": "10:51:43",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7sfv",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "I really don't understand how anyone could be against Net Neutrality. Do they enjoy being able to go to any website and use any internet based service without interruption and without having to pay additional costs? Well, without Net Neutrality ISP's can charge you based on your traffic and lock out access to websites unless you pay for them much like a cable subscription. Like Netflix at fast speeds? Well your ISP can throttle bandwidth as they see fit without Net Neutrality. Have a startup business that is internet based? Well unless you pay a premium fee to your ISP they will block people from using your website and throttle your bandwidth for other websites that have paid for a premium service without Net Neutrality.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496789862.0,
    "date_created": "2017-06-06",
    "time_created": "10:57:42",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijbhqp",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "If you don't know what this is all about, Trump's FCC chairman, Ajit Pai, wants to make it legal for ISP monopolies to create artificial barriers between customers and websites, so they can then charge a fee to remove those barriers. In other words, he wants to decriminalize extortion for internet providers.\nHis reasoning is that ISPs would never do this because everyone would just switch to an internet provider that didn't charge artificial fees.\nThat's right, Trump's FCC chairman is pretending that we live in a world where there's more than just one ISP to choose from.\nSo either Pai is the most delusional or the most dishonest man on the planet. I'm guessing it's the latter. At least Trump is honest about not giving a fuck about a free market.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496793866.0,
    "date_created": "2017-06-06",
    "time_created": "12:04:26",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijef0q",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "Amazon, Youtube, etc NEED to shut down their services for 24 hours. \n\nInstead, users will get a notice as to why their site is down, with links to their reps.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496796965.0,
    "date_created": "2017-06-06",
    "time_created": "12:56:05",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijjb7v",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "Shouldn't almost every video game company/publisher be on board as well? I would imagine it would be hard to run any sort of online gaming service with Net Neutrality killed.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496802084.0,
    "date_created": "2017-06-06",
    "time_created": "14:21:24",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijn0az",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm about to cancel my netflix account.  \n'We can pay the bills, fuck net neutrality' does not get my support.\n\nEDIT: yas, finally got round to cancelling, making it clear I would be using Amazon Prime due to Amazon's NN stance",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496805902.0,
    "date_created": "2017-06-06",
    "time_created": "15:25:02",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijt2dg",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm sorry to have to break it to everyone but this is \"nothing\". These companies are just being \"spoiled rotten idiotic jerks\" trying to score good-boy points finger-pointing other \"spoiled rotten idiotic jerks\". Them staging a blackout has zero effect on ISP companies because they don't exist without ISP companies in the first place.\n\nIf Microsoft or Apple weighed in it would be meaningful since without them the majority of consumers would have no reason to use the internet in the first place, but obviously they don't care. They existed before the internet so they know how to survive.\n\nStates need to be more responsible and man up and instate their own net neutrality. They're the ones that enabled telecom companies to pocket billions of dollars back in the 90s, not the federal government. The government signed the check and the states let telecom companies line their pockets.\n\nI'm still waiting for state and federal governments to sue all the telecom companies that pocketed money back in the 90s instead of installing fiber across the nation. That's at least \"$200billion\" + inflation of tax dollars that citizens deserve a refund from.\n\nIf your state representative doesn't care about net neutrality that's where the fixing needs to start. If your representative doesn't care then nothing is going to happen no matter how many FCC rulings there are.\n\nStop making this a bi-partisan issue. Deal with the person, not the party. The party means dick-all after they're elected. If ISP companies tries to bully your state over poles, ground wires, and cell towers they should be told flat-out to fuck off. All ISP companies want to do is own those wires, they don't care if they're providing you with a service. Once they own those wires free-market dies.\n\nTL;DR Corporate action = worthless. State action = priceless.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496812354.0,
    "date_created": "2017-06-06",
    "time_created": "17:12:34",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijtzui",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "It saddens me that the fight is over maintaining relatively toothless rules to begin with. I would have hoped at this point that we'd be fighting to vastly **expand** net neutrality but instead what little protection there was is being taken away.\n\nFuckers.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496813401.0,
    "date_created": "2017-06-06",
    "time_created": "17:30:01",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij62nw",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "As we saw with climate change this past week, these politicians dont care what intelligent people at major businesses think, they are all about fooling hillbillies that somehow can read a ballot",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1496787950.0,
    "date_created": "2017-06-06",
    "time_created": "10:25:50",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6lf8",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "Like Republicans will care. I don't think Republican politicians have any sort of conscience. But really, if a bunch of corporations (and the WORLD) are against leaving something (Paris Agreement) but they do anyway, why does anyone have any faith that these companies can sway anyone?",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496788537.0,
    "date_created": "2017-06-06",
    "time_created": "10:35:37",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij71m3",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "Etsy is the real weight we needed to throw around in all this.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496789032.0,
    "date_created": "2017-06-06",
    "time_created": "10:43:52",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7j3u",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "Not that they need it but what a good marketing plan by amazon. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496789575.0,
    "date_created": "2017-06-06",
    "time_created": "10:52:55",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7ooh",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "WRITE YOUR CONGRESSMEN. You can ignore a full inbox but you can't ignore a bag full of letters.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496789746.0,
    "date_created": "2017-06-06",
    "time_created": "10:55:46",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij93b0",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "I run a business and have an online presence.  Although I have less than 100 hits a day, what can I do to participate (if anything)?",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496791286.0,
    "date_created": "2017-06-06",
    "time_created": "11:21:26",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijnlov",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "How often is it Kickstarter, Etsy, Amazon, Greenpeace, and the ACLU all get together in unison on an issue? \n\nThat should help frame just how interested the general public is in having our internet monopolies arbitrarily slow down our internet.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496806524.0,
    "date_created": "2017-06-06",
    "time_created": "15:35:24",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijpfvi",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "Being that Amazon Web Services (AWS) basically runs the internet (they run most companies' servers), I would say that Amazon supporting net neutrality is *very* fortuitous. If any company decides to not be neutral, Amazon can say, \"Get your own servers, we're not hosting you anymore,\" which will cost that company *a lot* more money than it takes for them to pay Amazon to host them. AWS even hosts Comcast, the leading anti-net neutrality company.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496808445.0,
    "date_created": "2017-06-06",
    "time_created": "16:07:25",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijqk60",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "When the *industry* has to tell the *government* to not give *the industry more freedom* something is **wrong**. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496809636.0,
    "date_created": "2017-06-06",
    "time_created": "16:27:16",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijr4be",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "Dear Twitter,\n\nPlease start charging trump per each tweet. Due to all the bandwidth he is using.\n\nThanks,\nThe internet.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496810238.0,
    "date_created": "2017-06-06",
    "time_created": "16:37:18",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6dde",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "the title is syntax hell.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1496788282.0,
    "date_created": "2017-06-06",
    "time_created": "10:31:22",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij63f7",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "Thank you Amazon. Finally a \"big guy\" standing up for us ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496787974.0,
    "date_created": "2017-06-06",
    "time_created": "10:26:14",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7250",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "Censor the Internet and catch the terrorists they said. It'll be a global source of peace they said. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496789048.0,
    "date_created": "2017-06-06",
    "time_created": "10:44:08",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij743j",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "I will re-up a year of amazon subscription services because of this. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496789109.0,
    "date_created": "2017-06-06",
    "time_created": "10:45:09",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7ulu",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "I'd love to see amazon.com slowed down to dialup speeds for a day with giant popups with links to members of congress phone and emails.  ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496789928.0,
    "date_created": "2017-06-06",
    "time_created": "10:58:48",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij84no",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "Finally! Why haven't Google, Apple, Microsoft, and other big names also joined the fight for net neutrality!?",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496790238.0,
    "date_created": "2017-06-06",
    "time_created": "11:03:58",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij8dmw",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "We should be organizing these once a week.  People need to understand that losing net neutrality isn't going to be a problem for just one day.  It will be a permanent downgrade.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496790513.0,
    "date_created": "2017-06-06",
    "time_created": "11:08:33",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij9eke",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "If Trump allows this, I will vote against him next election. Full stop.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496791625.0,
    "date_created": "2017-06-06",
    "time_created": "11:27:05",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijbkjk",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "Greenpeace?\n\nWell, normally that'd make me a bit skeptical - on things like GMOs and nuclear energy, they're basically post-truth - but they're known to occasionally support things that are sensible.\n\nI suppose the fact that net neutrality has little to do with actual environmentalism helps.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496793950.0,
    "date_created": "2017-06-06",
    "time_created": "12:05:50",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijg6a8",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "Huh, etsy seems kind of weird to be in on this but, that is awesome. Everyone should be in on stopping this.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496798810.0,
    "date_created": "2017-06-06",
    "time_created": "13:26:50",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijgadu",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "I hate that we have to rely on corporate interests to protect freedom.  \nCorporate influence is how we got into this mess in the first place.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496798928.0,
    "date_created": "2017-06-06",
    "time_created": "13:28:48",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijgu68",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "Can someone explain how this is all possible? This organization is built for the purpose to protect the consumer why do we have the head of this program against all of our demands? Shouldn't this be something where our majority voice is heard and listened too? This is just ridiculous. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496799497.0,
    "date_created": "2017-06-06",
    "time_created": "13:38:17",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijh6g1",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "If we could all tolerate some down-time, a mesh-net (edit) between existing non-corporate wifi routers running the right firmware can be created.  Then, again assuming some inconvenience, a client machine could serve data, as it already does via bit torrent, but with a different ratio to compensate for the loss of the high-speed data center infrastructure.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496799850.0,
    "date_created": "2017-06-06",
    "time_created": "13:44:10",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijhu8f",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "Unfortunately, there is one problem.\nThey do not care. Might be 85% approval for net neutrality, it does not matter. Lobby are paying Republican against it,  and this all it matters.\n",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496800524.0,
    "date_created": "2017-06-06",
    "time_created": "13:55:24",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijimll",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "What if everyone called and cancelled their home Internet service on the same day? We still have 4g and the ability to go to the library or, as one Congressman suggested, not use the Internet at all.\n\nIts not like we cant renew service but, cancelling in mass would scare the shit out of them and we'd all get better deals to sign back up... Just say no for one day. July 12th.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496801354.0,
    "date_created": "2017-06-06",
    "time_created": "14:09:14",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijjraf",
    "parent_id": "t3_6fl9em",
    "subreddit_name_prefixed": "r/news",
    "body": "This is Trump's America now, good luck with that. He'll go to any length to dismantle what the Obama administration put up.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496802549.0,
    "date_created": "2017-06-06",
    "time_created": "14:29:09",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij9kox",
    "parent_id": "t1_dij696k",
    "subreddit_name_prefixed": "r/news",
    "body": "The problem is that areas with both meaningful competition and competition that isn't just another one of the big ISPs is exceedingly rare. Most of the country lacks any significant choice in ISP. I have Comcast. Doesn't matter what I do, I either have no internet or Comcast. ",
    "controversiality": 0,
    "ups": 291,
    "downs": 0,
    "score": 291,
    "created": 1496791809.0,
    "date_created": "2017-06-06",
    "time_created": "11:30:09",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijivzx",
    "parent_id": "t1_dij696k",
    "subreddit_name_prefixed": "r/news",
    "body": "They don't need to do anything to steal customers outside build it out.  I had 2 google fiber vans across the road a few weeks ago doing something.  In the time to smoke a cig on my porch, half a dozen cars stopped when cruising by to ask when they would build out to X neighborhood in the city not including myself asking when I parked my car.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496801634.0,
    "date_created": "2017-06-06",
    "time_created": "14:13:54",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijgrqi",
    "parent_id": "t1_dij696k",
    "subreddit_name_prefixed": "r/news",
    "body": "This is actually their argument for why the restrictions don't need to be in place - that meaningful competition will keep everything on the up-and-up. The problem is that this competition doesn't exist to a meaningful degree. Sure, in some areas Google and some other companies have gotten some presence, but it's a very difficult task to enter that market when current ISPs have a stranglehold on local mandates on who can use wires or set down new ones. Hell, Google had to abandon their Fiber endeavor because of it. That should tell you just how locked down it is. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496799426.0,
    "date_created": "2017-06-06",
    "time_created": "13:37:06",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6fe6",
    "parent_id": "t1_dij5n3k",
    "subreddit_name_prefixed": "r/news",
    "body": "Just write him back with evidence that it hasn't been net neutrality that's hindering internet infrastructure growth, it's been hindered by ISPs pocketing cash that was given for that purpose and using it elsewhere.",
    "controversiality": 0,
    "ups": 2040,
    "downs": 0,
    "score": 2040,
    "created": 1496788345.0,
    "date_created": "2017-06-06",
    "time_created": "10:32:25",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6nxc",
    "parent_id": "t1_dij5n3k",
    "subreddit_name_prefixed": "r/news",
    "body": "Show the good folk down at /r/KeepOurNetFree!",
    "controversiality": 0,
    "ups": 168,
    "downs": 0,
    "score": 168,
    "created": 1496788613.0,
    "date_created": "2017-06-06",
    "time_created": "10:36:53",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij97kt",
    "parent_id": "t1_dij5n3k",
    "subreddit_name_prefixed": "r/news",
    "body": "I can make perfect sense of this for you.\n\n(1) He's referencing a report issued by an ISP think-tank suggesting that infrastructure investment has stalled. This has been widely discredited. [See here](https://www.techdirt.com/blog/netneutrality/articles/20151030/05391532674/sorry-net-neutrality-chicken-littles-title-ii-net-neutrality-still-havent-hurt-broadband-investment-slightest.shtml) **edit** [and here](https://arstechnica.com/information-technology/2017/05/title-ii-hasnt-hurt-network-investment-according-to-the-isps-themselves/). Your representative is essentially uncritically toeing the party line.\n\n(2) There is no wireline competition in the USA. Wired Internet infrastructure is a natural monopoly, and anyone claiming a need to promote competition doesn't know what they are talking about. We don't need competition, because competing against a natural monopoly is irrational. You handle natural monopoly by regulating it until it isn't a threat to consumers. Dean Heller is, again, toeing the Republican party line. Republicans often refuse to acknowledge the effects of monopoly, and recently have completely refused to acknowledge it in the context of Net Neutrality.\n\n(3) Related to (2) above, the fact that he thinks competition is a priority, and he invokes it in giving you his personal guarantee, means you are talking to the Republican party, not a person. I know senators get retained like nobody's business, but this person does not need to be in a position of power anymore. If you get a form letter from the Republican party whenever you attempt to contact your elected official, it better goddamn be a fucking Representative. At minimum, this person should not be a Senator. ",
    "controversiality": 0,
    "ups": 447,
    "downs": 0,
    "score": 447,
    "created": 1496791413.0,
    "date_created": "2017-06-06",
    "time_created": "11:23:33",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6kai",
    "parent_id": "t1_dij5n3k",
    "subreddit_name_prefixed": "r/news",
    "body": "That is why you got to vote him out in 2018. Heller is one of the only vulnerable Republicans in the Senate in 2018. You can do it Nevada. ",
    "controversiality": 0,
    "ups": 542,
    "downs": 0,
    "score": 542,
    "created": 1496788500.0,
    "date_created": "2017-06-06",
    "time_created": "10:35:00",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7b0d",
    "parent_id": "t1_dij5n3k",
    "subreddit_name_prefixed": "r/news",
    "body": "Dean Heller is a goddamn snake. He's screwed us six ways to Sunday already, and his responses are always that canned crap. I doubt he even is aware of correspondence. Here's hoping we can get rid of him soon.",
    "controversiality": 0,
    "ups": 113,
    "downs": 0,
    "score": 113,
    "created": 1496789324.0,
    "date_created": "2017-06-06",
    "time_created": "10:48:44",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijanzt",
    "parent_id": "t1_dij5n3k",
    "subreddit_name_prefixed": "r/news",
    "body": "Same thing happened to me\n\nHe said that net neutrality forced people into a \"one size fits all plan\". \n\nApparently he hasn't seen that ISPs offer different speeds for different prices. His idea of \"more options\" is more plans that cost you more to have priority",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496792980.0,
    "date_created": "2017-06-06",
    "time_created": "11:49:40",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij8dj2",
    "parent_id": "t1_dij5n3k",
    "subreddit_name_prefixed": "r/news",
    "body": "The idea that Title II is too strict is a valid concern. If they didn't already address the issue when they made the change by saying exactly which parts of Title II did and did not apply to internet.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496790510.0,
    "date_created": "2017-06-06",
    "time_created": "11:08:30",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij2z94",
    "parent_id": "t1_diizphm",
    "subreddit_name_prefixed": "r/news",
    "body": "Seriously...   Netflix and amazon could refuse to service an ISP and practically put them out of business...  if it weren't for the whole monopoly-in-certain-areas bullshit.",
    "controversiality": 0,
    "ups": 4302,
    "downs": 0,
    "score": 4302,
    "created": 1496784043.0,
    "date_created": "2017-06-06",
    "time_created": "09:20:43",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij52wv",
    "parent_id": "t1_diizphm",
    "subreddit_name_prefixed": "r/news",
    "body": "If Amazon web services joins in, literally upwards of 80% of the internet would be affected, including Reddit.   \n\nEdit: they don't need to cause downtime to make a point. Inject a banner ad into cloudfront, s3 powered websites or anything else that passes through their servers before heading to browser informing everyone about NN",
    "controversiality": 0,
    "ups": 390,
    "downs": 0,
    "score": 390,
    "created": 1496786830.0,
    "date_created": "2017-06-06",
    "time_created": "10:07:10",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij24tm",
    "parent_id": "t1_diizphm",
    "subreddit_name_prefixed": "r/news",
    "body": "Death by snu snu 😫",
    "controversiality": 0,
    "ups": 109,
    "downs": 0,
    "score": 109,
    "created": 1496782797.0,
    "date_created": "2017-06-06",
    "time_created": "08:59:57",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij4kou",
    "parent_id": "t1_diizphm",
    "subreddit_name_prefixed": "r/news",
    "body": "Especially since Netflix lives on AWS",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1496786187.0,
    "date_created": "2017-06-06",
    "time_created": "09:56:27",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij56mv",
    "parent_id": "t1_dij52e6",
    "subreddit_name_prefixed": "r/news",
    "body": "If you're a customer, contact customer support to let them know how you feel about their NN stance.",
    "controversiality": 0,
    "ups": 884,
    "downs": 0,
    "score": 884,
    "created": 1496786958.0,
    "date_created": "2017-06-06",
    "time_created": "10:09:18",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijai5k",
    "parent_id": "t1_dij52e6",
    "subreddit_name_prefixed": "r/news",
    "body": "Everyone keeps asking where is Netflix and I agree they should be there... but what about Google, Facebook, and all the others as well?  Where the fuck are you guys?  The silence is deafening...",
    "controversiality": 0,
    "ups": 165,
    "downs": 0,
    "score": 165,
    "created": 1496792807.0,
    "date_created": "2017-06-06",
    "time_created": "11:46:47",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7tth",
    "parent_id": "t1_dij52e6",
    "subreddit_name_prefixed": "r/news",
    "body": "Wait, is pornhub joining? Anyone know their reddit username? ",
    "controversiality": 0,
    "ups": 84,
    "downs": 0,
    "score": 84,
    "created": 1496789903.0,
    "date_created": "2017-06-06",
    "time_created": "10:58:23",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijdbse",
    "parent_id": "t1_dij52e6",
    "subreddit_name_prefixed": "r/news",
    "body": "Email the CEO directly\nreed.hastings@netflix.com \n\nOr hit him up on Twitter\n@reedhastings",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1496795832.0,
    "date_created": "2017-06-06",
    "time_created": "12:37:12",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijg69f",
    "parent_id": "t1_dij52e6",
    "subreddit_name_prefixed": "r/news",
    "body": "Based off of people not reading, They said they will not lead the fight anymore but they are still actively against it. They just realize the current administration is corrupt.\n\n> Hastings stressed the company is still active as FCC Chairman Ajit Pai looks to repeal current net neutrality rules, which subject internet providers to utility-like regulation in order to protect the open web. They’ve done so through one of their main lobbying groups, the Internet Association. “I think Trump’s FCC is going to unwind the rules no matter what anybody says,” Hastings said.\n> \n> Otherwise, the Netflix chief said the burden is on the rest of the startup community to fight this latest round at the FCC.\n> \n> “We had to carry the water when we were growing up and we were small,” Hastings said, “and now other companies need to be on that leading edge.\"",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1496798809.0,
    "date_created": "2017-06-06",
    "time_created": "13:26:49",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijdcsa",
    "parent_id": "t1_dij52e6",
    "subreddit_name_prefixed": "r/news",
    "body": "Amazon owns the servers Netflix uses. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496795861.0,
    "date_created": "2017-06-06",
    "time_created": "12:37:41",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij42yb",
    "parent_id": "t1_dij41f2",
    "subreddit_name_prefixed": "r/news",
    "body": "Campaign site for that day: https://www.battleforthenet.com/july12/",
    "controversiality": 0,
    "ups": 726,
    "downs": 0,
    "score": 726,
    "created": 1496785554.0,
    "date_created": "2017-06-06",
    "time_created": "09:45:54",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5697",
    "parent_id": "t1_dij41f2",
    "subreddit_name_prefixed": "r/news",
    "body": "Is congress going to be in session then? ",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1496786946.0,
    "date_created": "2017-06-06",
    "time_created": "10:09:06",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij642m",
    "parent_id": "t1_dij41f2",
    "subreddit_name_prefixed": "r/news",
    "body": "What a great way to celebrate my birthday!",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1496787994.0,
    "date_created": "2017-06-06",
    "time_created": "10:26:34",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6cg9",
    "parent_id": "t1_dij41f2",
    "subreddit_name_prefixed": "r/news",
    "body": "Needs to be more than a day. People won't notice ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496788253.0,
    "date_created": "2017-06-06",
    "time_created": "10:30:53",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij788l",
    "parent_id": "t1_dij580p",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah. Fuck him and his giant mug.",
    "controversiality": 0,
    "ups": 290,
    "downs": 0,
    "score": 290,
    "created": 1496789237.0,
    "date_created": "2017-06-06",
    "time_created": "10:47:17",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij9eu2",
    "parent_id": "t1_dij580p",
    "subreddit_name_prefixed": "r/news",
    "body": "The guy has the most punchable face on the planet hands down. He's quite the douche too, all ego no brains.",
    "controversiality": 0,
    "ups": 115,
    "downs": 0,
    "score": 115,
    "created": 1496791633.0,
    "date_created": "2017-06-06",
    "time_created": "11:27:13",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijaxbr",
    "parent_id": "t1_dij580p",
    "subreddit_name_prefixed": "r/news",
    "body": "He's gotta be the biggest conflict of interest in trumps cabinet pick. You know Verizon still has their arm fully up his ass puppeting every little dick move of his. He even admitted that he hates the United States ",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1496793254.0,
    "date_created": "2017-06-06",
    "time_created": "11:54:14",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7ky7",
    "parent_id": "t1_dij580p",
    "subreddit_name_prefixed": "r/news",
    "body": "Paice of Ajit",
    "controversiality": 0,
    "ups": 54,
    "downs": 0,
    "score": 54,
    "created": 1496789632.0,
    "date_created": "2017-06-06",
    "time_created": "10:53:52",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijcjve",
    "parent_id": "t1_dij617k",
    "subreddit_name_prefixed": "r/news",
    "body": "I cancelled my subscription when they released that, \"Yall can eat cake, we're rich\" statement.",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1496795002.0,
    "date_created": "2017-06-06",
    "time_created": "12:23:22",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij841w",
    "parent_id": "t1_dij617k",
    "subreddit_name_prefixed": "r/news",
    "body": "Why?  These companies don't have feelings.  This is all shareholder shit.  ",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1496790219.0,
    "date_created": "2017-06-06",
    "time_created": "11:03:39",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijg7id",
    "parent_id": "t1_dij617k",
    "subreddit_name_prefixed": "r/news",
    "body": "They said they will not lead the fight anymore but they are still actively against it. They just realize the current administration is corrupt.\n\n> Hastings stressed the company is still active as FCC Chairman Ajit Pai looks to repeal current net neutrality rules, which subject internet providers to utility-like regulation in order to protect the open web. They’ve done so through one of their main lobbying groups, the Internet Association. “I think Trump’s FCC is going to unwind the rules no matter what anybody says,” Hastings said.\n> \n> Otherwise, the Netflix chief said the burden is on the rest of the startup community to fight this latest round at the FCC.\n> \n> “We had to carry the water when we were growing up and we were small,” Hastings said, “and now other companies need to be on that leading edge.\"",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1496798845.0,
    "date_created": "2017-06-06",
    "time_created": "13:27:25",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5x79",
    "parent_id": "t1_dij4lib",
    "subreddit_name_prefixed": "r/news",
    "body": "Also, if they choose to go after Amazon, they could affect a huge portion of the internet because so many things run on AWS.\n\nIf one service, in one region could bring a huge portion of the internet and internet businesses to a halt (see the S3 outage this year), imagine if AWS just stopped working.",
    "controversiality": 0,
    "ups": 153,
    "downs": 0,
    "score": 153,
    "created": 1496787780.0,
    "date_created": "2017-06-06",
    "time_created": "10:23:00",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6mnu",
    "parent_id": "t1_dij4lib",
    "subreddit_name_prefixed": "r/news",
    "body": "Amazon is worth 500b as a company. Much more than Comcast. They have the money to create and manipulate whatever they need to in order to remain in power. Comcast is Amazons little brother in terms of funds.\n\nAlphabet as company has a market cap 3.5x times greater than Comcast. Both Google and Amazon could easily defeat a cable company in whatever business venture they both were attempting.\n\nTo say that Amazon and Google are just websites is terribly inaccurate.",
    "controversiality": 0,
    "ups": 106,
    "downs": 0,
    "score": 106,
    "created": 1496788575.0,
    "date_created": "2017-06-06",
    "time_created": "10:36:15",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij9ulr",
    "parent_id": "t1_dij4lib",
    "subreddit_name_prefixed": "r/news",
    "body": "So it would almost be like going to a restaurant, ordering a Pepsi, and being told you can only have a off brand cola unless you pay extra. Only the Pepsi ($$$) is Websites like Reddit, Google, Steam, Netflix, Facebook, etc while the Off brand ($) is msn.com and MySpace \n\nEdit: oh and you only get 2 floz. Of the off brand cola unless you want to buy more at 2 oz. increments for $200 each",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496792103.0,
    "date_created": "2017-06-06",
    "time_created": "11:35:03",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij4hmq",
    "parent_id": "t1_dij1khd",
    "subreddit_name_prefixed": "r/news",
    "body": "How though? I clicked through to some links and still am not clear exactly what's going to happen on July 12.\n\n\"WHAT WILL HAPPEN ON JULY 12TH?\n\nWebsites, Internet users, and online communities will come together to sound the alarm about the FCC’s attack on net neutrality. We'll provide tools for everyone to make it super easy for your followers / visitors to take action. From the SOPA blackout to the Internet Slowdown, we've shown time and time again that when the Internet comes together, we can stop censorship and corruption. Now, we have to do it again!\"\n\nWhat exactly does that mean? Is this just another symbolic gesture to send \"them\" a message?",
    "controversiality": 0,
    "ups": 181,
    "downs": 0,
    "score": 181,
    "created": 1496786080.0,
    "date_created": "2017-06-06",
    "time_created": "09:54:40",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij3q10",
    "parent_id": "t1_dij1khd",
    "subreddit_name_prefixed": "r/news",
    "body": "I trust Trump to do the right thing.\n\nI mean, he said he would. And has he ever led us astray?",
    "controversiality": 0,
    "ups": 94,
    "downs": 0,
    "score": 94,
    "created": 1496785080.0,
    "date_created": "2017-06-06",
    "time_created": "09:38:00",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij9l5l",
    "parent_id": "t1_dij1khd",
    "subreddit_name_prefixed": "r/news",
    "body": "Row, row, fight the power.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496791823.0,
    "date_created": "2017-06-06",
    "time_created": "11:30:23",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij81xw",
    "parent_id": "t1_dij1khd",
    "subreddit_name_prefixed": "r/news",
    "body": "That Northrop Grumman comment was weird on this topic. Just curious why you wrote that? Aren't they an aerospace company? And doesn't Boeing out lobby everyone in the aerospace world? ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496790155.0,
    "date_created": "2017-06-06",
    "time_created": "11:02:35",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6pc3",
    "parent_id": "t1_dij6cyi",
    "subreddit_name_prefixed": "r/news",
    "body": "Well... Kickstarter seems to be on board! In all seriousness, though, that likely wouldn't be \"sustainable\" the way the cable lobby has it :(.",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1496788658.0,
    "date_created": "2017-06-06",
    "time_created": "10:37:38",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij80sa",
    "parent_id": "t1_dij6cyi",
    "subreddit_name_prefixed": "r/news",
    "body": "> Could we literally just make a kickstarter to bribe congress ourselves?\n\nWhy not do the practical thing and actually show up to vote?  I know, I know \"your vote doesn't count.\"  BUT it really does.  This past election is proof of that, but guess what?  People don't fucking vote AT ALL.  Our numbers are terrible.  \n\nIf you don't think there is a difference in Republican and Democrats consider this.  Net Neutrality is REGULATION.  The FCC is in place to enforce this type of REGULATION.  Democrats are FOR a working FCC, Republicans want it gone.  So if this was your sole issue, VOTE FOR DEMOCRATS. JUST VOTE.   \n\nNow on to the real issue here.  Money in Politics.  I don't understand all this support for Amazon or Google or whomever on this issue.  The very idea that corporations have influence good or bad is just not cool.  It is why we have this problem.  They are rightfully so only considered with the bottom line.  NOT YOU.  Their bottom line.    The only reason SOPA/CIPA \"went away\" was because the likes of Google and American Expressed flexed more financial will. This is letting the fox guard the hen house.  \n\nVOTE PEOPLE.  PLEASE VOTE. ",
    "controversiality": 0,
    "ups": 99,
    "downs": 0,
    "score": 99,
    "created": 1496790120.0,
    "date_created": "2017-06-06",
    "time_created": "11:02:00",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijawcl",
    "parent_id": "t1_dij6cyi",
    "subreddit_name_prefixed": "r/news",
    "body": "Good idea but we would need many millions to be successful. Comcast alone has spent $3.7m just in 2017 in part to stop net neutrality for lobbying alone. Senator John Thune got over $220k from his 2016 campaign cycle just from the Telecom industry. (All info from OpenSecrets.org )\n\nThe Telecom industry is spending most likely over $50m/yr on influencing the masses with misinformation and on influencing politicians. \n\nI doubt a Kickstarter can top that. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496793225.0,
    "date_created": "2017-06-06",
    "time_created": "11:53:45",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij9hf6",
    "parent_id": "t1_dij5qa8",
    "subreddit_name_prefixed": "r/news",
    "body": "> I can't believe this is still a conversation.\n\nThat's what I thought about global warming as well last week...",
    "controversiality": 0,
    "ups": 100,
    "downs": 0,
    "score": 100,
    "created": 1496791713.0,
    "date_created": "2017-06-06",
    "time_created": "11:28:33",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5vgb",
    "parent_id": "t1_dij5qa8",
    "subreddit_name_prefixed": "r/news",
    "body": "Donald Trump supported the IRA who did raise kids as soldiers. He, therefore, sees that as right.",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1496787724.0,
    "date_created": "2017-06-06",
    "time_created": "10:22:04",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijaey4",
    "parent_id": "t1_dij5qa8",
    "subreddit_name_prefixed": "r/news",
    "body": "It's still a conversation because the amount of misinformation that is out that is enormous and makes people believe industry-bred lies. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496792711.0,
    "date_created": "2017-06-06",
    "time_created": "11:45:11",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijew5h",
    "parent_id": "t1_dij5qa8",
    "subreddit_name_prefixed": "r/news",
    "body": "Corruption and incompetence would be my first guess.\n\nIn France under the Sarkozy government we had the Minister of Culture, Christine Albanel that was discussing the anti-piracy law (HADOPI) and free software IIRC before it was accepted.\n\nIf you are french this is gold : https://www.youtube.com/watch?v=F011hLZHZrM\n\nTranslation of the relevant part:\n\n\"when you buy the Microsoft pack with Word, PowerPoint, Excel, which isn't free software, there are firewalls and security software; but free software can also make use of firewalls. here in the parliament we use the free software OpenOffice, which is protected by security programs. Free software publishers publishes those firewalls, even free firewalls.\"\n\nYep. How do you want to have those type of people to make political decisions about the internet?!",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496797466.0,
    "date_created": "2017-06-06",
    "time_created": "13:04:26",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij65dm",
    "parent_id": "t1_dij4xnh",
    "subreddit_name_prefixed": "r/news",
    "body": "Not with 100% accuracy, but well enough to be effective yes.",
    "controversiality": 0,
    "ups": 113,
    "downs": 0,
    "score": 113,
    "created": 1496788036.0,
    "date_created": "2017-06-06",
    "time_created": "10:27:16",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij58iv",
    "parent_id": "t1_dij4xnh",
    "subreddit_name_prefixed": "r/news",
    "body": "Yes it wouldn't actually be that hard.",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1496787015.0,
    "date_created": "2017-06-06",
    "time_created": "10:10:15",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijc641",
    "parent_id": "t1_dij4xnh",
    "subreddit_name_prefixed": "r/news",
    "body": "I thought in the past when this sort of thing happens these websites have replaced their content with links to learn more about why Net Neutrality is good and the opposite that is being pushed by ISP lobbies is bad.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496794598.0,
    "date_created": "2017-06-06",
    "time_created": "12:16:38",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijtp2j",
    "parent_id": "t1_dij4xnh",
    "subreddit_name_prefixed": "r/news",
    "body": "If they wanted too, technically Amazon could serve every Comcast user (who doesn't use a vpn) a page saying \"The Internet is down for you because Comcast fucked net neutrality\" instead of basically 70% of mainstream web content.\n\nReddit? Yeah, runs on Amazon Web Services. So do most big sites nowadays.\n\nAmazon and Goggle/Alphabet together could probably throttle or outright ban you from accessing like 80-90% of the mainstream internet these days, if they wanted to.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496813061.0,
    "date_created": "2017-06-06",
    "time_created": "17:24:21",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij56qx",
    "parent_id": "t1_dij1gx1",
    "subreddit_name_prefixed": "r/news",
    "body": "Amazon owns Amazon web services. AWS runs a ton of websites and services, 80 of the surface net ends up running off of AWS servers. \n\nThey can certainly put public pressure on if they want. ",
    "controversiality": 0,
    "ups": 275,
    "downs": 0,
    "score": 275,
    "created": 1496786961.0,
    "date_created": "2017-06-06",
    "time_created": "10:09:21",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij4wlj",
    "parent_id": "t1_dij1gx1",
    "subreddit_name_prefixed": "r/news",
    "body": "> You got ISP's paying premium lobbying dollars \n\nThe sick part is they aren't even paying that much. A few thousand dollars is all it takes. Your Congressmen will sell you and the future of all online businesses out for $10,000",
    "controversiality": 0,
    "ups": 135,
    "downs": 0,
    "score": 135,
    "created": 1496786609.0,
    "date_created": "2017-06-06",
    "time_created": "10:03:29",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij2aoi",
    "parent_id": "t1_dij1gx1",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm starting to understand the brain of the single issue \"2nd amendment!\" voters. ",
    "controversiality": 0,
    "ups": 284,
    "downs": 0,
    "score": 284,
    "created": 1496783039.0,
    "date_created": "2017-06-06",
    "time_created": "09:03:59",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij34xf",
    "parent_id": "t1_dij1gx1",
    "subreddit_name_prefixed": "r/news",
    "body": "Thing is, they're actually not [paying](https://www.theverge.com/2017/3/29/15100620/congress-fcc-isp-web-browsing-privacy-fire-sale) that much if we look at the resources at their disposal. At least not that we know of. It's possible they're giving them suitcases of cash in secret. But that money must come from somewhere and it seems unlikely there wouldn't have been someone somewhere providing some information on that. ",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1496784263.0,
    "date_created": "2017-06-06",
    "time_created": "09:24:23",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6fh4",
    "parent_id": "t1_dij516e",
    "subreddit_name_prefixed": "r/news",
    "body": "Republicans love the free market unless there's competition",
    "controversiality": 0,
    "ups": 169,
    "downs": 0,
    "score": 169,
    "created": 1496788347.0,
    "date_created": "2017-06-06",
    "time_created": "10:32:27",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijcjwx",
    "parent_id": "t1_dij516e",
    "subreddit_name_prefixed": "r/news",
    "body": "Its so ridiculous. I'm someone on the right side of the political spectrum who despises regulation as a concept, but if there are two things that need to be regulated its shitty ISP monopolies like Comcast and TWC and shitty companies that want to destroy the planet. Having people on my facebook feed who I would normally agree with politically call me a LINO for wanting, what I see, as common sense regulations is incredibly disheartening.\n\nBasically, don't count on the support of most of the people on the right regarding Net Neutrality. Members of the GOP either don't care or will support it because it pisses the rest of the nation off, and (most) Libertarians will support it because they're against regulating anything on principle, regardless of its importance.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1496795004.0,
    "date_created": "2017-06-06",
    "time_created": "12:23:24",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijjsrs",
    "parent_id": "t1_dij516e",
    "subreddit_name_prefixed": "r/news",
    "body": "Hi, Republican here, I support net neutrality and will fight tooth and nail for it... I can imagine comments like this will just push republicans that also support NN, to think they are outcasts and go to the other side. Just my 2 cents though.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496802591.0,
    "date_created": "2017-06-06",
    "time_created": "14:29:51",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6b41",
    "parent_id": "t1_dij61vh",
    "subreddit_name_prefixed": "r/news",
    "body": "Costs a lot to setup. That's why google has basically stopped their fiber business in many cities.",
    "controversiality": 0,
    "ups": 161,
    "downs": 0,
    "score": 161,
    "created": 1496788211.0,
    "date_created": "2017-06-06",
    "time_created": "10:30:11",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij73ri",
    "parent_id": "t1_dij61vh",
    "subreddit_name_prefixed": "r/news",
    "body": "The company in question would have to roll out infrastructure across the country, build lines to houses, etc.  The big companies would never lease them time on their lines, and if they did, it would be slowed down to be worse than the line owners speeds.",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1496789099.0,
    "date_created": "2017-06-06",
    "time_created": "10:44:59",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijaurc",
    "parent_id": "t1_dij61vh",
    "subreddit_name_prefixed": "r/news",
    "body": "Also, some cities actively block new ISPs from entering into the area to block competition. \nhttps://www.wired.com/2013/07/we-need-to-stop-focusing-on-just-cable-companies-and-blame-local-government-for-dismal-broadband-competition\n\nI also remember reading, but can't find the article, where Google had to actually sue one of the big telcos to get access to their poles to string up their lines. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496793180.0,
    "date_created": "2017-06-06",
    "time_created": "11:53:00",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6lj1",
    "parent_id": "t1_dij5an8",
    "subreddit_name_prefixed": "r/news",
    "body": "What we need is major gaming networks shutting down in protest, it affects them too. What stops EA from paying Comcast to throttle World of Warcraft traffic?\n\nValve, Blizzard, EA, Activision, they all need to step up vocally about Net Neutrality, it affects everyone.\n\n",
    "controversiality": 0,
    "ups": 54,
    "downs": 0,
    "score": 54,
    "created": 1496788540.0,
    "date_created": "2017-06-06",
    "time_created": "10:35:40",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5w50",
    "parent_id": "t1_dij5f13",
    "subreddit_name_prefixed": "r/news",
    "body": "No, don't lock them out entirely. They'll just find other things to do. Slow the service down to a crawl, keep them anticipating. Slow internet is several times worse than no internet at all.",
    "controversiality": 0,
    "ups": 156,
    "downs": 0,
    "score": 156,
    "created": 1496787745.0,
    "date_created": "2017-06-06",
    "time_created": "10:22:25",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7zag",
    "parent_id": "t1_dij5f13",
    "subreddit_name_prefixed": "r/news",
    "body": "This right here would be the ideal solution ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496790073.0,
    "date_created": "2017-06-06",
    "time_created": "11:01:13",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijhgez",
    "parent_id": "t1_dij5f13",
    "subreddit_name_prefixed": "r/news",
    "body": "I wouldn't be surprised if there's a few old farts in congress who don't personally use the internet daily. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496800131.0,
    "date_created": "2017-06-06",
    "time_created": "13:48:51",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijeqzl",
    "parent_id": "t1_dije8rh",
    "subreddit_name_prefixed": "r/news",
    "body": "Correct. The problem is we did this to ourselves. Money drives everything and everyone so between that and people never removing theirs eyes from electronic devices, they are too busy to fight this. USA hasn't been a democracy for years. I wouldn't be surprised to learn of evidence that all elections for the past 50 years were setup. Now look who they blame, Russia. It's everyone else's fault except our own, no more accountability. ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1496797312.0,
    "date_created": "2017-06-06",
    "time_created": "13:01:52",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5x6b",
    "parent_id": "t1_dij5j8q",
    "subreddit_name_prefixed": "r/news",
    "body": "This is the campaign site: https://www.battleforthenet.com/july12/",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1496787779.0,
    "date_created": "2017-06-06",
    "time_created": "10:22:59",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijakoc",
    "parent_id": "t1_dij5j8q",
    "subreddit_name_prefixed": "r/news",
    "body": "The goal is to drive people to comment on fcc and Congress sites to show support.  Reddit.com is participating, as are most default subreddits. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496792882.0,
    "date_created": "2017-06-06",
    "time_created": "11:48:02",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij4g3h",
    "parent_id": "t1_dij28x9",
    "subreddit_name_prefixed": "r/news",
    "body": "I have yet to hear *how* Pai thinks violation of open internet will make our lives better. Any idea what the hell his angle is?",
    "controversiality": 0,
    "ups": 91,
    "downs": 0,
    "score": 91,
    "created": 1496786026.0,
    "date_created": "2017-06-06",
    "time_created": "09:53:46",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5fzt",
    "parent_id": "t1_dij28x9",
    "subreddit_name_prefixed": "r/news",
    "body": "And the FCC chairman is wrong. It will destroy all future online businesses. This is not a small deal. Amazon, Google, and Netflix simply would not exist today if Comcast could pick the winners and losers.",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1496787241.0,
    "date_created": "2017-06-06",
    "time_created": "10:14:01",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6jko",
    "parent_id": "t1_dij5zmw",
    "subreddit_name_prefixed": "r/news",
    "body": "Unfortunately for them... Their site runs on AWS...",
    "controversiality": 0,
    "ups": 62,
    "downs": 0,
    "score": 62,
    "created": 1496788476.0,
    "date_created": "2017-06-06",
    "time_created": "10:34:36",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijl9en",
    "parent_id": "t1_dij5ynu",
    "subreddit_name_prefixed": "r/news",
    "body": "Cable companies bought out this administration so it would probably get banned. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496804106.0,
    "date_created": "2017-06-06",
    "time_created": "14:55:06",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij2cvs",
    "parent_id": "t1_dij1rmr",
    "subreddit_name_prefixed": "r/news",
    "body": "This is when the establishment convinces those people that it is for the greater good.",
    "controversiality": 0,
    "ups": 51,
    "downs": 0,
    "score": 51,
    "created": 1496783134.0,
    "date_created": "2017-06-06",
    "time_created": "09:05:34",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij71za",
    "parent_id": "t1_dij1rmr",
    "subreddit_name_prefixed": "r/news",
    "body": "Textbook populism. Shout some easily digestible opinions to pretend you are with the people, then fuck them up when you seize power.\n\nWe shouldn't have to deal with 20th century shit yet here we are.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1496789043.0,
    "date_created": "2017-06-06",
    "time_created": "10:44:03",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij8a9g",
    "parent_id": "t1_dij1rmr",
    "subreddit_name_prefixed": "r/news",
    "body": "It's hilarious how many small business owners I know that voted for him when his policies have potential to fuck them the most. Some of them are finally starting to realize they made a huge mistake meanwhile I'm here wondering how they didn't see this from a mile away. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496790412.0,
    "date_created": "2017-06-06",
    "time_created": "11:06:52",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6cr8",
    "parent_id": "t1_dij5are",
    "subreddit_name_prefixed": "r/news",
    "body": "Do it. Even just for the experience. Everyone should go to one in their lives.  Here's a tip: think about if you were a reporter how you would skew what you saw to support your narrative. From the left and right, both. Give it some real thought before you go.  Then when you go, look for opportunities to skew the narrative.  Then look at reality.  Then after, watch the coverage of the event. You will never look at coverage the same way again.  It's eye opening  and a little bit appalling.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1496788263.0,
    "date_created": "2017-06-06",
    "time_created": "10:31:03",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7s9d",
    "parent_id": "t1_dij7kg8",
    "subreddit_name_prefixed": "r/news",
    "body": "What kills me is isp's have already done this.\n\nSo pai is full of shit. \n\nBut with NN, they were punished. \n\nWhy would we give them the blank check to do it?",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1496789856.0,
    "date_created": "2017-06-06",
    "time_created": "10:57:36",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6dsj",
    "parent_id": "t1_dij1q5p",
    "subreddit_name_prefixed": "r/news",
    "body": "The thing is, people still don't understand computers and the internet. \n\nA little over ten years ago, you could still get away with saying \"I don't really go on the internet/'do computers'\" and people would just kind of nod because they weren't really tech savvy themselves. Than the iPhone came out and A: Rich demographics who could afford to be out of touch suddenly had the internet in their pocket and discovered it all at once, and B: the standard computer shifted so dramatically that \"not doing computers\" simply wasn't an option anymore. Only the most out of touch person still clings to the \"why do poor people have smartphones\" argument. Typically the earliest adopters of smartphones for whom the product was always a luxury item, for them their first exposure to the the internet was as a luxury. \n\nApple's shtick around 2006 was user friendliness. As a very poignant shower thought once said, \"The fact that a 4 years old kid can use an smart phone does not mean the kid is a genius, it means engineers are.\" People don't actually understand the devices they're using, Apple simply idiot-proofed them enough for our world to fully integrate technology into our day to day lives, and... that's fine, it really is; the combine harvester allowed more people to eat food without having to know farming, this allowed ignorance is a mark of progress. When people use computers they still are limited in their understanding. Buzz words like \"fast lanes\" sound nice because it's something they understand in the real world. The language used to argue against net neutrality is, at best, meaningless and, at worst, so flagrantly manipulative it's very breadth implies malice and contempt for consumers. \n\nThe other issue is economics. Economics is something the layperson inflates they're knowledge on the subject more so than any other discipline; consider that people get PhDs in economics while your average american had half a semester in highs school in an underfunded classroom. Net neutrality isn't an anti-corporate position (quite the opposite), but it has been championed to benefit an industry. Many Americans have tied and politicized the benefit of any industry as a universal good, and inversely another side has politicized the success of an industry as bad (I shan't need say which orientations are which).\n\nFor as much as reddit likes to blather on about how republican voters are being sheep, there are just as many sheep on the democratic side. That is to say: the wisdom to trust people who know better than you on an issue does not impart actual knowledge on a subject (see climate change). The political right doesn't see arguments for net neutrality as apolitical because, well, it is political. And for as many ignorant people towing a party line because they adhere to an economic policy they don't actually understand, there are more than a few people looking across the aisle and seeing some dumb asses blathering on about net neutrality who can't actually tell you what a data packet is, let alone why a \"fast lane\" is one of the most disingenuous offers a company can make. \n\nTL:DR People need to learn about computers, and probably stop thinking they understand economics as well as they think they do. ",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1496788294.0,
    "date_created": "2017-06-06",
    "time_created": "10:31:34",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij3swv",
    "parent_id": "t1_dij30p0",
    "subreddit_name_prefixed": "r/news",
    "body": "That brick we threw through the window of the Establishment is just doing all kinds of good.",
    "controversiality": 0,
    "ups": 114,
    "downs": 0,
    "score": 114,
    "created": 1496785187.0,
    "date_created": "2017-06-06",
    "time_created": "09:39:47",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijcl9n",
    "parent_id": "t1_dij30p0",
    "subreddit_name_prefixed": "r/news",
    "body": "Never forget, Hillary voters: We could have had Bernie. ",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1496795043.0,
    "date_created": "2017-06-06",
    "time_created": "12:24:03",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijd55a",
    "parent_id": "t1_dij9woj",
    "subreddit_name_prefixed": "r/news",
    "body": ">ISP's would be nothing without them\n\nI think you under estimate how much power ISP's actually have, considering they can literally shut down the internet. If you honestly think search engines going offline will \"shut down the internet\" you need to remember that the internet existed long before search engines",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496795635.0,
    "date_created": "2017-06-06",
    "time_created": "12:33:55",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij1wmp",
    "parent_id": "t1_dij1mwe",
    "subreddit_name_prefixed": "r/news",
    "body": "It just shows how important net neutrality is.   \n   \nSharing of information, like information about companies that are dumping oil and photos made by locals of companies polluting, is a very nifty weapon for environmentalists.   \n   \nFreedom of information is bad for people who doesn't want you to have all the information. Bad for heavy polluters.",
    "controversiality": 0,
    "ups": 162,
    "downs": 0,
    "score": 162,
    "created": 1496782451.0,
    "date_created": "2017-06-06",
    "time_created": "08:54:11",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij2rol",
    "parent_id": "t1_dij1mwe",
    "subreddit_name_prefixed": "r/news",
    "body": "an ISP could block Greenpeace's message. not oop at all. ",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1496783743.0,
    "date_created": "2017-06-06",
    "time_created": "09:15:43",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij53yc",
    "parent_id": "t1_dij1mwe",
    "subreddit_name_prefixed": "r/news",
    "body": "> Seems out of place for Greenpeace to be involved in this. \n\nWhy? You think they would be immune? Do you think Comcast and it's advertisers such as Exxon, and BP don't have an interest in shutting down Greenpeaces fundraising and public face of their website? ",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1496786867.0,
    "date_created": "2017-06-06",
    "time_created": "10:07:47",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij69qb",
    "parent_id": "t1_dij1mwe",
    "subreddit_name_prefixed": "r/news",
    "body": "Net neutrality affects everyone, not just companies.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496788169.0,
    "date_created": "2017-06-06",
    "time_created": "10:29:29",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij696v",
    "parent_id": "t1_dij5i0k",
    "subreddit_name_prefixed": "r/news",
    "body": "Occam's razor, man.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1496788153.0,
    "date_created": "2017-06-06",
    "time_created": "10:29:13",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijafaa",
    "parent_id": "t1_dij5i0k",
    "subreddit_name_prefixed": "r/news",
    "body": "Or it's just a tactic to let ISPs be even more greedy fucks than usual.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496792721.0,
    "date_created": "2017-06-06",
    "time_created": "11:45:21",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijdeic",
    "parent_id": "t1_dij7sfv",
    "subreddit_name_prefixed": "r/news",
    "body": "Gummermint regulations = bad\n\nInvisible hand of the free market always wins and private infrastructure monopolies/duopolies only have their 'customers' best interest at heart.\n\nThat seems to sum up their positions judging by this thread. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496795911.0,
    "date_created": "2017-06-06",
    "time_created": "12:38:31",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7rvy",
    "parent_id": "t1_dij743j",
    "subreddit_name_prefixed": "r/news",
    "body": "I accidentally did. Found out less than a week later. They were willing to give me a full refund. Ended up just keeping it. Already got my money's worth.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496789845.0,
    "date_created": "2017-06-06",
    "time_created": "10:57:25",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijjxcc",
    "parent_id": "t1_dijimll",
    "subreddit_name_prefixed": "r/news",
    "body": "Lol you make it sound like they don't have a monopoly in most areas in the United states and go ahead live without Internet I can't I need it for my job. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496802726.0,
    "date_created": "2017-06-06",
    "time_created": "14:32:06",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijbwd1",
    "parent_id": "t1_dij9kox",
    "subreddit_name_prefixed": "r/news",
    "body": "I totally agree but also trying to make best of a situation that I assume we will lose.  I'm a cynic and I think that the Senate really puts corporations over people 100% of the time.  I'm operating under the assumption NN is going to die.",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1496794304.0,
    "date_created": "2017-06-06",
    "time_created": "12:11:44",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijv6sa",
    "parent_id": "t1_dij9kox",
    "subreddit_name_prefixed": "r/news",
    "body": "This on the head. In my area they haven't laid cable. Years back they did a survey and it was shot down because nobody was interested at the time. Now the only option we have is satellite and the only provider we can get is Hughsnet and one small town provider that delivers dialup speeds at a premium price",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1496814764.0,
    "date_created": "2017-06-06",
    "time_created": "17:52:44",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7434",
    "parent_id": "t1_dij6fe6",
    "subreddit_name_prefixed": "r/news",
    "body": "do you have any links to examples of this? I need ammunition!",
    "controversiality": 0,
    "ups": 708,
    "downs": 0,
    "score": 708,
    "created": 1496789109.0,
    "date_created": "2017-06-06",
    "time_created": "10:45:09",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijel5y",
    "parent_id": "t1_dij6fe6",
    "subreddit_name_prefixed": "r/news",
    "body": "You act like their representative really gives a fuck about what the real issues are. That representative is going to support whoever gives them a fat \"donation\".",
    "controversiality": 0,
    "ups": 75,
    "downs": 0,
    "score": 75,
    "created": 1496797142.0,
    "date_created": "2017-06-06",
    "time_created": "12:59:02",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijbw36",
    "parent_id": "t1_dij97kt",
    "subreddit_name_prefixed": "r/news",
    "body": "One thing that I find troubling is that the words the Senator put in the letter are structured in a way that you need to do quite a bit of research to find what is truth and what is lies, exaggerations, and references to such.  \n\nThe accusation that legislation would change how private organizations invest in expanding/contracting their business in particular ways is not crazy.  The idea that an ISP would forgo investments to gain new rural customers because they wouldn't be able to throttle those customers access to certain network destinations is ridiculous.  This is akin to the claim that ISPs aren't profitable if they can't double-dip to milk money out of both customers and the network content providers.  Of course they're profitable from customer money by itself - that's the model that built the Internet to the success today and the reason the Net Neutrality fight exists is to prevent greedy ISPs from being able to double-dip with the content providers the same way cable television companies have double-dipped on customers as well as content providers (in the form of paid advertisements).  \n\nThe only way to justify throttling access to different parts of the internet is if an ISP adopts a \"No charge to customers\" model where their profit is based on billing content-providers for access to customers who are signed up for their network.  Obviously this idea run contrary to freedom of the content-providers.  So down with double-dipping ISPs and up with Net Neutrality. ",
    "controversiality": 0,
    "ups": 143,
    "downs": 0,
    "score": 143,
    "created": 1496794296.0,
    "date_created": "2017-06-06",
    "time_created": "12:11:36",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijf9n7",
    "parent_id": "t1_dij97kt",
    "subreddit_name_prefixed": "r/news",
    "body": "There is one thing in the Senators response that I do agree with. The 2015 FCC regulation isn't what we need as it doesn't allow for the transparency and consistency that legislation does. We need legislation to address the issue and not an FCC rule. \n\nThat said, he went the opposite direction with that legislation than he should have. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496797864.0,
    "date_created": "2017-06-06",
    "time_created": "13:11:04",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijkd6i",
    "parent_id": "t1_dij6kai",
    "subreddit_name_prefixed": "r/news",
    "body": "Give 'em heller!",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496803187.0,
    "date_created": "2017-06-06",
    "time_created": "14:39:47",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijlf3x",
    "parent_id": "t1_dij6kai",
    "subreddit_name_prefixed": "r/news",
    "body": "His ass is out in my book. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1496804268.0,
    "date_created": "2017-06-06",
    "time_created": "14:57:48",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij4bkw",
    "parent_id": "t1_dij2z94",
    "subreddit_name_prefixed": "r/news",
    "body": "Didn't Netflix essentially say they didn't care anymore?",
    "controversiality": 0,
    "ups": 1728,
    "downs": 0,
    "score": 1728,
    "created": 1496785867.0,
    "date_created": "2017-06-06",
    "time_created": "09:51:07",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5u18",
    "parent_id": "t1_dij2z94",
    "subreddit_name_prefixed": "r/news",
    "body": "The fact that we have state sanctioned monopolies - in 2017 - blows my mind. The politicians tell us they are for the \"free market\" and \"competition\" but there is absolutely no competition across most of the country. Amazon and Netflix could definitely force the hands of politicians if they did decide to do something like this. They could also do more during elections. Can you imagine if they ran ads like, \"if you value your Netflix... Amazon services...\"",
    "controversiality": 0,
    "ups": 181,
    "downs": 0,
    "score": 181,
    "created": 1496787680.0,
    "date_created": "2017-06-06",
    "time_created": "10:21:20",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij4r2z",
    "parent_id": "t1_dij2z94",
    "subreddit_name_prefixed": "r/news",
    "body": "I agree.  This whole monopoly thing is dumb.  My area is pretty much owned by Time Warner.  We have other options, but they're way too overpriced.  We had problems with our internet getting cut off often with TWC, so I switched to Frontier.  The internet stayed up more often with them, but holy fuck does it cost more.  TWC here is $65 for 50/5 with speed tests returning 70/7 using my own modem.  Frontier cost $85 for 25/1 with speed tests returning 18/0.6.",
    "controversiality": 0,
    "ups": 79,
    "downs": 0,
    "score": 79,
    "created": 1496786412.0,
    "date_created": "2017-06-06",
    "time_created": "10:00:12",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij3tjs",
    "parent_id": "t1_dij2z94",
    "subreddit_name_prefixed": "r/news",
    "body": "Could you go by region as well? Say you live in D.C. could you refuse to let any traffic come from there? I know you can get around that but if every major company essentially black lists congress and the FCC they will flip so fast. Either that or figure out who is a major carrier of the US government and block them.",
    "controversiality": 0,
    "ups": 51,
    "downs": 0,
    "score": 51,
    "created": 1496785210.0,
    "date_created": "2017-06-06",
    "time_created": "09:40:10",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij4xwg",
    "parent_id": "t1_dij2z94",
    "subreddit_name_prefixed": "r/news",
    "body": "> Seriously... Netflix and amazon could refuse to service an ISP and practically put them out of business... \n\nSure! But when being online, one solution is to always use VPNs with a stealth-function. (The traffic will then appear as normal SSL traffic, and therefore impossible to block or throttle.) (related forum: r/NetflixViaVPN) \n\n",
    "controversiality": 0,
    "ups": 88,
    "downs": 0,
    "score": 88,
    "created": 1496786653.0,
    "date_created": "2017-06-06",
    "time_created": "10:04:13",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5rww",
    "parent_id": "t1_dij2z94",
    "subreddit_name_prefixed": "r/news",
    "body": "Except for areas where there is only 1 or 2 choices and they all charge for access to Netflix...",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496787612.0,
    "date_created": "2017-06-06",
    "time_created": "10:20:12",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij86v6",
    "parent_id": "t1_dij52wv",
    "subreddit_name_prefixed": "r/news",
    "body": "There's no way that would happen. Amazon can't make other companies paying for their services basically unwillingly take part in a protest. ",
    "controversiality": 0,
    "ups": 81,
    "downs": 0,
    "score": 81,
    "created": 1496790307.0,
    "date_created": "2017-06-06",
    "time_created": "11:05:07",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6b2i",
    "parent_id": "t1_dij52wv",
    "subreddit_name_prefixed": "r/news",
    "body": "Do any government sites use AWS? Could be fun for Amazon to show the government quite literally what would happen if it goes through.",
    "controversiality": 0,
    "ups": 134,
    "downs": 0,
    "score": 134,
    "created": 1496788210.0,
    "date_created": "2017-06-06",
    "time_created": "10:30:10",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dije3am",
    "parent_id": "t1_dij52wv",
    "subreddit_name_prefixed": "r/news",
    "body": "Hold on. s3 is a PROFESSIONAL service i pay for. Inject anything into my stream between me and and my users and im going to be pissed. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496796628.0,
    "date_created": "2017-06-06",
    "time_created": "12:50:28",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij8aeo",
    "parent_id": "t1_dij52wv",
    "subreddit_name_prefixed": "r/news",
    "body": "That would be business suicide though. They can't just shut down AWS, or purposefully limit the connection to prove a point. They would lose tons of customers and likely incur some lawsuits. I'm sure Amazon will protest in form of the Amazon Marketplace, video services, etc. There's no way they'll touch AWS.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496790416.0,
    "date_created": "2017-06-06",
    "time_created": "11:06:56",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij3gei",
    "parent_id": "t1_dij24tm",
    "subreddit_name_prefixed": "r/news",
    "body": "It's kind of telling that it didn't occur to me until like a decade after I saw that episode that those guys are (arguably) getting raped to death.\n\nI mean it's played for the laughs and the guys are depicted as being into it - kinda - but it's an interesting comment on gender roles that the thought took years to even cross my mind.",
    "controversiality": 0,
    "ups": 108,
    "downs": 0,
    "score": 108,
    "created": 1496784712.0,
    "date_created": "2017-06-06",
    "time_created": "09:31:52",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7foq",
    "parent_id": "t1_dij4kou",
    "subreddit_name_prefixed": "r/news",
    "body": "They won't mess with any AWS services. They have SLA contacts to uphold.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1496789469.0,
    "date_created": "2017-06-06",
    "time_created": "10:51:09",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij63qf",
    "parent_id": "t1_dij56mv",
    "subreddit_name_prefixed": "r/news",
    "body": "complaining AND cancelling subscriptions is probably the best way to make sure they know how their customers feel about this",
    "controversiality": 0,
    "ups": 305,
    "downs": 0,
    "score": 305,
    "created": 1496787983.0,
    "date_created": "2017-06-06",
    "time_created": "10:26:23",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij622k",
    "parent_id": "t1_dij56mv",
    "subreddit_name_prefixed": "r/news",
    "body": "Already did, the customer service rep said she would pass it along....  yet I doubt that.",
    "controversiality": 0,
    "ups": 410,
    "downs": 0,
    "score": 410,
    "created": 1496787932.0,
    "date_created": "2017-06-06",
    "time_created": "10:25:32",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijfyqx",
    "parent_id": "t1_dijai5k",
    "subreddit_name_prefixed": "r/news",
    "body": "You mean, companies that claim to care about equality and people, until it affects their paycheck?",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1496798594.0,
    "date_created": "2017-06-06",
    "time_created": "13:23:14",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijo4l1",
    "parent_id": "t1_dijai5k",
    "subreddit_name_prefixed": "r/news",
    "body": "To be fair...\n\nGoogle started trying to break the monopolies by being innovative and improving infrastructure...\n\nGoogle fiber...you're our only hope.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1496807070.0,
    "date_created": "2017-06-06",
    "time_created": "15:44:30",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijccfw",
    "parent_id": "t1_dij7tth",
    "subreddit_name_prefixed": "r/news",
    "body": "Paging /u/katie_pornhub for a comment. ",
    "controversiality": 0,
    "ups": 88,
    "downs": 0,
    "score": 88,
    "created": 1496794784.0,
    "date_created": "2017-06-06",
    "time_created": "12:19:44",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijh89z",
    "parent_id": "t1_dij7tth",
    "subreddit_name_prefixed": "r/news",
    "body": "I REALLY don't think their presence would help in this situation. The bellends we need to reach are the sort who see sex, especially porn, as the reason the internet needs fucking over.",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1496799903.0,
    "date_created": "2017-06-06",
    "time_created": "13:45:03",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6gr8",
    "parent_id": "t1_dij42yb",
    "subreddit_name_prefixed": "r/news",
    "body": "> The FCC wants to destroy net neutrality and give big cable companies control over what we see and do online. If they get their way, they’ll allow widespread throttling, blocking, censorship, and extra fees. On July 12th, the Internet will come together to stop them.\n\nYep, let's.",
    "controversiality": 0,
    "ups": 381,
    "downs": 0,
    "score": 381,
    "created": 1496788387.0,
    "date_created": "2017-06-06",
    "time_created": "10:33:07",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6fos",
    "parent_id": "t1_dij42yb",
    "subreddit_name_prefixed": "r/news",
    "body": "Why wont they tell us what we do for the battle?\n\nIs it just going to be some stupid # or are we actually doing something?",
    "controversiality": 0,
    "ups": 109,
    "downs": 0,
    "score": 109,
    "created": 1496788354.0,
    "date_created": "2017-06-06",
    "time_created": "10:32:34",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6pyb",
    "parent_id": "t1_dij42yb",
    "subreddit_name_prefixed": "r/news",
    "body": "Thanks! Signed up. You should post this as a parent comment so it can be more visible. ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1496788677.0,
    "date_created": "2017-06-06",
    "time_created": "10:37:57",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij8ggk",
    "parent_id": "t1_dij42yb",
    "subreddit_name_prefixed": "r/news",
    "body": "Here's an easy-to-view list of participants: http://imgur.com/a/1pd12\n\n(meant to post this here, not as a main thread reply)",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496790599.0,
    "date_created": "2017-06-06",
    "time_created": "11:09:59",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5hb7",
    "parent_id": "t1_dij5697",
    "subreddit_name_prefixed": "r/news",
    "body": "Yes, the 8th through the end of July.",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1496787281.0,
    "date_created": "2017-06-06",
    "time_created": "10:14:41",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij9z08",
    "parent_id": "t1_dij788l",
    "subreddit_name_prefixed": "r/news",
    "body": "Fuck that dude, his ugly mug, and his giant mug.",
    "controversiality": 0,
    "ups": 130,
    "downs": 0,
    "score": 130,
    "created": 1496792235.0,
    "date_created": "2017-06-06",
    "time_created": "11:37:15",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dija5us",
    "parent_id": "t1_dij9eu2",
    "subreddit_name_prefixed": "r/news",
    "body": "But what of his infamous mug?",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1496792439.0,
    "date_created": "2017-06-06",
    "time_created": "11:40:39",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijixmk",
    "parent_id": "t1_dij9eu2",
    "subreddit_name_prefixed": "r/news",
    "body": "Mr. Potato Head looking mother fucker.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496801683.0,
    "date_created": "2017-06-06",
    "time_created": "14:14:43",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7re1",
    "parent_id": "t1_dij5x79",
    "subreddit_name_prefixed": "r/news",
    "body": "Man I hope Amazon's day of action includes something like this. Just bring AWS down...",
    "controversiality": 0,
    "ups": 72,
    "downs": 0,
    "score": 72,
    "created": 1496789828.0,
    "date_created": "2017-06-06",
    "time_created": "10:57:08",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij8v77",
    "parent_id": "t1_dij6mnu",
    "subreddit_name_prefixed": "r/news",
    "body": "That wasn't always the case, nor is it the case with all the new amazons and googles of the future. We are at the edge of a new VR/AR revolution. Imagine all the VR based web services that are about to come along, we dont know what they will look like but there will be a Steam or Netflix or Google of the VR world. Those companies will not be allowed to exist without net neutrality because it might compete with Comcast and their advertisers.\n\nEven small sites like that podcast you enjoy will be hurt by this. Do you think a small podcast like \"Hello from the magic tavern\" would have the financial resources to pay the ~~bribes~~ access fees to Comcast? Everything you know about the internet will be destroyed. Your internet will look like a cable package and if you want anything outside the what Comcast wants you to see you are fucked. ",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1496791044.0,
    "date_created": "2017-06-06",
    "time_created": "11:17:24",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6bp1",
    "parent_id": "t1_dij4hmq",
    "subreddit_name_prefixed": "r/news",
    "body": "I think the biggest thing is raising awareness. There are a lot of people out there who don't even know what net neutrality is. When you raise awareness and put the issues front and center, politicians are held to greater scrutiny on their actions. ",
    "controversiality": 0,
    "ups": 77,
    "downs": 0,
    "score": 77,
    "created": 1496788229.0,
    "date_created": "2017-06-06",
    "time_created": "10:30:29",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6o08",
    "parent_id": "t1_dij4hmq",
    "subreddit_name_prefixed": "r/news",
    "body": "Agreed. This needs way more visibility.\n\n@the organizers for this thing -- people need to know HOW joining the protest will make a difference. Having a landing page with just an email sign up is going to turn a lot of people off.\n\nThe reason why the LOIC and stuff worked was because they were marketed well. \"YOU run this program, YOU slow down our enemies, YOU make a difference.\"\n\nThe people clicking through to your website want to help fight this battle. Give 'em the tools! (Or at least a snapshot of what the tools will be?)",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496788616.0,
    "date_created": "2017-06-06",
    "time_created": "10:36:56",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij4siy",
    "parent_id": "t1_dij3q10",
    "subreddit_name_prefixed": "r/news",
    "body": "No, he has been clear and upfront with all his decifegfeg",
    "controversiality": 0,
    "ups": 128,
    "downs": 0,
    "score": 128,
    "created": 1496786464.0,
    "date_created": "2017-06-06",
    "time_created": "10:01:04",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijx29u",
    "parent_id": "t1_dij6pc3",
    "subreddit_name_prefixed": "r/news",
    "body": "Probably need Patreon for that",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496817012.0,
    "date_created": "2017-06-06",
    "time_created": "18:30:12",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dije2oi",
    "parent_id": "t1_dij80sa",
    "subreddit_name_prefixed": "r/news",
    "body": "The difference is Amazon in this instance is being transparent about trying to influence the law. They aren't using some secret back channel by buying 50 plates at a $5000 a plate senate fundraiser. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1496796611.0,
    "date_created": "2017-06-06",
    "time_created": "12:50:11",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijtm7a",
    "parent_id": "t1_dij80sa",
    "subreddit_name_prefixed": "r/news",
    "body": "I agree with your message to vote. \n\nI disagree that votes mattered much at all this election, specifically because most people are not single issue voters. Where you are either operating under the assumption that \"anyone is better than Trump,\" or \"Hillary Clinton is the better candidate,\" I, and many others, think Hillary was just as likely to be a terrible president. She would have been terrible in a different way, but terrible none the less.\n\nThe issue I have is for the parties to be able to block out real candidates like Bernie, who everyone I knew wanted to see in the job. \n\nYou can't choose one issue and vote based on it. You have to look at what both candidates are offering and vote on who sucks less. These candidates both fucking sucked! Is it surprising so few people voted? Most people who didn't vote probably still don't think they should have, because they realize that there's no telling what Hillary would have done. While our current issues brought to fore by Trump wouldn't likely be happening, we would have whatever crazy shit Hillary would do in office to deal with instead. Maybe it would have been better, but the reason those people didn't vote for her is that we don't think she would have been better.\n\nIn fact, I know people who voted for Trump because after Bernie got snubbed, they absolutely wanted *anyone* in office other than Hillary. And these are liberals I'm talking about!\n\nOf course, my perspective is anecdotal, but if you think that can't apply to a lot more of the people who didn't vote, you should think on it some more and realize how much people are scared of Hillary. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496812971.0,
    "date_created": "2017-06-06",
    "time_created": "17:22:51",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijkwnk",
    "parent_id": "t1_dij80sa",
    "subreddit_name_prefixed": "r/news",
    "body": "Because people don't know the fuck they're doing when they vote, there isn't a stand-alone vote with Net Neutrality, people essentially voted against it when they voted for Trump and Congress in a lesser sense. And if you remember anything about 2016, policies were the last thing being talked about for the election. In a way, this country deserves this consequences because of the careless decision it made.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496803743.0,
    "date_created": "2017-06-06",
    "time_created": "14:49:03",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij9rw9",
    "parent_id": "t1_dij9hf6",
    "subreddit_name_prefixed": "r/news",
    "body": "Ya, I don't even know the metaphor for that one.\nIt's as if the whole world was ready to put aside their differences and work together, and America could have been the leading country to bring change and prosperity to the future generations of the planet, but instead we said, \"fuck that!! Build a wall!!!\"\n\nOh wait, that's exactly what happened. \n\nI don't even understand how Trump could come under so much fire but then throw away this killer PR opportunity. If there's anything I can say semi sorta goodish about Trump, it's that he doesn't buckle under bad press.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1496792025.0,
    "date_created": "2017-06-06",
    "time_created": "11:33:45",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5z4i",
    "parent_id": "t1_dij5vgb",
    "subreddit_name_prefixed": "r/news",
    "body": "I knew I would get a response like that. Very good point. Who's gonna make all of those small computer parts, shoes, disarm mines, and scurry down those little fox holes? Trump can't do everything people!!!",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1496787840.0,
    "date_created": "2017-06-06",
    "time_created": "10:24:00",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7vrp",
    "parent_id": "t1_dij5vgb",
    "subreddit_name_prefixed": "r/news",
    "body": "Holy shit seriously? Source?",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1496789963.0,
    "date_created": "2017-06-06",
    "time_created": "10:59:23",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij60v8",
    "parent_id": "t1_dij56qx",
    "subreddit_name_prefixed": "r/news",
    "body": "dang.  Imagine if they throttled every application on isp's that are against net neutrality.\n\nOR better yet just throttle all of their family",
    "controversiality": 0,
    "ups": 140,
    "downs": 0,
    "score": 140,
    "created": 1496787894.0,
    "date_created": "2017-06-06",
    "time_created": "10:24:54",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij8pds",
    "parent_id": "t1_dij4wlj",
    "subreddit_name_prefixed": "r/news",
    "body": "And a top spot in their company, most people miss that part.  Politics is a job for most people doesn't last long in. Especially if you are doing scummy shit that won't get you re-elected.  So having a confirmed spot with a 6 figure pay waiting for you after office is wonderful payment for betraying your voters.",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1496790871.0,
    "date_created": "2017-06-06",
    "time_created": "11:14:31",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijb11b",
    "parent_id": "t1_dij4wlj",
    "subreddit_name_prefixed": "r/news",
    "body": "one of ours in Louisiana was bought off for $300. One of mine specifically for $1k. Bill Cassidy for like $190k.\n\nMy district rep called them all out on it. Gretna loves you, Cedric Richmond!",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1496793366.0,
    "date_created": "2017-06-06",
    "time_created": "11:56:06",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij8ezm",
    "parent_id": "t1_dij4wlj",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496790556.0,
    "date_created": "2017-06-06",
    "time_created": "11:09:16",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij32lf",
    "parent_id": "t1_dij2aoi",
    "subreddit_name_prefixed": "r/news",
    "body": "It was always thought in school that the reason the 2nd amendment was important was in case the people had to take up arms against the government. It is the freedom and opportunity to fight back oppression. Many people abuse this and use it for wrong reasons. Sadly though military tech has advance soo much that weapons wouldn't make a dent.",
    "controversiality": 0,
    "ups": 216,
    "downs": 0,
    "score": 216,
    "created": 1496784173.0,
    "date_created": "2017-06-06",
    "time_created": "09:22:53",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij4td7",
    "parent_id": "t1_dij2aoi",
    "subreddit_name_prefixed": "r/news",
    "body": "Plugging these here:  \n/r/liberalgunowners  \n/r/pinkpistols  \nhttps://i.imgur.com/gElaBsy.jpg",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1496786494.0,
    "date_created": "2017-06-06",
    "time_created": "10:01:34",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij52tc",
    "parent_id": "t1_dij34xf",
    "subreddit_name_prefixed": "r/news",
    "body": "The insidious nature of lobbying is, most of the time, a congressman doesn't know they're being lobbied to.\n\nThe traceable lobbying is on the books, there's records and limits on just how much time a lobbyist can spend talking about telecom issues. The real meat of lobbying happens on golf courses and at private barbecues. A good lobbyist is a congressman's friend, or \"friend\" depending on the case. They'll play 9 holes of golf together and not talk shop at all. Later in the bar, something might come up, but nothing overt, just a friend talking about his job that *happens* to be related to a bill the congressman needs to vote on soon. The congressman doesn't see this as lobbying. He knows the guys a lobbyist, but they've golfed/drank/chatted through dozens of bills that have nothing to do with his company. \n\nShort of telling congressmen they can't have friends, there's no real way to counter this. These lobbyists are their peers, issues or not. And just like how your friends in high school had more influence in how you dressed and what music you listened to than your home life (home state to protract a metaphor), these peer groups of lobbyists have much more influence over votes than a voting public. When this is how you lobby, you don't need to spend that much money during the lobbying proper.\n\nThis is my biggest argument for term limits. These relationships forge over time, across multiple elections. The ability to casually cajole a vote to the point where a congressman thinks it's from their own subjective insight is a slower process than just throwing money at it, but it's a lot cheaper and more effective in the long term. ",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1496786827.0,
    "date_created": "2017-06-06",
    "time_created": "10:07:07",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij4b9y",
    "parent_id": "t1_dij34xf",
    "subreddit_name_prefixed": "r/news",
    "body": "Doesn't the benefit of lobbying come from when you retire and get hired yourself by these groups to lobby on their behalf?",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1496785857.0,
    "date_created": "2017-06-06",
    "time_created": "09:50:57",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij8qp0",
    "parent_id": "t1_dij6fh4",
    "subreddit_name_prefixed": "r/news",
    "body": "Republicans love the free market, unless it's a free market.\n\n",
    "controversiality": 0,
    "ups": 91,
    "downs": 0,
    "score": 91,
    "created": 1496790909.0,
    "date_created": "2017-06-06",
    "time_created": "11:15:09",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijaq7t",
    "parent_id": "t1_dij6b41",
    "subreddit_name_prefixed": "r/news",
    "body": "They are continuing to expand. Kc just had more areas added. I think they may be pulling out of poor markets and refocusing.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1496793044.0,
    "date_created": "2017-06-06",
    "time_created": "11:50:44",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7h8k",
    "parent_id": "t1_dij6b41",
    "subreddit_name_prefixed": "r/news",
    "body": "But if they open up a \"truly free\" internet service after this they'll way more than recoup their losses. Many would go to their service no matter the price just to send a message.",
    "controversiality": 0,
    "ups": 68,
    "downs": 0,
    "score": 68,
    "created": 1496789519.0,
    "date_created": "2017-06-06",
    "time_created": "10:51:59",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij9tz1",
    "parent_id": "t1_dij6lj1",
    "subreddit_name_prefixed": "r/news",
    "body": "Valve step up and talk about something big? Goodluck with that. ",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1496792085.0,
    "date_created": "2017-06-06",
    "time_created": "11:34:45",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijarob",
    "parent_id": "t1_dij6lj1",
    "subreddit_name_prefixed": "r/news",
    "body": "Giving Steam a \"Convenience Fee\" would be such a Comcast thing to do. Just charge Valve a flat $10 / user download, they'd be forced to pass that fee unto consumers.\n\nEdit: Dear god, they'd do it by throwing in ANOTHER cap. Put a 10Gb/month cap on every IP, force the user or Valve to pay $25 if they want to go over.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1496793088.0,
    "date_created": "2017-06-06",
    "time_created": "11:51:28",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijgt4b",
    "parent_id": "t1_dij5w50",
    "subreddit_name_prefixed": "r/news",
    "body": "Can confirm, my internet slows down randomly and it's horrible. Waiting for things to load instead of just accepting that I can't use it because it could get better at any moment.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1496799465.0,
    "date_created": "2017-06-06",
    "time_created": "13:37:45",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij52ra",
    "parent_id": "t1_dij4g3h",
    "subreddit_name_prefixed": "r/news",
    "body": ">First, it will bring high-speed Internet access to more Americans. Without the overhang of heavy-handed regulation, companies will spend more building next-generation networks. As those networks expand, many more Americans, especially low-income rural and urban Americans, will get high-speed Internet access for the first time. And more Americans generally will benefit from faster and better broadband.\n\n>Second, it will create jobs. More Americans will go to work building these networks. These are good-paying jobs, laying fiber, digging trenches, and connecting equipment to utility poles. And established businesses and startup entrepreneurs alike will take advantage of the networks that they build to create even more jobs.\n\n>Third, it will boost competition. Title II was designed for a monopoly. And a regulatory framework designed for a monopoly will tend to move the marketplace towards monopoly. It should therefore come as no surprise that we have seen greater consolidation during the Title II era. Heavy-handed regulations are especially tough on new entrants and small businesses that don’t have the armies of lawyers and compliance officers that large, well-established companies do. So if we want to encourage smaller competitors to enter into the broadband marketplace or expand, we must end Title II.\n\n\n>Fourth, this proposal is the best path toward protecting Americans’ online privacy. Privacy is a topic that has received a lot of attention lately. I understand that many disagreed with Congress’ decision to stop the FCC’s flawed privacy rules from going into effect later this year. But wherever you stand, one thing is indisputable: Congress was maintaining the status quo that the FCC put in place when it imposed Title II. That FCC decision actually stripped the Federal Trade Commission of its authority to regulate broadband providers’ privacy and data security practices. That’s because the FTC cannot regulate common carriers — which the prior FCC suddenly deemed broadband providers to be. This decision was a mistake.\n\nSource: https://medium.com/@timkarr/fcc-chairman-pai-speech-on-the-future-of-internet-regulation-ea9f43c24269",
    "controversiality": 0,
    "ups": 82,
    "downs": 0,
    "score": 82,
    "created": 1496786824.0,
    "date_created": "2017-06-06",
    "time_created": "10:07:04",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5umr",
    "parent_id": "t1_dij4g3h",
    "subreddit_name_prefixed": "r/news",
    "body": "That fuckstick Pai is a former Verizon lawyer. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496787699.0,
    "date_created": "2017-06-06",
    "time_created": "10:21:39",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijetmf",
    "parent_id": "t1_dij6jko",
    "subreddit_name_prefixed": "r/news",
    "body": "As much as they'd like to screw with them, AWS can't really take action. They'd not only fail their ToS, but also destroy their reputation.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496797390.0,
    "date_created": "2017-06-06",
    "time_created": "13:03:10",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij9mfi",
    "parent_id": "t1_dij6jko",
    "subreddit_name_prefixed": "r/news",
    "body": "And? AWS is unaffected. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1496791862.0,
    "date_created": "2017-06-06",
    "time_created": "11:31:02",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij3otn",
    "parent_id": "t1_dij2cvs",
    "subreddit_name_prefixed": "r/news",
    "body": "Buttery males.",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1496785036.0,
    "date_created": "2017-06-06",
    "time_created": "09:37:16",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij869z",
    "parent_id": "t1_dij3swv",
    "subreddit_name_prefixed": "r/news",
    "body": "Turns out the brick WAS the establishment. Now they get to choose the rules in whatever manner maximizes their stock portfolio. Telecom stocks are through the roof! Goldman Sachs and co ought to be sending royalty checks to trump voters lol. ",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1496790288.0,
    "date_created": "2017-06-06",
    "time_created": "11:04:48",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij9gmi",
    "parent_id": "t1_dij2rol",
    "subreddit_name_prefixed": "r/news",
    "body": "Or any political speech deemed not in their interests. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1496791688.0,
    "date_created": "2017-06-06",
    "time_created": "11:28:08",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7jss",
    "parent_id": "t1_dij7434",
    "subreddit_name_prefixed": "r/news",
    "body": "There was actually a really good ELI5 right here on Reddit a couple weeks ago that explains a lot of this stuff and is loaded with links to sources of more info. \n\nhttps://www.reddit.com/r/explainlikeimfive/comments/6c5e97/eli5_how_were_isps_able_to_pocket_the_200_billion/",
    "controversiality": 0,
    "ups": 971,
    "downs": 0,
    "score": 971,
    "created": 1496789596.0,
    "date_created": "2017-06-06",
    "time_created": "10:53:16",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij8cko",
    "parent_id": "t1_dij7434",
    "subreddit_name_prefixed": "r/news",
    "body": "I used to work in a congressman office and writing back will be useless. There will be an intern who will lump you right into a stack of letters that will get a standard response... Most likely the letter you already received. You are better off calling in requesting to speak to an legislative assistant or written a opinion piece in your local news paper calling out the congressman. ",
    "controversiality": 0,
    "ups": 653,
    "downs": 0,
    "score": 653,
    "created": 1496790481.0,
    "date_created": "2017-06-06",
    "time_created": "11:08:01",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij89t8",
    "parent_id": "t1_dij7434",
    "subreddit_name_prefixed": "r/news",
    "body": "Not exactly what you are looking for, but close...The inside story of how Netflix came to pay Comcast for internet traffic:\n\nhttps://qz.com/256586/the-inside-story-of-how-netflix-came-to-pay-comcast-for-internet-traffic/",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496790397.0,
    "date_created": "2017-06-06",
    "time_created": "11:06:37",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijdyw6",
    "parent_id": "t1_dijbw36",
    "subreddit_name_prefixed": "r/news",
    "body": "Its important to say that net neutrality is the reason why rural communities aren't getting broadband, because the truth is there is no economic reason for anyone to install broadband in rural communities. Population density seems to directly correlate with profitability, and if you need to maintain 15 miles of cable for three customers, you aren't going to make any money.\n\nRural communities need government subsidies to get broadband. Republicans hate government subsidies. So of course the rational white knight of net neutrality needs to be blamed.",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1496796503.0,
    "date_created": "2017-06-06",
    "time_created": "12:48:23",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijmzb9",
    "parent_id": "t1_dijbw36",
    "subreddit_name_prefixed": "r/news",
    "body": "> the letter (is) structured in a way that you need to do quite a bit of research to find what is truth and what is lies, exaggerations, and references to such.\n\nProbably written by a telecom industry lobbyist group.\n\n",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496805874.0,
    "date_created": "2017-06-06",
    "time_created": "15:24:34",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij4ko6",
    "parent_id": "t1_dij4bkw",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 1739,
    "downs": 0,
    "score": 1739,
    "created": 1496786186.0,
    "date_created": "2017-06-06",
    "time_created": "09:56:26",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5wzz",
    "parent_id": "t1_dij4bkw",
    "subreddit_name_prefixed": "r/news",
    "body": "Someone remind Netflix that torrents are still a viable alternative.",
    "controversiality": 0,
    "ups": 146,
    "downs": 0,
    "score": 146,
    "created": 1496787774.0,
    "date_created": "2017-06-06",
    "time_created": "10:22:54",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij4jnx",
    "parent_id": "t1_dij4bkw",
    "subreddit_name_prefixed": "r/news",
    "body": "Yep, I cancelled my subscription because of it.  Now I send that $12/month to the EFF instead.  I already have amazon prime anyway, so I'll just use that more.",
    "controversiality": 0,
    "ups": 179,
    "downs": 0,
    "score": 179,
    "created": 1496786152.0,
    "date_created": "2017-06-06",
    "time_created": "09:55:52",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5qel",
    "parent_id": "t1_dij4bkw",
    "subreddit_name_prefixed": "r/news",
    "body": "Jump on a Netflix support chat and tell them they should care about net neutrality and should be participating in the July 12th protest.",
    "controversiality": 0,
    "ups": 51,
    "downs": 0,
    "score": 51,
    "created": 1496787566.0,
    "date_created": "2017-06-06",
    "time_created": "10:19:26",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6n5q",
    "parent_id": "t1_dij4bkw",
    "subreddit_name_prefixed": "r/news",
    "body": "Yup. Netflix really did not impress me. When they weren't the incumbent they were very pro net neutrality. Now they literally don't give a fuck. Pretty distasteful. They should stay ahead of their competition due to quality service, not pay for speed bullshit.\n\nBetween that and blocking of legit VPN / ipv6 tunnel users (not even those trying to get around geo blocks) they lost me as a customer finally. Cancelled my 4-user account.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496788589.0,
    "date_created": "2017-06-06",
    "time_created": "10:36:29",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij84wt",
    "parent_id": "t1_dij5u18",
    "subreddit_name_prefixed": "r/news",
    "body": "They should have national blackout days where the site just redirects to a message about net neutrality. Reddit and other social media sites should do the same.\n\nEdit: typo",
    "controversiality": 0,
    "ups": 101,
    "downs": 0,
    "score": 101,
    "created": 1496790246.0,
    "date_created": "2017-06-06",
    "time_created": "11:04:06",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijc27g",
    "parent_id": "t1_dij5u18",
    "subreddit_name_prefixed": "r/news",
    "body": "That's actually why Title II makes so much sense.  State sanctioned monopolies in areas where large infrastructure are required with significant hurdles to implementation (permitting, right-of-way, etc) and a desire to see uniform distribution (ie rural or less profitable areas) make government subsidy a necessity are acceptable IF those monopolies are properly regulated.  Unfortunately these corporations have more power within our government than they should.  They have taken subsidies and not followed through on the promised implementations.  They are being allowed to enter into massive vertical monopolies - content creation, content distribution platforms and delivery process, communications, and more.  We're going backwards.  The various vertical industries should be split and the lowest level (ISP) should be regulated just like power distribution or telephone.  Telecom is a utility with the same infrastructural capital and regulatory requirements and should be treated as such.  I don't see how anyone can argue that it is anyone's best interest to continue moving in the direction we are now with vertical and horizontal consolidation followed by deregulation??",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1496794481.0,
    "date_created": "2017-06-06",
    "time_created": "12:14:41",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7w5s",
    "parent_id": "t1_dij5u18",
    "subreddit_name_prefixed": "r/news",
    "body": "> Can you imagine if they ran ads\n\nI would riot.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496789974.0,
    "date_created": "2017-06-06",
    "time_created": "10:59:34",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijbvo6",
    "parent_id": "t1_dij5u18",
    "subreddit_name_prefixed": "r/news",
    "body": ">The fact that we have state sanctioned monopolies - in 2017 - blows my mind.\n\nIt shouldn't. The Democratic Party platform abandoned antitrust policy way back during the Clinton administration. This was a natural, forseeable consequence.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496794284.0,
    "date_created": "2017-06-06",
    "time_created": "12:11:24",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijgm9g",
    "parent_id": "t1_dij5u18",
    "subreddit_name_prefixed": "r/news",
    "body": "It is called rent seeking and it is what happens when greed transects increased barriers to additional profits. The only way to make something that is already amazingly profitable *more* profitable is to enlarge its market or break the rules so more can be charged, demand can be forced, or supply can be protected.\n\nThis is exactly why many believe the end state of free markets in a democracy is crony capitalism. Politics and markets mix for really bad outcomes. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496799273.0,
    "date_created": "2017-06-06",
    "time_created": "13:34:33",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij67ph",
    "parent_id": "t1_dij4r2z",
    "subreddit_name_prefixed": "r/news",
    "body": "It blows my mind that we have such monopolies and oligopolies in the 21st Century. This is the kinda stuff that Teddy Roosevelt and friends squashed over 100 years ago. Now our politicians fawn over and deepthroat subjects like \"free market\" and \"competition\" while taking money through the back door from the very companies that suffocate and smother out all competitors.",
    "controversiality": 0,
    "ups": 112,
    "downs": 0,
    "score": 112,
    "created": 1496788108.0,
    "date_created": "2017-06-06",
    "time_created": "10:28:28",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij3w0l",
    "parent_id": "t1_dij3tjs",
    "subreddit_name_prefixed": "r/news",
    "body": "Depends on how the companies handle their IP space.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1496785299.0,
    "date_created": "2017-06-06",
    "time_created": "09:41:39",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5hrl",
    "parent_id": "t1_dij4xwg",
    "subreddit_name_prefixed": "r/news",
    "body": "As usual, the biggest problem with losing net neutrality isn't *us* losing access to things that currently exist.  It's the fact that new competitors for various services won't be able to pop up because they won't be able to pay the ISP fees and the majority of people don't know how to VPN their way to them.",
    "controversiality": 0,
    "ups": 113,
    "downs": 0,
    "score": 113,
    "created": 1496787295.0,
    "date_created": "2017-06-06",
    "time_created": "10:14:55",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5mjz",
    "parent_id": "t1_dij4xwg",
    "subreddit_name_prefixed": "r/news",
    "body": "The terminal step of this bullshit is to make VPN use a felony.",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1496787445.0,
    "date_created": "2017-06-06",
    "time_created": "10:17:25",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijaryl",
    "parent_id": "t1_dij86v6",
    "subreddit_name_prefixed": "r/news",
    "body": "Probably also illegal unless they plan on refunding everyone whose service agreement they would breach by doing so. Zero chance this happens. ",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1496793096.0,
    "date_created": "2017-06-06",
    "time_created": "11:51:36",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijofxw",
    "parent_id": "t1_dij86v6",
    "subreddit_name_prefixed": "r/news",
    "body": "Perhaps if they offered to allow those companies' websites to remain accessible during the protest for a small fee....",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1496807399.0,
    "date_created": "2017-06-06",
    "time_created": "15:49:59",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6pz1",
    "parent_id": "t1_dij6b2i",
    "subreddit_name_prefixed": "r/news",
    "body": "AWS and Microsoft have custom cloud environments for use by US government entities. They're essentially smaller versions of cloud environments that meet isolation and FISMA requirements. \n\nHowever, neither of those platforms would be able to make any changes that could negatively impact contracted SLA performance provided to the governments without heavy penalties. Also, the government uses its own custom \"ISP\" to get access to main campus sites and bypasses comcast, att, TW, etc wherever possible. Small satellite offices can have public ISP links, but the government has by and large insulated itself against net neutrality for its infrastructure needs.",
    "controversiality": 0,
    "ups": 157,
    "downs": 0,
    "score": 157,
    "created": 1496788678.0,
    "date_created": "2017-06-06",
    "time_created": "10:37:58",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6qef",
    "parent_id": "t1_dij6b2i",
    "subreddit_name_prefixed": "r/news",
    "body": "Many do, AWS GovCloud is huge. But 100% AWS will not join the blackout.",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1496788691.0,
    "date_created": "2017-06-06",
    "time_created": "10:38:11",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5kff",
    "parent_id": "t1_dij3gei",
    "subreddit_name_prefixed": "r/news",
    "body": "The whole shtick was a play on an old dirty joke that's been around forever that's referred to as \"bunga bunga\" or just \"bunga\". A quick internet search will give you a few different versions. Here's one I found with a quick search:\n\n>Three guys are captured by a tribe of natives in a far off land. They are brought before the tribal leader who gives them a choice. He says, \"what will you have, death or bunga bunga?\". The first guys thinks, hmmm wonder what bunga bunga is. \"I'll take the bunga bunga\". The tribal leader says, \"good\". Then a dozen tribal members line up and give it to him in the rear. The tribal leader turns to the second guy and gives him the choice, death, or bunga. The second guy thinks, hmm, that bunga bunga thing is pretty nasty. But death is permanent, \"I'll take the bunga bunga\". Tribal leader says, \"good\", and a hundred tribesmen line up and give him the bunga bunga. The tribal leader gives the choice to the third captive. He thinks a while, hmm, first it was a dozen, then it was a hundred, I don't know man. Heck with it, \"I'll take death\". The tribal leader says, \"good, death .... by bunga bunga\". \n\n",
    "controversiality": 0,
    "ups": 124,
    "downs": 0,
    "score": 124,
    "created": 1496787379.0,
    "date_created": "2017-06-06",
    "time_created": "10:16:19",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij49p4",
    "parent_id": "t1_dij3gei",
    "subreddit_name_prefixed": "r/news",
    "body": ">those guys are (arguably) getting raped to death.  I mean it's played for the laughs and the guys are depicted as being into it \n\nwell, Fry and Zapp were into it...\n\nbut Kif was just getting raped",
    "controversiality": 0,
    "ups": 74,
    "downs": 0,
    "score": 74,
    "created": 1496785802.0,
    "date_created": "2017-06-06",
    "time_created": "09:50:02",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij731x",
    "parent_id": "t1_dij63qf",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah, but I don't wanna cancel Netflix. I wanna eat my cake and have it to. \n\nComplaining would probably work if on the 12th everyone stopped watching and just flooded customer service with \"SUPPORT NET NEUTRALITY\" ",
    "controversiality": 0,
    "ups": 372,
    "downs": 0,
    "score": 372,
    "created": 1496789077.0,
    "date_created": "2017-06-06",
    "time_created": "10:44:37",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7uvw",
    "parent_id": "t1_dij622k",
    "subreddit_name_prefixed": "r/news",
    "body": "Bear in mind, the CS reps are individuals just like the rest of us. They have their own beliefs and they are not necessarily the same as the CEO's own opinions.\n\nThey also can't do anything else besides pass the comments along.",
    "controversiality": 0,
    "ups": 326,
    "downs": 0,
    "score": 326,
    "created": 1496789936.0,
    "date_created": "2017-06-06",
    "time_created": "10:58:56",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijok3m",
    "parent_id": "t1_dijo4l1",
    "subreddit_name_prefixed": "r/news",
    "body": "That hope is dying considering the cable companies put them through so much shit that deploying fiber is indefinitely on hold now",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1496807517.0,
    "date_created": "2017-06-06",
    "time_created": "15:51:57",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijolbu",
    "parent_id": "t1_dijo4l1",
    "subreddit_name_prefixed": "r/news",
    "body": "Unfortunately, that won't be happening.  They are winding down most fiber deployments to new cities (existing cities with coverage are ok).  They've downsized the team that was working on Fiber and even stopped their implementation in Google's hometown of Mountain View, CA.  Their new direction is towards wireless technologies, but suffice to say it's not clear at this point other than they plan to test it in 24 cities at some point.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496807553.0,
    "date_created": "2017-06-06",
    "time_created": "15:52:33",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijwane",
    "parent_id": "t1_dijh89z",
    "subreddit_name_prefixed": "r/news",
    "body": "I never considered how getting rid of net neutrality will effect porn. Pornhub is actually a very ethical company, who've showed their support for many good issues. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496816072.0,
    "date_created": "2017-06-06",
    "time_created": "18:14:32",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijacbz",
    "parent_id": "t1_dij6gr8",
    "subreddit_name_prefixed": "r/news",
    "body": "Replace the FCC with banks and the internet with your money. Now imagine the banks are lobbying to control where you can shop, how much of your money you can spend at certain places, or charge you extra fees because you shopped at a competitor or becsuse you spent x dollars somewhere else.    ",
    "controversiality": 0,
    "ups": 170,
    "downs": 0,
    "score": 170,
    "created": 1496792633.0,
    "date_created": "2017-06-06",
    "time_created": "11:43:53",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij948r",
    "parent_id": "t1_dij6gr8",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 130,
    "downs": 0,
    "score": 130,
    "created": 1496791313.0,
    "date_created": "2017-06-06",
    "time_created": "11:21:53",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijai5a",
    "parent_id": "t1_dij6gr8",
    "subreddit_name_prefixed": "r/news",
    "body": "So is this going to be like SOPA all over again? If so, fuck yea.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496792806.0,
    "date_created": "2017-06-06",
    "time_created": "11:46:46",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6ox3",
    "parent_id": "t1_dij6fos",
    "subreddit_name_prefixed": "r/news",
    "body": "It will probably not be limited to this, but here's the campaign site: https://www.battleforthenet.com/july12/",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1496788645.0,
    "date_created": "2017-06-06",
    "time_created": "10:37:25",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijaxmk",
    "parent_id": "t1_dij9z08",
    "subreddit_name_prefixed": "r/news",
    "body": "> and his giant mug\n\nWhich is also ugly!",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1496793263.0,
    "date_created": "2017-06-06",
    "time_created": "11:54:23",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijchbx",
    "parent_id": "t1_dij9z08",
    "subreddit_name_prefixed": "r/news",
    "body": "Both of his mugs are unfuckable",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1496794929.0,
    "date_created": "2017-06-06",
    "time_created": "12:22:09",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijbh6w",
    "parent_id": "t1_dija5us",
    "subreddit_name_prefixed": "r/news",
    "body": "Anyone who calls their own mug infamous seems like a smug asshole to me ",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1496793850.0,
    "date_created": "2017-06-06",
    "time_created": "12:04:10",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij92a6",
    "parent_id": "t1_dij7re1",
    "subreddit_name_prefixed": "r/news",
    "body": "That would probably have the biggest effect. Replace the web with a text page telling people that due to the loss of Net Neutrality, they would no longer have a functioning internet. \n\nThe pornhub users alone would have Pai nailed to the wall of the FCC before the first hour is done. ",
    "controversiality": 0,
    "ups": 136,
    "downs": 0,
    "score": 136,
    "created": 1496791254.0,
    "date_created": "2017-06-06",
    "time_created": "11:20:54",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijb399",
    "parent_id": "t1_dij7re1",
    "subreddit_name_prefixed": "r/news",
    "body": "That wouldn't be healthy for Amazon's business.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1496793433.0,
    "date_created": "2017-06-06",
    "time_created": "11:57:13",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij99f3",
    "parent_id": "t1_dij6bp1",
    "subreddit_name_prefixed": "r/news",
    "body": "Literally all of my friends and coworkers have zero idea about it. Really disheartening because you can't have support for something when no one knows about it to begin with.",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1496791471.0,
    "date_created": "2017-06-06",
    "time_created": "11:24:31",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dije6sg",
    "parent_id": "t1_dij6bp1",
    "subreddit_name_prefixed": "r/news",
    "body": "\"Raising awareness\" isn't enough. Amazon, Google, Wikipedia, and others need to just do a full stop of their services. Internet version of a strike.\n\nCompanies like Amazon could also threaten to remove their wearhouses and distribution centers from states with representatives not supporting net neutrality.\n\nThe time for \"raising awareness\" is over. Now's the time to play hardball.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1496796728.0,
    "date_created": "2017-06-06",
    "time_created": "12:52:08",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijhj16",
    "parent_id": "t1_dij6bp1",
    "subreddit_name_prefixed": "r/news",
    "body": "I find the problem is trying to figure out how to approach my explanation for each individual asking. They are only going to listen for so long before glazing over and not caring. You have to get it right and make it brief.\n\nLike, explaining *what Net Neutrality is* is the same for everyone, but the example you pick for how it actually affects things is the important part. It's like the issue of privacy: Not everyone gives a shit about the same things, so if you make the wrong argument they'll just say \".... so what?\" because they honestly don't care.\n\n- Do you talk about \"The Internet Fast Lane\" and how that really just means slowing everything else down? Not everyone needs fast Internet - as long as it's fast enough for Facebook they're happy.\n\n- Do you talk about how it could be used to stifle competition, making it nearly impossible for competitors to companies like Netflix to ever establish themselves? Well, turns out a lot of people are really happy with their Netflix subscription and don't care if it has any competitors.\n\n- Do you talk about how it could result in the sale of \"Internet Packages\" like you currently get with Cable TV? I find people tend to write me off as a tinfoil-hat conspiracy theorist for this one. It sounds too farfetched. \n\n- Even just saying \"They could slow Netflix down and make you *and* Netflix pay more to bring it back up to where it is now\" often yields the response, \"Well it's more money for the companies right? That can only be a good thing.\"\n\nI don't know. I've found it's a really hard subject to talk to people about.\n\n**Edit:** There's also the comparison to other services, such as electricity. I would find it outrageous if my electric company had any say at all over what brand of television I could and couldn't use, or if they charged me more for one brand than another. But even this one doesn't seem to grab people the same way it does me.\n",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496800206.0,
    "date_created": "2017-06-06",
    "time_created": "13:50:06",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij61ia",
    "parent_id": "t1_dij4siy",
    "subreddit_name_prefixed": "r/news",
    "body": "Give him a chance, he just needs a nice warm cup of covfefe.",
    "controversiality": 0,
    "ups": 45,
    "downs": 0,
    "score": 45,
    "created": 1496787915.0,
    "date_created": "2017-06-06",
    "time_created": "10:25:15",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7yvm",
    "parent_id": "t1_dij7vrp",
    "subreddit_name_prefixed": "r/news",
    "body": "http://www.independent.co.uk/news/world/americas/donald-trump-attended-sinn-f-in-fundraiser-months-before-ira-attacked-london-a6767601.html\n\nHe donated to Sinn Fein weeks before the IRA started to bomb the UK again. It was well-documented at the time that Sinn Fein were funnelling money into the IRA. \n\nHe also hired Peter King who really funded the IRA, gave to NORAID and regularly spoke in support of them. He asked Peter King to draft the Muslim ban. \n\nI have tried to show to Trump supporters that Trump supported the IRA but apparently no, he did not. In their mind, he was 'networking'. Who the fuck networks with terrorists?",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1496790060.0,
    "date_created": "2017-06-06",
    "time_created": "11:01:00",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij85f9",
    "parent_id": "t1_dij60v8",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 69,
    "downs": 0,
    "score": 69,
    "created": 1496790261.0,
    "date_created": "2017-06-06",
    "time_created": "11:04:21",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij93ya",
    "parent_id": "t1_dij8ezm",
    "subreddit_name_prefixed": "r/news",
    "body": ">  you could pretty easily beat this with a gofundme page, that would be pretty hilarious.\n\nIt wont work, even if the gofundme makes a million, Comcast will pay 1.2 million. Its all small change to them. \n\nThere is also a HUGE problem with a government when the population thinks it needs to out bribe a corporation in order to have its interests represented. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496791304.0,
    "date_created": "2017-06-06",
    "time_created": "11:21:44",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5h8n",
    "parent_id": "t1_dij32lf",
    "subreddit_name_prefixed": "r/news",
    "body": "Vietnam proved that modern weaponry doesn't help when the military is up against individuals who are able to disperse, hide out, play the terrain, and don't follow established, expected military patterns.",
    "controversiality": 0,
    "ups": 88,
    "downs": 0,
    "score": 88,
    "created": 1496787279.0,
    "date_created": "2017-06-06",
    "time_created": "10:14:39",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij3999",
    "parent_id": "t1_dij32lf",
    "subreddit_name_prefixed": "r/news",
    "body": "The scariest insurgents in Afghanistan are the 65 y/o Muj fighters with a Lee Enfield. The U.S. isn't going to be overthrown by an insurgency but we haven't quite figured out how to beat them yet.",
    "controversiality": 0,
    "ups": 153,
    "downs": 0,
    "score": 153,
    "created": 1496784436.0,
    "date_created": "2017-06-06",
    "time_created": "09:27:16",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij3hrx",
    "parent_id": "t1_dij32lf",
    "subreddit_name_prefixed": "r/news",
    "body": "You are part correct. It also provides a ready made band of fighters in a pinch. This. Anti- tyranny is why some of the more well read 2nd amendment supporters are always fighting to roll back legislation that creates a de facto ban on certain weapons, to make the dent bigger.",
    "controversiality": 0,
    "ups": 53,
    "downs": 0,
    "score": 53,
    "created": 1496784767.0,
    "date_created": "2017-06-06",
    "time_created": "09:32:47",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij4ts6",
    "parent_id": "t1_dij32lf",
    "subreddit_name_prefixed": "r/news",
    "body": "The 2nd Amendment protects the 1st.",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1496786508.0,
    "date_created": "2017-06-06",
    "time_created": "10:01:48",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij4z7w",
    "parent_id": "t1_dij32lf",
    "subreddit_name_prefixed": "r/news",
    "body": "Everyone always uses this dumbass military weaponry excuse as if everyone in the military is just going to fall in line and slaughter their fellow countrymen. This isn't the 1800s anymore. It won't work like that again.",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1496786697.0,
    "date_created": "2017-06-06",
    "time_created": "10:04:57",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5qgn",
    "parent_id": "t1_dij32lf",
    "subreddit_name_prefixed": "r/news",
    "body": "See, what people forget is that the army is made up of PEOPLE. Not government drones. It's an army of our fellow countrymen and women. That's why I hate when people say things like that. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1496787568.0,
    "date_created": "2017-06-06",
    "time_created": "10:19:28",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij73zj",
    "parent_id": "t1_dij32lf",
    "subreddit_name_prefixed": "r/news",
    "body": "> Sadly though military tech has advance soo much that weapons wouldn't make a dent.\n\nHaven't spent much time in the South or Texas have you? An American insurgency would rival most foreign standing \narmies ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496789106.0,
    "date_created": "2017-06-06",
    "time_created": "10:45:06",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij68tk",
    "parent_id": "t1_dij32lf",
    "subreddit_name_prefixed": "r/news",
    "body": "It depends on how many side with the government, and how many people side with the rebellion. Guerrilla warfare would be the tactics of choice, the rebels would have to rely on pre-internet communication to  ensure their tactics are hidden from surveillance, and people would start to understand why isis and other terrorist groups fight the way they do in the middle east with IED's. With many veterans knowledgeable in weapons, bombs, and tactics we would rely on them to train the rebellion soldiers and teach recruits how to make explosives. Some governors would not agree with the federal governments orders and depending on their state support may even secede and provide national guard troops, armor, weapons, and military vehicles. The rebels would have more of a chance than you would think.  ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496788141.0,
    "date_created": "2017-06-06",
    "time_created": "10:29:01",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij8y1w",
    "parent_id": "t1_dij52tc",
    "subreddit_name_prefixed": "r/news",
    "body": "1 term limit with the death penalty for anyone convicted of being a politician. Solves 100% of the governmental issues. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496791128.0,
    "date_created": "2017-06-06",
    "time_created": "11:18:48",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijbdfr",
    "parent_id": "t1_dij52tc",
    "subreddit_name_prefixed": "r/news",
    "body": "I upvoted you because you bring up an interesting point, but I disagree- if you have a term limit then a congressman simply won't care during their last term about public good.\n\nI think the general person is probably \"bad\" enough to do something shady if they have nothing to lose (i.e. an election), and while maybe 90% of the time it's nothing overt, that 10% of the time is _really_ bad. \n\nAlso based on personal experience I definitely think you can become friends w/ somebody within a year. (unless we have a single term limit of 1 year it's a moot point)",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496793739.0,
    "date_created": "2017-06-06",
    "time_created": "12:02:19",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij93ch",
    "parent_id": "t1_dij8qp0",
    "subreddit_name_prefixed": "r/news",
    "body": "Republicans hate the free market.",
    "controversiality": 0,
    "ups": 81,
    "downs": 0,
    "score": 81,
    "created": 1496791287.0,
    "date_created": "2017-06-06",
    "time_created": "11:21:27",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij9jw8",
    "parent_id": "t1_dij7h8k",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah no kidding. They'd either force competitors into net neutrality again or run them out of business. ",
    "controversiality": 0,
    "ups": 61,
    "downs": 0,
    "score": 61,
    "created": 1496791786.0,
    "date_created": "2017-06-06",
    "time_created": "11:29:46",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijel5m",
    "parent_id": "t1_dij7h8k",
    "subreddit_name_prefixed": "r/news",
    "body": "I live in Nashville were Google has basically stopped their campaign to lay fiber.  What happens is the ISP's gang up on the new guy and file injunctions to stop them from being able to move the lines on the poles.  Of course, this wont stand up in court, but it will delay the new guy from laying wires on the poles for a very long time.  \n\nA guy that lived next to me moved here to work on laying the fiber and had to leave because the delay basically shut down his income.  So all the workers waiting to lay the wires are out of a job while they wait for the ISPs to duke it out in court and the new guy (Google) loses all their momentum and money while the big ISP's are laying their own fiber. ",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1496797142.0,
    "date_created": "2017-06-06",
    "time_created": "12:59:02",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5iln",
    "parent_id": "t1_dij52ra",
    "subreddit_name_prefixed": "r/news",
    "body": "Well that's dumb. Clearly Pai is either lying to us or to himself. \n\n\n\n\nEDIT:  As for how I can say that it's a lie, \n>It's a lie because he doesn't have any proof or evidence or substantiation of any kind to back up these claims. If there's no evidence for them, then there's no way to know if they're true or not, so him acting like they are is inherently dishonest. Even if he believes them completely, he's got no good reason to, so he has to be lying to himself or to us.\n\n>You might be thinking \"but people say things that they can't prove all the time!\" in which case, yep! You're exactly right. Lots of politicians have trouble with basic honesty.\n",
    "controversiality": 0,
    "ups": 114,
    "downs": 0,
    "score": 114,
    "created": 1496787321.0,
    "date_created": "2017-06-06",
    "time_created": "10:15:21",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5xg7",
    "parent_id": "t1_dij52ra",
    "subreddit_name_prefixed": "r/news",
    "body": "Sometimes it blows my mind that they can just lie so easily. I really do wonder how they live with themselves. ",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1496787788.0,
    "date_created": "2017-06-06",
    "time_created": "10:23:08",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6sja",
    "parent_id": "t1_dij52ra",
    "subreddit_name_prefixed": "r/news",
    "body": "...and net neutrality literally doesn't prevent *any of that*.\n\n* broadband providers may not block access to legal content, applications, services, or non-harmful devices.\n* broadband providers may not impair or degrade lawful Internet traffic on the basis of content, applications, services, or non-harmful devices.\n* broadband providers may not favor some lawful Internet traffic over other lawful traffic in exchange for consideration of any kind. This rule also bans ISPs from prioritizing content and services of their affiliates.\n\nSo yea, go ahead and build out your fiber networks, allow new ISPs in your markets to compete, and hire more workers. Net neutrality doesn't prevent any of that from happening. \n\nThe implication people like Pai are making is that ISPs are poor struggling companies and the reason your internet is slow is because those evil giants like netflix clog the pipes with tv shows! So please allow ISPs to start charging new fees, rates, and privileges and then maybe they'll make their networks better.\n\nI mean even though verizon made $9 billion *just last year* clearly that isn't enough money to offer better service. I mean it's not like you can get google fiber fucking gigabit internet for $70, meanwhile comcast charges $75 for 50mb internet in my area. ",
    "controversiality": 0,
    "ups": 45,
    "downs": 0,
    "score": 45,
    "created": 1496788758.0,
    "date_created": "2017-06-06",
    "time_created": "10:39:18",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5yv9",
    "parent_id": "t1_dij52ra",
    "subreddit_name_prefixed": "r/news",
    "body": "The same corporations that took billions in tax breaks to build the infrastructure in Pennsylvania but instead pocketed and used it to expand their cell network?\n\nYeah, them investing in new infrastructure instead of charging more for a lesser product seems super likely.",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1496787833.0,
    "date_created": "2017-06-06",
    "time_created": "10:23:53",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5xpb",
    "parent_id": "t1_dij52ra",
    "subreddit_name_prefixed": "r/news",
    "body": "That's a whole load of bullshit. Its the opposite in almost every single point of his.",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1496787795.0,
    "date_created": "2017-06-06",
    "time_created": "10:23:15",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5u9g",
    "parent_id": "t1_dij52ra",
    "subreddit_name_prefixed": "r/news",
    "body": "Laying fiber?! Get the hell outta here\n.. I WISH they'd do that anywhere near me... Why would they spend any money on that when they have us by the balls already? ",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1496787688.0,
    "date_created": "2017-06-06",
    "time_created": "10:21:28",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5mza",
    "parent_id": "t1_dij52ra",
    "subreddit_name_prefixed": "r/news",
    "body": "> Without the overhang of heavy-handed regulation, companies will spend more building next-generation networks.\n\nAh yes, trickle down economics.  Tried and true according to the GOP.",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1496787459.0,
    "date_created": "2017-06-06",
    "time_created": "10:17:39",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijiuow",
    "parent_id": "t1_dijetmf",
    "subreddit_name_prefixed": "r/news",
    "body": "nor should they. at that point they would cross the line and become no better than what they're trying to fight. it's the whole point of net neutrality.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496801597.0,
    "date_created": "2017-06-06",
    "time_created": "14:13:17",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij9wof",
    "parent_id": "t1_dij9mfi",
    "subreddit_name_prefixed": "r/news",
    "body": "If Amazon is participating, AWS may not be unaffected.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1496792165.0,
    "date_created": "2017-06-06",
    "time_created": "11:36:05",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijetzv",
    "parent_id": "t1_dij7jss",
    "subreddit_name_prefixed": "r/news",
    "body": "Unfortunately, Reddit isn't excluded from newscycles. If it's been more than a week, mostly everyone forgot and moved onto something else. ",
    "controversiality": 0,
    "ups": 180,
    "downs": 0,
    "score": 180,
    "created": 1496797400.0,
    "date_created": "2017-06-06",
    "time_created": "13:03:20",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijbh2c",
    "parent_id": "t1_dij8cko",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 292,
    "downs": 0,
    "score": 292,
    "created": 1496793847.0,
    "date_created": "2017-06-06",
    "time_created": "12:04:07",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijg5f5",
    "parent_id": "t1_dij8cko",
    "subreddit_name_prefixed": "r/news",
    "body": "In your experience, did the concerns of constituents ever get passed upwards in the office? Not even necessarily to the congressman, but to higher ranking assistants (I don't know the proper position titles). I know it is unlikely to ever change a congressman's mind on a subject, but were there instances where the congressman or his staff in charge of drafting legislation were ever imprinted by ideas from constituents that they didn't necessarily agree with?",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1496798786.0,
    "date_created": "2017-06-06",
    "time_created": "13:26:26",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijjroj",
    "parent_id": "t1_dij8cko",
    "subreddit_name_prefixed": "r/news",
    "body": "have worked for a member of parliament in Canada.\nSame deal",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496802560.0,
    "date_created": "2017-06-06",
    "time_created": "14:29:20",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijjksf",
    "parent_id": "t1_dijdyw6",
    "subreddit_name_prefixed": "r/news",
    "body": "Republicans love government subsidies like everyone else so long as they align with their goals: setting up more religious schools, paying more of the rich farmers and ranchers to produce less, or propping up the fossil fuel industry.\n\nThe only reason they (see their party, as the rest will vote down party lines even if only the ones at top are really getting the donations, corrupting themselves without even getting paid these days, all for the love of party)  are against this is because they are being paid by ISP lobbyists to be against it.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1496802361.0,
    "date_created": "2017-06-06",
    "time_created": "14:26:01",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij4vi4",
    "parent_id": "t1_dij4ko6",
    "subreddit_name_prefixed": "r/news",
    "body": "Such primitive thinking...\n\n\"Oh yeah it would'a been a massive fuck up for us when we were small....but meeeh now it will just let us lead the pack for longer\"",
    "controversiality": 0,
    "ups": 1039,
    "downs": 0,
    "score": 1039,
    "created": 1496786570.0,
    "date_created": "2017-06-06",
    "time_created": "10:02:50",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5orx",
    "parent_id": "t1_dij4ko6",
    "subreddit_name_prefixed": "r/news",
    "body": "I don't think he got bribed, I think it's just that he knows it's no longer viable to block Netflix and/or they now have the money if they have to pay the blood money. ",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1496787514.0,
    "date_created": "2017-06-06",
    "time_created": "10:18:34",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij650w",
    "parent_id": "t1_dij4ko6",
    "subreddit_name_prefixed": "r/news",
    "body": "Netflix should be careful. I remember a few years back another home entertainment company sounded just as cocky.  \n  \nI believe they were called... Blockbuster?",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1496788024.0,
    "date_created": "2017-06-06",
    "time_created": "10:27:04",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij4vuw",
    "parent_id": "t1_dij4ko6",
    "subreddit_name_prefixed": "r/news",
    "body": "Netflix isnt what it used to be. Idk if they were bought by big hollywood or theyre being strangled but theres a definate decline in variety on their library. Unless the same movies showing up in every genre was always the norm...",
    "controversiality": 0,
    "ups": 51,
    "downs": 0,
    "score": 51,
    "created": 1496786582.0,
    "date_created": "2017-06-06",
    "time_created": "10:03:02",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij846m",
    "parent_id": "t1_dij4ko6",
    "subreddit_name_prefixed": "r/news",
    "body": "It's treason then.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496790223.0,
    "date_created": "2017-06-06",
    "time_created": "11:03:43",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6lo7",
    "parent_id": "t1_dij5wzz",
    "subreddit_name_prefixed": "r/news",
    "body": "...until the end of NN",
    "controversiality": 0,
    "ups": 81,
    "downs": 0,
    "score": 81,
    "created": 1496788545.0,
    "date_created": "2017-06-06",
    "time_created": "10:35:45",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij59jk",
    "parent_id": "t1_dij4jnx",
    "subreddit_name_prefixed": "r/news",
    "body": "That's awesome. Ignore the keyboard cowboys who do nothing positive and just mock those who do.",
    "controversiality": 0,
    "ups": 67,
    "downs": 0,
    "score": 67,
    "created": 1496787046.0,
    "date_created": "2017-06-06",
    "time_created": "10:10:46",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij64f8",
    "parent_id": "t1_dij5qel",
    "subreddit_name_prefixed": "r/news",
    "body": "The guy on the other side of that chat can't really do anything about that suggestion. Good chance it won't even be someone living in the USA.",
    "controversiality": 0,
    "ups": 63,
    "downs": 0,
    "score": 63,
    "created": 1496788005.0,
    "date_created": "2017-06-06",
    "time_created": "10:26:45",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dije5dj",
    "parent_id": "t1_dij5qel",
    "subreddit_name_prefixed": "r/news",
    "body": "Someone should organize a mass netflix cancellation on july 12th as well, to show that consumers matter.\n\nSure, I expect 90% would renew anyways, but at least it will damage netflix stock, so they will HAVE to care.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496796686.0,
    "date_created": "2017-06-06",
    "time_created": "12:51:26",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dija8sx",
    "parent_id": "t1_dij84wt",
    "subreddit_name_prefixed": "r/news",
    "body": "The whole internet did for sopa",
    "controversiality": 0,
    "ups": 92,
    "downs": 0,
    "score": 92,
    "created": 1496792527.0,
    "date_created": "2017-06-06",
    "time_created": "11:42:07",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijbypm",
    "parent_id": "t1_dij84wt",
    "subreddit_name_prefixed": "r/news",
    "body": "Not even a message, a web page that says \"This website has been blocked by your ISP. To access this premium part of the internet you are required to pay an additional 24.99 a month for the Shopping & Streaming package.\"\n\n\"This message is brought to you by www.(insertwebsitenamehere).com and is fake, but it will be real if the FCC reverses net neutrality rules.\"\n\nAnyone who reads that and understands they also cant access the site for a day will quickly understand how bad this could get. ",
    "controversiality": 0,
    "ups": 130,
    "downs": 0,
    "score": 130,
    "created": 1496794376.0,
    "date_created": "2017-06-06",
    "time_created": "12:12:56",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijdtvv",
    "parent_id": "t1_dij84wt",
    "subreddit_name_prefixed": "r/news",
    "body": ">What will happen on July 12th?\n\n>Websites, Internet users, and online communities will come together to sound the alarm about the FCC’s attack on net neutrality. We'll provide tools for everyone to make it super easy for your followers / visitors to take action. From the SOPA blackout to the Internet Slowdown, we've shown time and time again that when the Internet comes together, we can stop censorship and corruption. Now, we have to do it again!\n\nWe, as customers, should also shut down our own home internet access, including cable tv if supplied by an ISP/telecoms, on that day. No ad revenue; no clicks or views, for a whole day...\n\n",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1496796358.0,
    "date_created": "2017-06-06",
    "time_created": "12:45:58",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijewkj",
    "parent_id": "t1_dij84wt",
    "subreddit_name_prefixed": "r/news",
    "body": "I would be so aggravated, but also understand that this is for the greater good and my personal inconveniences mean fuck all when these large companies don't give a shit about their customers. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496797478.0,
    "date_created": "2017-06-06",
    "time_created": "13:04:38",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijleso",
    "parent_id": "t1_dij84wt",
    "subreddit_name_prefixed": "r/news",
    "body": "not even national blackout dates, just impose what amounts to trade restrictions against states whose congresspeople are anti-NN (read: Republican). \n\nThis would have several advantages:\n\n1. The people living in states with reasonable representatives  can keep having nice things. You're not really accomplishing much by telling me to contact my reps if they're already onboard\n\n\n2. the companies themselves can still make money that day by doing business in at least half the country\n\n3. it highlights the shitty politicians. It's no longer \"we cant have nice things because all of congress is shitty\", it's  \"I can't have nice things because MY congressfolks suck\". This is important, because it makes it a more reasonable fight for the common person. We can't change all of congress, but if the problem is that it's just MY state that  can't get it's act together, then I have more hope for change, because it's been proven by the states unaffected. \n\n4. republican ideology is becoming \"we all can't have nice things, but it's okay as long as libruls can't have nice things either and we get to see them librul tears\", but if it's only themselves that they are hurting with their policies, while the libruls are doing just fine, it might be a different story.\n\n",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1496804259.0,
    "date_created": "2017-06-06",
    "time_created": "14:57:39",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7f2f",
    "parent_id": "t1_dij67ph",
    "subreddit_name_prefixed": "r/news",
    "body": "Also scary that both parties are supportive of this wealth aggregation and inequality.\n\nLook what happened to Bernie's message on rigged economy..... fades away to \"safe\" issues\n\nedit: spelling",
    "controversiality": 0,
    "ups": 69,
    "downs": 0,
    "score": 69,
    "created": 1496789449.0,
    "date_created": "2017-06-06",
    "time_created": "10:50:49",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5fc7",
    "parent_id": "t1_dij3w0l",
    "subreddit_name_prefixed": "r/news",
    "body": "Ah. Admittingly I don't know how the infrastructure is set up. Probably super confusing by design.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496787222.0,
    "date_created": "2017-06-06",
    "time_created": "10:13:42",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5u7q",
    "parent_id": "t1_dij5hrl",
    "subreddit_name_prefixed": "r/news",
    "body": "They will have to pay the troll toll.",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1496787686.0,
    "date_created": "2017-06-06",
    "time_created": "10:21:26",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7zq6",
    "parent_id": "t1_dij5hrl",
    "subreddit_name_prefixed": "r/news",
    "body": "That's like the Internet version of the first anti-trust cases against the railroads monopolies",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496790086.0,
    "date_created": "2017-06-06",
    "time_created": "11:01:26",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dik0sz5",
    "parent_id": "t1_dijofxw",
    "subreddit_name_prefixed": "r/news",
    "body": "Underrated idea right here, some ISP should try to do that as a business plan!",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496821722.0,
    "date_created": "2017-06-06",
    "time_created": "19:48:42",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijdeex",
    "parent_id": "t1_dij6pz1",
    "subreddit_name_prefixed": "r/news",
    "body": "Congress should make a public national custom ISP for residents.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496795908.0,
    "date_created": "2017-06-06",
    "time_created": "12:38:28",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij83fz",
    "parent_id": "t1_dij6qef",
    "subreddit_name_prefixed": "r/news",
    "body": "Oh well. At least they are there in name which is still a huge deal.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496790200.0,
    "date_created": "2017-06-06",
    "time_created": "11:03:20",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij8nkc",
    "parent_id": "t1_dij5kff",
    "subreddit_name_prefixed": "r/news",
    "body": "Holy crap ! We've got a very famous cartoon about this story in France too ! It's called \"La mort ou Tchi-tchi ?\": \n\n[Here's the link](https://www.youtube.com/watch?v=e4Ha7csuZz4)",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1496790816.0,
    "date_created": "2017-06-06",
    "time_created": "11:13:36",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij97u0",
    "parent_id": "t1_dij5kff",
    "subreddit_name_prefixed": "r/news",
    "body": "That's a common format for a joke to be honest. Even The Dark Knight Rises used it, with Scarecrow's kangaroo court scene. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1496791421.0,
    "date_created": "2017-06-06",
    "time_created": "11:23:41",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij4xvb",
    "parent_id": "t1_dij49p4",
    "subreddit_name_prefixed": "r/news",
    "body": "\"What are you, gay?\" classic Zapp.",
    "controversiality": 0,
    "ups": 55,
    "downs": 0,
    "score": 55,
    "created": 1496786652.0,
    "date_created": "2017-06-06",
    "time_created": "10:04:12",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij4uqt",
    "parent_id": "t1_dij49p4",
    "subreddit_name_prefixed": "r/news",
    "body": "For a while they were, but then by the time they were rescued Zapp says \"Can't we just cuddle?\" At that point he and Fry were being raped.",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1496786543.0,
    "date_created": "2017-06-06",
    "time_created": "10:02:23",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7lee",
    "parent_id": "t1_dij731x",
    "subreddit_name_prefixed": "r/news",
    "body": "I mean it's not that hard to cancel it and then start it up again in a few weeks lol",
    "controversiality": 0,
    "ups": 176,
    "downs": 0,
    "score": 176,
    "created": 1496789646.0,
    "date_created": "2017-06-06",
    "time_created": "10:54:06",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij942f",
    "parent_id": "t1_dij731x",
    "subreddit_name_prefixed": "r/news",
    "body": "You can. Cancel netflix then just torrent all of netflix shoes.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1496791307.0,
    "date_created": "2017-06-06",
    "time_created": "11:21:47",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dija186",
    "parent_id": "t1_dij731x",
    "subreddit_name_prefixed": "r/news",
    "body": "Why wait, do it now! I don't have netflix so my complaint may not be viable. I could call and say that their stance made me turn away from purchasing a subscription. Partially true anyways.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496792301.0,
    "date_created": "2017-06-06",
    "time_created": "11:38:21",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dija63l",
    "parent_id": "t1_dij7uvw",
    "subreddit_name_prefixed": "r/news",
    "body": "As long as they have some sort of process to log these complaints. Worried the CS reps hangup and go about their day thinking \"well another waste of time that was\" ",
    "controversiality": 0,
    "ups": 80,
    "downs": 0,
    "score": 80,
    "created": 1496792447.0,
    "date_created": "2017-06-06",
    "time_created": "11:40:47",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dija86i",
    "parent_id": "t1_dij7uvw",
    "subreddit_name_prefixed": "r/news",
    "body": "The rep said she'd pass it along and she probably did. Just as when I was a buss boy and a granny would tell me the AC was set too high. In both cases management just shrugs their shoulders. However, if a good percentage of the takes have the same gripe, the manager would turn down the AC.\n\nPoint of the anecdotes is that the best thing we can do is flood their customer service department with comments. A few dozen comments can be brushed off as nothing. They won't ignore thousands of comments.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1496792508.0,
    "date_created": "2017-06-06",
    "time_created": "11:41:48",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijy2zl",
    "parent_id": "t1_dijwane",
    "subreddit_name_prefixed": "r/news",
    "body": "Fully agree. Pretty sure politicians are either major sex fiends or gay, depending on whether they think porn or homosexuality is the greatest threat to family.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496818262.0,
    "date_created": "2017-06-06",
    "time_created": "18:51:02",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijb7t5",
    "parent_id": "t1_dijacbz",
    "subreddit_name_prefixed": "r/news",
    "body": "I like this analogy a lot. People should use this with their less tech savvy friends/family. Thanks!",
    "controversiality": 0,
    "ups": 62,
    "downs": 0,
    "score": 62,
    "created": 1496793569.0,
    "date_created": "2017-06-06",
    "time_created": "11:59:29",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijoahu",
    "parent_id": "t1_dijacbz",
    "subreddit_name_prefixed": "r/news",
    "body": "Of course the best analogy I've ever heard for NN comes from someone who calls them self /u/gives_anal_lessons",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496807243.0,
    "date_created": "2017-06-06",
    "time_created": "15:47:23",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijn492",
    "parent_id": "t1_dijacbz",
    "subreddit_name_prefixed": "r/news",
    "body": "What a GREAT analogy!\n\nI've been saying - Would you like your internet to get slower and more expensive? yes or no? ......then explaining how this is similar to turning the internet into cable TV packages, in order for the average layperson to get it.\n\nEven though it's the regulations that's potentially the most scary",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496806014.0,
    "date_created": "2017-06-06",
    "time_created": "15:26:54",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6r31",
    "parent_id": "t1_dij6ox3",
    "subreddit_name_prefixed": "r/news",
    "body": "The only thing it says is\n\n>Websites, Internet users, and online communities will come together to sound the alarm about the FCC’s attack on net neutrality. We'll provide tools for everyone to make it super easy for your followers / visitors to take action.",
    "controversiality": 0,
    "ups": 58,
    "downs": 0,
    "score": 58,
    "created": 1496788713.0,
    "date_created": "2017-06-06",
    "time_created": "10:38:33",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dije1tk",
    "parent_id": "t1_dijbh6w",
    "subreddit_name_prefixed": "r/news",
    "body": "He probably farts in his mug, then smells and tastes it like a fine wine.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1496796587.0,
    "date_created": "2017-06-06",
    "time_created": "12:49:47",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijj64c",
    "parent_id": "t1_dij92a6",
    "subreddit_name_prefixed": "r/news",
    "body": "It really says something when I have more faith that a porn website will do more for my rights than the government...",
    "controversiality": 0,
    "ups": 70,
    "downs": 0,
    "score": 70,
    "created": 1496801935.0,
    "date_created": "2017-06-06",
    "time_created": "14:18:55",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijb9ru",
    "parent_id": "t1_dijb399",
    "subreddit_name_prefixed": "r/news",
    "body": "Short term, probably not, but long term? Without net neutrality, their entire business model could be crippled.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1496793628.0,
    "date_created": "2017-06-06",
    "time_created": "12:00:28",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijrha5",
    "parent_id": "t1_dijhj16",
    "subreddit_name_prefixed": "r/news",
    "body": "I saw a post above compare the FCC to the bank, and your internet service to your money. Denying Net Neutrality is like the bank telling you how much you can spend at each store or even charging you for buying at stores they don't want you to spend at",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496810623.0,
    "date_created": "2017-06-06",
    "time_created": "16:43:43",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij97vc",
    "parent_id": "t1_dij7yvm",
    "subreddit_name_prefixed": "r/news",
    "body": "Sinn Fein is a political party. This is the same BS that Tories are slandering Corbyn for. If Ireland elects Sinn Fein, and you meet with them, you are meeting with representatives of the Irish government and political processes. They have ties to the IRA, but that doesn't mean Trump and Corbyn met with Terrorists. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1496791422.0,
    "date_created": "2017-06-06",
    "time_created": "11:23:42",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij8j5n",
    "parent_id": "t1_dij85f9",
    "subreddit_name_prefixed": "r/news",
    "body": "its what comcast does :P\nMaybe they should charge the customers more for faster internet.",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1496790681.0,
    "date_created": "2017-06-06",
    "time_created": "11:11:21",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijb490",
    "parent_id": "t1_dij85f9",
    "subreddit_name_prefixed": "r/news",
    "body": "Comcast uses AWS, not that Amazon is bold/dumb enough to take down their service. Amusing to think about though...",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496793463.0,
    "date_created": "2017-06-06",
    "time_created": "11:57:43",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij68vn",
    "parent_id": "t1_dij5h8n",
    "subreddit_name_prefixed": "r/news",
    "body": "And more recently, Afghanistan. We've been there almost 16 years, and there are still insurgents putting up a fight with crappy weapons. ",
    "controversiality": 0,
    "ups": 73,
    "downs": 0,
    "score": 73,
    "created": 1496788143.0,
    "date_created": "2017-06-06",
    "time_created": "10:29:03",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij3mtv",
    "parent_id": "t1_dij3999",
    "subreddit_name_prefixed": "r/news",
    "body": "It never seems to occur to anyone that all those heavily armed hillbillies might be more included to fight on _behalf_ of tyranny than against it.\n\nTake a look at the last election, and the Trump cult that has sprung up. Imagine that the figurehead of that cult has more canny and cunning than Trump. You think that the rural areas can't be manipulated into taking up arms against their hated political enemies? \n\nThe demagogue we've got is incompetent - for now. They won't all be.",
    "controversiality": 0,
    "ups": 134,
    "downs": 0,
    "score": 134,
    "created": 1496784962.0,
    "date_created": "2017-06-06",
    "time_created": "09:36:02",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij46g8",
    "parent_id": "t1_dij3hrx",
    "subreddit_name_prefixed": "r/news",
    "body": "Yep. I guarantee if there was a tank dealer at the auto mall, there would be tanks everywhere.",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1496785684.0,
    "date_created": "2017-06-06",
    "time_created": "09:48:04",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijaw7e",
    "parent_id": "t1_dij4ts6",
    "subreddit_name_prefixed": "r/news",
    "body": "The 1st makes civil disobedience possible, and when civil disobedience is no longer enough, the 2nd got our backs.\n\nThey protect each other and allow us to protect ourselves.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1496793221.0,
    "date_created": "2017-06-06",
    "time_created": "11:53:41",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7pap",
    "parent_id": "t1_dij4z7w",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm in the Army Reserve and people give me this crap all the time. It's seriously insulting. I had to explain to my roommate that I wouldn't just follow orders to kill innocent civilians if I was given the order. The look on his face was incredible, like he couldn't comprehend that we (including the high ranking officers) are individuals with our own set of principles, allegiances, and personal hopes and dreams just like anyone else.\n\nIt never even was this way to begin with. Look at all the civil wars Rome had where the military split down the middle, or how many soldiers broke away from the Tsar to fight for the Bolsheviks. \n\nIf you haven't read about the Operation Jade Helm conspiracy look it up. I grew up conservative, but that was the straw that broke it all for me. You had actual congressmen and senators calling for the National Guard to monitor the active duty Army to make sure President Obama wasn't going to declare martial law in Texas and use Wal Marts as concentration camps. And this is coming from the same people who deep throat \"patriotism\" and the military and everything else, yet they somehow thought we were stupid and blind enough to follow orders, break with the constitution, and overthrow an entire state. If you think we are blind enough to do this I don't want your support.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1496789765.0,
    "date_created": "2017-06-06",
    "time_created": "10:56:05",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijgf23",
    "parent_id": "t1_dij93ch",
    "subreddit_name_prefixed": "r/news",
    "body": "Hey guys! We got there!",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496799063.0,
    "date_created": "2017-06-06",
    "time_created": "13:31:03",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijdjr1",
    "parent_id": "t1_dij9jw8",
    "subreddit_name_prefixed": "r/news",
    "body": "I mean this is assuming that they are able to get into the large markets where the already established ISP have a monopoly basically being enforced by the local government.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1496796065.0,
    "date_created": "2017-06-06",
    "time_created": "12:41:05",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6hwt",
    "parent_id": "t1_dij5iln",
    "subreddit_name_prefixed": "r/news",
    "body": "He is lying to us. He just wants those bribes.",
    "controversiality": 0,
    "ups": 61,
    "downs": 0,
    "score": 61,
    "created": 1496788424.0,
    "date_created": "2017-06-06",
    "time_created": "10:33:44",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6ifw",
    "parent_id": "t1_dij5iln",
    "subreddit_name_prefixed": "r/news",
    "body": "He's lying to the people while potentially pocketing kickbacks.",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1496788439.0,
    "date_created": "2017-06-06",
    "time_created": "10:33:59",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7t54",
    "parent_id": "t1_dij5xg7",
    "subreddit_name_prefixed": "r/news",
    "body": "Whenever he starts to feel bad he buys a new Mercedes with all the money ISPs are throwing at him to make this happen. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1496789884.0,
    "date_created": "2017-06-06",
    "time_created": "10:58:04",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij79xd",
    "parent_id": "t1_dij5xg7",
    "subreddit_name_prefixed": "r/news",
    "body": "Some of them made almost 100k$ with this! In a year! Amazing",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496789290.0,
    "date_created": "2017-06-06",
    "time_created": "10:48:10",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij80f0",
    "parent_id": "t1_dij5xg7",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm chalking it up to groupthink. Enough of these guys/gals working in a room and they see some of their friends getting $$$k for promoting X agenda. Enough of them start doing it and it becomes \"normal\". They start doing it and it doesn't feel odd, it doesn't feel like lying, it just is the way it is. It is normal. \n\nHell, think of lobbying. Company X contributes to a politician's election fund and they vote a certain way. In some countries that's  bribery, here it's lobbying. It's normal and we're OK with it. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496790107.0,
    "date_created": "2017-06-06",
    "time_created": "11:01:47",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijb8ym",
    "parent_id": "t1_dij5xg7",
    "subreddit_name_prefixed": "r/news",
    "body": "I lied to my friend saying I was too busy to go see a movie with them, but I really just wanted to stay home and relax alone. That was 10 years ago, and I still feel bad about it.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496793604.0,
    "date_created": "2017-06-06",
    "time_created": "12:00:04",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7z70",
    "parent_id": "t1_dij5xg7",
    "subreddit_name_prefixed": "r/news",
    "body": "When you focus on all the money you'll have and the lavish and luxurious life you'll be guaranteed, it is easy to forget about the plight of the average American or the consequences of your shitty and selfish decisions. Nothing helps get your mind off what a shit person you are like jet skis, beautiful vacations, and endless enjoyment of all that life can offer. At the station and position you'll be in, you will be above the consequences of all your decisions. Not your problem.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496790070.0,
    "date_created": "2017-06-06",
    "time_created": "11:01:10",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijy3zh",
    "parent_id": "t1_dijbh2c",
    "subreddit_name_prefixed": "r/news",
    "body": "My Congressmen always told us to send a fax, most interns have no idea what to do when one arrives so its more likey to reach his desk",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496818295.0,
    "date_created": "2017-06-06",
    "time_created": "18:51:35",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijgowt",
    "parent_id": "t1_dijg5f5",
    "subreddit_name_prefixed": "r/news",
    "body": "Here's the run down: The congressman will always be on the side of party lines (and lobbyist) unless there is overwhelming support from their constituents, even if the congressman doesn't agree with the issue themselves. \n\n\nExample: I worked for an extremely conservative congressman. He knew the government shut down was stupid and the GOP would not gain anything from it but Ted Cruz set the stage and convinced conservative constituents that it was a good move. So he voted along party lines.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1496799347.0,
    "date_created": "2017-06-06",
    "time_created": "13:35:47",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij4zvt",
    "parent_id": "t1_dij4vi4",
    "subreddit_name_prefixed": "r/news",
    "body": "Not primitive at all...\n\nSelfish and greedy? Absolutely, but not primitive.\n\nIt makes perfect financial sense for Netflix to support a law that will squash small competitors.",
    "controversiality": 0,
    "ups": 1353,
    "downs": 0,
    "score": 1353,
    "created": 1496786722.0,
    "date_created": "2017-06-06",
    "time_created": "10:05:22",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5h0c",
    "parent_id": "t1_dij4vi4",
    "subreddit_name_prefixed": "r/news",
    "body": "I think his message is well worded. If anyone tries to use Netflix as an example of NN losing large corporate support, this comment can serve as an example of how it hurts the small companies over the large. \n\nIt puts a company we all love and use and makes them look a dirty. It's a win-win for Netflix. ",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1496787272.0,
    "date_created": "2017-06-06",
    "time_created": "10:14:32",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij83pv",
    "parent_id": "t1_dij650w",
    "subreddit_name_prefixed": "r/news",
    "body": "Tbf they were cocky about changing product strategy. This is a little different",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1496790209.0,
    "date_created": "2017-06-06",
    "time_created": "11:03:29",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij4ze9",
    "parent_id": "t1_dij4vuw",
    "subreddit_name_prefixed": "r/news",
    "body": "I think it's because all that sweet Netflix money is getting pushed more into original content, and less on acquiring/keeping show rights and licenses. ",
    "controversiality": 0,
    "ups": 78,
    "downs": 0,
    "score": 78,
    "created": 1496786704.0,
    "date_created": "2017-06-06",
    "time_created": "10:05:04",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5kfb",
    "parent_id": "t1_dij4vuw",
    "subreddit_name_prefixed": "r/news",
    "body": "Idk. Netflix has never really had many A list movies.  IMO their Netflix movies and shows are a good payoff because instead of getting 100 B list movies I'm never going to watch I get something original that somehow manages to stay clear of containing that Hollywood polish which is kind of refreshing really.\n\nI enjoy a lot of the Netflix Originals. Also, I mainly use Netflix for documentaries/nature and stand-up comedies.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1496787379.0,
    "date_created": "2017-06-06",
    "time_created": "10:16:19",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij77g1",
    "parent_id": "t1_dij6lo7",
    "subreddit_name_prefixed": "r/news",
    "body": "How is the end of NN going to prevent p2p file transfer? ",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1496789212.0,
    "date_created": "2017-06-06",
    "time_created": "10:46:52",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6p1v",
    "parent_id": "t1_dij64f8",
    "subreddit_name_prefixed": "r/news",
    "body": "There's about a 100% chance that anyone in any customer service can't do anything about big picture stuff when looked at on an individual basis.\n\nIt's all about the influx. If enough reports are generated about the issue, it will be noticed.",
    "controversiality": 0,
    "ups": 82,
    "downs": 0,
    "score": 82,
    "created": 1496788649.0,
    "date_created": "2017-06-06",
    "time_created": "10:37:29",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6apr",
    "parent_id": "t1_dij64f8",
    "subreddit_name_prefixed": "r/news",
    "body": "Knowing customer support, all of these chats are saved and recorded. They look over what issues crop up the most so they can improve the service. If enough of a percentage of those chats are about this, the message will get through",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1496788198.0,
    "date_created": "2017-06-06",
    "time_created": "10:29:58",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijh20m",
    "parent_id": "t1_dijbypm",
    "subreddit_name_prefixed": "r/news",
    "body": "I would fucking love to see a DNS poisoning attack do this for one whole day. ",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1496799723.0,
    "date_created": "2017-06-06",
    "time_created": "13:42:03",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6ryj",
    "parent_id": "t1_dij5u7q",
    "subreddit_name_prefixed": "r/news",
    "body": "ISPs have already sold this boys hole",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1496788740.0,
    "date_created": "2017-06-06",
    "time_created": "10:39:00",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij9bqv",
    "parent_id": "t1_dij83fz",
    "subreddit_name_prefixed": "r/news",
    "body": "Yea I still <3 Amazon for it",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496791539.0,
    "date_created": "2017-06-06",
    "time_created": "11:25:39",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijcz8g",
    "parent_id": "t1_dij8nkc",
    "subreddit_name_prefixed": "r/news",
    "body": "My favorite part was his giant, puckered butthole dripping with cum at the end",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1496795457.0,
    "date_created": "2017-06-06",
    "time_created": "12:30:57",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijakef",
    "parent_id": "t1_dij97u0",
    "subreddit_name_prefixed": "r/news",
    "body": "Death... *by exile!*",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1496792874.0,
    "date_created": "2017-06-06",
    "time_created": "11:47:54",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dija5u2",
    "parent_id": "t1_dij4xvb",
    "subreddit_name_prefixed": "r/news",
    "body": "I just watched the episode last night where Zapp is attracted to Leela, who is disguised as a man so she can fight in the armed forces. I about died when he suggested they go back to his to listen to a book about life in Ancient Greece.\n\nThe look on his face when he realizes that he's really crushing on Leela is simultaneously one of the most beautiful and horrifying moments in all of television for me. He's relieved that his sexuality is heteronormally intact. As if really being attracted to a man would destroy him.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1496792438.0,
    "date_created": "2017-06-06",
    "time_created": "11:40:38",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij57p0",
    "parent_id": "t1_dij4uqt",
    "subreddit_name_prefixed": "r/news",
    "body": "oh yeah I forgot they take long enough to get rescued to get sick of it.  \n\nwhich *was* the implied idea from the onset",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1496786990.0,
    "date_created": "2017-06-06",
    "time_created": "10:09:50",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij92e9",
    "parent_id": "t1_dij7lee",
    "subreddit_name_prefixed": "r/news",
    "body": "Imagine if everyone just cancelled for one day on 12th. Obviously we don't say that but imagine their face when they see hundreds of thousands of customers cancelling their service on the same day. ",
    "controversiality": 0,
    "ups": 227,
    "downs": 0,
    "score": 227,
    "created": 1496791258.0,
    "date_created": "2017-06-06",
    "time_created": "11:20:58",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijalee",
    "parent_id": "t1_dij7lee",
    "subreddit_name_prefixed": "r/news",
    "body": "But you lose grandfathered pricing is the downside.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496792903.0,
    "date_created": "2017-06-06",
    "time_created": "11:48:23",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7ptt",
    "parent_id": "t1_dij7lee",
    "subreddit_name_prefixed": "r/news",
    "body": "Very fair point. I suppose I could spend a week rewatching Orphan Black & Spongebob.\n\nStill might spend a few hours complaining to cust service though. Sounds funny.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1496789781.0,
    "date_created": "2017-06-06",
    "time_created": "10:56:21",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij9zub",
    "parent_id": "t1_dij7lee",
    "subreddit_name_prefixed": "r/news",
    "body": "Plus then you get your free month for coming back, too",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496792260.0,
    "date_created": "2017-06-06",
    "time_created": "11:37:40",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijdwfp",
    "parent_id": "t1_dija63l",
    "subreddit_name_prefixed": "r/news",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1496796432.0,
    "date_created": "2017-06-06",
    "time_created": "12:47:12",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijasdf",
    "parent_id": "t1_dija63l",
    "subreddit_name_prefixed": "r/news",
    "body": "I do assume calls/conversations are recorded somehow, but I also assume there's a manual process of logging a complaint, and hopefully they are being followed.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1496793108.0,
    "date_created": "2017-06-06",
    "time_created": "11:51:48",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijbwce",
    "parent_id": "t1_dija63l",
    "subreddit_name_prefixed": "r/news",
    "body": "CSRs don't always have a way to track calls like that, but with enough people calling for a specific reason the calls definitely make their way up.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496794304.0,
    "date_created": "2017-06-06",
    "time_created": "12:11:44",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6z4p",
    "parent_id": "t1_dij6r31",
    "subreddit_name_prefixed": "r/news",
    "body": "You could also try going to https://www.battleforthenet.com/ there is more detail there the /july12 is just a page to tell you when and what action is taking place. There is more the the website than just one webpage.",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1496788958.0,
    "date_created": "2017-06-06",
    "time_created": "10:42:38",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijqk5d",
    "parent_id": "t1_dijj64c",
    "subreddit_name_prefixed": "r/news",
    "body": "/u/katie_pornhub\n\nYou guys getting in on this? ",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1496809635.0,
    "date_created": "2017-06-06",
    "time_created": "16:27:15",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijfm3u",
    "parent_id": "t1_dijb9ru",
    "subreddit_name_prefixed": "r/news",
    "body": "it could also be one epic PR stunt. Like everyone would talk about it...",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1496798228.0,
    "date_created": "2017-06-06",
    "time_created": "13:17:08",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij9guf",
    "parent_id": "t1_dij97vc",
    "subreddit_name_prefixed": "r/news",
    "body": "The people praising Trump at the time were actual terrorists, though. They had been plucked from the ranks of the IRA. Most of them had likely killed. \n\nIt was also well-known that Sinn Fein was funnelling money to the IRA. Trump would have known this at the time. The people who were praising Trump had all been banned from TV in the UK. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496791695.0,
    "date_created": "2017-06-06",
    "time_created": "11:28:15",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij8pm1",
    "parent_id": "t1_dij8j5n",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496790878.0,
    "date_created": "2017-06-06",
    "time_created": "11:14:38",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijfvvd",
    "parent_id": "t1_dij8j5n",
    "subreddit_name_prefixed": "r/news",
    "body": "Except when comcast throttles they're throttling us plebs, not directly throttling amazon.\n\nIf amazon does it they're going to break contracts with a business as large as comcast.\n\nComcast can piss and shit all over their contracts because they write them in such a way that doesn't give us consumers any rights or guarantees.  And a single comcast customer could never mount a suite against comcast and hope to do anything productive.\n\nIt is why we need things like the FCC and other regulatory agencies (run by democrats, or well... anyone who are NOT republicans) to protect us against things like throttling competitors.\n\nJust remember how things were under clinton, then think about how shitty things got during bush.... Then how things started to recover and get much better under obama, finally culminating in title 2 protections.  Now we're back to being under the thumb of the GOP/Corporations and look, things are shitty again and everyday is a fucking fight for our rights.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496798512.0,
    "date_created": "2017-06-06",
    "time_created": "13:21:52",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij8jlc",
    "parent_id": "t1_dij68vn",
    "subreddit_name_prefixed": "r/news",
    "body": "Not to mention how huge a difference it would be with fellow Americans being the opposition. Our military would be extremely conflicted about combating fellow citizens. ",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1496790694.0,
    "date_created": "2017-06-06",
    "time_created": "11:11:34",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6cv0",
    "parent_id": "t1_dij3mtv",
    "subreddit_name_prefixed": "r/news",
    "body": "I think the problem with this idea is that ALL of those people want that.\n\nI started working in Northern California like the deep north aka The Great State of Jefferson. The vast majority is middle class, white and republican. From what I saw and heard from people I'd say the Trump vote reasons where about 20:1\n\n20: Where the group of people who are already looked down on by the state and its non-Jeffersonian peoples, but when the election came around it was no long just \"look at those there hillbillies.\" but \"I bet you are voting for Trump you fucking racist! You'd never vote for Hillary cause shes a woman! namecalling namecalling namecalling\" . It is fucking appealing what democrats would shout at anyone who could even potentially vote for him let alone said they where. A lot of people where just terrified what Hillary could do and quite a few just decided \"Fuck you. You want to name call and be rude, the fuck off I will vote for him\" \n\n1: Was the actual back water \"White Power\" tattooed dbag who was excited because they heard of some liberal website that if Trump won people could execute anyone who wasn't white.\n\nLook at it this way, for us internet folks it would be like this. We have two candidates, one who has obvious problems but supports net neutrality and one who looks like a good fit for the job but has threatened to fight against net neutrality. I am voting for candidate 1. I'd rather have a few not good years but keep the right I hold dear then continue down the same path but lose that right.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1496788266.0,
    "date_created": "2017-06-06",
    "time_created": "10:31:06",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij49rn",
    "parent_id": "t1_dij3mtv",
    "subreddit_name_prefixed": "r/news",
    "body": "Eh, those types of people don't need to be manipulated, they just want to go fight someone but are too afraid to do it due to legal repercussions. \n\nAs much as people go \"ahhh civil wars a brewin!\" I don't see it happening. Ask the people who talk about it if it was legal would they kill their brother/sister/et al. because they support the opposite party. Would they go to their neighbors house that has an opposition party yard sign and kill the family that lives in that house?\n\nThere's plenty of dumb Trump supporters out there but a majority of them are people who are just afraid. They want to live a peaceful life and raise a family but they don't have the access/means/knowledge to get their information from multiple reliable sources, confirm with primary sources, etc. They just have time in the day to get a dose of Rupert Murdoch telling them that everyone is trying to murder their family. The internet is for trolling and lulz but take the time to ELI5 why Trump's actions are bad to your friends & family, they may listen to you and i'm not sure what other routes there are to take to change the course we're on.",
    "controversiality": 0,
    "ups": 48,
    "downs": 0,
    "score": 48,
    "created": 1496785805.0,
    "date_created": "2017-06-06",
    "time_created": "09:50:05",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij4tlz",
    "parent_id": "t1_dij46g8",
    "subreddit_name_prefixed": "r/news",
    "body": "Imagine how high taxes would be to fix all the roads... still... getting past the \" i have no idea what I'm doing, don't look at me!!!\" phase of things, I'd love to drive a tank.",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1496786502.0,
    "date_created": "2017-06-06",
    "time_created": "10:01:42",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij4o6m",
    "parent_id": "t1_dij46g8",
    "subreddit_name_prefixed": "r/news",
    "body": "I mean... I'd buy a tank if there was a store at the mall. Who wouldn't?",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1496786311.0,
    "date_created": "2017-06-06",
    "time_created": "09:58:31",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij4gu0",
    "parent_id": "t1_dij46g8",
    "subreddit_name_prefixed": "r/news",
    "body": "Woohoo abrams!",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496786052.0,
    "date_created": "2017-06-06",
    "time_created": "09:54:12",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijcnrz",
    "parent_id": "t1_dij6ifw",
    "subreddit_name_prefixed": "r/news",
    "body": "Nah. He was a top lawyer at Verizon before he became the head of the FCC. After hes done tearing the internet a new asshole he'll just go to one of the big ISPs and get a nice cushy job. Not a bribe, just a revolving door.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496795116.0,
    "date_created": "2017-06-06",
    "time_created": "12:25:16",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijigz9",
    "parent_id": "t1_dijgowt",
    "subreddit_name_prefixed": "r/news",
    "body": "So it's volume not quality that counts when writing your congressman?",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1496801184.0,
    "date_created": "2017-06-06",
    "time_created": "14:06:24",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5bul",
    "parent_id": "t1_dij4zvt",
    "subreddit_name_prefixed": "r/news",
    "body": "Its not all good though. It's bad for brand equity and customer loyalty. They just went down a few pegs for me. Unfortunately there's a lot of breathing room between Comcast and Netflix.",
    "controversiality": 0,
    "ups": 726,
    "downs": 0,
    "score": 726,
    "created": 1496787117.0,
    "date_created": "2017-06-06",
    "time_created": "10:11:57",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij58h2",
    "parent_id": "t1_dij4zvt",
    "subreddit_name_prefixed": "r/news",
    "body": "While it makes sense on some level....it's also the dumbest thing they could do. Unless Netflix plans on creating their own Internet then what stops the different Isps from cutting back on Netflix? I mean who owns the satellite and cable companies that Netflix has almost single handedly destroyed? So Who has a invested interest in Netflix's customers not being happy with service to maybe gain back viewers. Or more ironically who has an invested interest to create their own Netflix like streaming service that gets \"the fast lines\". It's very obvious these companies don't care about anything but making that extra dollar so it just doesn't seem to smart to trust that they wouldn't do it to them (Netflix).",
    "controversiality": 0,
    "ups": 62,
    "downs": 0,
    "score": 62,
    "created": 1496787014.0,
    "date_created": "2017-06-06",
    "time_created": "10:10:14",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5e7f",
    "parent_id": "t1_dij4zvt",
    "subreddit_name_prefixed": "r/news",
    "body": "So instead of establishing a stronger presence on the exclusive production niche (which is something they are absolutely smashing and should keep on, as it's the exclusives the main attractant for more subscribers), they'd rather support a something that hurts the evolution of digital media in order to squash a small time competitor that couldn't take much of their slice anyways because it's not easy to have your own Originals.\n\nThis is why I am calling it primitive. Instead of moving on to bigger better things small competitors cant even touch they'd rather take a minor hit at their reputation and their wallets if it hurts the small guy even more.\n\n",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1496787189.0,
    "date_created": "2017-06-06",
    "time_created": "10:13:09",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij9vq3",
    "parent_id": "t1_dij83pv",
    "subreddit_name_prefixed": "r/news",
    "body": "Netflix has been quietly dropping many of their titles from other companies and been replacing them with comedy specials. They've been ramping up more \"Netflix original\" titles as well.  \n  \nAs these other companies start their own streaming services as well we're gonna see Netflix subscriber rates start to drop.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1496792137.0,
    "date_created": "2017-06-06",
    "time_created": "11:35:37",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5wg4",
    "parent_id": "t1_dij4ze9",
    "subreddit_name_prefixed": "r/news",
    "body": "Don't forget content owners jacking up rates on them. At some point it's cheaper to make their own content, and that's exactly what they are doing.",
    "controversiality": 0,
    "ups": 61,
    "downs": 0,
    "score": 61,
    "created": 1496787756.0,
    "date_created": "2017-06-06",
    "time_created": "10:22:36",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijb0go",
    "parent_id": "t1_dij4ze9",
    "subreddit_name_prefixed": "r/news",
    "body": "Their own content has been amazing",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496793348.0,
    "date_created": "2017-06-06",
    "time_created": "11:55:48",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7g01",
    "parent_id": "t1_dij77g1",
    "subreddit_name_prefixed": "r/news",
    "body": "2gb traffic cap except for all the big content providers (which will pay the isp and their traffic will not count towards the data cap) ",
    "controversiality": 0,
    "ups": 99,
    "downs": 0,
    "score": 99,
    "created": 1496789480.0,
    "date_created": "2017-06-06",
    "time_created": "10:51:20",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijdkf7",
    "parent_id": "t1_dij77g1",
    "subreddit_name_prefixed": "r/news",
    "body": "\"You are attempting to reach an IP address outside your provider network. \n\nPlease go to comcast.com/payMoreYouRetard to add more IP addresses to your approved list.\"",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496796085.0,
    "date_created": "2017-06-06",
    "time_created": "12:41:25",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij9oze",
    "parent_id": "t1_dij6p1v",
    "subreddit_name_prefixed": "r/news",
    "body": "Exactly. If Netflix customer support crashes they will want to know why 1m users decided to try and live chat at the same time. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1496791938.0,
    "date_created": "2017-06-06",
    "time_created": "11:32:18",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7ezo",
    "parent_id": "t1_dij6apr",
    "subreddit_name_prefixed": "r/news",
    "body": "Working in customer support:\n\nChats are almost certainly saved and recorded.\n\nManagement *might* look over what issues crop up the most so they can improve the service. **Maybe**. \n\nThere's dozens of issues hundreds of clients have brought up countless times on the services I represent that have never gotten touched at all (even when customer support has gone through the effort of pointing out how common the problem is).\n\nIf you have an option to leave a \"reason I'm quitting the service\" message when canceling, that's a lot more likely to get through.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496789446.0,
    "date_created": "2017-06-06",
    "time_created": "10:50:46",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijwq8q",
    "parent_id": "t1_dijh20m",
    "subreddit_name_prefixed": "r/news",
    "body": "Imagine a week, there would be riots in the streets after three days of no Facebook.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496816604.0,
    "date_created": "2017-06-06",
    "time_created": "18:23:24",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijk7u5",
    "parent_id": "t1_dij92e9",
    "subreddit_name_prefixed": "r/news",
    "body": "_\"I felt a great disturbance in the Force, as if millions of voices suddenly cried out in terror and were suddenly silenced. I fear something terrible has happened.\"_",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1496803031.0,
    "date_created": "2017-06-06",
    "time_created": "14:37:11",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijc8ca",
    "parent_id": "t1_dij92e9",
    "subreddit_name_prefixed": "r/news",
    "body": "Don't even have to cancel necessarily just avoid using it that day. Imagine their streaming traffic suddenly taking a nosedive for 24 hours. I think they'd get the message. ",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1496794664.0,
    "date_created": "2017-06-06",
    "time_created": "12:17:44",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijix5k",
    "parent_id": "t1_dijdwfp",
    "subreddit_name_prefixed": "r/news",
    "body": "I've never worked for CS anywhere soo I had no clue how they work on the inside ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1496801669.0,
    "date_created": "2017-06-06",
    "time_created": "14:14:29",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijlixi",
    "parent_id": "t1_dijasdf",
    "subreddit_name_prefixed": "r/news",
    "body": "Have worked for a call center and calls were routinely monitored and recorded. There was an entire Quality department. However calls that were focused on complaints or \"suggestions\" were generally throw aways and the service rep would only pass that stuff \"up-the-line\" if they wanted to and knew how. The next level was certainly not the decision makers lol.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496804377.0,
    "date_created": "2017-06-06",
    "time_created": "14:59:37",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7x4q",
    "parent_id": "t1_dij6z4p",
    "subreddit_name_prefixed": "r/news",
    "body": "Still not seeing what's actually planning to happen on the 12th.",
    "controversiality": 0,
    "ups": 57,
    "downs": 0,
    "score": 57,
    "created": 1496790005.0,
    "date_created": "2017-06-06",
    "time_created": "11:00:05",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7s3n",
    "parent_id": "t1_dij6z4p",
    "subreddit_name_prefixed": "r/news",
    "body": "I checked there it pretty much says \"stay tuned\"",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1496789851.0,
    "date_created": "2017-06-06",
    "time_created": "10:57:31",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijchgt",
    "parent_id": "t1_dij8jlc",
    "subreddit_name_prefixed": "r/news",
    "body": "I doubt they would be very conflicted. No one likes politicians. Soldiers don't want to pay a premium for their porn either. ",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1496794933.0,
    "date_created": "2017-06-06",
    "time_created": "12:22:13",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij4pub",
    "parent_id": "t1_dij49rn",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1496786368.0,
    "date_created": "2017-06-06",
    "time_created": "09:59:28",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5htu",
    "parent_id": "t1_dij4tlz",
    "subreddit_name_prefixed": "r/news",
    "body": "That awful gas mileage though. =/ Not the best commuter.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496787296.0,
    "date_created": "2017-06-06",
    "time_created": "10:14:56",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6t2z",
    "parent_id": "t1_dij4tlz",
    "subreddit_name_prefixed": "r/news",
    "body": "Why would you drive on roads if you have a tank? Just pick a straight line to your destination and crush everything in your way. :D ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496788774.0,
    "date_created": "2017-06-06",
    "time_created": "10:39:34",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5p9f",
    "parent_id": "t1_dij4o6m",
    "subreddit_name_prefixed": "r/news",
    "body": "People who don't have $6.2 million to drop on a tank they might never have to use.",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1496787530.0,
    "date_created": "2017-06-06",
    "time_created": "10:18:50",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijl3rk",
    "parent_id": "t1_dijigz9",
    "subreddit_name_prefixed": "r/news",
    "body": "Almost like we live in a democracy.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496803945.0,
    "date_created": "2017-06-06",
    "time_created": "14:52:25",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5sg7",
    "parent_id": "t1_dij5bul",
    "subreddit_name_prefixed": "r/news",
    "body": "I decided with this comment that I'm not renewing my Netflix subscription, which in the long run isn't a big deal for them. But I'm not supporting greedy companies that are highly unethical like Netflix apparently is now.\n\nEdit: the comment was interpreted out of context. They still support NN, but they choose to no longer be active supporters.  Do with this info what you will, I'm still cancelling because they have the money to be a big influence and they are choosing not to for short term monetary gain.",
    "controversiality": 0,
    "ups": 609,
    "downs": 0,
    "score": 609,
    "created": 1496787628.0,
    "date_created": "2017-06-06",
    "time_created": "10:20:28",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij62k3",
    "parent_id": "t1_dij5bul",
    "subreddit_name_prefixed": "r/news",
    "body": "I gave up netflix a year ago, don't watch tv and am still alive. Amazon prime has a decent selection and then there's Redbox and even the local library.",
    "controversiality": 0,
    "ups": 74,
    "downs": 0,
    "score": 74,
    "created": 1496787947.0,
    "date_created": "2017-06-06",
    "time_created": "10:25:47",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5gnj",
    "parent_id": "t1_dij58h2",
    "subreddit_name_prefixed": "r/news",
    "body": "Netflix has shown it's willing to pay extra money to appease the gateholders that control access to customers. ",
    "controversiality": 0,
    "ups": 37,
    "downs": 0,
    "score": 37,
    "created": 1496787261.0,
    "date_created": "2017-06-06",
    "time_created": "10:14:21",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5jwl",
    "parent_id": "t1_dij58h2",
    "subreddit_name_prefixed": "r/news",
    "body": "I don't want to be \"that guy\" but my kids make use of the Netflix client that is inbuilt to the Comcast cable box, and Netflix results are included in the Xfinity search results.",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1496787362.0,
    "date_created": "2017-06-06",
    "time_created": "10:16:02",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5g2g",
    "parent_id": "t1_dij58h2",
    "subreddit_name_prefixed": "r/news",
    "body": "> Unless Netflix plans on creating their own Internet then what stops the different Isps from cutting back on Netflix?\n\nThe fact that their customers would split if they couldn't watch Netflix.\n\nNetflix is big enough to withstand the attacks from ISPs.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496787244.0,
    "date_created": "2017-06-06",
    "time_created": "10:14:04",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dija7cc",
    "parent_id": "t1_dij9vq3",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah, the days of them having a ton of others peoples content is over. Networks know how valuable streaming is. Netflix is basically going to become like a HBO, but with more content. I like how they both make originals and buy content to be \"originals\"",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496792484.0,
    "date_created": "2017-06-06",
    "time_created": "11:41:24",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij68qi",
    "parent_id": "t1_dij5wg4",
    "subreddit_name_prefixed": "r/news",
    "body": "They also cycle through things, they've never kept up the same stuff forever.  ",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1496788139.0,
    "date_created": "2017-06-06",
    "time_created": "10:28:59",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijh37i",
    "parent_id": "t1_dijb0go",
    "subreddit_name_prefixed": "r/news",
    "body": "Sometimes you get Stranger Things, sometimes you get Bill Nye. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496799758.0,
    "date_created": "2017-06-06",
    "time_created": "13:42:38",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7ozw",
    "parent_id": "t1_dij7g01",
    "subreddit_name_prefixed": "r/news",
    "body": "Oh right, I forgot about data caps, we don't have them where I'm from.",
    "controversiality": 0,
    "ups": 47,
    "downs": 0,
    "score": 47,
    "created": 1496789756.0,
    "date_created": "2017-06-06",
    "time_created": "10:55:56",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijgh2g",
    "parent_id": "t1_dijc8ca",
    "subreddit_name_prefixed": "r/news",
    "body": "That just means their costs took a nosedive for the day. Free money.",
    "controversiality": 0,
    "ups": 53,
    "downs": 0,
    "score": 53,
    "created": 1496799123.0,
    "date_created": "2017-06-06",
    "time_created": "13:32:03",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijgjei",
    "parent_id": "t1_dij7x4q",
    "subreddit_name_prefixed": "r/news",
    "body": "We're going to be doing amazing things. *Incredible* things. I don't have all the details, but I have the best people working on right now. Absolute experts on these things, believe me. ",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1496799191.0,
    "date_created": "2017-06-06",
    "time_created": "13:33:11",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijahq7",
    "parent_id": "t1_dij7x4q",
    "subreddit_name_prefixed": "r/news",
    "body": "The goal is to drive people to comment on fcc and Congress sites to show support.  Reddit.com is participating, as are most default subreddits. ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1496792794.0,
    "date_created": "2017-06-06",
    "time_created": "11:46:34",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijcuzx",
    "parent_id": "t1_dij4pub",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah, nobody thinks they'll be in the mob taking a machete to their neighbor's family, until they are.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496795330.0,
    "date_created": "2017-06-06",
    "time_created": "12:28:50",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7dpb",
    "parent_id": "t1_dij6t2z",
    "subreddit_name_prefixed": "r/news",
    "body": "Siri: \"Make a left turn in 100 yards\"\n\nCerinDeVane-with-Kung-Fu-Tank-Driving-Grip: \"You're not my supervisor!\"  \n\n-*drives straight ahead*-",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496789408.0,
    "date_created": "2017-06-06",
    "time_created": "10:50:08",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij64om",
    "parent_id": "t1_dij5p9f",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah, at least a gun you can go shoot for fun. Can't exactly shoot an Abrams for fun. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1496788013.0,
    "date_created": "2017-06-06",
    "time_created": "10:26:53",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6mub",
    "parent_id": "t1_dij5p9f",
    "subreddit_name_prefixed": "r/news",
    "body": "You can actually buy used tanks for much cheaper than that. I've seen them go as low as $50,000",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496788580.0,
    "date_created": "2017-06-06",
    "time_created": "10:36:20",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7o41",
    "parent_id": "t1_dij5sg7",
    "subreddit_name_prefixed": "r/news",
    "body": "Amazon Prime stands to benefit just as much from ISP pay for play. It really does make Netflix look bad. Glad there are other options. ",
    "controversiality": 0,
    "ups": 384,
    "downs": 0,
    "score": 384,
    "created": 1496789727.0,
    "date_created": "2017-06-06",
    "time_created": "10:55:27",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij9fvy",
    "parent_id": "t1_dij5sg7",
    "subreddit_name_prefixed": "r/news",
    "body": "Maybe someone should start a Reddit/Netflix protest. Get a few 10 thousand people on board, have everyone cancel their subscription at the same time, and let that go on for a month or two. Maybe Hastings will march to a different beat once he realizes he is obsolete. \n\nEDIT: Wow... I did not expect that to pick up as it did. I'd definitely be down with doing this, but I have no idea where to start. Just create a subreddit for this specific purpose to coordinate things? Anyone who has organized events before can step right up and hold my hand.\n\nEDIT 2: Alright everyone, if we are doing this we need to coordinate a day and I vote for coordinating it with their protest, so July 12th. Everyone can obviously do it when they want to, just the 12th seems like the most logical day. Also, to those against it saying that Netflix isn't against NN, rather they just don't want to deal with it, here's the deal. When someone or something has that much wealth and power, so much so that they could make a significant difference in people's lives, they have an obligation, no, a responsibility, to do so. There is no place for a company that large to simply say that they don't want anything to do with it just because they think they've paid their dues. \n\nSpread the word. July 12th. NET Independence Day.",
    "controversiality": 0,
    "ups": 1030,
    "downs": 0,
    "score": 1030,
    "created": 1496791665.0,
    "date_created": "2017-06-06",
    "time_created": "11:27:45",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij8h10",
    "parent_id": "t1_dij5sg7",
    "subreddit_name_prefixed": "r/news",
    "body": "Their new rating system indicated to me theyve turned a new leaf. No longer concerned with transparency, and inclined to peddle every bit of garbage content onto their subscribers. 98% match Bill Nye, 98% suck. ",
    "controversiality": 0,
    "ups": 67,
    "downs": 0,
    "score": 67,
    "created": 1496790616.0,
    "date_created": "2017-06-06",
    "time_created": "11:10:16",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6nvr",
    "parent_id": "t1_dij5sg7",
    "subreddit_name_prefixed": "r/news",
    "body": "Once Amazon Prime comes to Apple TV, I'm probably going to do the same. (I have it on my Roku, but I just like using my Apple TV more). I'm finding less and less to watch on Netflix over time and things like this are kind of like the nail in the coffin for me. ",
    "controversiality": 0,
    "ups": 198,
    "downs": 0,
    "score": 198,
    "created": 1496788612.0,
    "date_created": "2017-06-06",
    "time_created": "10:36:52",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij78ap",
    "parent_id": "t1_dij5sg7",
    "subreddit_name_prefixed": "r/news",
    "body": "Plenty of free technicaly legal streaming websites with the same shows anyway",
    "controversiality": 0,
    "ups": 89,
    "downs": 0,
    "score": 89,
    "created": 1496789239.0,
    "date_created": "2017-06-06",
    "time_created": "10:47:19",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij78qo",
    "parent_id": "t1_dij5sg7",
    "subreddit_name_prefixed": "r/news",
    "body": "Fuck all those greedy ass companies. I subscribe to piratebay. They have everything and it's cheaper too. ",
    "controversiality": 0,
    "ups": 168,
    "downs": 0,
    "score": 168,
    "created": 1496789252.0,
    "date_created": "2017-06-06",
    "time_created": "10:47:32",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij824u",
    "parent_id": "t1_dij5sg7",
    "subreddit_name_prefixed": "r/news",
    "body": "No idea about the US, but in Australia Netflix has some actual competition. For years we had no serious streaming services. Suddenly Netflix shows up and we get about 5 different services. Now Amazon is also apparently launching soon. It's going to be interesting... \n\nHonestly though, Netflix Australia is kind of meh. The local options seem to have some far better things.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496790161.0,
    "date_created": "2017-06-06",
    "time_created": "11:02:41",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijccwv",
    "parent_id": "t1_dij5sg7",
    "subreddit_name_prefixed": "r/news",
    "body": "I'll cancel Netflix too\n#SupportNNCancelNetflix",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496794799.0,
    "date_created": "2017-06-06",
    "time_created": "12:19:59",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijbl8e",
    "parent_id": "t1_dij5sg7",
    "subreddit_name_prefixed": "r/news",
    "body": "I'll quit them as well. I'm fine doing without. Anyone on board with this is dead to me. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496793972.0,
    "date_created": "2017-06-06",
    "time_created": "12:06:12",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7q9b",
    "parent_id": "t1_dij62k3",
    "subreddit_name_prefixed": "r/news",
    "body": "The library is an underrated resource for TV, movies, and games.",
    "controversiality": 0,
    "ups": 130,
    "downs": 0,
    "score": 130,
    "created": 1496789794.0,
    "date_created": "2017-06-06",
    "time_created": "10:56:34",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij8e6e",
    "parent_id": "t1_dij62k3",
    "subreddit_name_prefixed": "r/news",
    "body": "Amazon has Unsolved Mysteries.  They win.  Netflix has been getting progressively worse as they keep losing tv shows I like.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496790530.0,
    "date_created": "2017-06-06",
    "time_created": "11:08:50",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6wxg",
    "parent_id": "t1_dij5gnj",
    "subreddit_name_prefixed": "r/news",
    "body": "Well most companies try to eliminate the middle man.  If I remember right Netflix was created by a postal worker and that's why in the early days they used the usps so heavily until they decided they wanted to work on eliminating the middle man so I find it cute they are willing to get into a situation of trust with companies that have a invested interest in them not being the best.\n\n\nBut I could be wrong maybe the isp's will all set low data caps of 250 gb or something and then they will push Netflix to have 4K streaming so the providers can make back their money everyone month we go over. \n\n\nI don't trust big businesses to ever do right by the little guy.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1496788892.0,
    "date_created": "2017-06-06",
    "time_created": "10:41:32",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6zvv",
    "parent_id": "t1_dij5jwl",
    "subreddit_name_prefixed": "r/news",
    "body": "Yeah everything has a Netflix app? Netflix has done a great job making sure they are everywhere. That's what's so ironic about them being okay with risking control.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496788981.0,
    "date_created": "2017-06-06",
    "time_created": "10:43:01",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij5v9g",
    "parent_id": "t1_dij5g2g",
    "subreddit_name_prefixed": "r/news",
    "body": "Except they were paying out $$ to stop isps from throttling users. Customers are often ignorant of tech and all they know is Hulu and YouTube works, Netflix is slow so Netflix is the problem.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1496787719.0,
    "date_created": "2017-06-06",
    "time_created": "10:21:59",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij6hkt",
    "parent_id": "t1_dij5g2g",
    "subreddit_name_prefixed": "r/news",
    "body": "That is very optimistic.  Many people would go but what if say Comcast or mediacom decided well Hulu payed us more for the next 5 years so sorry Netflix users or what if they just bought a competitor to help make them bigger and the main focus of their platform. Netflix is big and can withstand a lot but it's a stupid gamble for them to let power and control be taken that far away from them without a fight.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496788413.0,
    "date_created": "2017-06-06",
    "time_created": "10:33:33",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij86fo",
    "parent_id": "t1_dij7ozw",
    "subreddit_name_prefixed": "r/news",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 59,
    "downs": 0,
    "score": 59,
    "created": 1496790293.0,
    "date_created": "2017-06-06",
    "time_created": "11:04:53",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijommz",
    "parent_id": "t1_dijgh2g",
    "subreddit_name_prefixed": "r/news",
    "body": "The thing is most people don't really want to punish Netflix...*yet*. Right now they just want to send a message. Sort of \" this is how many people care, screw up again and we'll take our business elsewhere\".",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1496807591.0,
    "date_created": "2017-06-06",
    "time_created": "15:53:11",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijbbue",
    "parent_id": "t1_dijahq7",
    "subreddit_name_prefixed": "r/news",
    "body": "No, that isn't the goal of the 12th, they clearly have something else planned.  When you submit yourself to join, it gives you a message \"Thanks! We'll be in touch. For now, can you help spread the word?\" which gives you twitter and Facebook links to share information on how to get involved.  They obviously want more comments on the FCC site, but there's also obviously something different planned for the 12th which I can find no actual specific information.  \n\nI'm all for helping this cause, but I would like to know more about what I'm getting into.  If they keep it vague, you're likely to lose some potential protesters because they'd like to know what they're signing up for.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1496793692.0,
    "date_created": "2017-06-06",
    "time_created": "12:01:32",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij65wc",
    "parent_id": "t1_dij64om",
    "subreddit_name_prefixed": "r/news",
    "body": "Well you *can.* It's just expensive and difficult to meet the conditions to fire it.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1496788052.0,
    "date_created": "2017-06-06",
    "time_created": "10:27:32",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijdlq6",
    "parent_id": "t1_dij7o41",
    "subreddit_name_prefixed": "r/news",
    "body": "Amazon stands to benefit from the removal of net neutrality period.\n\nThey have AWS, prime, shopping, partnerships, all sorts of things, and are a massive company.\n\nThem standing up for NN may only be to bolster their reputation, but that's ok by me.  As they would be one of the largest benefactors of a non-neutral net.",
    "controversiality": 0,
    "ups": 189,
    "downs": 0,
    "score": 189,
    "created": 1496796123.0,
    "date_created": "2017-06-06",
    "time_created": "12:42:03",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij913a",
    "parent_id": "t1_dij7o41",
    "subreddit_name_prefixed": "r/news",
    "body": "Technically, but Amazon is so popular for more reasons than just streaming. They can afford to take that stand. Netflix only has one business model - it has to \"protect\" it. Amazon could stop streaming and still be successful, albeit not as successful. ",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1496791221.0,
    "date_created": "2017-06-06",
    "time_created": "11:20:21",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijgr9o",
    "parent_id": "t1_dij7o41",
    "subreddit_name_prefixed": "r/news",
    "body": "Which is EXACTLY why we need net neutrality to remain in place. Without it, competition will suffer, creating more monopolies.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496799413.0,
    "date_created": "2017-06-06",
    "time_created": "13:36:53",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijfwdo",
    "parent_id": "t1_dij9fvy",
    "subreddit_name_prefixed": "r/news",
    "body": "We could call it \"the battle of hastings.\"",
    "controversiality": 0,
    "ups": 84,
    "downs": 0,
    "score": 84,
    "created": 1496798527.0,
    "date_created": "2017-06-06",
    "time_created": "13:22:07",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dije6cm",
    "parent_id": "t1_dij9fvy",
    "subreddit_name_prefixed": "r/news",
    "body": "I want to upvote this a thousand times over. This is exactly what could be done to show that there are people who give a damn about these things and we can make it affect the people at the top. We just need to work together ...",
    "controversiality": 0,
    "ups": 171,
    "downs": 0,
    "score": 171,
    "created": 1496796716.0,
    "date_created": "2017-06-06",
    "time_created": "12:51:56",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijewue",
    "parent_id": "t1_dij9fvy",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm down. I've got video games and books. Don't need Netflix.",
    "controversiality": 0,
    "ups": 144,
    "downs": 0,
    "score": 144,
    "created": 1496797487.0,
    "date_created": "2017-06-06",
    "time_created": "13:04:47",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijf7re",
    "parent_id": "t1_dij9fvy",
    "subreddit_name_prefixed": "r/news",
    "body": "I can get behind this. I've already dropped cable for being shit. ",
    "controversiality": 0,
    "ups": 65,
    "downs": 0,
    "score": 65,
    "created": 1496797809.0,
    "date_created": "2017-06-06",
    "time_created": "13:10:09",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijfvsq",
    "parent_id": "t1_dij9fvy",
    "subreddit_name_prefixed": "r/news",
    "body": "Shit, I almost wish I had a Netflix subscription now just so I could cancel it.",
    "controversiality": 0,
    "ups": 60,
    "downs": 0,
    "score": 60,
    "created": 1496798510.0,
    "date_created": "2017-06-06",
    "time_created": "13:21:50",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijeqxa",
    "parent_id": "t1_dij9fvy",
    "subreddit_name_prefixed": "r/news",
    "body": "I would participate you should too.",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1496797310.0,
    "date_created": "2017-06-06",
    "time_created": "13:01:50",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijrxzy",
    "parent_id": "t1_dij9fvy",
    "subreddit_name_prefixed": "r/news",
    "body": "What works so well with this thought is that Netflix isn't like your ISP.  It is basically a month to month thing in terms of payment.  If you just cancel it won't cost you anything extra and you can sign right back up again without a problem.  You will just have about 10 extra bucks that month/months.  \n\nThe timing couldn't be better.  It is summer time.  I feel like people will be more willing to do something like this because it will be nice out and there are out door things to do!  \n\nEveryone can take that 10 bucks and do a small little grill out for the 12th of July.  \n\nGrilling for NN!  \n\n",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496811114.0,
    "date_created": "2017-06-06",
    "time_created": "16:51:54",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijgfth",
    "parent_id": "t1_dij9fvy",
    "subreddit_name_prefixed": "r/news",
    "body": "That's it, I'm on board. Time to stand up against these fucking greedy mothe--\n\n*realise I actually use my roommate's account and have never paid Netflix in my life*\n\n¯\\_(ツ)_/¯ \n\n*resumes Downton Abbey*",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1496799086.0,
    "date_created": "2017-06-06",
    "time_created": "13:31:26",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijmtbu",
    "parent_id": "t1_dij9fvy",
    "subreddit_name_prefixed": "r/news",
    "body": "I tried on /r/technology last week and everyone basically said, \"fuck you, I'm not canceling Netflix, what will I watchhhhh?\"\n\nIf someone is able to organize something, that would be great, though! I canceled my subscription as soon as I heard about Hastings's comments which amounted to, \"We got ours, fuck everyone else.\"",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496805702.0,
    "date_created": "2017-06-06",
    "time_created": "15:21:42",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijgl6e",
    "parent_id": "t1_dij9fvy",
    "subreddit_name_prefixed": "r/news",
    "body": "Sounds good to me. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496799243.0,
    "date_created": "2017-06-06",
    "time_created": "13:34:03",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijle5x",
    "parent_id": "t1_dij9fvy",
    "subreddit_name_prefixed": "r/news",
    "body": "All companies are great when they are small. Why is it that as soon as they are big they lose their idealistic culture with as much care as I would about losing a pair of drugstore sunglasses.\n\nI'm down for this protest. I could use a Netflix binge detox anyways. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496804241.0,
    "date_created": "2017-06-06",
    "time_created": "14:57:21",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijg0qs",
    "parent_id": "t1_dij9fvy",
    "subreddit_name_prefixed": "r/news",
    "body": "Based off of people not reading, They said they will not lead the fight anymore but they are still actively against it. They just realize the current administration is corrupt.\n\n> Hastings stressed the company is still active as FCC Chairman Ajit Pai looks to repeal current net neutrality rules, which subject internet providers to utility-like regulation in order to protect the open web. They’ve done so through one of their main lobbying groups, the Internet Association. “I think Trump’s FCC is going to unwind the rules no matter what anybody says,” Hastings said.\n> \n> Otherwise, the Netflix chief said the burden is on the rest of the startup community to fight this latest round at the FCC.\n> \n> “We had to carry the water when we were growing up and we were small,” Hastings said, “and now other companies need to be on that leading edge.\"",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496798653.0,
    "date_created": "2017-06-06",
    "time_created": "13:24:13",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijhoqw",
    "parent_id": "t1_dij9fvy",
    "subreddit_name_prefixed": "r/news",
    "body": "When do we pull the trigger? Should it corresponding to the protest? The 12th?",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496800372.0,
    "date_created": "2017-06-06",
    "time_created": "13:52:52",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "diji1rt",
    "parent_id": "t1_dij9fvy",
    "subreddit_name_prefixed": "r/news",
    "body": "Well, give me the when and I'll cancel my subscription. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496800742.0,
    "date_created": "2017-06-06",
    "time_created": "13:59:02",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijihco",
    "parent_id": "t1_dij9fvy",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm on board. Let's do it. Get it to the front page so everyone knows about it. Share your cancellation notices on the 12th! ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496801196.0,
    "date_created": "2017-06-06",
    "time_created": "14:06:36",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijipby",
    "parent_id": "t1_dij9fvy",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm down... ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496801436.0,
    "date_created": "2017-06-06",
    "time_created": "14:10:36",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijjanc",
    "parent_id": "t1_dij9fvy",
    "subreddit_name_prefixed": "r/news",
    "body": "I still watch a few things on Netflix, but I would totally be on board for this. I used to really trust and respect them, what they said is just disgusting.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496802066.0,
    "date_created": "2017-06-06",
    "time_created": "14:21:06",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijrtkk",
    "parent_id": "t1_dij9fvy",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm down with this too (I'm geo locked on new content in any case) . When do I cancel? ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496810984.0,
    "date_created": "2017-06-06",
    "time_created": "16:49:44",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijt3xx",
    "parent_id": "t1_dij9fvy",
    "subreddit_name_prefixed": "r/news",
    "body": "Great idea. I would be willing to cancel my Netflix subscription for this July 12th is the day I will cancel.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1496812401.0,
    "date_created": "2017-06-06",
    "time_created": "17:13:21",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijrtrt",
    "parent_id": "t1_dij8h10",
    "subreddit_name_prefixed": "r/news",
    "body": "Seriously, the new rating system is horrible. And Forbes as long as streaming has existed, their recommendations for me have made no sense. \"We think you would rate this one star, so we're recommending it to you\"",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496810990.0,
    "date_created": "2017-06-06",
    "time_created": "16:49:50",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij80e7",
    "parent_id": "t1_dij6nvr",
    "subreddit_name_prefixed": "r/news",
    "body": ">  I'm finding less and less to watch on Netflix over time and things like this are kind of like the nail in the coffin for me. \n\nI got rid of mine back in January and don't miss it. For the last few weeks on there I was spending more time browsing, trying to find something to watch, than I was spending actually watching a show.",
    "controversiality": 0,
    "ups": 164,
    "downs": 0,
    "score": 164,
    "created": 1496790107.0,
    "date_created": "2017-06-06",
    "time_created": "11:01:47",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7vug",
    "parent_id": "t1_dij6nvr",
    "subreddit_name_prefixed": "r/news",
    "body": "Amazon Prime pretty much is already on Apple TV.. just air play it from you phone.",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1496789966.0,
    "date_created": "2017-06-06",
    "time_created": "10:59:26",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijfsv4",
    "parent_id": "t1_dij78ap",
    "subreddit_name_prefixed": "r/news",
    "body": "Can you expand on what you're implying or not implying with \"free technically legal\"? \n\nI've got a Raspberry Pi setup with kodi and have started playing with some of the base plugins that are available from within kodi and am left scratching my head wondering if some of those offerings are legal and how they do it. \n\n",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1496798426.0,
    "date_created": "2017-06-06",
    "time_created": "13:20:26",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijcwk6",
    "parent_id": "t1_dij78ap",
    "subreddit_name_prefixed": "r/news",
    "body": "Including the originals like Jessica Jones and Orange is the New Black?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496795376.0,
    "date_created": "2017-06-06",
    "time_created": "12:29:36",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij8h1t",
    "parent_id": "t1_dij78qo",
    "subreddit_name_prefixed": "r/news",
    "body": "People go on about how pirating is essentially stealing and all, but there is no fucking way I'm going to spend my money and support companies that fuck customers over for their own benefit. \n\n\nEdit: If I like the show that I am watching I will find ways to support them directly. (Merchandise, Disks). If I like how a company operates I will put out my money to support the company through subscriptions (Prime). If neither of the above are applicable I will pirate. Say what you want but there is no way I'm supporting a service like Netflix that is only interested in its own profits over it's customers.",
    "controversiality": 0,
    "ups": 172,
    "downs": 0,
    "score": 172,
    "created": 1496790617.0,
    "date_created": "2017-06-06",
    "time_created": "11:10:17",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dije7q7",
    "parent_id": "t1_dijccwv",
    "subreddit_name_prefixed": "r/news",
    "body": "Just cancelled my Netdicks subscription.\n\nEdit: leaving it.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1496796754.0,
    "date_created": "2017-06-06",
    "time_created": "12:52:34",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij9i8k",
    "parent_id": "t1_dij7q9b",
    "subreddit_name_prefixed": "r/news",
    "body": "I can only see Jurassic Park 2 and E.T. so many times tho",
    "controversiality": 0,
    "ups": 72,
    "downs": 0,
    "score": 72,
    "created": 1496791737.0,
    "date_created": "2017-06-06",
    "time_created": "11:28:57",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij8cd3",
    "parent_id": "t1_dij7q9b",
    "subreddit_name_prefixed": "r/news",
    "body": "Wait...what?",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496790475.0,
    "date_created": "2017-06-06",
    "time_created": "11:07:55",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dije8ty",
    "parent_id": "t1_dij7q9b",
    "subreddit_name_prefixed": "r/news",
    "body": "I'm a little hurt that you didn't mention books, doesn't even make sense. Haha. Nonetheless, one thing I was very impressed with when I moved to the US is the public library at Sunnyvale, CA. After moving around, 3 states now (CA, IA, WA), I can say that the US has great public libraries. Wide selection of books, games, movies, and music. ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1496796786.0,
    "date_created": "2017-06-06",
    "time_created": "12:53:06",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij7l72",
    "parent_id": "t1_dij6wxg",
    "subreddit_name_prefixed": "r/news",
    "body": "Just so you're aware, the phrase you're looking for is [\"a vested interest,\"](https://www.merriam-webster.com/dictionary/vested%20interest) not \"an invested interest.\" Sorry, it was bothering me for some reason. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1496789640.0,
    "date_created": "2017-06-06",
    "time_created": "10:54:00",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij8svi",
    "parent_id": "t1_dij6zvv",
    "subreddit_name_prefixed": "r/news",
    "body": "you misunderstood his point. His point was netflix already has partnered with comcast directly or they wouldnt have the app on the comcast box nor the infinity results page. This was a direct response to the \"whats to prevent an isp from cutting netflix out question that sosokitso pondered. \n\nThe infered answer was they dont have much to fear if they are partnering with comcast already.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1496790976.0,
    "date_created": "2017-06-06",
    "time_created": "11:16:16",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij61dn",
    "parent_id": "t1_dij5v9g",
    "subreddit_name_prefixed": "r/news",
    "body": "And they'll keep paying that money. They are okay with paying that money to kill any potential independent competition, apparently.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496787911.0,
    "date_created": "2017-06-06",
    "time_created": "10:25:11",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijcpzd",
    "parent_id": "t1_dij86fo",
    "subreddit_name_prefixed": "r/news",
    "body": "> ridiculously slow transfer rates.\n\nSome of us grew up in an era where we scheduled downloads overnight.  It's not too bad if you are determined to have it.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1496795181.0,
    "date_created": "2017-06-06",
    "time_created": "12:26:21",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dij8bj5",
    "parent_id": "t1_dij86fo",
    "subreddit_name_prefixed": "r/news",
    "body": "Oh man, I hope nobody from show biz is reading this comment thread, they'll go full force in support of anti-NN",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1496790450.0,
    "date_created": "2017-06-06",
    "time_created": "11:07:30",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijc1mj",
    "parent_id": "t1_dij86fo",
    "subreddit_name_prefixed": "r/news",
    "body": "Tunneling your VPN through 443 or 80 would solve this issue. Although, the average American is still fucked up unless they want to pay for a VPN and learn how to use it properly.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496794463.0,
    "date_created": "2017-06-06",
    "time_created": "12:14:23",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijpz4b",
    "parent_id": "t1_dijommz",
    "subreddit_name_prefixed": "r/news",
    "body": "Problem is, if everyone else gets throttled who would you take your business to?",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1496809009.0,
    "date_created": "2017-06-06",
    "time_created": "16:16:49",
    "submission_id": "news-6fl9em"
  },
  {
    "id": "dijbdga",
    "parent_id": "t1_dijbbue",
    "subreddit_name_prefixed": "r/news",
    "body": "That's what they explicitly told us, when they reached out to ask if we would out stickies up in our subreddits. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1496793739.0,
    "date_created": "2017-06-06",
    "time_created": "12:02:19",
    "submission_id": "news-6fl9em"
  }
]