[
  {
    "id": "dq5l9fn",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Attack ideas, not users. Personal insults, shill or troll accusations, hate speech, and other incivility violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1511322336.0,
    "date_created": "2017-11-21",
    "time_created": "14:45:36",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5lf85",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "What was even the purpose of expressing our opinion? 22 million laughs I guess?",
    "controversiality": 0,
    "ups": 6859,
    "downs": 0,
    "score": 6859,
    "created": 1511322488.0,
    "date_created": "2017-11-21",
    "time_created": "14:48:08",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5ld75",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "> For someone who claims to be working for the American people, FCC Chairman Ajit Pai sure doesn’t seem to care what they have to say. **In his announcement today that the Commission would vote whether to roll back net neutrality rules on December 15, he made no mention of the inconvenient and embarrassing fact that his proposal had attracted historic attention, garnering over 22 million comments — the majority of which opposed it.**\n\n> The statement mentions benefiting or protecting consumers five times, so clearly the idea here is to help the users of internet services. Yet those very same consumers wrote the Chairman by the millions to say that they felt the existing rules protect them very well and that to remove them would be detrimental to their safety and privacy.\n\n...\n\nedit:\ndarius, thanks for the coin!- happy holidays to you\n\n",
    "controversiality": 0,
    "ups": 1921,
    "downs": 0,
    "score": 1921,
    "created": 1511322436.0,
    "date_created": "2017-11-21",
    "time_created": "14:47:16",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5oefe",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "\nThey will be sued.  This may violate the Administrative Procedure Act.  First, there is an argument to be made that it violates section 553 (c) which requires a concise general statement as to why they ignored the vast majority of comments against the rule (which assumes many things leading up to that point).  Second, one can argue it violates section 706 (2)(a) which holds unlawful and sets aside agency action, findings, and conclusions found to be arbitrary and capricious, an abuse of discretion, or otherwise not in accordance with law. Third, there are constitutional issues with this proposed rule.\n\nIn my opinion, the internet is free speech protected under the 1st amendment, thus, corporations shall not abridge free speech by profiting from the removal of net neutrality. \n\nAs always, there will be many arguments against my point. One comment below pointed many of them out. We cannot rely on yelling into the echochambers of the internet we are trying to protect. We must engage reality and peacefully force change. We must vote for those who encourage the guiding hands of compassion, science, and reason to aid in our legislative processes. \n\nEdit #1 for clarity\n\nEdit #2 because I have a temporary voice due to my first 1000 comment post\n\n",
    "controversiality": 0,
    "ups": 1222,
    "downs": 0,
    "score": 1222,
    "created": 1511325334.0,
    "date_created": "2017-11-21",
    "time_created": "15:35:34",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5uxr8",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "The internet has always been free once you have paid to access it. Now you get the pleasure of paying for your access to it AND to access your content AND for the content. This makes the EA SWBF outrage look like a fight over milk and cookies. ",
    "controversiality": 0,
    "ups": 306,
    "downs": 0,
    "score": 306,
    "created": 1511331747.0,
    "date_created": "2017-11-21",
    "time_created": "17:22:27",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5s1o0",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "> Pai writes that the 2015 rules have “depressed investment in building and expanding broadband networks and deterred innovation.”\n\nDon't forget that governments at many levels paid broadband providers enormous sums of money to build out their networks, which they happily pocketed, after which they did nothing.\n\nFor example, in my home state of Pennsylvania, the state [gave Verizon over $2 billion in tax breaks](https://www.huffingtonpost.com/bruce-kushnick/verizon-pennsylvanias-com_b_7532008.html) to run fiber to homes statewide. By employing some clever language tricks, they claim they've met the contract requirements in the form of their cellular network (that they'd've built anyway) and as a result, significant portions of the rural parts of the state still have DSL at best, and dialup at worst.\n\nBut won't someone *please* think of protecting those poor Verizon shareholders' profits so Verizon can get back to not building unprofitable networks.",
    "controversiality": 0,
    "ups": 141,
    "downs": 0,
    "score": 141,
    "created": 1511328838.0,
    "date_created": "2017-11-21",
    "time_created": "16:33:58",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5mbgm",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Might want to consider it before it turns into 22 million torches and pitch forks in front of your house (protesting peacefully).\n\nDon't worry, you can pay a fee for passage.",
    "controversiality": 0,
    "ups": 1016,
    "downs": 0,
    "score": 1016,
    "created": 1511323347.0,
    "date_created": "2017-11-21",
    "time_created": "15:02:27",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5mvrj",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Fuck you straight to hell, Pai. May all your happiness rot and everyone you love turn against you. ",
    "controversiality": 0,
    "ups": 773,
    "downs": 0,
    "score": 773,
    "created": 1511323882.0,
    "date_created": "2017-11-21",
    "time_created": "15:11:22",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5qamt",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "What will it take for people to finally have enough of this shit? They obviously don't care what we think. Yet here we are talking about politicians, as if they cared too. Its on us. Were on our own. We are the ones who will have to physically do something about this.",
    "controversiality": 0,
    "ups": 159,
    "downs": 0,
    "score": 159,
    "created": 1511327138.0,
    "date_created": "2017-11-21",
    "time_created": "16:05:38",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5tjd9",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "* Net Neutrality\n* ACA repeal\n* Gun safety\n* The tax plan\n\nWe've really reached the point at which our government is no longer acting in line with the will or best interests of the people. This is not a representative democracy.",
    "controversiality": 0,
    "ups": 621,
    "downs": 0,
    "score": 621,
    "created": 1511330281.0,
    "date_created": "2017-11-21",
    "time_created": "16:58:01",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5x408",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1511334116.0,
    "date_created": "2017-11-21",
    "time_created": "18:01:56",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xqo8",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "I'm not American (Canadian), but I like the American people. It's important for the world that the American people fight back against this. America is a hub for innovation and creative thinking. I owe many of the modern conveniences I enjoy today to this spirit in America. \n\nThe destroying of net neutrality in the United States will have a profound effect the world over. It will result in a more limited access to information, a higher barrier to entry into the marketplace and will cut deep into the economy.\n\nWith everything going on in the United States of America today, I think it's time that those of you who still have your wits about you to do what you have done time and time again over the past few centuries and let out a loud collective \"Fuck this shit\". \n\nWhatever that means is up to you, but what I can tell you it does mean is getting up off your computer and assembling. What you choose to do when you assemble is pretty irrelevant, but it will require a very loud message to be sent. If that means 2 million people walking into congress and the FCC headquarters so be it. Whatever it means it has to send the message that the American people will not tolerate this anymore.\n\nThe world is watching and counting on you to continue to be the leaders of the free world, right now you are the laughing stalk of the entire world. This is a test, if you fail it, China is the new top dog and America will go the way of the Romans. If you pass this test, you can start to fight back. If net neutrality goes away it's going to get that much harder to claw your way back.",
    "controversiality": 0,
    "ups": 87,
    "downs": 0,
    "score": 87,
    "created": 1511334831.0,
    "date_created": "2017-11-21",
    "time_created": "18:13:51",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5p9yc",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "One of the reasons was because a large number of the comments were sent by bots.  \n\nThe telcos themselves paid for a [study](http://www.emprata.com/emp2017/wp-content/uploads/2017/08/FCC-Restoring-Internet-Freedom-Comments-Analysis.pdf) finding that, of uniquely written comments, 1.77 million were FOR Title II Net neutrality, whereas only 24 thousand were AGAINST Title II Net Neutrality.  This is out of nearly 22 million total comments.  One form letter against NN was submitted 7.8 million times, using fake/generated email addresses.  \n\nAll these fake comments from bots allowed the FCC to de-legitimize the entire public comment process.  It is weaponized disinformation.  There are advantages to the default of pseudo-anonymity on the Internet, but this is one costs.\n\nIt's sad that this has become such a political issue, but that's just the reality of the situation.  The Republican party (and Koch-funded libertarian policy institutes) have systematically undermined antitrust enforcement for decades.  They complain about \"regulatory capture,\" the corrupt relationship between industry and government agencies, but this is projection.  THEY are the worst offenders.  Want an example?  Look no further than [Republican former commissioner Baker](https://en.wikipedia.org/wiki/Meredith_Attwell_Baker).  After the FCC approved the merger of NBC/Universal and Comcast, she resigned from the commission and became the vice president for government affairs at the combined entity.  This is how the industry quasi-legally hands out huge piles of cash to reward its corrupt servants.  This is precisely the kind of swamp-monster behavior that needs to be burned out of Washington, and it's exactly the opposite of what the party of projection and their hypocrite-in-chief have been up to.\n\nThere's a small chance that this will be stopped by the D.C. Circuit Court of Appeals, but... in reality?  The only way you're going to stop this long-term is to elect Democrats.\n",
    "controversiality": 0,
    "ups": 133,
    "downs": 0,
    "score": 133,
    "created": 1511326167.0,
    "date_created": "2017-11-21",
    "time_created": "15:49:27",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5swfc",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "There are fewer signatures on *any* petition currently in circulation calling for the impeachment of Donald Trump than there are comments in support of Net Neutrality. That really says something. People hate Trump, but 22 million people came out to say how they felt about the prospect of the internet getting divided up into packages and resold to us as subscriptions.",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1511329651.0,
    "date_created": "2017-11-21",
    "time_created": "16:47:31",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5oi41",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "It's like, people are pretending we can stop this. This IS going to happen. It is the crown jewel of the telecom industry. This man is appointed to DO THIS VERY THING, and if he does nothing else in his life, he will have served his masters well. \n\nThe ONLY real recourse left is to elect the most liberal candidates in this nation and support them not to tackle social issues that get liberals banished for 40 years, but real economic reforms that put in place and solidify for all an even playing field and not one tilted for rich, trust fund babies.\n\nCall your senators and Congress persons. I have a number of times on this issue. Mine are in favor of NN but those that are in the pocket for the big guys ain't going to bend.\n\nThis is another brick in the wall in a fight to the death for your economic soul. We need to treat it like that. A fight for our lives and future. This is a fight for my daughter's economic future (she's 9) and the children she will hopefully have. For me, it is a war of freedom.",
    "controversiality": 0,
    "ups": 328,
    "downs": 0,
    "score": 328,
    "created": 1511325432.0,
    "date_created": "2017-11-21",
    "time_created": "15:37:12",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5mf4g",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Of course not.  The only opportunity we had to weigh in on this was during the election, and we voted to screw ourselves. ",
    "controversiality": 0,
    "ups": 132,
    "downs": 0,
    "score": 132,
    "created": 1511323447.0,
    "date_created": "2017-11-21",
    "time_created": "15:04:07",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5wqur",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Let's not just make comments online. A faceless voice has not worked. We need to organize. We need to show them what we want. A few words on a screen means nothing. This needs to be as public as possible. We can't let ourselves lose this battle. ",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1511333717.0,
    "date_created": "2017-11-21",
    "time_created": "17:55:17",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5rgoy",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "If something really bad happened to Pai, I wouldn't be the least bit upset.",
    "controversiality": 0,
    "ups": 77,
    "downs": 0,
    "score": 77,
    "created": 1511328268.0,
    "date_created": "2017-11-21",
    "time_created": "16:24:28",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5mo6l",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Fuck libertarians.  \n\nEdit: Wow, their excuse is that deregulation is also the government's fault. You can't make this shit up folks\n\n>The problem is that the current US government is accountable to big corporate, not the people.\nIt's pretty black and white that net neutrality is good for everyone, and bad for monopolies. \n\nEdit2: No, I'm not saying they're solely to blame for this, but they have this habit of supporting deregulation until it affects them negatively. Anyone who puts an ounce of faith into any corporation is a fool.",
    "controversiality": 0,
    "ups": 448,
    "downs": 0,
    "score": 448,
    "created": 1511323684.0,
    "date_created": "2017-11-21",
    "time_created": "15:08:04",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5r2jp",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Well, this could get violent. Can’t say id blame anyone who rebelled. They tried commenting through proper channels and have been outgunned by the moneyed class. If the republicans cause violent unrest, it will be their fault.",
    "controversiality": 0,
    "ups": 110,
    "downs": 0,
    "score": 110,
    "created": 1511327889.0,
    "date_created": "2017-11-21",
    "time_created": "16:18:09",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5ldk9",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "The 22 million comments in favor of the net neutrality.",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1511322445.0,
    "date_created": "2017-11-21",
    "time_created": "14:47:25",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5ravq",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Don't any of these idiots know that if you keep fucking over the general population they will rise up against you? High taxes on the lower class, throttled internet and having to pay for EVERYTHING, taking away any social programs and only funding military/police forces, this is the beginning of an armed insurrection. ",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1511328112.0,
    "date_created": "2017-11-21",
    "time_created": "16:21:52",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zr6y",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "I think Ajit Pai is currently the most hated man in America. Second only to Trump I suppose, not sure how the approval ratings are looking.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1511337164.0,
    "date_created": "2017-11-21",
    "time_created": "18:52:44",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5ttlw",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "At this point it seems all but inevitable. My only question is, how hard is this going to be able to undo when we oust these fuckers?",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1511330573.0,
    "date_created": "2017-11-21",
    "time_created": "17:02:53",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5ucry",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Honestly, if it passes ... which I really hope it doesn’t. Why doesn’t everyone just refuse to pay for it? I understand some people can’t do that due to work, but I could probably live without internet for a month... if millions of others did the same, wouldn’t they regret their decision?",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1511331135.0,
    "date_created": "2017-11-21",
    "time_created": "17:12:15",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5pskx",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "\"We don't care about public opinion. We're going to do what we want. If it makes you all feel better, when it goes south, we'll blame it on the left.\"",
    "controversiality": 0,
    "ups": 37,
    "downs": 0,
    "score": 37,
    "created": 1511326659.0,
    "date_created": "2017-11-21",
    "time_created": "15:57:39",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zd5i",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "***FUCK IT, we need to PUT UP OR SHUT UP!***\n===============\n\nIf this prick guts Net neutrality, we ALL need to CANCEL our internet service, and simply use our public libraries, and other public means to access the internet, THAT is the solitary message we could give to these pricks, if 22 million people get rid of their Internet service, they will listen to us!\n\n**EDIT:** *22 million x $50-$80 per month= $1.1-1.76 billion, that's how much they will lose MONTHLY!* \n---",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1511336706.0,
    "date_created": "2017-11-21",
    "time_created": "18:45:06",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5n1ve",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Yes Trump, your decision on this little fuckwad is surely in that MAGA theme. ",
    "controversiality": 0,
    "ups": 54,
    "downs": 0,
    "score": 54,
    "created": 1511324049.0,
    "date_created": "2017-11-21",
    "time_created": "15:14:09",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xbf7",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Sadly, the voices of a half dozen telecom CEOs count for more than 22 million citizens to the current regime.  That's what happens when the GOP steals power with the help of their Russian buddies.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1511334350.0,
    "date_created": "2017-11-21",
    "time_created": "18:05:50",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xui4",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "This administration has made no attempt to mask that its a complete shill for corporations and the oligarchy. At least Republicans of the past paid lip-service to some idea of defending the average American. In some ways, the transparency is refreshing, but it's also sad and terrifying that a large percent of the US population will still follow their team and willingly throw away their civil rights, money, healthcare, etc.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1511334955.0,
    "date_created": "2017-11-21",
    "time_created": "18:15:55",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xryl",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "I work at EPA. We take comment on stuff in this Administration all the time because the law requires it, but the current Administration could care less what average people think. This is no different. Window dressing.  ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1511334872.0,
    "date_created": "2017-11-21",
    "time_created": "18:14:32",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zsm5",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "I feel like we are fighting our government for control and freedom, rather than working together to form a more perfect union. \"We the people\" my ass.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511337212.0,
    "date_created": "2017-11-21",
    "time_created": "18:53:32",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq684rt",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "I swear if I hear one more idiot claim that they trust “the free market” more than government regulation, I’m going to scream.\n\nGuess we can get rid of the FDA and EPA too. Go back to thumbs in our cans of tuna and poison in the air we breath. \n\nMajor corporations have shown time and time again that they will do whatever they can in an effort to increase their profit margin.\n\nI swear, conservatives and free market capitalists are convinced there’s some major fairy out there that eliminates competition if they don’t respond to consumers.\n\nGuess that’s why all these ISPs are barely in business despite overwhelmingly negative reactions from customers. \n\nFucking morons. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1511347541.0,
    "date_created": "2017-11-21",
    "time_created": "21:45:41",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5yfbm",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Get your pitchforks sharpened because this alone shows that it will pass regardless of what the public thinks  ",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1511335619.0,
    "date_created": "2017-11-21",
    "time_created": "18:26:59",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5m5hh",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "\"for the people by the people\"",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1511323185.0,
    "date_created": "2017-11-21",
    "time_created": "14:59:45",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5nolz",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "I'm starting to think this Pai guy is a bit of an asshole.",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1511324649.0,
    "date_created": "2017-11-21",
    "time_created": "15:24:09",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xfjm",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Don't just up vote... Take 10 minutes out of your day to at least make one call!",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511334481.0,
    "date_created": "2017-11-21",
    "time_created": "18:08:01",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5z8xw",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Can this really be stopped? I want net neutrality, but I don't think the government will listen. They are going to do what they want. \n\nI hope I'm wrong. \n\nI think access to the internet should be regulated like a public utility such as electricity or water. It has become so ingrained and important in our lives that the private sector cannot be trusted to do the right thing. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511336572.0,
    "date_created": "2017-11-21",
    "time_created": "18:42:52",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5nnnz",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1511324623.0,
    "date_created": "2017-11-21",
    "time_created": "15:23:43",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5s4u4",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "The only comments that counted were the anonymous comment cards we were allowed to submit in early November 2016.\n\nToo bad so many people didn't bother to submit one then.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1511328928.0,
    "date_created": "2017-11-21",
    "time_created": "16:35:28",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5n2ju",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "They need to fear you. Do what it takes to make them fear you.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1511324066.0,
    "date_created": "2017-11-21",
    "time_created": "15:14:26",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5vgs6",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "I feel completely helpless on this issue.  There is zero recourse for the majority of the country to affect this decision.  This is a blatant attack on democracy and there's literally nothing we can do about it.  It makes me sick to my stomach",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1511332313.0,
    "date_created": "2017-11-21",
    "time_created": "17:31:53",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5mss5",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "The only way I can see this not passing is Congress (lol) or an enormous boycott of the lobbying companies.  ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1511323803.0,
    "date_created": "2017-11-21",
    "time_created": "15:10:03",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5x6pw",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Shut the FCC down. Remove Ajit Pai. They are not performing thier jobs and infact fighting the people. Shut them down. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511334200.0,
    "date_created": "2017-11-21",
    "time_created": "18:03:20",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5x9ct",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Craven?\n\nCraven???\n\nThey're jacking hundreds of millions of people directly in the face of vocal opposition from literally millions of people. That's about as bold as you can get.\n\nOf course... they know no one will do anything except spend a bunch of money on Reddit gold posting and reposting about it to each other.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511334285.0,
    "date_created": "2017-11-21",
    "time_created": "18:04:45",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zhpz",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Anyone who thinks this would be happening with Hillary in office is an idiot.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511336856.0,
    "date_created": "2017-11-21",
    "time_created": "18:47:36",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq616ig",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "This might be a little bit of an unpopular opinion but frankly, I don't think this shouldn't be the hill we choose to die on. This is a hugely unpopular thing that has seen millions speak out, but the problem is that if we kill this vote today, it will be back tomorrow, or the next month or the next year. It will come back at some point because this isn't legislation. \n\nThe general public hasn't understood the real risks here, and they aren't going to yet but all of us know that Verizon, AT&T, Comcast, they are all going to move quickly to take advantage of this vote, and it's going to suck. \n\nWhat we need isn't an FCC ruling, or guidelines that can shift on the whim of one man with an overly large cup, what we need is actual legislation. Something that would require a senate vote and a presidential signature to change. We aren't likely to get that from this congress of course, but no matter how you feel about Democrats, coming in to a year they expect to make gains in, a freebie softball policy position that they can gain traction on Republicans is meat no politician can pass up. Yes call your senator, but don't tell them that you want them to stop this vote, tell them you will be voting for a candidate that will actually pass legislation to protect the internet. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511338901.0,
    "date_created": "2017-11-21",
    "time_created": "19:21:41",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5x7qv",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "The US has officially become an oligarchy no better than Russia :/",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1511334233.0,
    "date_created": "2017-11-21",
    "time_created": "18:03:53",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zcnm",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "I'm sick of this shit! \n\nI'm sick of fighting rat traitor commercial isp's to maintain access to some diversionary entertainment in my life!\n\nFuck this shit!\n\nI don't want to rely on commercial corporations for internet access anymore. \n\nI'm sick of paying people to take things away from me.\n\nI demand our government build a free alternative public internet with tax payer money right now!\n\nI demand it!\n\nEveryone should demand it.\n\nThese commercial scum corporations want to take net neutrality away from us?\n\nThen our response should be to demand and petition the FEDERAL government to step in and build a free public internet!\n\nI don't want to hear your fucking excuses, you lying corporate puppets! \n\nI don't want to get internet from commercial interests anymore!\n\nIt's nothing but a fucking bait and switch scam and a paid subscription to play a shell game with content.\n\nI demand a government built and maintained public internet!\n\nEveryone should demand it!\n\nFuck this shit!",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511336689.0,
    "date_created": "2017-11-21",
    "time_created": "18:44:49",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq61uzh",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "We should march on Washington.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511339740.0,
    "date_created": "2017-11-21",
    "time_created": "19:35:40",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq66sbo",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "No shit? They just took healthcare away from millions of CHILDREN.\n\nChildren! Millions do not have healthcare as of 9/30.\n\nDo you really think they give a fuck about you petition? This issue was decided last year when people voted for Trump.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511345862.0,
    "date_created": "2017-11-21",
    "time_created": "21:17:42",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq69cpn",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "People think this is about the money when it's really about controlling information.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511349069.0,
    "date_created": "2017-11-21",
    "time_created": "22:11:09",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5py9c",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1511326812.0,
    "date_created": "2017-11-21",
    "time_created": "16:00:12",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5nhot",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "The Trump administration doesn't care for the input of the peasantry.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1511324464.0,
    "date_created": "2017-11-21",
    "time_created": "15:21:04",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5y3c3",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "What the hell has this admin done that is not for a corporate donor. Please tell me one thing.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511335235.0,
    "date_created": "2017-11-21",
    "time_created": "18:20:35",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5ye8c",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Those comments will go right into the recycling bin",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511335584.0,
    "date_created": "2017-11-21",
    "time_created": "18:26:24",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5s3d0",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Conservatism is a brain disorder.",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1511328886.0,
    "date_created": "2017-11-21",
    "time_created": "16:34:46",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5rrzx",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "This is the best tl;dr I could make, [original](https://techcrunch.com/2017/11/21/the-fccs-craven-net-neutrality-vote-announcement-makes-no-mention-of-the-22-million-comments-filed/) reduced by 84%. (I'm a bot)\n*****\n> In fact the numbers are far from decisive on this and many industry experts and ISPs themselves have said that the net neutrality rules had nothing to do with changes in investment - instead, they follow years-long cycles of updating infrastructure, accommodating technology changes like 5G and so on.\n\n> He calls the previous lack of Title II-based net neutrality rules a &quot;Longstanding consensus.&quot; But it was neither.\n\n> Net neutrality rules have been in and out of the courts since 2002, with the FCC and various industries disagreeing fundamentally on what constitutes an &quot;Information service&quot; versus a &quot;Telecommunications service,&quot; the dichotomy at the heart of this conflict.\n\n\n*****\n[**Extended Summary**](http://np.reddit.com/r/autotldr/comments/7eldd2/the_fccs_craven_net_neutrality_vote_announcement/) | [FAQ](http://np.reddit.com/r/autotldr/comments/31b9fm/faq_autotldr_bot/ \"Version 1.65, ~251320 tl;drs so far.\") | [Feedback](http://np.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **Rule**^#1 **Pai**^#2 **mention**^#3 **service**^#4 **proposal**^#5",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511328572.0,
    "date_created": "2017-11-21",
    "time_created": "16:29:32",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5rt69",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "So if you haven't already, there's a bot you can text, that helps you write an email or a fax, free of charge, to your senator, or governor. Text \"resist\" to \"504-09\" and it'll ask you some questions, then you're onto writing. From another thread a few weeks ago, someone posted this message, and it think it's a great one to send.\n\n\"Net Neutrality is the cornerstone of innovation, free speech and democracy on the Internet.\n\nControl over the Internet should remain in the hands of the people who use it every day. The ability to share information without impediment is critical to the progression of technology, science, small business, and culture.\n\nPlease stand with the public by protecting Net Neutrality once and for all.\"\n\nI'd love to credit the user, but have lost the comment, but please, go send some faxes, show your politicians you want net neutrality to stay.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511328605.0,
    "date_created": "2017-11-21",
    "time_created": "16:30:05",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5wivi",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Of course not-- which is why I seldom bother signing petitions. You can't stop _greed_ by simply signing petitions.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511333470.0,
    "date_created": "2017-11-21",
    "time_created": "17:51:10",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5x8zs",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "You want to know why people feel disenfranchised on political matters?\n\nI found one of the reasons for you.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511334273.0,
    "date_created": "2017-11-21",
    "time_created": "18:04:33",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xenk",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "So, if we manage to vote out the criminal party in 2018 and 2020, can we undo this? Can we fix it and reinstate NN? Preferably after finding evidence of their collusion and arresting them.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511334452.0,
    "date_created": "2017-11-21",
    "time_created": "18:07:32",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xgxv",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Honestly, I hope it goes through. \n\nThen people will get pissed off that they can't use the internet as easily and they won't have their 'relaxation' method of choice. \n\nThe anger and resentment will build, then just maybe people will get more involved in politics. \n\nAngry, bored, underpaid masses have never been a dangerous thing for society. \n\nNope, not ever. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511334523.0,
    "date_created": "2017-11-21",
    "time_created": "18:08:43",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xhlj",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Wake up, people. Stop sending comments to the FCC. This douchebag is in charge. They're just ignoring them. Exert your efforts towards your representatives in the House & Senate.\n\nedit: To make it easy, you can just go to www.battleforthenet.com or www.callmycongress.com",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511334545.0,
    "date_created": "2017-11-21",
    "time_created": "18:09:05",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xv8t",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "https://www.law.cornell.edu/uscode/text/5/706\n\n> (A) arbitrary, capricious, an abuse of discretion, or otherwise not in accordance with law;",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511334979.0,
    "date_created": "2017-11-21",
    "time_created": "18:16:19",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5y60r",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Because the government does not care about you or what you want. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511335322.0,
    "date_created": "2017-11-21",
    "time_created": "18:22:02",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5yk5z",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Our reps no longer hear our voices. Accept it.  \nThey only hear the voices of their sponsors like AT&T, Comcast, Time Warner, COX, etc.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511335775.0,
    "date_created": "2017-11-21",
    "time_created": "18:29:35",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5ysdf",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Fuck Pai and fuck the guy who put him there.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511336038.0,
    "date_created": "2017-11-21",
    "time_created": "18:33:58",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5z9qi",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "That’s because this government is bought by corporations top to bottom. Everyone knew this is how the republicans would be. They are like this every time. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511336597.0,
    "date_created": "2017-11-21",
    "time_created": "18:43:17",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zcfw",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "I've been reading through the document and notating all the most bullshit bits. Please look here. Some of it includes,\n\n\"We don't see how blocking, throttling, or prioritizing harms the consumer and do not think these ex ante (pre-emptive) rules are necessary.\" \n\nhttps://imgur.com/a/LXRre (Highlights Album)\n\nhttps://apps.fcc.gov/edocs_public/attachmatch/FCC-17-60A1_Rcd.pdf (Full text)",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511336682.0,
    "date_created": "2017-11-21",
    "time_created": "18:44:42",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zqrs",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Can some one tell me honestly: how fucked are we?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511337150.0,
    "date_created": "2017-11-21",
    "time_created": "18:52:30",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zrf6",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "I usually don't email or call my reps to voice my opinion on things (yes I know it's dumb), but I did today and it's not as hard as you might think. It only takes a few clicks, and words and if we succeed I for one will feel damn proud of myself for finally voicing my opinion on something that matters not only to me but to many with the same mindset as myself. So if you really want to support NN then please take a few minutes to email or call your reps and voice your opinion.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511337171.0,
    "date_created": "2017-11-21",
    "time_created": "18:52:51",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq6047j",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "If they won't listen to our opinions is it time to burn shit down yet? For fucks sake this is so frustrating.  When do we march in the street for Pai's head? When Reddit is a premium site maybe people will get up but I'm ready anyday.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511337602.0,
    "date_created": "2017-11-21",
    "time_created": "19:00:02",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq60hij",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Elections have consequences. Enjoy reaping what you've sown Trump supporters, maybe you'll wake up once your ISP restricts access to all other news orgs except CNN unless you pay an extra fee, because that's exactly what TWC is going to do.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511338051.0,
    "date_created": "2017-11-21",
    "time_created": "19:07:31",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq60sbj",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Fuck the Republican Party right now. This is on you. Data throttling and stupid data prices are already ridiculous. If you get to mine the hell out of my data you’re milking me both ways. Wouldn’t be surprised if Alit Pai owned stock in Verizon. Also wouldn’t be shocked if he gets a sweet bullshit VP gig with a slam dunk contract after this with a major telecom corporation ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511338415.0,
    "date_created": "2017-11-21",
    "time_created": "19:13:35",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq60vu7",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Why isn't porn hub and xhamster all over this. Tiered internet means less users. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511338536.0,
    "date_created": "2017-11-21",
    "time_created": "19:15:36",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq60wq2",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": " Pitchforks.  This has gone beyond reason and logic.  This human scum wants to destroy something sacred.  It's time for the pitchforks. It should never have come to this, but it has.  They want a revolution, well, this is how you start one. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511338565.0,
    "date_created": "2017-11-21",
    "time_created": "19:16:05",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq619jz",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "[This](https://pbs.twimg.com/media/DNGlrABUIAAr9RO.jpg) is what its like in portugal without net neutrality. The internet is going to need all the [help](https://www.reddit.com/r/listentothis/comments/7ekx19/the_fcc_is_about_to_kill_net_neutrality_were/) it can get",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511339006.0,
    "date_created": "2017-11-21",
    "time_created": "19:23:26",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq619q6",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "So is there no ethics investigation into the FCC at all?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511339012.0,
    "date_created": "2017-11-21",
    "time_created": "19:23:32",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq62h47",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Gonna be the first guillotine since 1947 with this guy if he goes through with it, I don't think he understands how many people are going to be pissed off.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511340508.0,
    "date_created": "2017-11-21",
    "time_created": "19:48:28",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq62man",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "It sounds like it’s time for people to start physically showing up",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511340686.0,
    "date_created": "2017-11-21",
    "time_created": "19:51:26",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq635a6",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "I left 3 pretty vulgar very angry voicemails at Ajit Pai’s office.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511341334.0,
    "date_created": "2017-11-21",
    "time_created": "20:02:14",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq645e2",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "I havent seen Reddit this united since Victoria was fired.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511342578.0,
    "date_created": "2017-11-21",
    "time_created": "20:22:58",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq645y3",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "I thought republicans wanted freedom, lol",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511342597.0,
    "date_created": "2017-11-21",
    "time_created": "20:23:17",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq649ve",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Holy shit. The comments at the bottom of that article are a **wasteland** of drooling idiocy.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511342736.0,
    "date_created": "2017-11-21",
    "time_created": "20:25:36",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq65wao",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Why on earth do we tolerate Donald Trump and his administration. They’re obviously no longer representing our own best interest. Impeach and jail the lot of them.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511344736.0,
    "date_created": "2017-11-21",
    "time_created": "20:58:56",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq668nr",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "\"Democracy\"",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511345172.0,
    "date_created": "2017-11-21",
    "time_created": "21:06:12",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq66df7",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Every single non-Republican politician (or telecommunications CEO) could collectively say they wanted strong net neutrality rules and they'd do this anyway.\n\nThat's the shittiest part. We have zero say, and we'll all suffer because those in power hate us.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511345335.0,
    "date_created": "2017-11-21",
    "time_created": "21:08:55",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq67wcn",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Proof the FCC has been usurped by small handful of very wealthy special interests.  There's lots of money changing hands here and none of this should be legal.  These people should be in jail.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511347255.0,
    "date_created": "2017-11-21",
    "time_created": "21:40:55",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq6852r",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Don't worry, those 22 million comments will make it into court when the ACLU sues them. I believe it's already in the works which is why people need to go donate to the ACLU ASAP!\n\n[ACLU](https://www.aclu.org/donate)",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511347552.0,
    "date_created": "2017-11-21",
    "time_created": "21:45:52",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq68y42",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "It is so easy to burn out on fighting this year after year.  This is how you pass unpopular legislation in a \"democracy\" - keep reintroducing the same thing over and over and over again until you managed to wear down your opponents and get it through.  If we win this battle, expect to see it over and over again year after year.  I call it \"brute force legislation\".",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511348551.0,
    "date_created": "2017-11-21",
    "time_created": "22:02:31",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq69b65",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Conservatives are worthless.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511349013.0,
    "date_created": "2017-11-21",
    "time_created": "22:10:13",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq6afza",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "I don't know if this has been shared, but there will be Net Neutrality protests outside of Verizon stores on December 7. Please join.\n\nhttps://www.google.com/amp/thehill.com/policy/technology/361351-net-neutrality-group-plans-holiday-protests-at-verizon-stores%3famp",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511350495.0,
    "date_created": "2017-11-21",
    "time_created": "22:34:55",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq6agsd",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "This is a failure of representative democracy. Not being held accountable and brazen support of corporate power grabs without care of public say, and all you can do is call your rep until they cut the phone line.\n Something important like access to a utility which the world runs on now is about to be ruined by the capitalist profit motive. \n\n",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511350525.0,
    "date_created": "2017-11-21",
    "time_created": "22:35:25",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq6c913",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Good old march on Washington seems in order",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511352955.0,
    "date_created": "2017-11-21",
    "time_created": "23:15:55",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq6co8f",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Why the hell are the right wing reddits not worried about NN? ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511353554.0,
    "date_created": "2017-11-21",
    "time_created": "23:25:54",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq6e7zk",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Ajit Pai’s willful efforts to defy both the American people and Constitution on this matter are sufficient to render them unconstitutional.  The ACLU needs to take him to the SCOTUS woodshed over it.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511355877.0,
    "date_created": "2017-11-22",
    "time_created": "00:04:37",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5oi9z",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Directions unclear. Sending snakes.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511325436.0,
    "date_created": "2017-11-21",
    "time_created": "15:37:16",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5vkkl",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Repealing net neutrality is a Libertarian utopia. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511332425.0,
    "date_created": "2017-11-21",
    "time_created": "17:33:45",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5x04e",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Pai wants to cause immeasurable damage to America because he puts corporation before country. He may singlehandedly destroy the American economy. Hopefully his name becomes a pejorative.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1511333995.0,
    "date_created": "2017-11-21",
    "time_created": "17:59:55",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xty4",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Fuck Ajit Pai.  That little bastard.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511334937.0,
    "date_created": "2017-11-21",
    "time_created": "18:15:37",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zmmi",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "And people still think we live in a democracy.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511337015.0,
    "date_created": "2017-11-21",
    "time_created": "18:50:15",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq65txh",
    "parent_id": "t3_7ekkmo",
    "subreddit_name_prefixed": "r/politics",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511344652.0,
    "date_created": "2017-11-21",
    "time_created": "20:57:32",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5m10u",
    "parent_id": "t1_dq5lf85",
    "subreddit_name_prefixed": "r/politics",
    "body": "Ajit Pai said publicly he didn't care about the public opinion, if I recall correctly.",
    "controversiality": 0,
    "ups": 3797,
    "downs": 0,
    "score": 3797,
    "created": 1511323066.0,
    "date_created": "2017-11-21",
    "time_created": "14:57:46",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5njg6",
    "parent_id": "t1_dq5lf85",
    "subreddit_name_prefixed": "r/politics",
    "body": "For the ensuing court case. Their rule making procedures say they must listen to public opinion, and if they didn't it can be grounds for overturning it. ",
    "controversiality": 0,
    "ups": 295,
    "downs": 0,
    "score": 295,
    "created": 1511324510.0,
    "date_created": "2017-11-21",
    "time_created": "15:21:50",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5ttd1",
    "parent_id": "t1_dq5lf85",
    "subreddit_name_prefixed": "r/politics",
    "body": "Because he hoped that shill-bots would dominate and not get caught.",
    "controversiality": 0,
    "ups": 71,
    "downs": 0,
    "score": 71,
    "created": 1511330567.0,
    "date_created": "2017-11-21",
    "time_created": "17:02:47",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5r26s",
    "parent_id": "t1_dq5lf85",
    "subreddit_name_prefixed": "r/politics",
    "body": "The only thing that matters is voting and unusually large and sustained protests. The latter, as awesome as it may sound, is actually very rare and hard to pull off and still not a sure thing. Ultimately, 1 day doesn’t really change anything no matter how many people turn up though it can help if those in power are more sympathetic to what the protesters are protesting about. Republicans do not give a shit.\n\nOverall, voting is much easier and more likely to have an effect. Not to mention constant emails, phone calls, petitions, protests etc. for these things Republicans and Trump are set on doing is fucking exhausting. \n\nYou can be lazy on one day and skip voting and then spend the next 4-8 years pouring so much energy into resisting all of the terrible things the Republicans want to do and end up doing or you take the hour or two to vote and then get to relax a bit for 4 years and occasionally protest over a few things and often (not always) actually have those in power listen.",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1511327879.0,
    "date_created": "2017-11-21",
    "time_created": "16:17:59",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5r9ba",
    "parent_id": "t1_dq5lf85",
    "subreddit_name_prefixed": "r/politics",
    "body": "Welcome to your oligarchy, you’ve actually been here for years.",
    "controversiality": 0,
    "ups": 61,
    "downs": 0,
    "score": 61,
    "created": 1511328071.0,
    "date_created": "2017-11-21",
    "time_created": "16:21:11",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5rrp5",
    "parent_id": "t1_dq5lf85",
    "subreddit_name_prefixed": "r/politics",
    "body": "Another failed attempt to reach out to Ajit \"Notice me sen-\" Pai",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1511328564.0,
    "date_created": "2017-11-21",
    "time_created": "16:29:24",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5vuch",
    "parent_id": "t1_dq5lf85",
    "subreddit_name_prefixed": "r/politics",
    "body": "There wasn’t one. The “OMG by sending in this stock comment that our website made up you’ll help save net neutrality” stuff was always selling laypeople a bill of goods. This is basic admin law stuff, agencies have to account for and respond to the substance of comments they receive, no weight has to be given to sheer volume.\n\nIn the same way that even if a resounding majority of Americans opposed the inclusion of greenhouse gasses in EPA regulations, the EPA can still have done it.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511332718.0,
    "date_created": "2017-11-21",
    "time_created": "17:38:38",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5y1uf",
    "parent_id": "t1_dq5lf85",
    "subreddit_name_prefixed": "r/politics",
    "body": "The public comments period assumes that the agency is operating in good faith and trying to fulfill its duties to the public. The theory is that even when the agency is trying its best, it's good to have input from people that will be affected so that they can fix issues before the rules are actually enacted. If the agency doesn't actually care about the people affected, then the comments period is just a formality.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511335187.0,
    "date_created": "2017-11-21",
    "time_created": "18:19:47",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5o8jj",
    "parent_id": "t1_dq5ld75",
    "subreddit_name_prefixed": "r/politics",
    "body": "Tell him how you feel.  \n  \nAjit Pai, FCC Chairman: 1-202-418-1000  \n  \nReddit won't let me post the rest of the FCC contact information, something with the formatting and the automod, I think.  You can click [here, to go to the FCC's official contact page.](https://www.fcc.gov/about/contact)\n\nYou need to contact your representatives and senators about **Net Neutrality** even if they already support it, but *especially* if they don't.   \n  \nRemember that this very thread is only possible because of a free and open internet; kill net neutrality and threads like this might be a thing of the past.\n\nEasy way #1:\n  \nStep 1: Go to [BattleForTheNet.com.](https://www.battleforthenet.com/)  \nStep 2: Do what [BattleForTheNet.com](https://www.battleforthenet.com/) tells you to do.  \n  \n---  \n  \nEasy way #2:  \n  \nText RESIST to 50409, and they'll walk you through the process.  (I've been told.  I've never done it myself.  Fees and whatnot may apply.)  \n\n---\n \nThe harder, but still very easy way:\n\nStep 1:  Find out who your Representative and Senator is/are.  \n  \n * [Find your Representative.](https://www.house.gov/representatives/find-your-representative)  \n * [Find your Senator.](https://www.senate.gov/senators/contact/)  \n * [Local elected officials.](https://www.usa.gov/elected-officials)  \n\n\nStep 2: Find your Representative and Senator's contact information.  \n\n * [5calls.org has a decent repository of Representatives and Senators contact information, though the site is a bit difficult to navigate.](https://5calls.org/)  \n * [Call My Congress just asks for your zip code and tells you what district you live in, who your Representatives are, and how to contact them.](https://www.callmycongress.com/)\n * [DailyKos has a list of *all* of our Senator's phone numbers, not just the DC office.](https://www.dailykos.com/stories/2017/2/2/1629046/-Call-your-senator-Phone-numbers-for-every-office-of-every-U-S-senator)  (Current as of February, 2017.)  \n * FaxZero has a system set up allowing you to fax your [Representatives](https://faxzero.com/fax_congress.php) and [Senators](https://faxzero.com/fax_senate.php) for free!  (Faxes are good if you can't get through on the phone lines, or just if you want congressional staffers to listen to fax machine noises until Net Neutrality is safe.)  \n \n  * [Fax Congress](https://faxzero.com/fax_congress.php)  \n  * [Fax Senators](https://faxzero.com/fax_senate.php)  \n  \nStep 3: Call, write, or fax to express your feelings on this.  \n  \nA lot of people are nervous about calling their elected officials for the first time, maybe you don't know what to say, or how to say it, or even who you'll be talking to, so here's what you'll need to know.  \n  \n1. There's a 75% chance your call will be answered by a Secretary who is specifically there to listen to your concerns, there's a 25% chance your call will be bumped into a voicemail box which is specifically there to listen to your concerns, there is a ~0% chance you'll find yourself on the phone with your Senator or Representative.  \n  \n2.  You may be asked for your name and address or zip code, it's okay not to tell them if you don't want to, but the information *is* useful for your elected officials.  I usually just give my first name, zip code, and the name of my town.  \n  \n3.  Don't worry about a script, don't worry about being eloquent, you're not writing Shakespeare here, you're a concerned citizen voicing their frustrations, fears, and hopes.  \"I'm really scared of Ajit Pai's plans to roll back net neutrality, a free and open internet is important to me because [Your reason here.  Some suggestions: An open internet is important to democracy/I worry what Donald Trump might do with more power/Cable bills are already too high/etc.].  Please tell [Senator or Representative] that I support a free and open internet, I support Net Neutrality, ***and I vote.***\"  The only hard and fast rule is that you need to be polite; these folks are getting dozens, if not hundreds of calls a day, they don't need you bitching and swearing at them for something they have no control over.  Be passionate, but be polite.  \n  \nReminder: ***Only call YOUR OWN elected officials!***  Calling Mitch McConnell from sunny Florida won't do anyone any good, and might actually harm the cause.  Only call your own elected officials, period.  \n\n---\n  \nSpread this information around, you can click **\"source\"** at the bottom of the comment to see an unformatted copy of this post that you can copy and paste.  This is important stuff!  ",
    "controversiality": 0,
    "ups": 1238,
    "downs": 0,
    "score": 1238,
    "created": 1511325176.0,
    "date_created": "2017-11-21",
    "time_created": "15:32:56",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5y7td",
    "parent_id": "t1_dq5ld75",
    "subreddit_name_prefixed": "r/politics",
    "body": "I wrote two letters to my rep who is unfortunately Rohrabacher (R) and the response was a you would expect. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511335378.0,
    "date_created": "2017-11-21",
    "time_created": "18:22:58",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5pho5",
    "parent_id": "t1_dq5oefe",
    "subreddit_name_prefixed": "r/politics",
    "body": "An honestly, they'll probably lose...at least at the present.  What worries me is how deeply they're stacking the courts now.  They just need to bide their time a bit and even the judiciary will be complicit.\n\nThis is what it looks like when empires die.",
    "controversiality": 0,
    "ups": 575,
    "downs": 0,
    "score": 575,
    "created": 1511326375.0,
    "date_created": "2017-11-21",
    "time_created": "15:52:55",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5wr8c",
    "parent_id": "t1_dq5oefe",
    "subreddit_name_prefixed": "r/politics",
    "body": "I️ worked in environmental law this summer and successfully invoked these to stop the Trump administration from rolling back certain regs. These are effective prohibitions on unlawful agency action. ",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1511333728.0,
    "date_created": "2017-11-21",
    "time_created": "17:55:28",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5shtf",
    "parent_id": "t1_dq5oefe",
    "subreddit_name_prefixed": "r/politics",
    "body": "Everyone made fun of me 1L year because I loved Admin Law and kept saying how relevant its going to be. Who would have thought Donald Trump would be making administrative law sexy again. IIRC the concise general statement comes after the vote.  Then under the citizen suit provision one would challenge it and (assuming no mention of the comments in the CGS) use, inter alia, that inadequate CGS as part of their argument for why its an inadequate final agency action.  \n\nThe American in me is appalled and doing what I can do take action, but from a detached admin law filter these questions are fascinating. ",
    "controversiality": 0,
    "ups": 68,
    "downs": 0,
    "score": 68,
    "created": 1511329268.0,
    "date_created": "2017-11-21",
    "time_created": "16:41:08",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5wok6",
    "parent_id": "t1_dq5oefe",
    "subreddit_name_prefixed": "r/politics",
    "body": "Hey! would those laws also apply to the National monument review in which they also completely blew off the 95% of comments in support of the current monument boundaries?",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1511333647.0,
    "date_created": "2017-11-21",
    "time_created": "17:54:07",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xq4b",
    "parent_id": "t1_dq5oefe",
    "subreddit_name_prefixed": "r/politics",
    "body": "Does suing the government even work anymore?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511334813.0,
    "date_created": "2017-11-21",
    "time_created": "18:13:33",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq60f0k",
    "parent_id": "t1_dq5oefe",
    "subreddit_name_prefixed": "r/politics",
    "body": "> This may violate the Administrative Procedure Act. First, there is an argument to be made that it violates section 553 (c) which requires a concise general statement as to why they ignored the vast majority of comments against the rule\n\nAn argument can be made that *what* violates 553? The final rule hasn’t been adopted yet, and the speculation that they might fail to address the substance of those comments is... well, pure speculation.\n\nBut it’s important to be clear on what the APA requires.\n\n>requires a concise general statement as to why they ignored the vast majority of comments against the rule\n\nNo, it doesn’t. The agency has no obligation to address what constituted the “vast majority” of comments, only to address the substantive arguments and evidence raised by those comments. An agency *may* consider predominant public opinion, but is not bound by it nor bound by explaining why they didn’t follow “the vast majority of comments.”\n\n>one can argue it violates section 706 (2)(a) which holds unlawful and sets aside agency action, findings, and conclusions found to be arbitrary and capricious, an abuse of discretion, or otherwise not in accordance with law.\n\nOne can, but is unlikely to be successful. Absent a statutory requirement that “how many people support the rule versus opposing it” be a factor to be considered (NB: such a statutory requirement does not exist here), the number of comments is irrelevant. Which means we’re in traditional informal rulemaking analysis. \n\nAnd as the Court has repeatedly explained, the courts are not meant to override an agency on a matter of policy based solely on disagreeing with the agency’s view of the right policy. *See Motor Vehicle Mfrs. Ass’n v. State Farm Mut. Ins. Co.*, 463 U.S. 29 (1983)\n\nOr, to put it more simply:\n\nAn agency is not required to prove that it made a good decision, only that its “explanation [demonstrate] that it examined the data, considered the relevant factors, and made a reasonable judgment based on the record.” *MD Pharm., Inc. v. Drug Enforcement Admin.*, 133 F.3d 8, 16 (D.C. Cir. 1998).",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511337966.0,
    "date_created": "2017-11-21",
    "time_created": "19:06:06",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5vmwu",
    "parent_id": "t1_dq5uxr8",
    "subreddit_name_prefixed": "r/politics",
    "body": "Let us not forget that the Cable companies own the last mile which you as taxpayers subsidized in the 80s and 90s as well as provided free use of right of way.  Yeah we are paying and have never been repaid for the investment.  ",
    "controversiality": 0,
    "ups": 117,
    "downs": 0,
    "score": 117,
    "created": 1511332496.0,
    "date_created": "2017-11-21",
    "time_created": "17:34:56",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5tet4",
    "parent_id": "t1_dq5s1o0",
    "subreddit_name_prefixed": "r/politics",
    "body": "Which is why Ajit wanted to lower the standard for broadband. So more and more of these contracts can be \"met\" ",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1511330156.0,
    "date_created": "2017-11-21",
    "time_created": "16:55:56",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq6c4oh",
    "parent_id": "t1_dq5s1o0",
    "subreddit_name_prefixed": "r/politics",
    "body": ">Pai writes that the 2015 rules have “depressed investment in building and expanding broadband networks and deterred innovation.”\n\nI'd like to see him back that up with *any* non-ISP involved source.\n\nThe local internet in my area switched from 10mb for $100 a month to 50mb for $100 a month (100mb is $200!) overnight because of Title 2. After the local ISP said for a decade that they couldn't do it, and gave every excuse in the book. No competition for 30 years because of some bullshit agreement with the county or some bull allowed them to fuck over every consumer in the area. And seeing as it was the only internet besides Satellite, people didn't have a choice.\n\nFucking crooks, all of them.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511352785.0,
    "date_created": "2017-11-21",
    "time_created": "23:13:05",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5odcv",
    "parent_id": "t1_dq5mbgm",
    "subreddit_name_prefixed": "r/politics",
    "body": "If you use Tiki torches, the president will be cool with it. ",
    "controversiality": 0,
    "ups": 495,
    "downs": 0,
    "score": 495,
    "created": 1511325306.0,
    "date_created": "2017-11-21",
    "time_created": "15:35:06",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5s7ic",
    "parent_id": "t1_dq5mbgm",
    "subreddit_name_prefixed": "r/politics",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 72,
    "downs": 0,
    "score": 72,
    "created": 1511328999.0,
    "date_created": "2017-11-21",
    "time_created": "16:36:39",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5nj4r",
    "parent_id": "t1_dq5mbgm",
    "subreddit_name_prefixed": "r/politics",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1511324501.0,
    "date_created": "2017-11-21",
    "time_created": "15:21:41",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5p4h4",
    "parent_id": "t1_dq5mbgm",
    "subreddit_name_prefixed": "r/politics",
    "body": "Gain the skills for proper pitchfork maintenance at /r/SocialistRA . A gun organization for people who hate Trump.",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1511326022.0,
    "date_created": "2017-11-21",
    "time_created": "15:47:02",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xvdj",
    "parent_id": "t1_dq5mbgm",
    "subreddit_name_prefixed": "r/politics",
    "body": "Honestly, I think it's time for 22 million people to walk onto the capital, peacefully make their way into both chambers of congress and the FCC headquarters and send a very, very loud message. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511334983.0,
    "date_created": "2017-11-21",
    "time_created": "18:16:23",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zsmz",
    "parent_id": "t1_dq5mbgm",
    "subreddit_name_prefixed": "r/politics",
    "body": "When is strong-arming a realistic alternative? We're being actively ignored and there isn't any sign (to me anyway) of this going our way. I'm going mad with all this shit we're doing for naught. What other options do we have? ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511337212.0,
    "date_created": "2017-11-21",
    "time_created": "18:53:32",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xtap",
    "parent_id": "t1_dq5mbgm",
    "subreddit_name_prefixed": "r/politics",
    "body": "Well since cable companies are getting greedy by trying to change the rules by buying there way into the FCC then I guess 22 million new pirates will help them understand how the free market really works.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511334916.0,
    "date_created": "2017-11-21",
    "time_created": "18:15:16",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5n8bs",
    "parent_id": "t1_dq5mvrj",
    "subreddit_name_prefixed": "r/politics",
    "body": "Damn, so mad you are getting out the gypsy curses. I would be ok if this actually happens to him. ",
    "controversiality": 0,
    "ups": 291,
    "downs": 0,
    "score": 291,
    "created": 1511324213.0,
    "date_created": "2017-11-21",
    "time_created": "15:16:53",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5nid1",
    "parent_id": "t1_dq5mvrj",
    "subreddit_name_prefixed": "r/politics",
    "body": "This might be the best curse I've seen all year.",
    "controversiality": 0,
    "ups": 59,
    "downs": 0,
    "score": 59,
    "created": 1511324482.0,
    "date_created": "2017-11-21",
    "time_created": "15:21:22",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5qv43",
    "parent_id": "t1_dq5mvrj",
    "subreddit_name_prefixed": "r/politics",
    "body": "I hope his dog hates him.",
    "controversiality": 0,
    "ups": 45,
    "downs": 0,
    "score": 45,
    "created": 1511327688.0,
    "date_created": "2017-11-21",
    "time_created": "16:14:48",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5pqdi",
    "parent_id": "t1_dq5mvrj",
    "subreddit_name_prefixed": "r/politics",
    "body": "And may your Reese's cup fall to the floor and shatter in a million pieces.",
    "controversiality": 0,
    "ups": 88,
    "downs": 0,
    "score": 88,
    "created": 1511326602.0,
    "date_created": "2017-11-21",
    "time_created": "15:56:42",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xbjg",
    "parent_id": "t1_dq5mvrj",
    "subreddit_name_prefixed": "r/politics",
    "body": "\"A day will come when you think yourself safe and happy, and suddenly your joy will turn to ashes in your mouth, and you'll know the debt is paid.” -Tyrion Lannister ",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1511334354.0,
    "date_created": "2017-11-21",
    "time_created": "18:05:54",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xrpu",
    "parent_id": "t1_dq5mvrj",
    "subreddit_name_prefixed": "r/politics",
    "body": "> ...Pai... May all your Netflix buffer like shit.\n\n",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1511334864.0,
    "date_created": "2017-11-21",
    "time_created": "18:14:24",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5yqga",
    "parent_id": "t1_dq5mvrj",
    "subreddit_name_prefixed": "r/politics",
    "body": "I would give you gold but I now have to pay a 9.99 fee to Comcast. Thanks pai",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511335977.0,
    "date_created": "2017-11-21",
    "time_created": "18:32:57",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zeva",
    "parent_id": "t1_dq5mvrj",
    "subreddit_name_prefixed": "r/politics",
    "body": "Fuck Trump.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511336762.0,
    "date_created": "2017-11-21",
    "time_created": "18:46:02",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5sxfo",
    "parent_id": "t1_dq5mvrj",
    "subreddit_name_prefixed": "r/politics",
    "body": "Luxor nuxor burst and burn!",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511329679.0,
    "date_created": "2017-11-21",
    "time_created": "16:47:59",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq62con",
    "parent_id": "t1_dq5mvrj",
    "subreddit_name_prefixed": "r/politics",
    "body": "I legit hope he has a heart attack. Not something I'd say about basically anyone else.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511340356.0,
    "date_created": "2017-11-21",
    "time_created": "19:45:56",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5wcux",
    "parent_id": "t1_dq5qamt",
    "subreddit_name_prefixed": "r/politics",
    "body": "The sad truth is that most people won't realize what this is until it actually starts to affect them.  I can guarantee next year when my parent's internet bill goes up and they start bitching about it, the \"I told you so\" is going to fall on deaf ears.  ",
    "controversiality": 0,
    "ups": 98,
    "downs": 0,
    "score": 98,
    "created": 1511333287.0,
    "date_created": "2017-11-21",
    "time_created": "17:48:07",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq62pat",
    "parent_id": "t1_dq5qamt",
    "subreddit_name_prefixed": "r/politics",
    "body": "In all honesty, why is it so remote a possibility for Americans that Politicians, Tyrants and other corrupt Fat Cats meet the guillotine?\n\nGreat moments of History were defined by such acts.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511340788.0,
    "date_created": "2017-11-21",
    "time_created": "19:53:08",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq608ig",
    "parent_id": "t1_dq5qamt",
    "subreddit_name_prefixed": "r/politics",
    "body": "That's what gets me.  Why the fuck did anyone think the FCC would give two shits about anyone's commentary??? They don't give a shit about the consumer.  Pai represents the telecom industry; theirs is the only commentary that matters.  Furthermore, he's not an elected official.  What does he care for the will of the electorate?  We don't have any impact on his job security at all, not while Trump is in office, and probably not while Pence is in office either.  \n\nEdit: And after Pai's term is done he's going to get a nice fat paycheck as a lobbyist because no one is going to do shit about campaign finance reform either.  No one wants to give up the revenue stream, nor the promise of landing a lobbying job after their term in Congress is finished.  The whole rotten system needs to be burned to the ground.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511337744.0,
    "date_created": "2017-11-21",
    "time_created": "19:02:24",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zhnm",
    "parent_id": "t1_dq5qamt",
    "subreddit_name_prefixed": "r/politics",
    "body": "The GOP has been fighting against democracy for decades.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511336854.0,
    "date_created": "2017-11-21",
    "time_created": "18:47:34",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5yx39",
    "parent_id": "t1_dq5qamt",
    "subreddit_name_prefixed": "r/politics",
    "body": "They've really wiped their asses with John Locke's concept of \"consent of the governed\" here.\n\nThe FCC knows for a fact that the overwhelming majority of people support net neutrality, they just don't give a fuck. \n\nDemocracy is dead. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511336191.0,
    "date_created": "2017-11-21",
    "time_created": "18:36:31",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq62c46",
    "parent_id": "t1_dq5qamt",
    "subreddit_name_prefixed": "r/politics",
    "body": "I think people have had enough of this. **WE NEED SOMEONE TO ORGANIZE US AND DIRECT US SYSTEMATICALLY TO SHOW THE GOVERNMENT THAT THIS IS OUR SHIT, NOT THEIRS**",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511340337.0,
    "date_created": "2017-11-21",
    "time_created": "19:45:37",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq6606z",
    "parent_id": "t1_dq5qamt",
    "subreddit_name_prefixed": "r/politics",
    "body": "We lost this fight the night Trump won the election. This was part of the stakes. Unfortunately that wasn't enough to get enough people to stomach voting for Hillary even if she wasn't Obama or Bernie. At least we could have treaded water with her but now we are sinking. I hope people are learning their lesson for next time.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511344872.0,
    "date_created": "2017-11-21",
    "time_created": "21:01:12",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq6c39b",
    "parent_id": "t1_dq5qamt",
    "subreddit_name_prefixed": "r/politics",
    "body": "Time for the pitchforks boys! ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511352727.0,
    "date_created": "2017-11-21",
    "time_created": "23:12:07",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xyrr",
    "parent_id": "t1_dq5tjd9",
    "subreddit_name_prefixed": "r/politics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 103,
    "downs": 0,
    "score": 103,
    "created": 1511335092.0,
    "date_created": "2017-11-21",
    "time_created": "18:18:12",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xoyk",
    "parent_id": "t1_dq5tjd9",
    "subreddit_name_prefixed": "r/politics",
    "body": "When do we riot?",
    "controversiality": 0,
    "ups": 121,
    "downs": 0,
    "score": 121,
    "created": 1511334775.0,
    "date_created": "2017-11-21",
    "time_created": "18:12:55",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5y7oz",
    "parent_id": "t1_dq5tjd9",
    "subreddit_name_prefixed": "r/politics",
    "body": "No taxation without representation, or is that not something America cares about anymore?",
    "controversiality": 0,
    "ups": 45,
    "downs": 0,
    "score": 45,
    "created": 1511335374.0,
    "date_created": "2017-11-21",
    "time_created": "18:22:54",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xr23",
    "parent_id": "t1_dq5tjd9",
    "subreddit_name_prefixed": "r/politics",
    "body": "Would it be wrong to add our electoral college to that list?",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1511334843.0,
    "date_created": "2017-11-21",
    "time_created": "18:14:03",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq61slj",
    "parent_id": "t1_dq5tjd9",
    "subreddit_name_prefixed": "r/politics",
    "body": "> our government is no longer acting in line\n\nRepublicans. It's fucking republicans. Get it right.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511339656.0,
    "date_created": "2017-11-21",
    "time_created": "19:34:16",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zd5p",
    "parent_id": "t1_dq5tjd9",
    "subreddit_name_prefixed": "r/politics",
    "body": "Isn't this what you Americans have guns for?",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511336706.0,
    "date_created": "2017-11-21",
    "time_created": "18:45:06",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5yoih",
    "parent_id": "t1_dq5tjd9",
    "subreddit_name_prefixed": "r/politics",
    "body": "It's an oligarchy. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511335914.0,
    "date_created": "2017-11-21",
    "time_created": "18:31:54",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq62grw",
    "parent_id": "t1_dq5x408",
    "subreddit_name_prefixed": "r/politics",
    "body": "I used the site and they put me through to my representative, unfortunately it went straight to voicemail and the automated message said the inbox was full. What is the next best step I can take?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511340496.0,
    "date_created": "2017-11-21",
    "time_created": "19:48:16",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zp3h",
    "parent_id": "t1_dq5xqo8",
    "subreddit_name_prefixed": "r/politics",
    "body": "The thing is, they’ve thrown so many critically important things at us that we need to fight for, that it’s getting exhausting. Healthcare signups and funding slashed by huge margins so people can blame Obama for not having healthcare. The INSANE tax bill they’re trying to push through that would make grad students pay additional taxes on their tuition remission of all things, and now they’re being super shady about trying to find the perfect time to get rid of NN. I’m not sure what more we can do.",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1511337095.0,
    "date_created": "2017-11-21",
    "time_created": "18:51:35",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5y6z1",
    "parent_id": "t1_dq5p9yc",
    "subreddit_name_prefixed": "r/politics",
    "body": "[98.5% of unique net neutrality comments oppose Ajit Pai’s anti-Title II plan](https://arstechnica.com/tech-policy/2017/08/isp-funded-study-finds-huge-support-for-keeping-current-net-neutrality-rules/)\n\nSo, of the comments by actual human beings... it's overwhelmingly opposed. \n\n",
    "controversiality": 0,
    "ups": 68,
    "downs": 0,
    "score": 68,
    "created": 1511335352.0,
    "date_created": "2017-11-21",
    "time_created": "18:22:32",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5rywi",
    "parent_id": "t1_dq5p9yc",
    "subreddit_name_prefixed": "r/politics",
    "body": "Well, if the telecoms presented a study that said they were the best and everyone loved them, you're right, we should just take their study as fact.",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1511328762.0,
    "date_created": "2017-11-21",
    "time_created": "16:32:42",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq621sl",
    "parent_id": "t1_dq5p9yc",
    "subreddit_name_prefixed": "r/politics",
    "body": "So if we all write *physical* letters to the FCC explaining our discontent with the repeal of Net Neutrality, will that have a better effect? Will he have to listen? Because surely every one of us can write a single letter to a single person, and mail it out by the end of this week? \n\nBuy Envelopes at your local Staples or other stationary store. \n\nType and print out your letter at your local library or university.\n\nStamps only cost $0.49. At least we'll be helping out the US postal service :) \n\nGotta do this the old fashioned way, if we're going to get through to these people. Mail in your letters to your congressmen and senators while your'e at it. Flood their literal mailboxes! ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511339981.0,
    "date_created": "2017-11-21",
    "time_created": "19:39:41",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5tije",
    "parent_id": "t1_dq5p9yc",
    "subreddit_name_prefixed": "r/politics",
    "body": "I'm betting that Pai's moron-logic for his future court date is a \"both sides\" issue:\n\n\"Well there were bots for one side of the issue, how were we to really dive into how many legitimate comments there were on the other side. For all we know those people just used better bots. Since we can't really tell which comments are authentic, we can't really use the comment system to actually inform our opinion with any certainty...so we really should be allowed to have our decision stand.\"",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511330258.0,
    "date_created": "2017-11-21",
    "time_created": "16:57:38",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5yr08",
    "parent_id": "t1_dq5swfc",
    "subreddit_name_prefixed": "r/politics",
    "body": "But the government doesn't give a f*ck because they are more loyal to companies than the American people.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511335994.0,
    "date_created": "2017-11-21",
    "time_created": "18:33:14",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq65bc9",
    "parent_id": "t1_dq5swfc",
    "subreddit_name_prefixed": "r/politics",
    "body": "Because the gov doesn't have to actually obey petitions",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511344015.0,
    "date_created": "2017-11-21",
    "time_created": "20:46:55",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq6ewgb",
    "parent_id": "t1_dq5swfc",
    "subreddit_name_prefixed": "r/politics",
    "body": "People on the Donald are literally saying they are against NN just because liberals aren't. So you have a good idea what kind of people are for NN and who's signing that.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511356950.0,
    "date_created": "2017-11-22",
    "time_created": "00:22:30",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5t6a7",
    "parent_id": "t1_dq5oi41",
    "subreddit_name_prefixed": "r/politics",
    "body": "I can't wait for telcos to get brazenly obvious about this and suddenly Congresscritters that take their money have insta-load times for their websites and their donation services, but for some reason that I can't quite put my finger, their opponent's site takes forever to load and when I try making a donation it always times out.\n\nMust be their servers, couldn't possibly be anything else....",
    "controversiality": 0,
    "ups": 82,
    "downs": 0,
    "score": 82,
    "created": 1511329923.0,
    "date_created": "2017-11-21",
    "time_created": "16:52:03",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5x2d0",
    "parent_id": "t1_dq5oi41",
    "subreddit_name_prefixed": "r/politics",
    "body": "1. We can focus on both social and economic issues, it’s not a binary (and they’re often intertwined). \n\n2. Try telling the democratic base, who is made up of racial and ethnic minorities, LGBT folk and women that we need to focus on “real issues” and drop social change, see how fast democrats lose elections without them",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1511334064.0,
    "date_created": "2017-11-21",
    "time_created": "18:01:04",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq63p49",
    "parent_id": "t1_dq5oi41",
    "subreddit_name_prefixed": "r/politics",
    "body": "I mean. Those second amendment people can always exercise their second amendment rights that they care about so much.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511342017.0,
    "date_created": "2017-11-21",
    "time_created": "20:13:37",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq62jvc",
    "parent_id": "t1_dq5oi41",
    "subreddit_name_prefixed": "r/politics",
    "body": "The internet will survive, and this issue will eventually be addressed by the supreme court as a freedom of speech issue. \n\nMaybe the next president will address it as well, because god knows trump won't get a 2nd term. \n\nBut for now the battle is most likely lost. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511340604.0,
    "date_created": "2017-11-21",
    "time_created": "19:50:04",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5n5ki",
    "parent_id": "t1_dq5mf4g",
    "subreddit_name_prefixed": "r/politics",
    "body": "Technicalities.\n\n1) Hillary won the popular vote.\n\n2) Trump voters, in their mind, were voting to ~~screw~~ express contempt for other people.",
    "controversiality": 0,
    "ups": 104,
    "downs": 0,
    "score": 104,
    "created": 1511324144.0,
    "date_created": "2017-11-21",
    "time_created": "15:15:44",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5mys5",
    "parent_id": "t1_dq5mf4g",
    "subreddit_name_prefixed": "r/politics",
    "body": "So basically we better not screw it up in the midterms, or next time.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511323966.0,
    "date_created": "2017-11-21",
    "time_created": "15:12:46",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5scj9",
    "parent_id": "t1_dq5rgoy",
    "subreddit_name_prefixed": "r/politics",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1511329131.0,
    "date_created": "2017-11-21",
    "time_created": "16:38:51",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5za7v",
    "parent_id": "t1_dq5rgoy",
    "subreddit_name_prefixed": "r/politics",
    "body": "He's just scum. Wants to fuck the US because greed.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511336612.0,
    "date_created": "2017-11-21",
    "time_created": "18:43:32",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5pw46",
    "parent_id": "t1_dq5mo6l",
    "subreddit_name_prefixed": "r/politics",
    "body": "But THEIR version of authoritarianism will be *different(tm)*.",
    "controversiality": 0,
    "ups": 202,
    "downs": 0,
    "score": 202,
    "created": 1511326753.0,
    "date_created": "2017-11-21",
    "time_created": "15:59:13",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5y46c",
    "parent_id": "t1_dq5mo6l",
    "subreddit_name_prefixed": "r/politics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 63,
    "downs": 0,
    "score": 63,
    "created": 1511335262.0,
    "date_created": "2017-11-21",
    "time_created": "18:21:02",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5prcx",
    "parent_id": "t1_dq5mo6l",
    "subreddit_name_prefixed": "r/politics",
    "body": "The party of \"How can we charge for this?\"",
    "controversiality": 0,
    "ups": 62,
    "downs": 0,
    "score": 62,
    "created": 1511326627.0,
    "date_created": "2017-11-21",
    "time_created": "15:57:07",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5pfln",
    "parent_id": "t1_dq5mo6l",
    "subreddit_name_prefixed": "r/politics",
    "body": "I read that as librarians... Leave them out of this!",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1511326320.0,
    "date_created": "2017-11-21",
    "time_created": "15:52:00",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zbk3",
    "parent_id": "t1_dq5mo6l",
    "subreddit_name_prefixed": "r/politics",
    "body": "You know political views are generally on a spectrum right? It is perfectly possible to be mostly libertarian, but still believe in some reasonable levels of regulation.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511336655.0,
    "date_created": "2017-11-21",
    "time_created": "18:44:15",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5ym83",
    "parent_id": "t1_dq5mo6l",
    "subreddit_name_prefixed": "r/politics",
    "body": "I'm a libertarian. Killing net neutrality is dumb. It has nothing to do with individual liberty and everything to do with politicians accepting bribes and FCC chairs having ties to corporations.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511335839.0,
    "date_created": "2017-11-21",
    "time_created": "18:30:39",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq61b63",
    "parent_id": "t1_dq5r2jp",
    "subreddit_name_prefixed": "r/politics",
    "body": "Americans are far too lazy, they will do nothing.\n\n(attempting reverse psychology. It is time for you to do something. Up to you...)",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1511339062.0,
    "date_created": "2017-11-21",
    "time_created": "19:24:22",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq690x6",
    "parent_id": "t1_dq5ravq",
    "subreddit_name_prefixed": "r/politics",
    "body": "The groundwork to silence dissenters is being put into place as we speak, that's the whole idea.  The time to rise up is quickly running out.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511348649.0,
    "date_created": "2017-11-21",
    "time_created": "22:04:09",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5z3b3",
    "parent_id": "t1_dq5ravq",
    "subreddit_name_prefixed": "r/politics",
    "body": "But that very thing is what got trump elected, isn’t it? Rather than an armed insurrection by disenfranchised citizens, we got this. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511336391.0,
    "date_created": "2017-11-21",
    "time_created": "18:39:51",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq603xy",
    "parent_id": "t1_dq5zr6y",
    "subreddit_name_prefixed": "r/politics",
    "body": "If only he gave a shit.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511337592.0,
    "date_created": "2017-11-21",
    "time_created": "18:59:52",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5va1s",
    "parent_id": "t1_dq5ttlw",
    "subreddit_name_prefixed": "r/politics",
    "body": "\n\nIf we can't stand up and fight this what makes you think we will 'oust these fuckers'?",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1511332113.0,
    "date_created": "2017-11-21",
    "time_created": "17:28:33",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5y7s5",
    "parent_id": "t1_dq5ucry",
    "subreddit_name_prefixed": "r/politics",
    "body": "Businesses would need to shut down. \n\nHonestly Google and Amazon could end this right now by protesting the government and protesting by shutting down their services. Imagine if every Amazon and Gooogle service went offline for just 1 day. The amount of business andbmoney that would be lost is insane.",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1511335377.0,
    "date_created": "2017-11-21",
    "time_created": "18:22:57",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5ykew",
    "parent_id": "t1_dq5ucry",
    "subreddit_name_prefixed": "r/politics",
    "body": "Some people? More than half the people I know rely on the internet.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1511335783.0,
    "date_created": "2017-11-21",
    "time_created": "18:29:43",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5uisl",
    "parent_id": "t1_dq5ucry",
    "subreddit_name_prefixed": "r/politics",
    "body": "Ill unplug for our country! for our people! for our freedom!",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1511331308.0,
    "date_created": "2017-11-21",
    "time_created": "17:15:08",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq60pya",
    "parent_id": "t1_dq5pskx",
    "subreddit_name_prefixed": "r/politics",
    "body": "Yeah it's the lefts fault. If they would have allowed them to deregulate more then this never would have happened!!!! ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511338336.0,
    "date_created": "2017-11-21",
    "time_created": "19:12:16",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq625iw",
    "parent_id": "t1_dq5zd5i",
    "subreddit_name_prefixed": "r/politics",
    "body": "Do you actually think that residential internet is a money maker for these corporations ? \n\n22 Million less residental accounts would barely make a dent. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511340109.0,
    "date_created": "2017-11-21",
    "time_created": "19:41:49",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq694qe",
    "parent_id": "t1_dq684rt",
    "subreddit_name_prefixed": "r/politics",
    "body": "> Guess we can get rid of the FDA and EPA too.\n\nI don't know about the FDA, but have you seen what Scott Pruitt's doing to the EPA? They literally are doing that.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511348783.0,
    "date_created": "2017-11-21",
    "time_created": "22:06:23",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5mcnh",
    "parent_id": "t1_dq5m5hh",
    "subreddit_name_prefixed": "r/politics",
    "body": "\\* \"for the ~~people~~ corporate personhoods by the ~~people~~ corporate personhoods\" ",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1511323380.0,
    "date_created": "2017-11-21",
    "time_created": "15:03:00",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zsmb",
    "parent_id": "t1_dq5z8xw",
    "subreddit_name_prefixed": "r/politics",
    "body": "It only takes one leading voice for people to realize. It sucks that most people I meet are so uninformed..\nAnd it also sucks that most Republics have turned into some sort of Feudalism, its sad it feels we'll never evolve. Sorry for the rant, just keep meeting people that are captive on consumerism and dont care about their fellow humans.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511337212.0,
    "date_created": "2017-11-21",
    "time_created": "18:53:32",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5ulro",
    "parent_id": "t1_dq5nnnz",
    "subreddit_name_prefixed": "r/politics",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1511331393.0,
    "date_created": "2017-11-21",
    "time_created": "17:16:33",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5pfm3",
    "parent_id": "t1_dq5nnnz",
    "subreddit_name_prefixed": "r/politics",
    "body": "Yes. Only the foolish make threats. A wise decision.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511326320.0,
    "date_created": "2017-11-21",
    "time_created": "15:52:00",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq621sn",
    "parent_id": "t1_dq5vgs6",
    "subreddit_name_prefixed": "r/politics",
    "body": "I feel the exact same way, sadly the government is going to fuck up the greatest thing the world has ever produced, and there is nothing that we can do about it. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511339981.0,
    "date_created": "2017-11-21",
    "time_created": "19:39:41",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq69swn",
    "parent_id": "t1_dq69cpn",
    "subreddit_name_prefixed": "r/politics",
    "body": "Those two things are linked",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511349651.0,
    "date_created": "2017-11-21",
    "time_created": "22:20:51",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5tgc6",
    "parent_id": "t1_dq5py9c",
    "subreddit_name_prefixed": "r/politics",
    "body": "**No, please don't copy paste!!!**\n\nThat's how the FCC is arguing to ignore such comments.  I encourage people to copy the ideas, but we each have to write our own letter and use our own words.  They should not show up as duplicate and potentially marked as being bot-generated.",
    "controversiality": 0,
    "ups": 82,
    "downs": 0,
    "score": 82,
    "created": 1511330196.0,
    "date_created": "2017-11-21",
    "time_created": "16:56:36",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5uji4",
    "parent_id": "t1_dq5py9c",
    "subreddit_name_prefixed": "r/politics",
    "body": "Ah, I see you start your arrays at 0 like an enlightened person.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1511331328.0,
    "date_created": "2017-11-21",
    "time_created": "17:15:28",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zaes",
    "parent_id": "t1_dq5s3d0",
    "subreddit_name_prefixed": "r/politics",
    "body": "It's a fundamentalist religion in which all of Christianity's deadly sins have been re-branded as virtues.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1511336618.0,
    "date_created": "2017-11-21",
    "time_created": "18:43:38",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xtwk",
    "parent_id": "t1_dq5s3d0",
    "subreddit_name_prefixed": "r/politics",
    "body": "Not really,  it's simply greed. ",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1511334935.0,
    "date_created": "2017-11-21",
    "time_created": "18:15:35",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5ylmp",
    "parent_id": "t1_dq5s3d0",
    "subreddit_name_prefixed": "r/politics",
    "body": "Conservatism is incompatible with modern civilised society.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1511335820.0,
    "date_created": "2017-11-21",
    "time_created": "18:30:20",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5ttxf",
    "parent_id": "t1_dq5rt69",
    "subreddit_name_prefixed": "r/politics",
    "body": "Both of my senators have their fax machines off, how fortunate.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511330582.0,
    "date_created": "2017-11-21",
    "time_created": "17:03:02",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq62na9",
    "parent_id": "t1_dq5xgxv",
    "subreddit_name_prefixed": "r/politics",
    "body": "It won't happen all at once. You drop a frog in boiling water, it will jump out. But drop a frog in a pot of room temperature water and slowly turn up the heat, and it will let itself be boiled to death.\n\nThat's the same track the telecoms will take.\n\nIf this passes on December 14th, then ISPs won't announced tiered Internet packages on December 15th. No, it'll be a slow roll-out. Incremental chipping away so people will get used to it and think, \"this is not so bad.\" ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511340720.0,
    "date_created": "2017-11-21",
    "time_created": "19:52:00",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq62bui",
    "parent_id": "t1_dq5zqrs",
    "subreddit_name_prefixed": "r/politics",
    "body": "it will be a slow process. Within weeks of passage we'll hear stories about pro-net neutrality articles not loading and being blocked by ISPs, and the law will protect them from having done so.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511340327.0,
    "date_created": "2017-11-21",
    "time_created": "19:45:27",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq62154",
    "parent_id": "t1_dq5zqrs",
    "subreddit_name_prefixed": "r/politics",
    "body": "Realistically?  Pretty boned.  But the ISP's aren't stupid.  They'll wait until AFTER the midterms until they start twisting their knives.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511339957.0,
    "date_created": "2017-11-21",
    "time_created": "19:39:17",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq6drz6",
    "parent_id": "t1_dq6co8f",
    "subreddit_name_prefixed": "r/politics",
    "body": "Because hilariously, they think Trump and his army of goons are going to look out for them instead of just sell America off to their donors.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511355188.0,
    "date_created": "2017-11-21",
    "time_created": "23:53:08",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq60gef",
    "parent_id": "t1_dq5vkkl",
    "subreddit_name_prefixed": "r/politics",
    "body": "Yeah because libertarians are complete idiots.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1511338012.0,
    "date_created": "2017-11-21",
    "time_created": "19:06:52",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq675rd",
    "parent_id": "t1_dq65txh",
    "subreddit_name_prefixed": "r/politics",
    "body": "This is the 100% conservative response to things.  Everything shitty that happens to everyone else doesn't matter until they are directly affected.  ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511346334.0,
    "date_created": "2017-11-21",
    "time_created": "21:25:34",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5meq7",
    "parent_id": "t1_dq5m10u",
    "subreddit_name_prefixed": "r/politics",
    "body": "[More or less.](https://arstechnica.com/tech-policy/2017/07/ajit-pai-not-concerned-about-number-of-pro-net-neutrality-comments/) Seems Pai is a fan of tossing out babies with the bathwater.\n\n>\"As I said previously, the raw number is not as important as the substantive comments that are in the record,\" Pai said at a press conference following yesterday's monthly FCC meeting.\n\n>Pai was answering a question posed by reporter Lynn Stanton of TRDaily. Stanton asked, \"shouldn't the number of consumers who feel they are detrimentally affected be a factor in a cost-benefit analysis of what you do?\" Pai did not give a definitive yes-or-no answer to the question of whether the number of pro-net neutrality comments would make any difference in his decision.\n\n>Pai previously addressed specific comments on one occasion, when he praised the \"exceptionally important contribution to the debate\" made by a group of 19 nonprofit municipal-broadband providers who oppose the current net neutrality rules. But Pai made no comment later on when 30 small ISPs urged him to preserve the rules.",
    "controversiality": 0,
    "ups": 2537,
    "downs": 0,
    "score": 2537,
    "created": 1511323437.0,
    "date_created": "2017-11-21",
    "time_created": "15:03:57",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5q45g",
    "parent_id": "t1_dq5m10u",
    "subreddit_name_prefixed": "r/politics",
    "body": "Doesn't that open this to a potential lawsuit to have it thrown out if they ignore public comment opinion?",
    "controversiality": 0,
    "ups": 181,
    "downs": 0,
    "score": 181,
    "created": 1511326969.0,
    "date_created": "2017-11-21",
    "time_created": "16:02:49",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5swn6",
    "parent_id": "t1_dq5m10u",
    "subreddit_name_prefixed": "r/politics",
    "body": "Which may mean that they’re in violation of the public comment and final rule components of the US Code 5 Section 553\n\nhttps://www.law.cornell.edu/uscode/text/5/553\n\n> (c) After notice required by this section, ***the agency shall give interested persons an opportunity to participate in the rule making through submission of written data, views, or arguments ***with or without opportunity for oral presentation. After ***consideration of the relevant matter presented, the agency shall incorporate in the rules adopted a concise general statement of their basis and purpose. ***When rules are required by statute to be made on the record after opportunity for an agency hearing, sections 556 and 557 of this title apply instead of this subsection\n\nSo ignoring the results wouldn’t seem to meet this criteria. \n\nAnd ignoring the documented false submissions would also seem to show any rule making is based on false data. \n\nAnybody with any experience of this know if that’s the case and any case law/precedence? \n\nEdit: This may be a better breakdown of examples for when this can be used but I’m still confused as to whether the way the public comment period was handled is problematic for their moving forward with the rulemaking process\nhttp://www.federalpracticemanual.org/chapter5/section1c",
    "controversiality": 0,
    "ups": 106,
    "downs": 0,
    "score": 106,
    "created": 1511329657.0,
    "date_created": "2017-11-21",
    "time_created": "16:47:37",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5p3xl",
    "parent_id": "t1_dq5m10u",
    "subreddit_name_prefixed": "r/politics",
    "body": "That's gonna come back and bite him in the ass when he inevitably gets taken to court over this.",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1511326008.0,
    "date_created": "2017-11-21",
    "time_created": "15:46:48",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq60oj6",
    "parent_id": "t1_dq5m10u",
    "subreddit_name_prefixed": "r/politics",
    "body": "They are going to repeal it. **The GOP is antiAmerican. They always have been antiAmerican. The GOP cannot stand the constitution.**\nThe GOP will do everything they can to fuck shit up. They did this in the 70s and 80s. And then, like they did before, they'll blame democrats and because their R base is dumb as fucksticks, they believe it. \nBottom line is: trumpco is bringing destruction of core functional processes of the American democratic republic. If you want internet in the future you'll pay for it, more than now, and it'll be filtered; so much for free press / free speech. \n**Fuck the GOP**  ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511338289.0,
    "date_created": "2017-11-21",
    "time_created": "19:11:29",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5su66",
    "parent_id": "t1_dq5m10u",
    "subreddit_name_prefixed": "r/politics",
    "body": "Why do we put up with these people... ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511329590.0,
    "date_created": "2017-11-21",
    "time_created": "16:46:30",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5oawe",
    "parent_id": "t1_dq5njg6",
    "subreddit_name_prefixed": "r/politics",
    "body": "Spot on and exactly why we need to keep commenting and keep calling.  If we cannot convince them not to do it, we can make a record that will indicate they failed in their obligation to consider the factors outside of what Comcast wants.",
    "controversiality": 0,
    "ups": 174,
    "downs": 0,
    "score": 174,
    "created": 1511325240.0,
    "date_created": "2017-11-21",
    "time_created": "15:34:00",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zjwo",
    "parent_id": "t1_dq5njg6",
    "subreddit_name_prefixed": "r/politics",
    "body": "That's awesome info!\n\nI wish your post had more visibility!\n",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1511336926.0,
    "date_created": "2017-11-21",
    "time_created": "18:48:46",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5vpj5",
    "parent_id": "t1_dq5ttd1",
    "subreddit_name_prefixed": "r/politics",
    "body": "This, and they were counting on public apathy.",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1511332573.0,
    "date_created": "2017-11-21",
    "time_created": "17:36:13",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq69dcj",
    "parent_id": "t1_dq5r9ba",
    "subreddit_name_prefixed": "r/politics",
    "body": "If you wanted your vote to count, you should've upgraded your citizenship to \"gold\" status, available now for the low cost of $9999.95.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511349092.0,
    "date_created": "2017-11-21",
    "time_created": "22:11:32",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5qqb6",
    "parent_id": "t1_dq5o8jj",
    "subreddit_name_prefixed": "r/politics",
    "body": "To add to this, it has been my experience that you do need to give your zip code. I interned for a senator and the standard procedure is if you do not have at a minimum a zip code then the call, letter, fax, etc. is wasted because zip codes are how we logged and kept track of all the information. In addition if someone from another state called or wrote that information was not logged. \n\nAlso the people answering are generally interns, especially in the summer. If whoever answers is good and decent at their job they should ask you for your zip code even if you forget to give it and even if the views you are expressing goes against the position of the elected official they are interning for. \n\nedit: spelling",
    "controversiality": 0,
    "ups": 194,
    "downs": 0,
    "score": 194,
    "created": 1511327557.0,
    "date_created": "2017-11-21",
    "time_created": "16:12:37",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5s8lm",
    "parent_id": "t1_dq5o8jj",
    "subreddit_name_prefixed": "r/politics",
    "body": "excellent advice and work here max. effort!!",
    "controversiality": 0,
    "ups": 75,
    "downs": 0,
    "score": 75,
    "created": 1511329028.0,
    "date_created": "2017-11-21",
    "time_created": "16:37:08",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5vbxf",
    "parent_id": "t1_dq5o8jj",
    "subreddit_name_prefixed": "r/politics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1511332170.0,
    "date_created": "2017-11-21",
    "time_created": "17:29:30",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5wzgq",
    "parent_id": "t1_dq5o8jj",
    "subreddit_name_prefixed": "r/politics",
    "body": "Thank you for the info!!! I'll be sending out emails and calling asap.\n\nIs there a way we can contact the chairman in the FCC as well?  I would like to communicate with him in every legal way.  I.e. phone, email, and snail mail.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511333975.0,
    "date_created": "2017-11-21",
    "time_created": "17:59:35",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5wzx0",
    "parent_id": "t1_dq5o8jj",
    "subreddit_name_prefixed": "r/politics",
    "body": "Is there any point if I'm in Kentucky?\n\nI live in Kentucky but my cell phone area code is out-of-state, will that hinder my effort?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511333988.0,
    "date_created": "2017-11-21",
    "time_created": "17:59:48",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5x7w6",
    "parent_id": "t1_dq5o8jj",
    "subreddit_name_prefixed": "r/politics",
    "body": "That number works!! I called and left a message. If we all know that this is not being done for the betterment of everyone, and only for the benefit of large ISPs, it shouldn’t be done. If you have links (images, phone numbers, offices, addresses, etc.) of the head of Verizon, post that too and I’ll go to his or her house and tell them how I feel about this",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511334238.0,
    "date_created": "2017-11-21",
    "time_created": "18:03:58",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5ypcn",
    "parent_id": "t1_dq5o8jj",
    "subreddit_name_prefixed": "r/politics",
    "body": "Real question.  If you write a letter or fax something, doesn’t it just go straight in the trash?  At the risk of this comment doing more harm than good, do any of these actions have a substantive effect?  22 million comments and we all know where this is heading.  Do they have to save and file these letters/faxes/phone calls or is it some interns job to just mindlessly hit the “delete” button on the answering machine and open envelopes and put the contents straight into the trash?\n\nBecause i think i know the answer",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511335941.0,
    "date_created": "2017-11-21",
    "time_created": "18:32:21",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq62i8a",
    "parent_id": "t1_dq5o8jj",
    "subreddit_name_prefixed": "r/politics",
    "body": "Is there anything that non-Americans can do to help? ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511340546.0,
    "date_created": "2017-11-21",
    "time_created": "19:49:06",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5rdhd",
    "parent_id": "t1_dq5pho5",
    "subreddit_name_prefixed": "r/politics",
    "body": "Yup. Everyone is saying 2016 was the most important election year ever, but 2018 and 2020 might be just as important.",
    "controversiality": 0,
    "ups": 334,
    "downs": 0,
    "score": 334,
    "created": 1511328183.0,
    "date_created": "2017-11-21",
    "time_created": "16:23:03",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq603lx",
    "parent_id": "t1_dq5pho5",
    "subreddit_name_prefixed": "r/politics",
    "body": "Once we lose the Supreme Courts and judges Fascism will fully take over. We have been on this path for a long time and we are reaching the end.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511337580.0,
    "date_created": "2017-11-21",
    "time_created": "18:59:40",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq604me",
    "parent_id": "t1_dq5wr8c",
    "subreddit_name_prefixed": "r/politics",
    "body": "Dude, you rock.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511337615.0,
    "date_created": "2017-11-21",
    "time_created": "19:00:15",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq69nf5",
    "parent_id": "t1_dq5wr8c",
    "subreddit_name_prefixed": "r/politics",
    "body": "> I️\n\nStill haven't updated your phone, huh?\n\nJokes aside, thank you.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511349455.0,
    "date_created": "2017-11-21",
    "time_created": "22:17:35",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5wwtq",
    "parent_id": "t1_dq5shtf",
    "subreddit_name_prefixed": "r/politics",
    "body": "Oh I should have replied to you, you seem to know better.\n\nIs that also a possible way to prevent the DOI from shrinking national monuments in disregard to the overwhelming support of the monuments expressed by something like 96% of comments?\n",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511333897.0,
    "date_created": "2017-11-21",
    "time_created": "17:58:17",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5wzcv",
    "parent_id": "t1_dq5shtf",
    "subreddit_name_prefixed": "r/politics",
    "body": "1. Great username\n2. You're right about the order of voting then the statement\n3. I agree, these questions are fascinating\n\nI think now that the internet is used for comment will change the game in one if two ways. 1. It will lead to better rules because large amount of voters can give imput and public opinion is the driving force in a democracy. 2. Corrupt administrations will use the internet to say, what does the layman know about these technical decisions? Volume of similar opinions does not equal quality. Unfortunately, I think option 2 will happen under the current administration. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511333971.0,
    "date_created": "2017-11-21",
    "time_created": "17:59:31",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq60m80",
    "parent_id": "t1_dq5shtf",
    "subreddit_name_prefixed": "r/politics",
    "body": "The problem is that it’s a high bar to clear, and there’s a general sense among laypeople that the fact that such a large majority of comments opposed the rule is evidence in and of itself that the rule is somehow procedurally flawed.\n\nWhich kind of goes back to the overarching wrong information about how valuable making comments actually was. The number of people and sites which effectively told people “if we just spam them with a form letter they will be compelled to do what we want” always bugged me.\n\nAnd, yeah, there’s a lot of cart before the horse arguments that the concise statement is insufficient... before it has been written or voted on.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511338210.0,
    "date_created": "2017-11-21",
    "time_created": "19:10:10",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zy51",
    "parent_id": "t1_dq5vmwu",
    "subreddit_name_prefixed": "r/politics",
    "body": "Then it should be nationalized. I would wholeheartedly support that, and then allow ISPs the privilege of renting that last mile infrastructure from the government at the same exorbitant rates they've been charging us.",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1511337398.0,
    "date_created": "2017-11-21",
    "time_created": "18:56:38",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq60w6r",
    "parent_id": "t1_dq5vmwu",
    "subreddit_name_prefixed": "r/politics",
    "body": "Sometimes it makes me wish we had some perfect dictator who could come in and say \"Version you owe $4 Billion, AT&T $2 Billion...etc) because when you read about what they did it was theft. They got paid to build something that they never did, said they did and kept all the money and then nothing ever happened to them. \n\nIMHO fines should exceed the amount of money that was made. Make it over 10-15 years so companies don't just go belly up, but I HATE when I see \"Widget Co fined 10 Million after making $6 Billion illegally\".\n\nIf the average person could make millions illegally and have to pay a $500 fine why wouldn't they?",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511338547.0,
    "date_created": "2017-11-21",
    "time_created": "19:15:47",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5tvzg",
    "parent_id": "t1_dq5odcv",
    "subreddit_name_prefixed": "r/politics",
    "body": "Pretty sure the Tiki Brand Products won't tweet denouncement this time.",
    "controversiality": 0,
    "ups": 90,
    "downs": 0,
    "score": 90,
    "created": 1511330645.0,
    "date_created": "2017-11-21",
    "time_created": "17:04:05",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5x7tj",
    "parent_id": "t1_dq5odcv",
    "subreddit_name_prefixed": "r/politics",
    "body": "Just hundreds of thousands standing outside his house completely still yelling \"AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA\".\n\nAlong his commute \"AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA\"\n\nAt his office building \"AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA\"\n\nAt his Grindr hook-up \"AAAAAAAAAAAAAAAAAAAAAAAAAAAA\"\n\nAt his corruption trial \"AAAAAAAAAAAAAAAAAAAAAAAAAAA\"\n\nAt his sentencing \"AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA\"\n\nPiped into his jail cell \"AAAAAAAAAAAAAAAAAAAAAAAAAAAAA\"\n\nOn his deathbed \"AAAASSSSSSSSSSSSSSHHHOOLLLLLEEEEEE!!!\"",
    "controversiality": 0,
    "ups": 167,
    "downs": 0,
    "score": 167,
    "created": 1511334235.0,
    "date_created": "2017-11-21",
    "time_created": "18:03:55",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5u4jn",
    "parent_id": "t1_dq5odcv",
    "subreddit_name_prefixed": "r/politics",
    "body": "Tiki torches are like the trojan horses of today. Grab one and sneak on into any protest your heart desires. ",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1511330895.0,
    "date_created": "2017-11-21",
    "time_created": "17:08:15",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xkv5",
    "parent_id": "t1_dq5s7ic",
    "subreddit_name_prefixed": "r/politics",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1511334647.0,
    "date_created": "2017-11-21",
    "time_created": "18:10:47",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xnib",
    "parent_id": "t1_dq5s7ic",
    "subreddit_name_prefixed": "r/politics",
    "body": "I’m yet to see anything of the sort actually happen nor do I see it happening in the near future. Us Americans have been pacified and domesticated by our government and corporate overlords. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1511334728.0,
    "date_created": "2017-11-21",
    "time_created": "18:12:08",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5z82t",
    "parent_id": "t1_dq5s7ic",
    "subreddit_name_prefixed": "r/politics",
    "body": "You bring the guillotine, we'll bring the pitchforks and torches.  Perhaps my dreams of peasant mob vengeance will still come true one day.  \n\nSeriously though, there are a great deal of politicians and officials who openly and blatantly no longer give a single fuck about doing what is best for the country or its citizens and it is high time that an example was made of some of them.  Make those shitheels fear the consequences of their actions.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511336543.0,
    "date_created": "2017-11-21",
    "time_created": "18:42:23",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5tyrt",
    "parent_id": "t1_dq5nj4r",
    "subreddit_name_prefixed": "r/politics",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 68,
    "downs": 0,
    "score": 68,
    "created": 1511330726.0,
    "date_created": "2017-11-21",
    "time_created": "17:05:26",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq60zn6",
    "parent_id": "t1_dq5nj4r",
    "subreddit_name_prefixed": "r/politics",
    "body": "Sharing private information about a public figure is still doxxing.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511338668.0,
    "date_created": "2017-11-21",
    "time_created": "19:17:48",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5pe0j",
    "parent_id": "t1_dq5p4h4",
    "subreddit_name_prefixed": "r/politics",
    "body": "I like the idea of that subreddit, though it'd be nice if gun safety and ownership can be dissociated from partisan politics altogether.",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1511326278.0,
    "date_created": "2017-11-21",
    "time_created": "15:51:18",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq605ya",
    "parent_id": "t1_dq5zsmz",
    "subreddit_name_prefixed": "r/politics",
    "body": "Every couple of years we get a chance to overwhelmingly do the right thing before being overruled by the vastly overrepresented systemically partisan voter pool from undereducated often counterfactual states. Somehow that is a situation we should accept.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511337658.0,
    "date_created": "2017-11-21",
    "time_created": "19:00:58",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5n9j8",
    "parent_id": "t1_dq5n8bs",
    "subreddit_name_prefixed": "r/politics",
    "body": "Eh, worth a try anyway.",
    "controversiality": 0,
    "ups": 96,
    "downs": 0,
    "score": 96,
    "created": 1511324245.0,
    "date_created": "2017-11-21",
    "time_created": "15:17:25",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xu40",
    "parent_id": "t1_dq5n8bs",
    "subreddit_name_prefixed": "r/politics",
    "body": "Let's get Katy Perry out here to do some witch spells again 👏 ",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1511334942.0,
    "date_created": "2017-11-21",
    "time_created": "18:15:42",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq64j1t",
    "parent_id": "t1_dq5n8bs",
    "subreddit_name_prefixed": "r/politics",
    "body": "Im gonna have to pull my monkey paw out of storage",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511343051.0,
    "date_created": "2017-11-21",
    "time_created": "20:30:51",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5rz1x",
    "parent_id": "t1_dq5nid1",
    "subreddit_name_prefixed": "r/politics",
    "body": "My favorite was one directed at Mitch McConnell: \"May all your lettuce be wilted\"",
    "controversiality": 0,
    "ups": 66,
    "downs": 0,
    "score": 66,
    "created": 1511328766.0,
    "date_created": "2017-11-21",
    "time_created": "16:32:46",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5yxic",
    "parent_id": "t1_dq5nid1",
    "subreddit_name_prefixed": "r/politics",
    "body": "May you build a house with your own kidney stones, chairman Pai.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511336205.0,
    "date_created": "2017-11-21",
    "time_created": "18:36:45",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5wtnz",
    "parent_id": "t1_dq5pqdi",
    "subreddit_name_prefixed": "r/politics",
    "body": "Whoa calm down Satan",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1511333801.0,
    "date_created": "2017-11-21",
    "time_created": "17:56:41",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zttw",
    "parent_id": "t1_dq5pqdi",
    "subreddit_name_prefixed": "r/politics",
    "body": "Reese's *mug*. You never want a Reese's Cup to fall on the floor.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511337252.0,
    "date_created": "2017-11-21",
    "time_created": "18:54:12",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq60j1c",
    "parent_id": "t1_dq5xrpu",
    "subreddit_name_prefixed": "r/politics",
    "body": "He working on it",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511338103.0,
    "date_created": "2017-11-21",
    "time_created": "19:08:23",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5z0rg",
    "parent_id": "t1_dq5wcux",
    "subreddit_name_prefixed": "r/politics",
    "body": "Trump was elected by asshole Boomers who generally go through life oblivious about money...either because they have plenty and one more bill is no big deal or because money management is a thing that requires a modicum of thought and they're Fox-News-swilling conservative death-cultists who can't be arsed to give a shit about anything that's *that* involved. I have one die-hard Trump supporter in my family who's in real danger of having his home foreclosed on in the next month or two. What's his strategy to deal with this problem? Answer: To do absolutely fucking nothing beyond eating junk food and watching six hours of Fox News and sports games every day.",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1511336310.0,
    "date_created": "2017-11-21",
    "time_created": "18:38:30",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq60jmn",
    "parent_id": "t1_dq5wcux",
    "subreddit_name_prefixed": "r/politics",
    "body": "I have been trying and trying to warn my parents and immediate family about this for months and my mom's response today was \"We just switched to Verizon, is that going to affect us?\"\n\n\n*head explodes*",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511338122.0,
    "date_created": "2017-11-21",
    "time_created": "19:08:42",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq60o5s",
    "parent_id": "t1_dq5xyrr",
    "subreddit_name_prefixed": "r/politics",
    "body": "no, until money is pulled out of politics, nothing will change. Each of the four examples above has had decisions made that were influenced by or benefit the wealthy, powerful corporations, and lobbying groups/PACs funded by wealthy individuals and/or powerful corporations. \n\nOur democracy represents the rich and powerful, not the everyday person.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1511338276.0,
    "date_created": "2017-11-21",
    "time_created": "19:11:16",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zj3q",
    "parent_id": "t1_dq5xyrr",
    "subreddit_name_prefixed": "r/politics",
    "body": "Most Americans have no idea how to do that. We have been complacent for far to long. ",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1511336900.0,
    "date_created": "2017-11-21",
    "time_created": "18:48:20",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq60lw6",
    "parent_id": "t1_dq5xyrr",
    "subreddit_name_prefixed": "r/politics",
    "body": "We did it in Virginia. We still have a long way to go, but it was one hell of an opening salvo. Do it in your state in 2018.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511338198.0,
    "date_created": "2017-11-21",
    "time_created": "19:09:58",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zp1j",
    "parent_id": "t1_dq5xyrr",
    "subreddit_name_prefixed": "r/politics",
    "body": "Which ironically is the whole point of the second amendment. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1511337093.0,
    "date_created": "2017-11-21",
    "time_created": "18:51:33",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zanz",
    "parent_id": "t1_dq5xoyk",
    "subreddit_name_prefixed": "r/politics",
    "body": "You guys aren't going to revolt. Americans still live way too comfortably to just give it all up and potentially die for something like this. Maybe one day when most Americans don't have access with food, water, shelter, and the internet.",
    "controversiality": 0,
    "ups": 120,
    "downs": 0,
    "score": 120,
    "created": 1511336626.0,
    "date_created": "2017-11-21",
    "time_created": "18:43:46",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5yrtd",
    "parent_id": "t1_dq5xoyk",
    "subreddit_name_prefixed": "r/politics",
    "body": "Honestly not soon enough ",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1511336021.0,
    "date_created": "2017-11-21",
    "time_created": "18:33:41",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq60249",
    "parent_id": "t1_dq5xoyk",
    "subreddit_name_prefixed": "r/politics",
    "body": "having studied a lot of revolutions it takes generally one of a few things.\n\n1. No food or Money - this is the fastest way. France's revolution was more about food at first then about \"freedom, brotherhood and equality\" \n\n2. Death - The killing of an important figure can set off the long held frustrations of a people. See the failed Paris Uprising of 1832 made famous in Les Miserable. \n\nBut more often it is a slow burn that boils over seemingly at random, where long and stable governments fall in days or weeks. See Romania in 1989. \n\nDec 17th - Small protests, led to bigger student anti-gov protests. \n\nDec 21st - Dictator gives speech to \"pro-communist\" crowd, gets booed and heckled on live TV, looks nervous. Protests grow but are stopped by the military.\n\nDec 22nd - mass protests around the whole country. People break into gov buildings, flees by helicopter.\n\nDec 25th - tried and executed by provisional gov.\n\nWhile this is a short example I doubt that on Dec 1st he would have thought that he would be dead by the 25th. \n\nTLDR: Revolutions usually happen after a long time of anger and feelings of being unheard. Then something happens and the long simmer turns into a boil that sometimes boils over into a full revolution, but can often be suppressed by military might. See Hungry 1956.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511337531.0,
    "date_created": "2017-11-21",
    "time_created": "18:58:51",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5ze3w",
    "parent_id": "t1_dq5xoyk",
    "subreddit_name_prefixed": "r/politics",
    "body": "New years",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511336738.0,
    "date_created": "2017-11-21",
    "time_created": "18:45:38",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq602e1",
    "parent_id": "t1_dq5y7oz",
    "subreddit_name_prefixed": "r/politics",
    "body": "This is exactly what's going on here. It's to pre-Revolutionary levels of oppression. The difference is that we had distractions to keep the masses occupied and placated with a false sense of security. But once our primary source of distraction is gone, shit's gonna get real.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511337541.0,
    "date_created": "2017-11-21",
    "time_created": "18:59:01",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq62uib",
    "parent_id": "t1_dq62grw",
    "subreddit_name_prefixed": "r/politics",
    "body": "You can go to https://resistbot.io to send an email/fax/letter instead! You can also help to educate others: a staggering number of Americans don't even know that this is going on.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511340967.0,
    "date_created": "2017-11-21",
    "time_created": "19:56:07",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq60vq6",
    "parent_id": "t1_dq5zp3h",
    "subreddit_name_prefixed": "r/politics",
    "body": "The problem isn't individual things, that's why you're losing. The problem is the bigger picture. You need to cut the head of the snake if you want to have a chance, that means fighting against the entire system and ripping it apart piece, by piece. \n\nAgain, you need numbers and need to be willing to physically move yourself to where it would be effective. It's not a matter of winning one battle, you need to stand up and say \"fuck this shit\" all over again.\n\nI don't know how you accomplish this through 100% peaceful means, but if you have enough people it's not hard to sit your butts down inside the chambers of Congress or the FCC headquarters, or wherever without causing too much violence.\n\nI just think it's beyond the point of \"we're not gonna take it anymore\" and it's time for American's to do what American's do best and fuck shit up to give control back to the people. Democracy doesn't come easy and yours is dissolving. It's getting pretty time sensitive on all fronts and I don't think the system can work fast enough to fix itself (if at all). I just don't see another way.\n\nLike I said, the world is watching and America is fading.\n\nMaybe I'm being cynical, but I just see things going downhill fast and the hill is getting steeper and steeper. Pretty soon it's going to be a vertical dropoff and there's no turning back. I just look at the entire mess and wonder what happened to the American spirit many in the world look to as inspiration. Just seems like everyone is forgetting that democracy and freedom is something you have to be willing to fight to the bitter end for and people in power are reinforcing that there aren't enough people willing to do that anymore.",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1511338532.0,
    "date_created": "2017-11-21",
    "time_created": "19:15:32",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5twat",
    "parent_id": "t1_dq5rywi",
    "subreddit_name_prefixed": "r/politics",
    "body": "Huh?  The point was that, _despite_ having been funded by industry the study was devastating to the industry position.  ",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1511330654.0,
    "date_created": "2017-11-21",
    "time_created": "17:04:14",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5yl9p",
    "parent_id": "t1_dq5t6a7",
    "subreddit_name_prefixed": "r/politics",
    "body": "Of course, you have the *freedom to choose* who your ISP is, amirite? All those choices available these days when it comes to internet services...all you have to do is move 30 miles away and you might find another service provider.",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1511335808.0,
    "date_created": "2017-11-21",
    "time_created": "18:30:08",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5y9fm",
    "parent_id": "t1_dq5x2d0",
    "subreddit_name_prefixed": "r/politics",
    "body": "Absolutely agreed. It's not like a party that has built itself on championing social change could suffer any backlash if they just completely dropped that platform or anything, right?",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1511335431.0,
    "date_created": "2017-11-21",
    "time_created": "18:23:51",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zznf",
    "parent_id": "t1_dq5x2d0",
    "subreddit_name_prefixed": "r/politics",
    "body": "Here's the thing, which other party are the minorities and LGBT going to vote for? Republicans? Maybe the crazies... but you've got to motivate the moderates and independents.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511337449.0,
    "date_created": "2017-11-21",
    "time_created": "18:57:29",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5ta47",
    "parent_id": "t1_dq5n5ki",
    "subreddit_name_prefixed": "r/politics",
    "body": "> express contempt for other people.\n\nAhem, I believe the term was \"economic anxiety.\"",
    "controversiality": 0,
    "ups": 37,
    "downs": 0,
    "score": 37,
    "created": 1511330029.0,
    "date_created": "2017-11-21",
    "time_created": "16:53:49",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5ylfc",
    "parent_id": "t1_dq5mys5",
    "subreddit_name_prefixed": "r/politics",
    "body": "The way this is going, is there going to be a next time to not screw up?",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511335813.0,
    "date_created": "2017-11-21",
    "time_created": "18:30:13",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5q0oe",
    "parent_id": "t1_dq5pw46",
    "subreddit_name_prefixed": "r/politics",
    "body": "*At least it's not the government*",
    "controversiality": 0,
    "ups": 79,
    "downs": 0,
    "score": 79,
    "created": 1511326877.0,
    "date_created": "2017-11-21",
    "time_created": "16:01:17",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5smnz",
    "parent_id": "t1_dq5pw46",
    "subreddit_name_prefixed": "r/politics",
    "body": "The Founding Fathers intended for businesses to pay to own the government.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1511329394.0,
    "date_created": "2017-11-21",
    "time_created": "16:43:14",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq6iuig",
    "parent_id": "t1_dq5y46c",
    "subreddit_name_prefixed": "r/politics",
    "body": "I think a lot of Libertarians, the not totally full of shit ones, conflate Government and bureaucracy. They hate bureaucracy, really and they fail to fully realize that bureaucracy exists in every large entity, including the ones in the private sector.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511364447.0,
    "date_created": "2017-11-22",
    "time_created": "02:27:27",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq621ps",
    "parent_id": "t1_dq603xy",
    "subreddit_name_prefixed": "r/politics",
    "body": "Pai is still young and not rich enough to lock himself in a mansion without internet waiting to die, like Trump. He will have to spend the rest of his life facing the people he screwed over out in public. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511339978.0,
    "date_created": "2017-11-21",
    "time_created": "19:39:38",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5vqw6",
    "parent_id": "t1_dq5va1s",
    "subreddit_name_prefixed": "r/politics",
    "body": "What do you expect people to do when congressmen and Pai continually ignore phone calls, comments, emails, etc? Unless you expect bloodshed at this point, you vote their asses out and work to undo the damage. That's all we can do as standing up for this and other recent bills from congress results in being ignored and republicans claiming that Soros is bussing people in and these people aren't real constituents. So how do you show them they are real? Vote their asses out.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1511332614.0,
    "date_created": "2017-11-21",
    "time_created": "17:36:54",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq628gh",
    "parent_id": "t1_dq5y7s5",
    "subreddit_name_prefixed": "r/politics",
    "body": "Why would they do that when the alternative leads to them never having to worry about competition?",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511340209.0,
    "date_created": "2017-11-21",
    "time_created": "19:43:29",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zrxs",
    "parent_id": "t1_dq5ulro",
    "subreddit_name_prefixed": "r/politics",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511337188.0,
    "date_created": "2017-11-21",
    "time_created": "18:53:08",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5ut0v",
    "parent_id": "t1_dq5uji4",
    "subreddit_name_prefixed": "r/politics",
    "body": "That was my favorite part of the whole text\n",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1511331608.0,
    "date_created": "2017-11-21",
    "time_created": "17:20:08",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5u78y",
    "parent_id": "t1_dq5ttxf",
    "subreddit_name_prefixed": "r/politics",
    "body": "call them?",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1511330972.0,
    "date_created": "2017-11-21",
    "time_created": "17:09:32",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq63z6h",
    "parent_id": "t1_dq62na9",
    "subreddit_name_prefixed": "r/politics",
    "body": "It's already happening. \n\nAnd if you put a frog in boiling water, it dies. \n\nGamers, at the very least, will notice. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511342364.0,
    "date_created": "2017-11-21",
    "time_created": "20:19:24",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq62ynk",
    "parent_id": "t1_dq60gef",
    "subreddit_name_prefixed": "r/politics",
    "body": "Yes. They are basically a corporate front “philosophy”.  They make it sound great on paper and then when you look at it closely all it is an excuse to protect a few wealthy people at the expense of everything else. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511341108.0,
    "date_created": "2017-11-21",
    "time_created": "19:58:28",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5pi50",
    "parent_id": "t1_dq5meq7",
    "subreddit_name_prefixed": "r/politics",
    "body": "> 30 small ISPs urged him to preserve the rules.\n\nImportant:  \n\n30 of the \"small business innovators\" he claims *that repealing Title II will help* oppose this, because in truth this is anti-innovation.  It will make the big four grossly more powerful and squeeze out and destroy free innovation.",
    "controversiality": 0,
    "ups": 973,
    "downs": 0,
    "score": 973,
    "created": 1511326387.0,
    "date_created": "2017-11-21",
    "time_created": "15:53:07",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5ms8c",
    "parent_id": "t1_dq5meq7",
    "subreddit_name_prefixed": "r/politics",
    "body": "Fascist little shit",
    "controversiality": 0,
    "ups": 1911,
    "downs": 0,
    "score": 1911,
    "created": 1511323788.0,
    "date_created": "2017-11-21",
    "time_created": "15:09:48",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5npju",
    "parent_id": "t1_dq5meq7",
    "subreddit_name_prefixed": "r/politics",
    "body": "I just sent him a message at https://www.fcc.gov/about/leadership/ajit-pai  telling him that his legacy will forever be tied to stealing the internet if he doesn't distance himself from trump and renounce this repeal.  He won't care but I had to do something besides leaving voicemail for my representatives. ",
    "controversiality": 0,
    "ups": 202,
    "downs": 0,
    "score": 202,
    "created": 1511324673.0,
    "date_created": "2017-11-21",
    "time_created": "15:24:33",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5vtrg",
    "parent_id": "t1_dq5meq7",
    "subreddit_name_prefixed": "r/politics",
    "body": "I hope he has children.  I just wrote an email to his fcc email expressing myself.  I threw in at the end his kids (hoping this slime-ball has at least one he gives a shit about) will be known forever as the offspring of the man who killed the internet and nothing they do will ever change that.  They will grow old being related to the man who killed the internet.  \n\najit.pai@fcc.gov  For anyone interested.  Flood that thing!!!",
    "controversiality": 0,
    "ups": 100,
    "downs": 0,
    "score": 100,
    "created": 1511332700.0,
    "date_created": "2017-11-21",
    "time_created": "17:38:20",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5n0jp",
    "parent_id": "t1_dq5meq7",
    "subreddit_name_prefixed": "r/politics",
    "body": "I get the argument for putting more consideration to \"substantive comments\", in that having bots make comments that consisted of \"you suck. Keep net neutrality\" or \"repeal!\" aren't exactly helpful towards the conversation.\n\nThe problem though, is that Pai seems to be using this excuse to completely ignore ALL comments. I'm sure in 100% of the comments were substantive he'd find some other excuse to justify ignoring them.",
    "controversiality": 0,
    "ups": 70,
    "downs": 0,
    "score": 70,
    "created": 1511324013.0,
    "date_created": "2017-11-21",
    "time_created": "15:13:33",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5rnxv",
    "parent_id": "t1_dq5meq7",
    "subreddit_name_prefixed": "r/politics",
    "body": "Basically use a unique message when you post, not the pre-form-filled stuff",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1511328463.0,
    "date_created": "2017-11-21",
    "time_created": "16:27:43",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5rzcd",
    "parent_id": "t1_dq5meq7",
    "subreddit_name_prefixed": "r/politics",
    "body": "Seems like a textbook example of \"Confirmation Bias\"....",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511328774.0,
    "date_created": "2017-11-21",
    "time_created": "16:32:54",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5ya7m",
    "parent_id": "t1_dq5meq7",
    "subreddit_name_prefixed": "r/politics",
    "body": "\"Substantive comments\" means the comments of telecom executives.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511335455.0,
    "date_created": "2017-11-21",
    "time_created": "18:24:15",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5z91t",
    "parent_id": "t1_dq5meq7",
    "subreddit_name_prefixed": "r/politics",
    "body": "Equifax was hacked. Over a hundred million Americans personal information, including their social security numbers is likely available in the void.\n\nThere are hundreds of thousands of computer viruses manufactured every single year and the FCC wants to create a natural system of channels and funnels to make spreading viruses much much easier.\n\nAmerica needs to be more concerned about the data that was stolen and the infrastructure being built from the ground up to make a catastrophic incursion from foreign invaders not only possible but inevitable.\n\nRussian sleeper cells are in America right now. Number stations didn't disappear with the cold war.\n\nFor the record: I know this sounds like conspiracy theory bs. I wish it didn't.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1511336575.0,
    "date_created": "2017-11-21",
    "time_created": "18:42:55",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xllx",
    "parent_id": "t1_dq5meq7",
    "subreddit_name_prefixed": "r/politics",
    "body": "So all people are equal, but some are more equal than others?",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511334670.0,
    "date_created": "2017-11-21",
    "time_created": "18:11:10",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5s9n3",
    "parent_id": "t1_dq5q45g",
    "subreddit_name_prefixed": "r/politics",
    "body": "Yes.  They have to respond, sufficiently to a court's liking, to comments which raise significant points with regard to the form and purpose of the new rule.  These responses would be in the final published rule.  It is absolutely a factor in the court's analysis the agency's response to comments received during notice-and-comment. ",
    "controversiality": 0,
    "ups": 226,
    "downs": 0,
    "score": 226,
    "created": 1511329055.0,
    "date_created": "2017-11-21",
    "time_created": "16:37:35",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5wair",
    "parent_id": "t1_dq5q45g",
    "subreddit_name_prefixed": "r/politics",
    "body": "Lawyer here.\n\nIt’ll depend on how the rule and explanation is actually drafted, but Pai correctly stated (in the interview being referenced above) that an administrative agency must respond to the substance of the comments. They are not bound by, or even encouraged to follow, the most popular layperson viewpoint.\n\nThe cases where courts have intervened based on a lack of response to comments is where the substantive arguments were completely ignored. The Administrative Procedures Act does not give any special preference based on volume.",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1511333215.0,
    "date_created": "2017-11-21",
    "time_created": "17:46:55",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5rnzh",
    "parent_id": "t1_dq5q45g",
    "subreddit_name_prefixed": "r/politics",
    "body": "I don't think so.  They are required to take in public opinion but not required to care about it.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1511328464.0,
    "date_created": "2017-11-21",
    "time_created": "16:27:44",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5y6n0",
    "parent_id": "t1_dq5swn6",
    "subreddit_name_prefixed": "r/politics",
    "body": "It’s important to start off by distinguishing a few things. First, what Pai said was that “the raw number is not as important as the substantive comments that are in the record”, and that is true.\n\nThe administrative procedures act requires that the agency respond to the comments, not that it give any particular credence to them. If the final rule addresses the substantive arguments of a million pre-written comments submitted from “gofccyourself.net”, those million comments have been sufficiently addressed.\n\nNor does the agency have to provide specific response to conclusory comments of the “I want net neutrality to stay, don’t get rid of it” variety.\n\n>And ignoring the documented false submissions would also seem to show any rule making is based on false data.\n\nProbably not, unless there is some information contained in those submissions that does not appear in any other source in the agency’s record.\n\nThis whole fight over the number of comments on either side has never been relevant, the agency is not bound by the numbers. The fact that there were submissions claiming to be from individuals who didn’t actually submit them doesn’t really matter unless the agency were required to give weight based on volume of comments, which they aren’t.\n\nThink of it this way: the fact that there are five million comments saying “it will be bad for new internet startups who may not be able to buy priority bandwidth” is not required (under the APA) to mean more than if there were five of them. \n\nThe fact that there were 200 comments saying that this would be good for consumers as it allows for those who don’t use as much bandwidth to stop subsidizing more consuming users doesn’t matter more than if there were 2.\n\nSo even if half of all anti-net neutrality comments were “false submissions”, it wouldn’t matter. The half that are properly there are still on the record and can still form some basis of the rule. The only way it would matter is if the agency gave those arguments more weight because of the number of unique submissions, which they are unlikely to.\n\n>Anybody with any experience of this know if that’s the case and any case law/precedence?\n\nFor which part?\n\nI’m not being glib, it’s just a really big subject and I don’t want to waste your time citing cases for the proposition that the volume of comments supporting a particular view is irrelevant if what you really care about is what is considered sufficient to have addressed the comments’ substance.\n\nAnd a big part of this is going to depend on how the final rule is actually phrased. If it’s argued as a matter of statutory interpretation (i.e the FCC saying “we cannot regulate broadband as common carriers because they fall under information services rather than telecommunications, but we can require greater transparency as a matter of policy”) the agency arguably gets *Chevron* deference and agencies rarely lose with *Chevron* deference. \n\nThough then you get into some interesting cases about whether a prior agency statutory interpretation was viewed as the *only* interpretation, or just a *valid* interpretation.\n\nIf it’s a pure policy issue? There we get into sufficiency of response, and the cases where the courts have held that an agency failed to consider comments are predominately cases where the agency actually failed to respond to them in their rulemaking.\n\n> I’m still confused as to whether the way the public comment period was handled is problematic for their moving forward with the rulemaking process\n\nWell... the easier way to do this might be to ask what you think was problematic.\n\nThey issued notice, received comments, and we’re awaiting the final rulemaking which will be required to consider (i.e respond to) the substantive arguments raised in the comments. \n\nIf your question is whether what Pai said somehow makes the rulemaking less valid... not really, he accurately stated that an agency is not bound by considerations of sheer volume of comments.",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1511335342.0,
    "date_created": "2017-11-21",
    "time_created": "18:22:22",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5wbi0",
    "parent_id": "t1_dq5p3xl",
    "subreddit_name_prefixed": "r/politics",
    "body": "Except when he is found to be in contempt of court, Dumpy will just pardon him.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1511333246.0,
    "date_created": "2017-11-21",
    "time_created": "17:47:26",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5yg7p",
    "parent_id": "t1_dq5oawe",
    "subreddit_name_prefixed": "r/politics",
    "body": "See I didn’t even realize this. This needs to be a separate post. I think it would make people feel like their writing/calling can make a difference eventually. ",
    "controversiality": 0,
    "ups": 67,
    "downs": 0,
    "score": 67,
    "created": 1511335647.0,
    "date_created": "2017-11-21",
    "time_created": "18:27:27",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xzcm",
    "parent_id": "t1_dq5vpj5",
    "subreddit_name_prefixed": "r/politics",
    "body": "Exactly, just look at the timing. Make the  announcement just before everyone leaves for thanksgiving and have the vote in the middle of the holiday season.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1511335111.0,
    "date_created": "2017-11-21",
    "time_created": "18:18:31",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5sq2e",
    "parent_id": "t1_dq5s8lm",
    "subreddit_name_prefixed": "r/politics",
    "body": "This comment puts you at +300, according to RES.  Keep it up, Socrates!  :D",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1511329481.0,
    "date_created": "2017-11-21",
    "time_created": "16:44:41",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5vztw",
    "parent_id": "t1_dq5vbxf",
    "subreddit_name_prefixed": "r/politics",
    "body": "You can copy my comment and share it on your subreddits if you'd like. ",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1511332882.0,
    "date_created": "2017-11-21",
    "time_created": "17:41:22",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5x8nx",
    "parent_id": "t1_dq5vbxf",
    "subreddit_name_prefixed": "r/politics",
    "body": "I feel like we need to throw together a couple or more protest marches for Net Neutrality and the GOP tax bilks. We also need to get out on the streets to fight this bs.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1511334263.0,
    "date_created": "2017-11-21",
    "time_created": "18:04:23",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq6299f",
    "parent_id": "t1_dq5ypcn",
    "subreddit_name_prefixed": "r/politics",
    "body": "Yes, advocacy *does* work!  \n  \nYou might remember back at the very beginning of this congress when they tried to roll back the independent ethics committee, [until people raised so much hell about it that Trump stepped in and stopped them.](https://www.cnn.com/2017/01/02/politics/office-of-congressional-ethics-oversight-of-ethics-committee-amendment/index.html)  \n  \nJason Chaffetz was proposing a bill that would have disposed \"of 3.3 million acres of federal land in 10 Western states,\" [until people started calling up and telling him off about it.](http://www.denverpost.com/2017/02/02/federal-land-transfer-bill-withdrawn/)  \n  \nRepublicans voted more than sixty times to repeal the Affordable Care Act during Obama's administration, but now that they're in charge of the government they can't get it done, [in large part because vulnerable Republican Senators are worried about the backlash.](https://www.washingtonpost.com/news/monkey-cage/wp/2017/07/19/why-cant-the-senate-repeal-obamacare-because-its-actual-policies-are-popular/)  \n  \nWe've also repeatedly fought back against SOPA, we fought back against repealing Net Neutrality during the Obama years, I don't think anyone would argue that Hillary Clinton's stance on the TPP changed in response to public pressures... yeah, they'll listen, if we speak loudly enough.  \n  \nCynicism is the greatest ally Republicans have these days, they want nothing more than for folks like you and me to give up and stop fighting for what we believe in.  Don't let them win.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511340238.0,
    "date_created": "2017-11-21",
    "time_created": "19:43:58",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq62rlh",
    "parent_id": "t1_dq62i8a",
    "subreddit_name_prefixed": "r/politics",
    "body": "Protect Net Neutrality on *your* end, just like you'd protect clean air or water.  \n  \nSpread information and awareness, you're more than welcome to copy and paste my post anywhere you think is relevant or useful.  (Heads up that mods may not agree on that.)  \n  \nBe a cheerleader, upvote, encourage, educate.  \n  \nTL;DR: Keep doing what you're doing.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511340869.0,
    "date_created": "2017-11-21",
    "time_created": "19:54:29",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5ycge",
    "parent_id": "t1_dq5rdhd",
    "subreddit_name_prefixed": "r/politics",
    "body": "No EVERY election is important. Every. Single. Election.. from President to City fucking council. Almost every twelve months one of your representatives is up for election President, Senators, Governors, County Commisioners, Sheriff's, Judges, State legislatures, Mayors. Democracy is not a part time job there is always a campaign to volunteer or work for. There is always a bill up for vote that you can call your Representatives about. Democracy isnt voting every few years. It's something that has to take a constant effort of participation and education.",
    "controversiality": 0,
    "ups": 183,
    "downs": 0,
    "score": 183,
    "created": 1511335528.0,
    "date_created": "2017-11-21",
    "time_created": "18:25:28",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5rlaj",
    "parent_id": "t1_dq5rdhd",
    "subreddit_name_prefixed": "r/politics",
    "body": "The problem is that, once the courts are stacked, it's basically game over.  All the authoritarians have to do is wait a few years until things get bad and they can get re-elected, only this time they know exactly the person to run and what to do and say to keep out of the fray and they have the last check against this...the judiciary....in their pocket.\n\nTrump may not make it four years, but for America to survive, there realistically can't be a republican cut from the same cloth as the current GOP for about 40 years.  Ask yourself how likely it is that Dems or some third party hold the White House for four decades.  Now start looking at other countries to live in.",
    "controversiality": 0,
    "ups": 238,
    "downs": 0,
    "score": 238,
    "created": 1511328389.0,
    "date_created": "2017-11-21",
    "time_created": "16:26:29",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zgnl",
    "parent_id": "t1_dq5rdhd",
    "subreddit_name_prefixed": "r/politics",
    "body": "2018 and 2020 will make or break us",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511336821.0,
    "date_created": "2017-11-21",
    "time_created": "18:47:01",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq60ibe",
    "parent_id": "t1_dq5rdhd",
    "subreddit_name_prefixed": "r/politics",
    "body": "So revolution? ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511338078.0,
    "date_created": "2017-11-21",
    "time_created": "19:07:58",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq61net",
    "parent_id": "t1_dq5wzcv",
    "subreddit_name_prefixed": "r/politics",
    "body": "Also #3:  You cannot prove someone is who they say they are on the internet.  We're wide open to espionage against our public entities in order to give the illusion that public opinion leans one way or another.  We're very, very lucky that attacks so far have been such obvious hack jobs (pun intended).",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511339480.0,
    "date_created": "2017-11-21",
    "time_created": "19:31:20",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq60ddb",
    "parent_id": "t1_dq5zy51",
    "subreddit_name_prefixed": "r/politics",
    "body": "Title II was the way to go.  The Cable Companies were losing to technology progress as their model was dying and they are trying to prop it up through artificial means.  The really ironic point is that the last half mile was subsidized by the tax payers and cities around the country.  The whole internet capability exists because of tax payer money. So now we are held hostage to the Cable Companies and their pay off to the FCC. They now want to make it illegal for cities and states to run their own last half mile. ",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1511337911.0,
    "date_created": "2017-11-21",
    "time_created": "19:05:11",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq62gut",
    "parent_id": "t1_dq60w6r",
    "subreddit_name_prefixed": "r/politics",
    "body": "[We needed Caesar, instead we got a 70 year old gouty bitchmade Antony]\n(https://youtu.be/nmsVwJZz0lo)",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511340499.0,
    "date_created": "2017-11-21",
    "time_created": "19:48:19",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5yilp",
    "parent_id": "t1_dq5x7tj",
    "subreddit_name_prefixed": "r/politics",
    "body": ">At his Grindr hook-up\n\n???",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1511335724.0,
    "date_created": "2017-11-21",
    "time_created": "18:28:44",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xst0",
    "parent_id": "t1_dq5x7tj",
    "subreddit_name_prefixed": "r/politics",
    "body": "I seriously advocate for shit like this. Find where this guy lives and harass him.\n\nEdit: okay, but really, violence is something entirely different and has no place in our society. ",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1511334900.0,
    "date_created": "2017-11-21",
    "time_created": "18:15:00",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5yd88",
    "parent_id": "t1_dq5x7tj",
    "subreddit_name_prefixed": "r/politics",
    "body": "I really enjoyed that visual, thank you",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511335552.0,
    "date_created": "2017-11-21",
    "time_created": "18:25:52",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5ze63",
    "parent_id": "t1_dq5x7tj",
    "subreddit_name_prefixed": "r/politics",
    "body": "It needs to have the dialup scream of the internet as background noise",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511336739.0,
    "date_created": "2017-11-21",
    "time_created": "18:45:39",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq60at0",
    "parent_id": "t1_dq5xkv5",
    "subreddit_name_prefixed": "r/politics",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1511337822.0,
    "date_created": "2017-11-21",
    "time_created": "19:03:42",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq608uy",
    "parent_id": "t1_dq5xnib",
    "subreddit_name_prefixed": "r/politics",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511337756.0,
    "date_created": "2017-11-21",
    "time_created": "19:02:36",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zgcl",
    "parent_id": "t1_dq5tyrt",
    "subreddit_name_prefixed": "r/politics",
    "body": "His name is foreign sounding enough that if you told them he was an ISIS recruiter or Black Lives Matters coordinator, they likely wouldn’t bother with checking before hurling death threats and racism at him and his family.  ",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1511336811.0,
    "date_created": "2017-11-21",
    "time_created": "18:46:51",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5pvbb",
    "parent_id": "t1_dq5pe0j",
    "subreddit_name_prefixed": "r/politics",
    "body": ">though it'd be nice if gun safety and ownership can be dissociated from partisan politics altogether. \n\nThe NRA is working overtime to make sure that isn't the case.",
    "controversiality": 0,
    "ups": 70,
    "downs": 0,
    "score": 70,
    "created": 1511326731.0,
    "date_created": "2017-11-21",
    "time_created": "15:58:51",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5s9x9",
    "parent_id": "t1_dq5pe0j",
    "subreddit_name_prefixed": "r/politics",
    "body": "It's more partisan as in resistance fighter than partisan as the US political system.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511329062.0,
    "date_created": "2017-11-21",
    "time_created": "16:37:42",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq608di",
    "parent_id": "t1_dq5n9j8",
    "subreddit_name_prefixed": "r/politics",
    "body": "What's great is that everyone he loves probably WILL turn against him because of this. The only people on his side now or his corporate Masters, and only so long as he does their bidding. I suspect he will die a sad and lonely man.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511337740.0,
    "date_created": "2017-11-21",
    "time_created": "19:02:20",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq6h688",
    "parent_id": "t1_dq5z0rg",
    "subreddit_name_prefixed": "r/politics",
    "body": "I'm pissed at most of the idealistic Boomers in my life, and the self-absorbed Millennials who are too jaded to go to the goddamn polls. One told me, \"What I've noticed, is politics is a pendulum. It's conservative now, but it will swing back next election.\" Such a ray of hope! I gave him the exact same \"Are you actually this stupid?\" look I give my parents.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511360951.0,
    "date_created": "2017-11-22",
    "time_created": "01:29:11",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq61t76",
    "parent_id": "t1_dq5z0rg",
    "subreddit_name_prefixed": "r/politics",
    "body": "Then blame Obama for his financial irresponsibility. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511339679.0,
    "date_created": "2017-11-21",
    "time_created": "19:34:39",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq63nxc",
    "parent_id": "t1_dq5zj3q",
    "subreddit_name_prefixed": "r/politics",
    "body": "I thought this was what the whole 2nd amendment arguments was built around ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1511341977.0,
    "date_created": "2017-11-21",
    "time_created": "20:12:57",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq66g4p",
    "parent_id": "t1_dq5zj3q",
    "subreddit_name_prefixed": "r/politics",
    "body": "Throw our keurigs into the harbor? ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511345431.0,
    "date_created": "2017-11-21",
    "time_created": "21:10:31",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq618z6",
    "parent_id": "t1_dq5zanz",
    "subreddit_name_prefixed": "r/politics",
    "body": "> food, water, shelter, and ~~the internet~~.\n\nOne down, 3 to go (2 if you live in Flint).\n\n",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1511338986.0,
    "date_created": "2017-11-21",
    "time_created": "19:23:06",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq61kak",
    "parent_id": "t1_dq5zanz",
    "subreddit_name_prefixed": "r/politics",
    "body": "It's less about living comfortably, and more about not being able to afford missing work, gas to get to the city, who's going to take care of the kids while mom/dad is gone, hope we don't get hurt because insurance sure as hell isn't going to cover that.",
    "controversiality": 0,
    "ups": 55,
    "downs": 0,
    "score": 55,
    "created": 1511339375.0,
    "date_created": "2017-11-21",
    "time_created": "19:29:35",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq629y2",
    "parent_id": "t1_dq5zanz",
    "subreddit_name_prefixed": "r/politics",
    "body": "I mean, we do riot. We do protest. But its not effective bc we're too spread across a massive amount of land. We have tons of major cities, if one stops due to protests, theres fifty others that'll make the news for something else. ",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1511340262.0,
    "date_created": "2017-11-21",
    "time_created": "19:44:22",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq625js",
    "parent_id": "t1_dq5zanz",
    "subreddit_name_prefixed": "r/politics",
    "body": "What if some citizens *have already revolted*, but the government who caused that, have successfully framed it as terrorism and unconscionable violence, thus deliberately hiding the true intentions?",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1511340110.0,
    "date_created": "2017-11-21",
    "time_created": "19:41:50",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq63pd8",
    "parent_id": "t1_dq5zanz",
    "subreddit_name_prefixed": "r/politics",
    "body": "Shit, I'm almost ready to just give it all up and die out of loneliness. An actual worthwhile cause? Now that's something I'd be excited to give it all up for.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511342026.0,
    "date_created": "2017-11-21",
    "time_created": "20:13:46",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq66ebz",
    "parent_id": "t1_dq5zanz",
    "subreddit_name_prefixed": "r/politics",
    "body": "It's sad. There used to be a time where we would riot over a few cents tax hike on liquor...",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511345367.0,
    "date_created": "2017-11-21",
    "time_created": "21:09:27",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zw7a",
    "parent_id": "t1_dq5yl9p",
    "subreddit_name_prefixed": "r/politics",
    "body": "...until next year when the two companies merge.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1511337333.0,
    "date_created": "2017-11-21",
    "time_created": "18:55:33",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq650xb",
    "parent_id": "t1_dq5zznf",
    "subreddit_name_prefixed": "r/politics",
    "body": "uh, they’ll just not vote.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1511343664.0,
    "date_created": "2017-11-21",
    "time_created": "20:41:04",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq62l09",
    "parent_id": "t1_dq5ta47",
    "subreddit_name_prefixed": "r/politics",
    "body": "It's spelled \"Economic an卐iety\"",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511340642.0,
    "date_created": "2017-11-21",
    "time_created": "19:50:42",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq60eln",
    "parent_id": "t1_dq5ta47",
    "subreddit_name_prefixed": "r/politics",
    "body": "I'M SO ANXIOUS I'M GOING TO VOTE FOR 1950'S MYTHOLOGICAL NOSTALGIA!",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511337953.0,
    "date_created": "2017-11-21",
    "time_created": "19:05:53",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5q877",
    "parent_id": "t1_dq5q0oe",
    "subreddit_name_prefixed": "r/politics",
    "body": "*NewGov(tm)* - now with more DATA!\n\nIt's the *feeling* of being free with none of those messy freedumbs!",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1511327076.0,
    "date_created": "2017-11-21",
    "time_created": "16:04:36",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq601h1",
    "parent_id": "t1_dq5vqw6",
    "subreddit_name_prefixed": "r/politics",
    "body": "What is the main reason people try and defend the second amendment?\n\nI dunno, I'm just saying if you can prove tyrannical government and you get a really radical judge they might just say it was your constitutional right.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511337509.0,
    "date_created": "2017-11-21",
    "time_created": "18:58:29",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq62grf",
    "parent_id": "t1_dq628gh",
    "subreddit_name_prefixed": "r/politics",
    "body": "That's only if the ISPs favor them. If ISPs decide that Bing is a free search engine but Google is a premium service, Google is fucked and they know it. Same goes for Amazon if ISPs decide that Rakuten is free to access but Amazon requires premium pricing. \n\nThat's why Google and Amazon are also against Pai's plan.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1511340496.0,
    "date_created": "2017-11-21",
    "time_created": "19:48:16",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5ryfm",
    "parent_id": "t1_dq5pi50",
    "subreddit_name_prefixed": "r/politics",
    "body": "Because those 30 small ISPs are about to get fucked  harder than the rest of us. ",
    "controversiality": 0,
    "ups": 512,
    "downs": 0,
    "score": 512,
    "created": 1511328750.0,
    "date_created": "2017-11-21",
    "time_created": "16:32:30",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq61jr0",
    "parent_id": "t1_dq5pi50",
    "subreddit_name_prefixed": "r/politics",
    "body": "Not to mention they now become the keepers of success. Say I have a new site called StuTube, filled with videos of people named Stewart. It's a great idea and it looks like it could really give YouTube a run for their money. But it's not featured in any video packages unless I pay Verizon a lot of money. My company is forced to use to the slow limited internet and I will never be able to compete with Youtube.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511339356.0,
    "date_created": "2017-11-21",
    "time_created": "19:29:16",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq60rbw",
    "parent_id": "t1_dq5pi50",
    "subreddit_name_prefixed": "r/politics",
    "body": "Which is probably the main reason why Tom Wheeler was a good dingo.  He had his attempt at a small ISP crushed.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511338384.0,
    "date_created": "2017-11-21",
    "time_created": "19:13:04",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq61ayr",
    "parent_id": "t1_dq5pi50",
    "subreddit_name_prefixed": "r/politics",
    "body": "Is Google considered one of those small ISPs? I know this may seem like a dumb question but their market area is a pimple when compared to Charter/Time Warner, Comcast, and ATT",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511339054.0,
    "date_created": "2017-11-21",
    "time_created": "19:24:14",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq68j6a",
    "parent_id": "t1_dq5pi50",
    "subreddit_name_prefixed": "r/politics",
    "body": "I hope they are party to the gigantic lawsuit filed in opposition of this deregulation.  I just hope it gets before a judge who isn’t a Trump plant.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511348035.0,
    "date_created": "2017-11-21",
    "time_created": "21:53:55",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq6aq4m",
    "parent_id": "t1_dq5pi50",
    "subreddit_name_prefixed": "r/politics",
    "body": "Correct. I have a single ISP option in my community for anything other than LTE-based access, so this isn't going to \"promote competition\" here. There's already no competition. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511350871.0,
    "date_created": "2017-11-21",
    "time_created": "22:41:11",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5o80j",
    "parent_id": "t1_dq5ms8c",
    "subreddit_name_prefixed": "r/politics",
    "body": "What do you expect from someone who was part of Verizon. I bet him and Trump had this deal to start with where he would make him head of the FCC for some Verizon kickbacks.",
    "controversiality": 0,
    "ups": 904,
    "downs": 0,
    "score": 904,
    "created": 1511325162.0,
    "date_created": "2017-11-21",
    "time_created": "15:32:42",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5q647",
    "parent_id": "t1_dq5ms8c",
    "subreddit_name_prefixed": "r/politics",
    "body": "Corporatism is always neo-fascist",
    "controversiality": 0,
    "ups": 181,
    "downs": 0,
    "score": 181,
    "created": 1511327020.0,
    "date_created": "2017-11-21",
    "time_created": "16:03:40",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5w4ko",
    "parent_id": "t1_dq5ms8c",
    "subreddit_name_prefixed": "r/politics",
    "body": "If this passes maybe people should start treating him like they treated fascists in the 40s.",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1511333029.0,
    "date_created": "2017-11-21",
    "time_created": "17:43:49",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5w3c5",
    "parent_id": "t1_dq5ms8c",
    "subreddit_name_prefixed": "r/politics",
    "body": "This is what happens when you don't vote, kids.",
    "controversiality": 0,
    "ups": 60,
    "downs": 0,
    "score": 60,
    "created": 1511332991.0,
    "date_created": "2017-11-21",
    "time_created": "17:43:11",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5x4j9",
    "parent_id": "t1_dq5npju",
    "subreddit_name_prefixed": "r/politics",
    "body": "Every message I've sent to my reps have been returned with..a \"you're wrong, this is gonna make things better\" email. Strangely enough, the three I got are almost exactly the same.",
    "controversiality": 0,
    "ups": 71,
    "downs": 0,
    "score": 71,
    "created": 1511334132.0,
    "date_created": "2017-11-21",
    "time_created": "18:02:12",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5phv9",
    "parent_id": "t1_dq5npju",
    "subreddit_name_prefixed": "r/politics",
    "body": "I sent him a similar message six months ago.  I'm sure the people who screen his messages passed it right along.",
    "controversiality": 0,
    "ups": 91,
    "downs": 0,
    "score": 91,
    "created": 1511326380.0,
    "date_created": "2017-11-21",
    "time_created": "15:53:00",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5plki",
    "parent_id": "t1_dq5npju",
    "subreddit_name_prefixed": "r/politics",
    "body": "We should give him the Santorum treatment :)",
    "controversiality": 0,
    "ups": 85,
    "downs": 0,
    "score": 85,
    "created": 1511326478.0,
    "date_created": "2017-11-21",
    "time_created": "15:54:38",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5vp2m",
    "parent_id": "t1_dq5npju",
    "subreddit_name_prefixed": "r/politics",
    "body": "I couldn't even leave voicemail.  All the boxes are full.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1511332560.0,
    "date_created": "2017-11-21",
    "time_created": "17:36:00",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5wypd",
    "parent_id": "t1_dq5npju",
    "subreddit_name_prefixed": "r/politics",
    "body": "[https://imgur.com/vE5aGlU](https://imgur.com/vE5aGlU)",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511333951.0,
    "date_created": "2017-11-21",
    "time_created": "17:59:11",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5wh2d",
    "parent_id": "t1_dq5vtrg",
    "subreddit_name_prefixed": "r/politics",
    "body": ">I hope he has children.\n\nHe has two, though I doubt they'll care since they can just pay for their shitty nu-internet with daddy's lobbying money.",
    "controversiality": 0,
    "ups": 74,
    "downs": 0,
    "score": 74,
    "created": 1511333416.0,
    "date_created": "2017-11-21",
    "time_created": "17:50:16",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zh5h",
    "parent_id": "t1_dq5vtrg",
    "subreddit_name_prefixed": "r/politics",
    "body": "The history books will remember him as the man who tried to kill (or killed) the free internet)",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1511336837.0,
    "date_created": "2017-11-21",
    "time_created": "18:47:17",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5umho",
    "parent_id": "t1_dq5n0jp",
    "subreddit_name_prefixed": "r/politics",
    "body": "Well, its just the typical right tactic of ignoring all evidence that goes against what you've already decided to do.  He's just doing this as a formal process, he already decided the moment he was picked that Net Neutrality had to go.",
    "controversiality": 0,
    "ups": 58,
    "downs": 0,
    "score": 58,
    "created": 1511331415.0,
    "date_created": "2017-11-21",
    "time_created": "17:16:55",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5u8sh",
    "parent_id": "t1_dq5s9n3",
    "subreddit_name_prefixed": "r/politics",
    "body": "I'm glad that I took my time to type out a thoughtful comment on why it was bad, then.",
    "controversiality": 0,
    "ups": 89,
    "downs": 0,
    "score": 89,
    "created": 1511331017.0,
    "date_created": "2017-11-21",
    "time_created": "17:10:17",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5vi7q",
    "parent_id": "t1_dq5s9n3",
    "subreddit_name_prefixed": "r/politics",
    "body": "You are right they have to address the comments, but not individually. Just collectively. Notice that Pai chose his words carefully,\"As I said previously, the raw number is not as important as the substantive comments that are in the record.\"  He's basically parroting the requirement back. His statement won't hurt the FCC's chances. \n",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1511332356.0,
    "date_created": "2017-11-21",
    "time_created": "17:32:36",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5yys0",
    "parent_id": "t1_dq5s9n3",
    "subreddit_name_prefixed": "r/politics",
    "body": "Oooohhhh.\n\nLitigation.\n\nThat sounds fun.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511336246.0,
    "date_created": "2017-11-21",
    "time_created": "18:37:26",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5z1my",
    "parent_id": "t1_dq5wair",
    "subreddit_name_prefixed": "r/politics",
    "body": "> the substance of the comments. They are not bound by, or even encouraged to follow, the most popular layperson viewpoint.\n\nSo they weigh the substance versus the most popular viewpoint however they like? The corporations who bought Pai and his cronies speak a million times louder than the laypeople? I suppose that fits with the political ethos of the US, sadly.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1511336338.0,
    "date_created": "2017-11-21",
    "time_created": "18:38:58",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5sa33",
    "parent_id": "t1_dq5rnzh",
    "subreddit_name_prefixed": "r/politics",
    "body": "See my comment above you ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511329066.0,
    "date_created": "2017-11-21",
    "time_created": "16:37:46",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq6c7mq",
    "parent_id": "t1_dq5yg7p",
    "subreddit_name_prefixed": "r/politics",
    "body": "Someone please make a giant post just saying we need this. I don't have the means but these people out here need to know that the little stuff they are doing matters.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511352902.0,
    "date_created": "2017-11-21",
    "time_created": "23:15:02",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq61h18",
    "parent_id": "t1_dq5xzcm",
    "subreddit_name_prefixed": "r/politics",
    "body": "Also while we're having to freak out about the proposed tax cuts for the mega-wealthy.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511339263.0,
    "date_created": "2017-11-21",
    "time_created": "19:27:43",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5soka",
    "parent_id": "t1_dq5rlaj",
    "subreddit_name_prefixed": "r/politics",
    "body": "Considering he got to appoint one Supreme Court justice and gets to appoint about 100 federal judges, we are screwed. ",
    "controversiality": 0,
    "ups": 114,
    "downs": 0,
    "score": 114,
    "created": 1511329444.0,
    "date_created": "2017-11-21",
    "time_created": "16:44:04",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5whta",
    "parent_id": "t1_dq5rlaj",
    "subreddit_name_prefixed": "r/politics",
    "body": "The diversity of federal circuits will help counter though. Lawsuits can always be filed in more liberal and plaintiff friendly districts. As long as the supreme court doesn't become anything trump envisions, there is hope. \n\nWildcard: if one side decides to try to stack the court by increasing the amount of justices. ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1511333439.0,
    "date_created": "2017-11-21",
    "time_created": "17:50:39",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5yljb",
    "parent_id": "t1_dq5yilp",
    "subreddit_name_prefixed": "r/politics",
    "body": "Fake news! it was mutual sex with a 14yo from Tinder. Does it matter? Would you rather have a *librul* in that position?\n\n/s",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1511335817.0,
    "date_created": "2017-11-21",
    "time_created": "18:30:17",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zfa9",
    "parent_id": "t1_dq5xst0",
    "subreddit_name_prefixed": "r/politics",
    "body": "Take his stupid mug hostage.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511336775.0,
    "date_created": "2017-11-21",
    "time_created": "18:46:15",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq60lto",
    "parent_id": "t1_dq60at0",
    "subreddit_name_prefixed": "r/politics",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1511338196.0,
    "date_created": "2017-11-21",
    "time_created": "19:09:56",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq60nid",
    "parent_id": "t1_dq608uy",
    "subreddit_name_prefixed": "r/politics",
    "body": "Seriously would be surprised if anyone actually brings the fight to them. First politician or corporate exec to to popped or even jumped and every media outlet will be shouting terrorism. The people’s ability to fight back died a long time ago when the government weaseled away the right to assemble a militia that gets conveniently ignored in discussions of the second amendment. Anyone tries to actually rebel against the governments practices or those of large corporations and the cia will find all the information on the organization and plotting, the fbi will carry out careful assasinations on key figures, the police will arrest participants, the media will demonize it, and worst comes to worst the army will just mow everyone down. But it won’t get to that because everyone is already pacified to the point where they are too afraid to actually discuss starting it. There’s too much to lose. The leaders are too powerful and even mentioning it could cost you any normal life to return to. And meanwhile they won’t let it get to the point where people feel like it’s their only option. People will continue to be fed entertainment and media while their freedoms are stripped away. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511338253.0,
    "date_created": "2017-11-21",
    "time_created": "19:10:53",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq629xw",
    "parent_id": "t1_dq5zgcl",
    "subreddit_name_prefixed": "r/politics",
    "body": "Show him how his supposed co-conspirators would put him in a concentration camp at their earliest convenience.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511340262.0,
    "date_created": "2017-11-21",
    "time_created": "19:44:22",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5q10y",
    "parent_id": "t1_dq5pvbb",
    "subreddit_name_prefixed": "r/politics",
    "body": "Yeah I've seen a few of their NRISIS videos. Pretty scary.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1511326886.0,
    "date_created": "2017-11-21",
    "time_created": "16:01:26",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq645v5",
    "parent_id": "t1_dq63nxc",
    "subreddit_name_prefixed": "r/politics",
    "body": "Not necessarily, when written the ‘tyranny’ stated in the amendment is most likely referring to the British or other foreign powers.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511342595.0,
    "date_created": "2017-11-21",
    "time_created": "20:23:15",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq61ox2",
    "parent_id": "t1_dq61kak",
    "subreddit_name_prefixed": "r/politics",
    "body": "The only thing to fear is fear itself.  It has come to a point where this is no longer a representative democracy. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511339530.0,
    "date_created": "2017-11-21",
    "time_created": "19:32:10",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq67244",
    "parent_id": "t1_dq61kak",
    "subreddit_name_prefixed": "r/politics",
    "body": "Amen, but fuck!",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511346202.0,
    "date_created": "2017-11-21",
    "time_created": "21:23:22",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq60dt9",
    "parent_id": "t1_dq5q877",
    "subreddit_name_prefixed": "r/politics",
    "body": "To vote for our candidate please insert $5 for the opposition candidate please insert DNA, all personal information and $5,000. \n\nThank you for using iDemocracy!^^TM\n\nYour Opinion Matters To Us!",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511337926.0,
    "date_created": "2017-11-21",
    "time_created": "19:05:26",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq63287",
    "parent_id": "t1_dq62grf",
    "subreddit_name_prefixed": "r/politics",
    "body": "What makes you think they won't team up to have a nice money/power circle jerk with eachother?",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511341230.0,
    "date_created": "2017-11-21",
    "time_created": "20:00:30",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zlb3",
    "parent_id": "t1_dq5ryfm",
    "subreddit_name_prefixed": "r/politics",
    "body": "Lol what a broken system for this to even have to happen, not to entirely blame the system rather than the people involved with it",
    "controversiality": 0,
    "ups": 167,
    "downs": 0,
    "score": 167,
    "created": 1511336973.0,
    "date_created": "2017-11-21",
    "time_created": "18:49:33",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq63bbm",
    "parent_id": "t1_dq5ryfm",
    "subreddit_name_prefixed": "r/politics",
    "body": "Not true. I'd lose my job if it meant that information could still be shared freely.\n\nThis is worse than book burning. Your internet will be about as informative as TLC and The History Channel when this shit comes to pass.\n\nPages that are not favored will specifically take X amount of time before the request goes through where X is approx the amount of time before the average user decides a page is down / not worth it. And where X + tiny amount of latency will cause a browser to assume the page is not available. Thus blocking content they claim simply isn't in the \"hyperspeed lane\" that they talked about years ago when this shit started. The same kind of delays will break certain features on websites now that the internet is not just a series of .HTML files and images but living pages actively communicating with a database.\n\nAssuming the bombs don't drop, this could potentially be the largest singular event in the Trump legacy. The day they burned the information sharing infastructure that gave birth to a new and prosperous age in order to make more fucking money.",
    "controversiality": 0,
    "ups": 104,
    "downs": 0,
    "score": 104,
    "created": 1511341544.0,
    "date_created": "2017-11-21",
    "time_created": "20:05:44",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5q7l3",
    "parent_id": "t1_dq5o80j",
    "subreddit_name_prefixed": "r/politics",
    "body": "Tom Wheeler came from similar roots (he was the original dingo babysitter), but he did a good enough job. You can't just blame kickbacks, there has to be a total lack of moral fiber, as well.",
    "controversiality": 0,
    "ups": 491,
    "downs": 0,
    "score": 491,
    "created": 1511327059.0,
    "date_created": "2017-11-21",
    "time_created": "16:04:19",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5witx",
    "parent_id": "t1_dq5o80j",
    "subreddit_name_prefixed": "r/politics",
    "body": "Pence. Everything I have heard and read suggests that Trump doesn't give a shit about anything business or policy-related. The Kochs and other anti-government anti-democracy think tanks are able to get whatever they want from the executive branch through Pence. ",
    "controversiality": 0,
    "ups": 202,
    "downs": 0,
    "score": 202,
    "created": 1511333469.0,
    "date_created": "2017-11-21",
    "time_created": "17:51:09",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5x8ya",
    "parent_id": "t1_dq5o80j",
    "subreddit_name_prefixed": "r/politics",
    "body": "Hahaha.  The plan to gut net neutrality waaaay predated trump.",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1511334272.0,
    "date_created": "2017-11-21",
    "time_created": "18:04:32",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xvwl",
    "parent_id": "t1_dq5o80j",
    "subreddit_name_prefixed": "r/politics",
    "body": "Like Trump gets HBOGO for free for life with his subscription? Or is that too lucrative?",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1511334999.0,
    "date_created": "2017-11-21",
    "time_created": "18:16:39",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5z4iu",
    "parent_id": "t1_dq5o80j",
    "subreddit_name_prefixed": "r/politics",
    "body": "Verizon is also telling it like it is:\n\n>The new chairman of the FCC was a top lawyer at Verizon. Now he's calling for a vote to kill net neutrality. We’re protesting at retail stores across the U.S. to demand that Congress stop Verizon’s puppet FCC from destroying the Internet as we know it.\n\nThey're also inviting [protest at Verizon stores](https://events.battleforthenet.com/#eventType=protestrally) on December 7.\n\nThe 6th and 8th could use some love, too.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511336429.0,
    "date_created": "2017-11-21",
    "time_created": "18:40:29",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5r5kh",
    "parent_id": "t1_dq5q647",
    "subreddit_name_prefixed": "r/politics",
    "body": "Neoliberal deregulation sets the conditions for fascism. Every. Single. Time.\n\nI don’t get why we haven’t learned this lesson yet as a society. Dismantling the social safety net and alienating millions of people does not have happy results.",
    "controversiality": 0,
    "ups": 227,
    "downs": 0,
    "score": 227,
    "created": 1511327972.0,
    "date_created": "2017-11-21",
    "time_created": "16:19:32",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5x857",
    "parent_id": "t1_dq5w4ko",
    "subreddit_name_prefixed": "r/politics",
    "body": "No, see, they're going to be treating us like fascists treated regular people in the 40's. \n\nIt's just not an ethnic thing anymore, it's a money thing. ",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1511334246.0,
    "date_created": "2017-11-21",
    "time_created": "18:04:06",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5yr4x",
    "parent_id": "t1_dq5w3c5",
    "subreddit_name_prefixed": "r/politics",
    "body": "I voted. This still happened. ",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1511335999.0,
    "date_created": "2017-11-21",
    "time_created": "18:33:19",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5yrgo",
    "parent_id": "t1_dq5w3c5",
    "subreddit_name_prefixed": "r/politics",
    "body": "Kids can't vote Mr. Adultman ",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1511336010.0,
    "date_created": "2017-11-21",
    "time_created": "18:33:30",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq62rtb",
    "parent_id": "t1_dq5w3c5",
    "subreddit_name_prefixed": "r/politics",
    "body": "We did vote. We voted overwhelmingly against Trump, and overwhelmingly against ending NN. The “ruling class” doesn’t give a fuck what the commoners think and will do whatever the fuck they want regardless. \n\nWe don’t live in any form of democracy other than name. DINO, Democracy in Name Only. The only difference is that our oligarchs stopped trying to pretend that our voice matters. The GO in GOP is for “GO fuck yourself” \n\nThere isn’t any secret conspiracy to destroy America, these people just don’t care about anything outside their wealth bubble. So long as they can make a dollar off it, that’s what they do. If Trump could sell California to the highest bidder he would. If it means putting a Pedophile in office, they will. We keep seeing “party over country” it’s not, it’s profits above all else. \n\nThe GOP has a perfect opportunity to throw trump under the bus, along with Moore and others claiming that they have been compromised. Fox would push the message of how their “moral high ground” saved the country while the democrats sat idly back and let the country go to shit, and their dumb shit  viewers would believe it. They would be able to ram all their shit legislation through even faster, while boosting their image and avoiding all the forthcoming scandals. Yet they don’t. Because they don’t give a shit even for their own party, wealth is simply the only goal, no matter what or who it fucks over and destroys. The faster the better. \n\n Voting is still absolutely vital, don’t get me wrong everyone still needs to vote, now more than ever. But it’s going take more than just voting. I DON’T mean violence.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511340876.0,
    "date_created": "2017-11-21",
    "time_created": "19:54:36",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5yyfj",
    "parent_id": "t1_dq5x4j9",
    "subreddit_name_prefixed": "r/politics",
    "body": "It might well make things better for *them*, because they probably have some nice corporate donations tied to the overturn of net neutrality.",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1511336234.0,
    "date_created": "2017-11-21",
    "time_created": "18:37:14",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5z4h6",
    "parent_id": "t1_dq5x4j9",
    "subreddit_name_prefixed": "r/politics",
    "body": "Huh, that sounds an awful lot like the emails I got from mine back in August. And September. October, too. I sent yet another appeal to their human decency so I can have an even 8 (one each) identical responses and laugh/cry myself to sleep.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1511336427.0,
    "date_created": "2017-11-21",
    "time_created": "18:40:27",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq661ij",
    "parent_id": "t1_dq5x4j9",
    "subreddit_name_prefixed": "r/politics",
    "body": "I sent a letter asking \"How much money do I have to donate to you to get you to change your vote?\" I just got a form letter in response.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511344917.0,
    "date_created": "2017-11-21",
    "time_created": "21:01:57",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq63izr",
    "parent_id": "t1_dq5phv9",
    "subreddit_name_prefixed": "r/politics",
    "body": "\nWe need to show up in person! :) Put faces to the numbers!\n\nhttps://www.reddit.com/r/DC_FCC_Protest/\n\nhttps://twitter.com/Hunterkll/status/930982627691114496",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1511341808.0,
    "date_created": "2017-11-21",
    "time_created": "20:10:08",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5sw2v",
    "parent_id": "t1_dq5plki",
    "subreddit_name_prefixed": "r/politics",
    "body": "Agreed! I'll hazard a definition: \"Ajitpai\" -- the clogs that form in drains in college dorms from excessive shower masturbation by the residents.",
    "controversiality": 0,
    "ups": 156,
    "downs": 0,
    "score": 156,
    "created": 1511329641.0,
    "date_created": "2017-11-21",
    "time_created": "16:47:21",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5v51x",
    "parent_id": "t1_dq5plki",
    "subreddit_name_prefixed": "r/politics",
    "body": "Holy shit.  That idea is great.  How do we go about doing that?",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1511331962.0,
    "date_created": "2017-11-21",
    "time_created": "17:26:02",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5sbff",
    "parent_id": "t1_dq5plki",
    "subreddit_name_prefixed": "r/politics",
    "body": "Call it a \"cream Pai\"?",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1511329102.0,
    "date_created": "2017-11-21",
    "time_created": "16:38:22",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq67xbp",
    "parent_id": "t1_dq5plki",
    "subreddit_name_prefixed": "r/politics",
    "body": "Well, clearly trying to justify this bullshit with an article he wrote, he thinks we're idiots, so by logic of the golden rule, we have to treat him like an idiot.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511347288.0,
    "date_created": "2017-11-21",
    "time_created": "21:41:28",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5w2la",
    "parent_id": "t1_dq5vp2m",
    "subreddit_name_prefixed": "r/politics",
    "body": "To be fair I just called my local rep, Jim Jordan (total pos scum bag), again after I got off of work and I got through to his exhausted sounding assistant.  He didn't seem to care, but he did promise to pass my message along.  I made the jerk off motion the whole time he was talking...so there is that. ",
    "controversiality": 0,
    "ups": 59,
    "downs": 0,
    "score": 59,
    "created": 1511332967.0,
    "date_created": "2017-11-21",
    "time_created": "17:42:47",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq631va",
    "parent_id": "t1_dq5wh2d",
    "subreddit_name_prefixed": "r/politics",
    "body": "That donkey toothed mother fucker.\n\nI hope his two kids also have donkey teeth. Fuck that guy.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511341218.0,
    "date_created": "2017-11-21",
    "time_created": "20:00:18",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq6a9g0",
    "parent_id": "t1_dq5wh2d",
    "subreddit_name_prefixed": "r/politics",
    "body": "Also rich people probably don't love their children like we love ours. They aren't like us. Something about their culture prevents them having morals. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511350259.0,
    "date_created": "2017-11-21",
    "time_created": "22:30:59",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5vsou",
    "parent_id": "t1_dq5umho",
    "subreddit_name_prefixed": "r/politics",
    "body": "And that is likely the best hope we have to save net neutrality. I don't trust the reps to fight. I don't trust Pai to bend to pressure. What I do trust is that Pai's comments are going to prove to be a violation of required procedures, and the repeal will be successfully challenged as a result.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1511332668.0,
    "date_created": "2017-11-21",
    "time_created": "17:37:48",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xquf",
    "parent_id": "t1_dq5u8sh",
    "subreddit_name_prefixed": "r/politics",
    "body": "Hopefully they don't have any mysterious server malfunctions.",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1511334837.0,
    "date_created": "2017-11-21",
    "time_created": "18:13:57",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq62uo7",
    "parent_id": "t1_dq5vi7q",
    "subreddit_name_prefixed": "r/politics",
    "body": "His statement won't, but the fact that this policy change does not address public comments will.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511340972.0,
    "date_created": "2017-11-21",
    "time_created": "19:56:12",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq63u2u",
    "parent_id": "t1_dq5z1my",
    "subreddit_name_prefixed": "r/politics",
    "body": "> So they weigh the substance versus the most popular viewpoint however they like\n\nWell, the most popular viewpoint can also be of substance, but the agency is not required to give any extra weight to “five thousand people submitted this form letter” than to analyze the argument and evidence itself.\n\nAgencies are not meant to be responsive directly to public opinion. They are meant to analyze the evidence and form an expert decision on the best policy.\n\nWe can disagree with an agency on policy, and even its legal mandate, but to invoke pure popularity of an opinion misses the point of administrative agencies.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511342190.0,
    "date_created": "2017-11-21",
    "time_created": "20:16:30",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq6o8ih",
    "parent_id": "t1_dq5z1my",
    "subreddit_name_prefixed": "r/politics",
    "body": "The US chose capitalism without regulation, it believed the lies about the trickle-down effect. And that social responsibility is evil communism. Now the banks have been exempted from accountability. Public schooling is being destroyed as part of the \"more money for the rich\" scheme. And net neutrality is yet another stab at the common citizen. Or should I say a grab at his purse. At least it's getting some attention.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511378150.0,
    "date_created": "2017-11-22",
    "time_created": "06:15:50",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq61njm",
    "parent_id": "t1_dq61h18",
    "subreddit_name_prefixed": "r/politics",
    "body": "Trump was right, I am so sick of winning. So sick of the super rich winning.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511339484.0,
    "date_created": "2017-11-21",
    "time_created": "19:31:24",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5t697",
    "parent_id": "t1_dq5soka",
    "subreddit_name_prefixed": "r/politics",
    "body": ">Considering he got to appoint one Supreme Court justice and gets to appoint about 100 feseral judges,\n\nSo far.  Mueller has already taken too long.",
    "controversiality": 0,
    "ups": 90,
    "downs": 0,
    "score": 90,
    "created": 1511329922.0,
    "date_created": "2017-11-21",
    "time_created": "16:52:02",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5udxp",
    "parent_id": "t1_dq5soka",
    "subreddit_name_prefixed": "r/politics",
    "body": "It's been a year. Has he still not managed to fill those spots? \n\n\nAt this point I'm wondering if Trump Casino went bankrupt because he never filled any security positions and they got taken by card counters. Is he truly this bad at finding candidates for positions he *wants to* fill? \n\n\nOr does he just not actually want to fill them and hopes the position somehow goes away?",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1511331168.0,
    "date_created": "2017-11-21",
    "time_created": "17:12:48",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5ytvp",
    "parent_id": "t1_dq5whta",
    "subreddit_name_prefixed": "r/politics",
    "body": "Except, it eventually ends up at the Supreme Court that the traitors stole",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511336087.0,
    "date_created": "2017-11-21",
    "time_created": "18:34:47",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq617y7",
    "parent_id": "t1_dq5zfa9",
    "subreddit_name_prefixed": "r/politics",
    "body": "Make his face the first result when you google Hitler or deepshit.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511338950.0,
    "date_created": "2017-11-21",
    "time_created": "19:22:30",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq617zq",
    "parent_id": "t1_dq5zfa9",
    "subreddit_name_prefixed": "r/politics",
    "body": "People should block his driveway and try charging him for passage.  He should have a spotlight on his house that doesn't turn off. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511338951.0,
    "date_created": "2017-11-21",
    "time_created": "19:22:31",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq64qm0",
    "parent_id": "t1_dq645v5",
    "subreddit_name_prefixed": "r/politics",
    "body": "I mean, I don't think that's the case. The Founders thought of themselves as British and the British government as their government before the revolution. And it became tyrannical to them.\n\nBritain wasn't a foreign power at the time of the revolution. That was the whole point of it.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511343313.0,
    "date_created": "2017-11-21",
    "time_created": "20:35:13",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq63uof",
    "parent_id": "t1_dq63287",
    "subreddit_name_prefixed": "r/politics",
    "body": "Maybe they will. But right now they’re opposing it. \n\nI’m not under any delusions that Google or Amazon are altruistic. But they oppose this change because it’s not good for them. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511342211.0,
    "date_created": "2017-11-21",
    "time_created": "20:16:51",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq602mx",
    "parent_id": "t1_dq5zlb3",
    "subreddit_name_prefixed": "r/politics",
    "body": "Gotta laugh when the higher ups say they're very anti monopoly while gladly contributing towards massive monopolies.",
    "controversiality": 0,
    "ups": 139,
    "downs": 0,
    "score": 139,
    "created": 1511337548.0,
    "date_created": "2017-11-21",
    "time_created": "18:59:08",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq64hgi",
    "parent_id": "t1_dq5zlb3",
    "subreddit_name_prefixed": "r/politics",
    "body": "the system is to blame, it's called capitalism, and this is always what happens with it.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511342997.0,
    "date_created": "2017-11-21",
    "time_created": "20:29:57",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq68r6n",
    "parent_id": "t1_dq63bbm",
    "subreddit_name_prefixed": "r/politics",
    "body": "I would compare this to Erdoğan starting to censor the internet in Turkey",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1511348311.0,
    "date_created": "2017-11-21",
    "time_created": "21:58:31",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq6b0wj",
    "parent_id": "t1_dq63bbm",
    "subreddit_name_prefixed": "r/politics",
    "body": "Total fascism",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1511351272.0,
    "date_created": "2017-11-21",
    "time_created": "22:47:52",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq6cs32",
    "parent_id": "t1_dq63bbm",
    "subreddit_name_prefixed": "r/politics",
    "body": ">about as informative as TLC and the history channel.\n\nSo...just Nazis and kindergarten pageants?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511353710.0,
    "date_created": "2017-11-21",
    "time_created": "23:28:30",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5s0aq",
    "parent_id": "t1_dq5q7l3",
    "subreddit_name_prefixed": "r/politics",
    "body": "I've learned here on this sub that Wheeler wasn't all that great. He just did a few decent things.",
    "controversiality": 0,
    "ups": 174,
    "downs": 0,
    "score": 174,
    "created": 1511328800.0,
    "date_created": "2017-11-21",
    "time_created": "16:33:20",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5yzw3",
    "parent_id": "t1_dq5q7l3",
    "subreddit_name_prefixed": "r/politics",
    "body": "Ashit Pai is everything people were worried Tom Wheeler would be.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1511336283.0,
    "date_created": "2017-11-21",
    "time_created": "18:38:03",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq6agp3",
    "parent_id": "t1_dq5q7l3",
    "subreddit_name_prefixed": "r/politics",
    "body": "[The difference is Wheeler had created an internet startup prior to becoming a lobbyist during the early days of the internet.  One of his ventures, NABU Network was screwed over by the lack of net neutrality.  His ISP company operated on cable lines that were hundreds of times faster than AOL (1.5mbps-6.4mbps vs dialup in the mid 80s), but his ventures failed due to the cable company's interference.](https://arstechnica.com/information-technology/2015/02/why-the-ex-cable-lobbyist-running-the-fcc-turned-against-his-old-clients/)  He knew what the lack of NN could do to smaller companies who can offer more competition to the market and benefit the people.\n\nMeanwhile Pai has been a corporate shill his entire life.  He spent the most of his career working for ISPs doing mergers and acquisitions and as a general counsel for Verizon.  ISP corporations are his life and family and he's not about to turn his back on the hands that feed him well.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511350521.0,
    "date_created": "2017-11-21",
    "time_created": "22:35:21",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5ypzt",
    "parent_id": "t1_dq5q7l3",
    "subreddit_name_prefixed": "r/politics",
    "body": "So little morality, you'll forget the fiber!",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511335963.0,
    "date_created": "2017-11-21",
    "time_created": "18:32:43",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq62rwu",
    "parent_id": "t1_dq5q7l3",
    "subreddit_name_prefixed": "r/politics",
    "body": "Yeah, but look where Tom Wheeler is now. We all hated him first and then loved him. But once he left FCC, he is pretty much unemployed.\n\nSo, Pai is doing what he wants to make it big in Telecom. The only way he can do is to help them this way.\nOnce he quits FCC in 2020, he should be discarded by all Telecoms and thrown on street. Now, THAT would be sweet.\n",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511340880.0,
    "date_created": "2017-11-21",
    "time_created": "19:54:40",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5wq6z",
    "parent_id": "t1_dq5witx",
    "subreddit_name_prefixed": "r/politics",
    "body": "That's more or less what Trump had said previously about Pence's role. ",
    "controversiality": 0,
    "ups": 91,
    "downs": 0,
    "score": 91,
    "created": 1511333697.0,
    "date_created": "2017-11-21",
    "time_created": "17:54:57",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5yhs9",
    "parent_id": "t1_dq5x8ya",
    "subreddit_name_prefixed": "r/politics",
    "body": "Yep. Trump's election just paved the way for the GOP to finally carry it out.\n\nHe doesn't give a shit about net neutrality, or about most other things. They give him Pai's name as a great candidate, he appoints him. Never mind that Pai has been selected by corporate interests already.",
    "controversiality": 0,
    "ups": 57,
    "downs": 0,
    "score": 57,
    "created": 1511335698.0,
    "date_created": "2017-11-21",
    "time_created": "18:28:18",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5yisb",
    "parent_id": "t1_dq5x8ya",
    "subreddit_name_prefixed": "r/politics",
    "body": "Except now there's immediate traction and it's becoming a reality.  Until now we've been able to keep it from happening. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1511335730.0,
    "date_created": "2017-11-21",
    "time_created": "18:28:50",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5tpq3",
    "parent_id": "t1_dq5r5kh",
    "subreddit_name_prefixed": "r/politics",
    "body": "I thought neolibrals were the pro-regulation capitalists? I can't keep up with all these labels.",
    "controversiality": 0,
    "ups": 70,
    "downs": 0,
    "score": 70,
    "created": 1511330460.0,
    "date_created": "2017-11-21",
    "time_created": "17:01:00",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq68m50",
    "parent_id": "t1_dq5r5kh",
    "subreddit_name_prefixed": "r/politics",
    "body": "Exactly, but try telling people about the evils of neo-liberalism and see how many downvotes you get.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511348138.0,
    "date_created": "2017-11-21",
    "time_created": "21:55:38",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xsbd",
    "parent_id": "t1_dq5x857",
    "subreddit_name_prefixed": "r/politics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1511334884.0,
    "date_created": "2017-11-21",
    "time_created": "18:14:44",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq6152l",
    "parent_id": "t1_dq5yr4x",
    "subreddit_name_prefixed": "r/politics",
    "body": "He obviously meant the people who *didn't* vote. And a LOT of people didn't vote in 2016. If more people voted, Trump wouldn't be President. It's a proven fact that when more people show up at the polls, Democrats win. Every. Single. Time. ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1511338852.0,
    "date_created": "2017-11-21",
    "time_created": "19:20:52",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq60d51",
    "parent_id": "t1_dq5yr4x",
    "subreddit_name_prefixed": "r/politics",
    "body": "Vote again, and again, then keep on voting.  Apathy and distraction are two of their most powerful weapons.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511337903.0,
    "date_created": "2017-11-21",
    "time_created": "19:05:03",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq6205w",
    "parent_id": "t1_dq5yr4x",
    "subreddit_name_prefixed": "r/politics",
    "body": "Just so we’re clear: not voting next time won’t make it better.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1511339922.0,
    "date_created": "2017-11-21",
    "time_created": "19:38:42",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq632ea",
    "parent_id": "t1_dq5yrgo",
    "subreddit_name_prefixed": "r/politics",
    "body": "Also, [blaming the voters](https://youtu.be/F5K7UmYkD1I) when Hillary won the popular vote is inherently dishonest",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511341236.0,
    "date_created": "2017-11-21",
    "time_created": "20:00:36",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq69fu1",
    "parent_id": "t1_dq5yyfj",
    "subreddit_name_prefixed": "r/politics",
    "body": "Ask them what happens when the ISP starts to block Fox News.\n\nIt's not even like its bad for consumers. Its bad for everyone. The ISPs would have carte blanche to start bilking Both Ends. \n\nBusiness, you want access to consumers? Pay up.\n\nConsumers, you want access to business? Pay up.\n\nMeanwhile you can still keep the \"Up to X\" wording and do fuck all in terms of actually sticking to what they pay for.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511349182.0,
    "date_created": "2017-11-21",
    "time_created": "22:13:02",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5tbtm",
    "parent_id": "t1_dq5sw2v",
    "subreddit_name_prefixed": "r/politics",
    "body": "It's semen, pubes, snot, spit, sweat, dirt, and dead skin.\n\nEdit: and dingleberries and poo.",
    "controversiality": 0,
    "ups": 74,
    "downs": 0,
    "score": 74,
    "created": 1511330075.0,
    "date_created": "2017-11-21",
    "time_created": "16:54:35",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5uh3h",
    "parent_id": "t1_dq5sw2v",
    "subreddit_name_prefixed": "r/politics",
    "body": "We've got it, you're beautiful.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511331259.0,
    "date_created": "2017-11-21",
    "time_created": "17:14:19",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5uyoy",
    "parent_id": "t1_dq5sw2v",
    "subreddit_name_prefixed": "r/politics",
    "body": "Lets make this thing please.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511331774.0,
    "date_created": "2017-11-21",
    "time_created": "17:22:54",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq61yra",
    "parent_id": "t1_dq5sw2v",
    "subreddit_name_prefixed": "r/politics",
    "body": "Back in college I was an NFL prospect until I jacked up my ankle from that slip on ajitpai.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511339873.0,
    "date_created": "2017-11-21",
    "time_created": "19:37:53",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5wxjo",
    "parent_id": "t1_dq5v51x",
    "subreddit_name_prefixed": "r/politics",
    "body": "I feel like John Oliver and Steven Colbert could get the ball rolling on these. ",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1511333917.0,
    "date_created": "2017-11-21",
    "time_created": "17:58:37",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5stwi",
    "parent_id": "t1_dq5sbff",
    "subreddit_name_prefixed": "r/politics",
    "body": "Username does not check out",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1511329583.0,
    "date_created": "2017-11-21",
    "time_created": "16:46:23",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xg5t",
    "parent_id": "t1_dq5w2la",
    "subreddit_name_prefixed": "r/politics",
    "body": "You do what you can, ya know? ",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1511334499.0,
    "date_created": "2017-11-21",
    "time_created": "18:08:19",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5ynvc",
    "parent_id": "t1_dq5w2la",
    "subreddit_name_prefixed": "r/politics",
    "body": "Same happened to me when i reached Clay Higgins, and the assistant said he didn't have a say in the vote(?)",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511335893.0,
    "date_created": "2017-11-21",
    "time_created": "18:31:33",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5yill",
    "parent_id": "t1_dq5vsou",
    "subreddit_name_prefixed": "r/politics",
    "body": "Too bad we have a Supreme Court where the new guy was bought by Russia to defend eliminating net neutrality",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1511335724.0,
    "date_created": "2017-11-21",
    "time_created": "18:28:44",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq691fo",
    "parent_id": "t1_dq63u2u",
    "subreddit_name_prefixed": "r/politics",
    "body": "This is where I have the most beef. This man is an expert, sure. On making telecommunications companies money. Not on making \"best policy\" for Americans en masse. This seems endemic of this administration: appointment of folks who are only interested in promoting the downfall of the agency they are supposed to be caretakers of. \"we do what we want, take us to court, we have this appointed power\". Then we get an even more protracted time line of action /reaction, people lose interest, their interests are subverted, and ratified by law....by the Supreme Court Justices, also appointed by the administration. This just feels like a hijacking. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511348667.0,
    "date_created": "2017-11-21",
    "time_created": "22:04:27",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5wgf6",
    "parent_id": "t1_dq5t697",
    "subreddit_name_prefixed": "r/politics",
    "body": "I doubt Pence - or any other Republican - would be any better on the judicial front. These are the kind of people that Republicans want to fill the bench - Gilded Age-style libertarian radicals, like Alito, Gorsuch and the late Scalia.",
    "controversiality": 0,
    "ups": 66,
    "downs": 0,
    "score": 66,
    "created": 1511333397.0,
    "date_created": "2017-11-21",
    "time_created": "17:49:57",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zquk",
    "parent_id": "t1_dq5udxp",
    "subreddit_name_prefixed": "r/politics",
    "body": "if you don't fill the positions that's one way to downsize the government I guess ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511337152.0,
    "date_created": "2017-11-21",
    "time_created": "18:52:32",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq65cs5",
    "parent_id": "t1_dq617y7",
    "subreddit_name_prefixed": "r/politics",
    "body": "/r/LateStageCapitalism is doing this with \"venal,\" a word that means, \"showing or motivated by susceptibility to bribery.\"",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511344064.0,
    "date_created": "2017-11-21",
    "time_created": "20:47:44",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq684me",
    "parent_id": "t1_dq64qm0",
    "subreddit_name_prefixed": "r/politics",
    "body": "The Bill of Rights was written 15 years after the Declaration of Independence.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511347536.0,
    "date_created": "2017-11-21",
    "time_created": "21:45:36",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq66k9e",
    "parent_id": "t1_dq602mx",
    "subreddit_name_prefixed": "r/politics",
    "body": "It's the Republican way.",
    "controversiality": 0,
    "ups": 66,
    "downs": 0,
    "score": 66,
    "created": 1511345577.0,
    "date_created": "2017-11-21",
    "time_created": "21:12:57",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq69m2o",
    "parent_id": "t1_dq602mx",
    "subreddit_name_prefixed": "r/politics",
    "body": "That’s the thing. They’re anti-monopoly when they can’t be part of the monopoly.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511349406.0,
    "date_created": "2017-11-21",
    "time_created": "22:16:46",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq68vhb",
    "parent_id": "t1_dq602mx",
    "subreddit_name_prefixed": "r/politics",
    "body": "they lie with every word and think we can't tell",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511348461.0,
    "date_created": "2017-11-21",
    "time_created": "22:01:01",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq6qxx7",
    "parent_id": "t1_dq68r6n",
    "subreddit_name_prefixed": "r/politics",
    "body": "But to the mass majority of ~~dumbasses~~ people out there, only government dictators censor us; not good hard working American corporations. Surely the almighty hand of unregulated capitalism will only bring in things pure and good /s",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511384046.0,
    "date_created": "2017-11-22",
    "time_created": "07:54:06",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq6cqie",
    "parent_id": "t1_dq68r6n",
    "subreddit_name_prefixed": "r/politics",
    "body": "I was thinking the same thing.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511353647.0,
    "date_created": "2017-11-21",
    "time_created": "23:27:27",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5v2ll",
    "parent_id": "t1_dq5s0aq",
    "subreddit_name_prefixed": "r/politics",
    "body": "yeah, the definition of \"lesser of two evils\"",
    "controversiality": 0,
    "ups": 185,
    "downs": 0,
    "score": 185,
    "created": 1511331890.0,
    "date_created": "2017-11-21",
    "time_created": "17:24:50",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5yqvi",
    "parent_id": "t1_dq5s0aq",
    "subreddit_name_prefixed": "r/politics",
    "body": "Can I get some more on this? Because I heard the good stuff but not really any bad stuff. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511335990.0,
    "date_created": "2017-11-21",
    "time_created": "18:33:10",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq626n7",
    "parent_id": "t1_dq5s0aq",
    "subreddit_name_prefixed": "r/politics",
    "body": "Wheeler came in with awful ideas but he heard us and changed his mind. That's EXACTLY what the kind of person we should've been happy with - someone that fucking listens. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511340148.0,
    "date_created": "2017-11-21",
    "time_created": "19:42:28",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5yy2q",
    "parent_id": "t1_dq5s0aq",
    "subreddit_name_prefixed": "r/politics",
    "body": "Like what?  I'm not really aware of any significant policy changes from the FCC besides net neutrality.  ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511336222.0,
    "date_created": "2017-11-21",
    "time_created": "18:37:02",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq64kmv",
    "parent_id": "t1_dq5s0aq",
    "subreddit_name_prefixed": "r/politics",
    "body": "He started off pretty much status quo, which was oligopoly. After tons of backlash from previous bills, he flipped.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511343108.0,
    "date_created": "2017-11-21",
    "time_created": "20:31:48",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5x28w",
    "parent_id": "t1_dq5wq6z",
    "subreddit_name_prefixed": "r/politics",
    "body": "Right, so basically, Trump was being honest about this particular thing. ",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1511334060.0,
    "date_created": "2017-11-21",
    "time_created": "18:01:00",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq60zf8",
    "parent_id": "t1_dq5wq6z",
    "subreddit_name_prefixed": "r/politics",
    "body": "Pence was in charge of domestic and foreign policy while Trump #MAGA'd was the plan if I'm not mistaken. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511338660.0,
    "date_created": "2017-11-21",
    "time_created": "19:17:40",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq60vfv",
    "parent_id": "t1_dq5yisb",
    "subreddit_name_prefixed": "r/politics",
    "body": "The democratic administration has been the only thing keeping it at bay.  I told people for years that voting against Clinton and/or a democratic Congress would result in killing net neutrality.  I got as many blank states as I did bringing up environmental issues.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1511338521.0,
    "date_created": "2017-11-21",
    "time_created": "19:15:21",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5vx7q",
    "parent_id": "t1_dq5tpq3",
    "subreddit_name_prefixed": "r/politics",
    "body": "He's talking about the classical definition, not the modern American bastardization of political terminology.  Neoliberals were a reaction to Keynesian policies that dominated the US for a long time. Perhaps the  analogy is something like libertarian policies. ",
    "controversiality": 0,
    "ups": 91,
    "downs": 0,
    "score": 91,
    "created": 1511332803.0,
    "date_created": "2017-11-21",
    "time_created": "17:40:03",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5x3f6",
    "parent_id": "t1_dq5tpq3",
    "subreddit_name_prefixed": "r/politics",
    "body": "Depends on who's defining it - people who cannot accept that words change or people who actively describe themselves with the label. The former is the pro-capitalism, laissez faire until everyone's dead category. The latter is what you were thinking of, as evidenced by r/neoliberal.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1511334097.0,
    "date_created": "2017-11-21",
    "time_created": "18:01:37",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5tw3y",
    "parent_id": "t1_dq5tpq3",
    "subreddit_name_prefixed": "r/politics",
    "body": "No, I don't know when that started being the definition. Neo-liberalism is an economic philosophy that works to deregulate everything because even if things get really bad, the fancy invisible hand of the market will correct itself. ",
    "controversiality": 0,
    "ups": 94,
    "downs": 0,
    "score": 94,
    "created": 1511330649.0,
    "date_created": "2017-11-21",
    "time_created": "17:04:09",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zugs",
    "parent_id": "t1_dq5tpq3",
    "subreddit_name_prefixed": "r/politics",
    "body": "No. Anyone who would say that has to be deliberatly deceptive. Neo-liberalism has been associated with laissez-faire capitalism in the US since the 70s. That's a change from it's earlier meaning (that most americans would have never heard of) where it was associated with european economies (especially Germanys [Social Market Economy](https://en.wikipedia.org/wiki/Social_market_economy)) trying the bridge the gap between classical liberalism (which had catastrophic consequences, see 19th century europe) and the command economy of the socialist countries (themselfs a result of the catastrophic outcomes of classical liberalism..). In the new american (and now essentially global) meaning of neo-liberalism is is specifically *against* regulation, because it's basically \"laissez-faire capitalism, again\".\n\nDemocrats are neo-liberal, but republicans are neo-liberal ***as fuck***.\n\nI'd be really interrested to know why you thought neo-liberalism is pro-regulation. I mean, who's spreading that non-sense?",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1511337273.0,
    "date_created": "2017-11-21",
    "time_created": "18:54:33",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5ysl4",
    "parent_id": "t1_dq5tpq3",
    "subreddit_name_prefixed": "r/politics",
    "body": "Pro-regulation capitalists are Keynesians or Social Democrats (Think FDR and Bernie). Anti-regulation capitalists are neoliberals (Think Paul Ryan and Reagan).",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511336045.0,
    "date_created": "2017-11-21",
    "time_created": "18:34:05",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xrbb",
    "parent_id": "t1_dq5tpq3",
    "subreddit_name_prefixed": "r/politics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1511334851.0,
    "date_created": "2017-11-21",
    "time_created": "18:14:11",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq68tum",
    "parent_id": "t1_dq68m50",
    "subreddit_name_prefixed": "r/politics",
    "body": "So many “economic conservatives” don’t realize they are setting up the dominoes for fascism - or they don’t care - or they are fascists.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511348405.0,
    "date_created": "2017-11-21",
    "time_created": "22:00:05",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xa72",
    "parent_id": "t1_dq5tbtm",
    "subreddit_name_prefixed": "r/politics",
    "body": "Sorry, but why are you being so kind?",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1511334312.0,
    "date_created": "2017-11-21",
    "time_created": "18:05:12",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5zhvs",
    "parent_id": "t1_dq5tbtm",
    "subreddit_name_prefixed": "r/politics",
    "body": "Don't compare Ajit Pai to a rotting clog of semen, pubes, and snot.  At least the rotting clog of semen, pubes, and snot isn't an immoral sociopath bent on destroying American's access to one of the greatest literary and technological achievements ever made for a yacht or a gaggle of prostitutes or whatever pathetic creature comfort that sniveling pile of human trash sold us out for.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511336861.0,
    "date_created": "2017-11-21",
    "time_created": "18:47:41",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5yzfk",
    "parent_id": "t1_dq5tbtm",
    "subreddit_name_prefixed": "r/politics",
    "body": "Waffle-stomp it all away.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511336268.0,
    "date_created": "2017-11-21",
    "time_created": "18:37:48",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq6blmn",
    "parent_id": "t1_dq691fo",
    "subreddit_name_prefixed": "r/politics",
    "body": "All of which is a very good argument for putting better people in office. But we are not served well by either pretending that the laws and precedent that apply don’t exist (as many here are doing), nor by the Republican habit of rejecting the legitimacy of government institutions because we do not like the outcome.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511352050.0,
    "date_created": "2017-11-21",
    "time_created": "23:00:50",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5yjm2",
    "parent_id": "t1_dq5wgf6",
    "subreddit_name_prefixed": "r/politics",
    "body": "Even if only some of the stuff we are hearing coming from and around the Mueller investigation is true, it's not just going to be Trump. I'm personally hoping hundreds of high ranking GOP go to jail over this.",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1511335757.0,
    "date_created": "2017-11-21",
    "time_created": "18:29:17",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq6avjj",
    "parent_id": "t1_dq66k9e",
    "subreddit_name_prefixed": "r/politics",
    "body": "Yeah, just say literally the opposite of what you do.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1511351072.0,
    "date_created": "2017-11-21",
    "time_created": "22:44:32",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq6ch5g",
    "parent_id": "t1_dq66k9e",
    "subreddit_name_prefixed": "r/politics",
    "body": "Do as I say not as I do.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1511353268.0,
    "date_created": "2017-11-21",
    "time_created": "23:21:08",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5wslj",
    "parent_id": "t1_dq5v2ll",
    "subreddit_name_prefixed": "r/politics",
    "body": "in a world, where 'not a dingo' is cause for celebration",
    "controversiality": 0,
    "ups": 100,
    "downs": 0,
    "score": 100,
    "created": 1511333769.0,
    "date_created": "2017-11-21",
    "time_created": "17:56:09",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xrsa",
    "parent_id": "t1_dq5x28w",
    "subreddit_name_prefixed": "r/politics",
    "body": "accidentally, probably.",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1511334867.0,
    "date_created": "2017-11-21",
    "time_created": "18:14:27",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5yzzo",
    "parent_id": "t1_dq5vx7q",
    "subreddit_name_prefixed": "r/politics",
    "body": ">[Classical liberalism is a political ideology and a branch of liberalism which advocates civil liberties under the rule of law with an emphasis on economic freedom. Closely related to libertarianism and to economic liberalism,\\[1\\]\\[2\\] it developed in the early 19th century, building on ideas from the previous century as a response to urbanization and to the Industrial Revolution in Europe and the United States.\\[3\\] Notable individuals whose ideas contributed to classical liberalism include John Locke,\\[4\\] Jean-Baptiste Say, Thomas Malthus and David Ricardo. It drew on the economics of Adam Smith and on a belief in natural law,\\[5\\] utilitarianism\\[6\\] and progress.\\[7\\]](https://en.wikipedia.org/wiki/Classical_liberalism)\n\nNeoLiberalism is Friedman and Hayek, Thatcher and Reagan, Rand & Greenspan. ",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1511336286.0,
    "date_created": "2017-11-21",
    "time_created": "18:38:06",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5vsa8",
    "parent_id": "t1_dq5tw3y",
    "subreddit_name_prefixed": "r/politics",
    "body": "I think you are just confusing people with the term Neo-liberalism by using it correctly.  Most Americans see the word Liberal and think something on the order of Keynesian doctrine and what Democrats espouse with social safety nets and moderate regulation policies. ",
    "controversiality": 0,
    "ups": 85,
    "downs": 0,
    "score": 85,
    "created": 1511332656.0,
    "date_created": "2017-11-21",
    "time_created": "17:37:36",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq694oo",
    "parent_id": "t1_dq68tum",
    "subreddit_name_prefixed": "r/politics",
    "body": "I think they are on board with fascism's general tenants. Look at this list and see if it looks familiar. They are calling themselves \"Neo-Reactionaries\" now. \n\nUmberto Eco, 14 points:\n\n\n * The cult of tradition. “One has only to look at the syllabus of every fascist movement to find the major traditionalist thinkers. The Nazi gnosis was nourished by traditionalist, syncretistic, occult elements.”\n \n* The rejection of modernism. “The Enlightenment, the Age of Reason, is seen as the beginning of modern depravity. In this sense Ur-Fascism can be defined as irrationalism.”\n   \n* The cult of action for action’s sake. “Action being beautiful in itself, it must be taken before, or without, any previous reflection. Thinking is a form of emasculation.”\n \n*  Disagreement is treason. “The critical spirit makes distinctions, and to distinguish is a sign of modernism. In modern culture the scientific community praises disagreement as a way to improve knowledge.”\n \n* Fear of difference. “The first appeal of a fascist or prematurely fascist movement is an appeal against the intruders. Thus Ur-Fascism is racist by definition.”\n  \n *  Appeal to social frustration. “One of the most typical features of the historical fascism was the appeal to a frustrated middle class, a class suffering from an economic crisis or feelings of political humiliation, and frightened by the pressure of lower social groups.”\n   \n*  The obsession with a plot. “The followers must feel besieged. The easiest way to solve the plot is the appeal to xenophobia.”\n   \n*  The enemy is both strong and weak. “By a continuous shifting of rhetorical focus, the enemies are at the same time too strong and too weak.”\n   \n * Pacifism is trafficking with the enemy. “For Ur-Fascism there is no struggle for life but, rather, life is lived for struggle.”\n    \n* Contempt for the weak. “Elitism is a typical aspect of any reactionary ideology.”\n   \n* Everybody is educated to become a hero. “In Ur-Fascist ideology, heroism is the norm. This cult of heroism is strictly linked with the cult of death.” (This is what is different from standard fascism: (https://en.wikipedia.org/wiki/Inverted_totalitarianism)\n\n*  Machismo and weaponry. “Machismo implies both disdain for women and intolerance and condemnation of nonstandard sexual habits, from chastity to homosexuality.”\n  \n *  Selective populism. “There is in our future a TV or Internet populism, in which the emotional response of a selected group of citizens can be presented and accepted as the Voice of the People.”\n    \n*  Ur-Fascism speaks Newspeak. “All the Nazi or Fascist schoolbooks made use of an impoverished vocabulary, and an elementary syntax, in order to limit the instruments for complex and critical reasoning.”\n ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511348781.0,
    "date_created": "2017-11-21",
    "time_created": "22:06:21",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5y3fm",
    "parent_id": "t1_dq5xa72",
    "subreddit_name_prefixed": "r/politics",
    "body": "Ajitpai - The formal term for a \"fatburg\" consisting of so much shit, fat, diapers, wipes, and all manner of other foul stuff, that it takes weeks to dislodge. ",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1511335238.0,
    "date_created": "2017-11-21",
    "time_created": "18:20:38",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq63wfb",
    "parent_id": "t1_dq5yjm2",
    "subreddit_name_prefixed": "r/politics",
    "body": "Just get us far down enough on the line of succession until we hit Mattis please.  I could live with that guy in the oval.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511342270.0,
    "date_created": "2017-11-21",
    "time_created": "20:17:50",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5yx06",
    "parent_id": "t1_dq5yjm2",
    "subreddit_name_prefixed": "r/politics",
    "body": "I'll settle for a bunch of GOP going to jail, but personally I want both sides to go to jail forcing us to set up proper anti-corruption laws and have our government not run on the honor code.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1511336189.0,
    "date_created": "2017-11-21",
    "time_created": "18:36:29",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5ydm7",
    "parent_id": "t1_dq5wslj",
    "subreddit_name_prefixed": "r/politics",
    "body": "At this point even \"is a dingo, but not actively trying to eat my face\" is cause for celebration.",
    "controversiality": 0,
    "ups": 60,
    "downs": 0,
    "score": 60,
    "created": 1511335565.0,
    "date_created": "2017-11-21",
    "time_created": "18:26:05",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5y41n",
    "parent_id": "t1_dq5xrsa",
    "subreddit_name_prefixed": "r/politics",
    "body": "Alternate lie.",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1511335258.0,
    "date_created": "2017-11-21",
    "time_created": "18:20:58",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5x49x",
    "parent_id": "t1_dq5vsa8",
    "subreddit_name_prefixed": "r/politics",
    "body": "Yes, american common-use definitions of a lot of political and economic phrases are very different from the rest of the world's definition of the same phrases.",
    "controversiality": 0,
    "ups": 48,
    "downs": 0,
    "score": 48,
    "created": 1511334125.0,
    "date_created": "2017-11-21",
    "time_created": "18:02:05",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5x5x2",
    "parent_id": "t1_dq5vsa8",
    "subreddit_name_prefixed": "r/politics",
    "body": " The problem is that the US is so far right of most countries that what \"liberal\" means gets muddied.",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1511334175.0,
    "date_created": "2017-11-21",
    "time_created": "18:02:55",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5z2yn",
    "parent_id": "t1_dq5vsa8",
    "subreddit_name_prefixed": "r/politics",
    "body": "> Most Americans see the word Liberal and think something on the order of Keynesian doctrine and what Democrats espouse with social safety nets and moderate regulation policies. \n\nWait, what? Neo-liberalism has been associated with lasse-fair capitalism in the US since the 70s. That's a change from it's earlier meaning (that most americans would have never heard of) where it was associated with european economies (especially Germanys [Social Market Economy](https://en.wikipedia.org/wiki/Social_market_economy)) trying the bridge the gap between classical liberalism (which had catastrophic consequences, see 19th century europe) and the command economy of the socialist countries (themselfs a result of the catastrophic outcomes of classical liberalism..). Neo-liberalism was never about Keynesianism itself, and in the new american (and now essentially global) meaning of neo-liberalism is is specifically *against* Keynesianism, because it's basically \"lasse-fair capitalism, again\".\n\nDemocrats are neo-liberal, but republicans are neo-liberal ***as fuck***.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511336380.0,
    "date_created": "2017-11-21",
    "time_created": "18:39:40",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5xt0j",
    "parent_id": "t1_dq5vsa8",
    "subreddit_name_prefixed": "r/politics",
    "body": "Democrats are neoliberal too. Obama agreed to extend the Bush tax cuts for all of his years in office, with the effect of cutting taxes on corporations and the investor class by $6 trillion. The establishment Democrats have been corporatists since Bill Clinon. Another interesting fact - Obama appointed neoliberal (i.e mainstream) economists to the Federal Reserve like Bernanke and Yellen, who engaged in zero interest rate policies and quantitative easing (free money, basically) that have enriched the 1% tremendously by inflating financial asset markets and subsidizing investors and the private banking system. All this free money from central banks has amounted to $20-$25 trillion worldwide from the big 5 alone being pumped into financial markets through free money policies. The big 5 central banks are the Federal Reserve, People’s Bank of China, European Central Bank, Bank of Japan, and the Bank of England. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1511334907.0,
    "date_created": "2017-11-21",
    "time_created": "18:15:07",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq5yfxy",
    "parent_id": "t1_dq5y3fm",
    "subreddit_name_prefixed": "r/politics",
    "body": "Ajitpai...the accountabili T.  to the public is silent",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511335639.0,
    "date_created": "2017-11-21",
    "time_created": "18:27:19",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq619ki",
    "parent_id": "t1_dq5y3fm",
    "subreddit_name_prefixed": "r/politics",
    "body": "The formal term for a \"fatburg\" consisting so much shit, fat, diapers, wipes, and other nondegradables that it clogs whatever sewer, drain, or other plumbing fixture it forms in and requires intervention to destroy.\nColloquial: can also be used to refer to similar blockages that can occur in the internet when net neutrality does not have legal force.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1511339007.0,
    "date_created": "2017-11-21",
    "time_created": "19:23:27",
    "submission_id": "politics-7ekkmo"
  },
  {
    "id": "dq6021p",
    "parent_id": "t1_dq5y3fm",
    "subreddit_name_prefixed": "r/politics",
    "body": "I like this one since it's analogous to how his actions will mess up the flow of information on the Internet.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1511337528.0,
    "date_created": "2017-11-21",
    "time_created": "18:58:48",
    "submission_id": "politics-7ekkmo"
  }
]