[
  {
    "id": "dqw7ary",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Posting the full quote here, seeing as how no one actually reads articles on reddit. The points he makes are very salient indeed. \n\n**David Davis:** There is a proper role for referendums in constitutional change, but only if done properly. If it is not done properly, it can be a dangerous tool. The Chairman of the Public Administration Committee, who is no longer in the Chamber, said that Clement Attlee—who is, I think, one of the Deputy Prime Minister's heroes—famously described the referendum as the device of demagogues and dictators. \n\nWe may not always go as far as he did, but what is certain is that pre-legislative referendums of the type the Deputy Prime Minister is proposing are the worst type of all.\nReferendums should be held when the electorate are in the best possible position to make a judgment. They should be held when people can view all the arguments for and against and when those arguments have been rigorously tested. In short, referendums should be held when people know exactly what they are getting. So legislation should be debated by Members of Parliament on the Floor of the House, and then put to the electorate for the voters to judge.\n\nWe should not ask people to vote on a blank sheet of paper and tell them to trust us to fill in the details afterwards. For referendums to be fair and compatible with our parliamentary process, we need the electors to be as well informed as possible and to know exactly what they are voting for. Referendums need to be treated as an addition to the parliamentary process, not as a substitute for it.",
    "controversiality": 0,
    "ups": 239,
    "downs": 0,
    "score": 239,
    "created": 1512667651.0,
    "date_created": "2017-12-07",
    "time_created": "04:27:31",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw4piz",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That's kinda difficult when you have misleading propaganda thrown in your face constantly. Not that the public ever understanding most issues is possible. Governing is difficult, that's the simple truth of it.",
    "controversiality": 0,
    "ups": 75,
    "downs": 0,
    "score": 75,
    "created": 1512661318.0,
    "date_created": "2017-12-07",
    "time_created": "02:41:58",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw4kaz",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "This post is attracting quite a few early downvotes, presumably from people that believe that being informed is a bad thing.\n\n",
    "controversiality": 0,
    "ups": 303,
    "downs": 0,
    "score": 303,
    "created": 1512660998.0,
    "date_created": "2017-12-07",
    "time_created": "02:36:38",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw80na",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It's interesting to note that its likely that if Brexit had been legally mandated by the referendum, rather than it being advisory, the non-existent impact assessments would likely have been carried out. I would have thought this would have indeed fulfilled Davis' suggested aims here.\n\nIn any case, this just brings home the failure of Cameron's government to actually prepare for the consequences of the referendum, or to frame the question in a precise way.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1512669588.0,
    "date_created": "2017-12-07",
    "time_created": "04:59:48",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwgt9u",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Impact assesment? Fuck it we'll do it live! ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1512686147.0,
    "date_created": "2017-12-07",
    "time_created": "09:35:47",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwa7z2",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Has anyone forgotten the UK Gov sent out this to millions of homes prior to the vote? There was lots of strawman arguments for staying, but it spelled out the uncertainty etc. It gave open doors for anyone to explore the main issues the Government believed leaving the EU would cause and benefits we had whilst staying in the EU. It was pretty much; we remain and the status quo would resume.\n\nhttps://www.gov.uk/government/uploads/system/uploads/attachment_data/file/515068/why-the-government-believes-that-voting-to-remain-in-the-european-union-is-the-best-decision-for-the-uk.pdf\n\n\"A vote to leave could\nmean a decade or\nmore of uncertainty\" - one of the bolder quotes in the leaflet.\n\nI'm no fan of David Davis and quite unhappy how he's dealing with it (as I'm pro-leaving the EU). It's messy, disrespectful to voting public and parliament for leading us down multiple garden paths with regards to the impact assessments. Unfortunately, the ego of being in his position is outplaying the serious part he's playing with the negotiations.",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1512675303.0,
    "date_created": "2017-12-07",
    "time_created": "06:35:03",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw8m11",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Thomas Jefferson [wrote](https://www.loc.gov/exhibits/jefferson/60.html):\n\n> wherever the people are well informed they can be trusted with their own government  \n> [*Thomas Jefferson*](https://en.wikipedia.org/wiki/Thomas_Jefferson) to [*Richard Price*](https://en.wikipedia.org/wiki/Richard_Price)",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512671182.0,
    "date_created": "2017-12-07",
    "time_created": "05:26:22",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwtvej",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Iraq war 2.0\n\nNot long until 'we were lied to' becomes the main rallying feature between the Mail and brexiteers every time Cameron or May come up.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1512698928.0,
    "date_created": "2017-12-07",
    "time_created": "13:08:48",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw4f32",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1512660679.0,
    "date_created": "2017-12-07",
    "time_created": "02:31:19",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwoa8v",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'm an American and took the day off when Brexit happens (for unrelated reasons). So I got to watch it all day, and I just boggled at the thought that you guys had a vote, not on what treaty you would sign in the event of Brexit, or what the government would negotiate for, or really, anything at all that was concrete and legally binding. You just voted to give these assholes the power to pull you out of the EU, and at that point you would have no say in what would happen. What the hell was any one voting FOR when they voted Leave? Nothing. You voted for nothing but uncertainty because you had nothing to hold them to. The only binding power you had was giving them license to fuck you all over.\n\nIn the future, don't hold referendums over Yes/No questions. Make sure you have actual policies, binding policies, already stated and prepared. Make sure you know what you are actually going to DO before you vote on it.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1512693837.0,
    "date_created": "2017-12-07",
    "time_created": "11:43:57",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwq1qb",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It's fucking absurd to proceed at this point. The whole thing is a shambles; the vote itself was non-binding; and the so-called 'will of the people' turns out to be 37% (after deducting ineligable voters).\n\n\n* 46,600,001 = electorate on day of vote\n* 17,410,742 = leave\n\n\nWhy are we being dragged into something that we can now provably say will be a disaster; that we can provably say is being conducted like a farce; that was begun by a non-binding vote based on false information, manipulated by Russia; that only has support of 37% of electorate?\n\n\nWere most of us even qualified to make the decision?",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1512695441.0,
    "date_created": "2017-12-07",
    "time_created": "12:10:41",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw77ks",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "r/torycriticisestory",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1512667411.0,
    "date_created": "2017-12-07",
    "time_created": "04:23:31",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw86eo",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The problem is no government wants an informed populace.\n\nThat's is literally the worst thing for business men. It's not how our democracy works.\n\nYou either use fear, violence, flag worship cults or stupidity to rule a nation. Bonus points for keeping them entertained and fed - better for long term compliance.\n\nIt will be almost impossible to educate a nation to the level that they can vote like this. There are too many with money and influence who do not wish this.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1512670024.0,
    "date_created": "2017-12-07",
    "time_created": "05:07:04",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7lm5",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It's easy to say honest things from the position of opposition.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512668455.0,
    "date_created": "2017-12-07",
    "time_created": "04:40:55",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwfm3h",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Whoever is pulling his strings must have some serious fucking dirt on him. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512684659.0,
    "date_created": "2017-12-07",
    "time_created": "09:10:59",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw5okn",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It’ll be fine we don’t need any impact assessments just do it!",
    "controversiality": 1,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512663570.0,
    "date_created": "2017-12-07",
    "time_created": "03:19:30",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwgabq",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Here's the thing. They know, they are well informed. *That's why they don't want reports and in-depth discussion*. They know exactly how fucked Brexit is going to make up, but they want power, they want control. \n\nThey're thus faced with cognitive dissonance, how can you do something that you know is harmful and destruction? Never let anyone talk about the truth. Plausible deniability.\n\nIt's like an alcoholic with severe stomach pains or something. If he goes to the doctor, finds out he's got something bad, he's going to have to stop. It'd be insane not to, and people would lose all respect for him. If he just never finds out, he doesn't need to stop. \n\nThey're just protecting the bubble they require to do Brexit. They know it's a disaster. But as long as they never say it outloud, it'll all be fine.",
    "controversiality": 1,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512685514.0,
    "date_created": "2017-12-07",
    "time_created": "09:25:14",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqx0wn6",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Don't rest on your laurels. If you're here all week, I'll be expecting gems like this every day ;-)",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512705567.0,
    "date_created": "2017-12-07",
    "time_created": "14:59:27",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqx5pzs",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "i think he did very well.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512711634.0,
    "date_created": "2017-12-07",
    "time_created": "16:40:34",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqxkdsu",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Secret option B: sortition, as in random selection from all eligible adults.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512728535.0,
    "date_created": "2017-12-07",
    "time_created": "21:22:15",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqy1rvu",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "\"Provably\". Of course! I'm an idiot. \n\nI did actually notice that you'd made that same 'typo' a couple of times and that it was the only 'typo' in the whole thing. That little clue should have alerted me. \n\nThe other thing, I would have expected 'provably' to have an 'e' in it. Looked it up (told you I was 'anal') and of course you spelt it correctly :-)",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512757266.0,
    "date_created": "2017-12-08",
    "time_created": "05:21:06",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwboy3",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "\"Leave the EU\" or \"Stay in the EU\".\n\nThat's pretty black and white to me. It's like saying you shouldn't vote for X party and are not qualified to do so unless you understand every nuance of their manifesto, technical accompanying documents included. \n\nWas the 2014 Scottish vote null and void because not everybody who voted Yes read the SNP's independence white paper cover to cover - [all 650 excruciating pages of it?](https://www.berria.eus/dokumentuak/dokumentua1219.pdf)",
    "controversiality": 1,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512678451.0,
    "date_created": "2017-12-07",
    "time_created": "07:27:31",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7qr5",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Doesn't the wisdom of the crowds ensure the average voter's contribution falls very close to the best answer?\n\nMind, tWotC requires individuals be able to provide much more nuance and information, than checking one of two boxes.\n\nSo the solution is putting a range of options on the referendum and letting voters score each.",
    "controversiality": 1,
    "ups": -1,
    "downs": 0,
    "score": -1,
    "created": 1512668835.0,
    "date_created": "2017-12-07",
    "time_created": "04:47:15",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw6zq0",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You're trying to inflate one person's vote above another. \n\nOne side of the argument will always say we should restrict votes because the poor shouldn't be able to vote themselves into welfare.\n\nThe other side will say we should restrict votes because the rich shouldn’t be able to vote themselves into artificially hobbling their competitors or for their betterment at the expense of the poor.\n\nThe solution has always been (at least for a long time now) everyone gets a vote but you can't change the system. \n\nHow you want to vote is your own business, if you want people to be informed get out there and inform them.",
    "controversiality": 1,
    "ups": -6,
    "downs": 0,
    "score": -6,
    "created": 1512666845.0,
    "date_created": "2017-12-07",
    "time_created": "04:14:05",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwb67v",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "This is a consequence of not constantly improving our education system. People forget that good well educated kids make good, smart citizens who are less likely to be swayed by nonsense arguments thrown around by political parties. Eventually we will clock on, and have a greater focus on teaching people to be critical of what they hear but we still have to suffer the consequences of the failure of the past.",
    "controversiality": 1,
    "ups": -2,
    "downs": 0,
    "score": -2,
    "created": 1512677406.0,
    "date_created": "2017-12-07",
    "time_created": "07:10:06",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwj341",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Ah yes, the old 'They didn't know what they were voting for so that invalidates the referendum'.\n\nWhy not just just give the rest of the usual dehumanizing spiel, they are all uneducated little englanders who \nshouldn't have the right to vote. Yeah, nothing makes someone want to listen to your point of view like calling them an idiot for holding their own opinion. \n\nThough it does bring up a good point though not in the way that most will think. After the referendum and my sister was howling at me about voting to leave, I asked her to describe the EU, how does it function? How many presidents does it have? What's the difference between the Council of the European Union and the European Council? She couldn't answer any of them and walked away with a huff. Funny how someone who voted to leave knows more about the EU than someone who voted to stay. And whilst, unlike most remainers, I won't paint those who voted against me with a broad, villainizing brush, I have noticed that many remainers who I managed to have a civil debate with didn't even know much at all about the organization they were voting to remain a part of. \n\nThen again I don't even know why I'm bothering to comment. Brexit discussion on reddit is just one giant circle jerk of people who voted remain so I'm expecting a lot of salty replies and down votes.",
    "controversiality": 1,
    "ups": -5,
    "downs": 0,
    "score": -5,
    "created": 1512688734.0,
    "date_created": "2017-12-07",
    "time_created": "10:18:54",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7u8q",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Why is this such a big deal? Are people seeing this as hypocrisy? IIRC Davis was part of Grassroots out. How did he not want the public to be informed?",
    "controversiality": 1,
    "ups": -3,
    "downs": 0,
    "score": -3,
    "created": 1512669102.0,
    "date_created": "2017-12-07",
    "time_created": "04:51:42",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwbecx",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "What a twat.\n\n... Doesn't he know it should be referenda?",
    "controversiality": 1,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512677866.0,
    "date_created": "2017-12-07",
    "time_created": "07:17:46",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw5fun",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "'Dont listen to there propoganda, listen to my propoganda!'",
    "controversiality": 0,
    "ups": -10,
    "downs": 0,
    "score": -10,
    "created": 1512662994.0,
    "date_created": "2017-12-07",
    "time_created": "03:09:54",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwe4bi",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "They stopped this when they realised no informed member of the public would vote for the tories ever!",
    "controversiality": 0,
    "ups": -4,
    "downs": 0,
    "score": -4,
    "created": 1512682566.0,
    "date_created": "2017-12-07",
    "time_created": "08:36:06",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqx5v3k",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[removed]",
    "controversiality": 0,
    "ups": -2,
    "downs": 0,
    "score": -2,
    "created": 1512711817.0,
    "date_created": "2017-12-07",
    "time_created": "16:43:37",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqx1axi",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I inform myself, I don't need or want anyone to do it for me.\n\nI voted for Brexit and I don't read the Daily Mail.",
    "controversiality": 0,
    "ups": -4,
    "downs": 0,
    "score": -4,
    "created": 1512705948.0,
    "date_created": "2017-12-07",
    "time_created": "15:05:48",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw3m5e",
    "parent_id": "t3_7i4mmi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[removed]",
    "controversiality": 0,
    "ups": -63,
    "downs": 0,
    "score": -63,
    "created": 1512658981.0,
    "date_created": "2017-12-07",
    "time_created": "02:03:01",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7mj2",
    "parent_id": "t1_dqw7ary",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": " Was there ever a serious suggestion that the public would be asked to vote on a matter where the answers would be provided after the vote had happened?\n\nAlso, could one not say that is what has been happening here. Leave represents a mix of potential endings, all of which were mixed into just one vote. We are now trusting the government to fill in the detail afterwards. ",
    "controversiality": 0,
    "ups": 67,
    "downs": 0,
    "score": 67,
    "created": 1512668524.0,
    "date_created": "2017-12-07",
    "time_created": "04:42:04",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwa0l8",
    "parent_id": "t1_dqw7ary",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That last paragraph is pretty damning for Davis since it perfectly describes the EU Referendum's question and process",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1512674816.0,
    "date_created": "2017-12-07",
    "time_created": "06:26:56",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwe6s4",
    "parent_id": "t1_dqw7ary",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Thanks for the full text. Normally I find the full text greatly softens the headline but in this case it makes it all the more damning. Sadly this will probably be forgotten in a day or two at the most and we'll just continue on as we",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1512682669.0,
    "date_created": "2017-12-07",
    "time_created": "08:37:49",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwalf9",
    "parent_id": "t1_dqw7ary",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "So DD is NOT completely incompetent all of the time! I stand corrected. What an intelligent and thoughtful piece!\n\nHow is this the same man who has just admitted he didn't think it worthwhile to carry out any impact assessments?",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1512676154.0,
    "date_created": "2017-12-07",
    "time_created": "06:49:14",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwe1cr",
    "parent_id": "t1_dqw7ary",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Prophetic...",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512682442.0,
    "date_created": "2017-12-07",
    "time_created": "08:34:02",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw79vk",
    "parent_id": "t1_dqw4piz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Especially when the well has been poisoned for 30 years by a right wing press. ",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1512667584.0,
    "date_created": "2017-12-07",
    "time_created": "04:26:24",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwfuhl",
    "parent_id": "t1_dqw4piz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Atleast you can stil trust,\n\n\nWhats writen on a bus.\n\n/s",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1512684961.0,
    "date_created": "2017-12-07",
    "time_created": "09:16:01",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwa34e",
    "parent_id": "t1_dqw4kaz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I don't get what the point of the post is, not the sentiment.\n\nI'm pretty sure if, when the referendum was being considered, David Cameron organised a convention amongst those advocating leave to decide upon an organisational structure, gave them the funds and staff to properly draft their proposed option, debate it in parliament, then hold a referendum, Davis, Gove et Al would have welcomed it.\n\nThat wasn't on offer.\n\nWhat was offered was a binary winner take all referendum when Cameron wanted to have it, where the official leave campaign would be decided at a ridiculously late date. \n\nThis was all designed to give Cameron and Remain an advantage. It only failed because Elliott and Cummings were that much better and fudged the options. \n\n",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1512674986.0,
    "date_created": "2017-12-07",
    "time_created": "06:29:46",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqx3o33",
    "parent_id": "t1_dqw4kaz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That'll be the /r/badunitedkingdom trolls that sit on the New feed downvoting anti-Brexit stories.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1512708880.0,
    "date_created": "2017-12-07",
    "time_created": "15:54:40",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwfiyq",
    "parent_id": "t1_dqw4kaz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "...or due the implication that because David Davis is the minister in charge of ensuring Brexit goes smoothly, that he in anyway condones the misinformation presented by the Leave campaign... Which he didn't support.\n\nBut that's hardly a surprise, seeing as he was appointed by a Prime Minister who also opposed the concept. In fact, the office of DfExEU was created precisely in order to ensure that Brexit was managed by people of different standpoints, and avoid Boris Johnson and Michael Gove controlling the process.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512684544.0,
    "date_created": "2017-12-07",
    "time_created": "09:09:04",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwp9es",
    "parent_id": "t1_dqw4kaz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> people that believe that being informed is a bad thing.\n\n[\"Sometimes you need someone with less grasp of detail, less clever.”](http://www.theneweuropean.co.uk/top-stories/brex-factor-kate-katie-1-5302405)",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512694713.0,
    "date_created": "2017-12-07",
    "time_created": "11:58:33",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw5q5v",
    "parent_id": "t1_dqw4kaz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I downvoted because i think this is just an inflammatory post. I voted for leave, felt well informed, still feel well informed and am still committed to seeing it through. The quote is presented in a different context as if to insinuate that Brexit voters were not well informed (and by extension Davies is a hypocrit) and I think that’s an unfair comparison to draw. The problem is that whenever you are comparing “the status quo” with “something new” then it is inherently difficult to give people as much information about that “something new” especially when it requires negotiation. \n\nWhen people say voters weren’t well informed it strikes me they are really implying we need some sort of crystal ball before we get a choice on anything. Indeed we don’t know whether staying in the EU would have meant eventual federalisation... let’s face it, if it is then leave would have won by more than 52%... basically the future is inherently unknown and I’m not sure that this whole “the vote wasn’t well informed, something something about slogans on a bus etc” really helps advance the Brexit debate. \n\n**EDIT: WOW, -24 downvotes in 1 hour. Can’t we just have a friendly debate? The OP asked why he was being downvoted and I explained honestly - what don’t you like about that?**",
    "controversiality": 0,
    "ups": -77,
    "downs": 0,
    "score": -77,
    "created": 1512663675.0,
    "date_created": "2017-12-07",
    "time_created": "03:21:15",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwg7lm",
    "parent_id": "t1_dqw4kaz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[removed]",
    "controversiality": 0,
    "ups": -4,
    "downs": 0,
    "score": -4,
    "created": 1512685418.0,
    "date_created": "2017-12-07",
    "time_created": "09:23:38",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw5gul",
    "parent_id": "t1_dqw4kaz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Perhaps they are downvoting because they are sick of individuals saying the electorate did not know what they voted for.",
    "controversiality": 0,
    "ups": -82,
    "downs": 0,
    "score": -82,
    "created": 1512663059.0,
    "date_created": "2017-12-07",
    "time_created": "03:10:59",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwdm2v",
    "parent_id": "t1_dqw4kaz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The downvotes are due to this post presumably saying that leavers were uninformed and didn’t know what they were voting for. Get your head out of your arse. ",
    "controversiality": 0,
    "ups": -15,
    "downs": 0,
    "score": -15,
    "created": 1512681793.0,
    "date_created": "2017-12-07",
    "time_created": "08:23:13",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwcv0p",
    "parent_id": "t1_dqwa7z2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think the government was out of touch if they thought the word \"uncertainty\" was going to deter anyone without a modicum of knowledge about economics. \n\nThey fought the most inept PR battle since the Iraq war, only to be bested by Theresa May's stupid 2017 election. \n\nWhat a ridiculous, self-inflicted morass.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1512680571.0,
    "date_created": "2017-12-07",
    "time_created": "08:02:51",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwn3u6",
    "parent_id": "t1_dqwa7z2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That abused the resources of the civil service, who are meant to be apolitical ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1512692751.0,
    "date_created": "2017-12-07",
    "time_created": "11:25:51",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwyf07",
    "parent_id": "t1_dqwa7z2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think the fundamental problem is that no one wants to lead our government through these times. It just isn't possible to not end up hated by at least half the country. It is creating a mess where the crazies, which would normally not have a chance, get a shot of power. ",
    "controversiality": 0,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512703214.0,
    "date_created": "2017-12-07",
    "time_created": "14:20:14",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqxlpgt",
    "parent_id": "t1_dqw8m11",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Which, strictly speaking, is not logically equivalent to\n\n> when the people are not well informed, they cannot be trusted with their own government\n\nbut clearly that latter idea is in the spirit of the first proposition.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512730016.0,
    "date_created": "2017-12-07",
    "time_created": "21:46:56",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw5ilx",
    "parent_id": "t1_dqw4f32",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "'Here we go Running through wheat with May'",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1512663175.0,
    "date_created": "2017-12-07",
    "time_created": "03:12:55",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwayxd",
    "parent_id": "t1_dqw4f32",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Sung to the tune of?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512676973.0,
    "date_created": "2017-12-07",
    "time_created": "07:02:53",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw8yqf",
    "parent_id": "t1_dqw4f32",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Did you have a stroke, what is this crap that you've written?",
    "controversiality": 1,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512672119.0,
    "date_created": "2017-12-07",
    "time_created": "05:41:59",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwq6aj",
    "parent_id": "t1_dqwoa8v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "For what it's worth, I completely agree with everything you've said. You're 100% right. It's possibly the most moronic political event in modern history and we simply have no excuses for our ongoing delusional idiocy and self-harming.\n\nHowever, in the spirit of continuing the fine tradition of British / American piss taking, I am dutifully obligated to twist your post back on you. I hope you understand.\n\n> I'm British and took the day off when Trump was elected (for unrelated reasons). So I got to watch it all day, and I just boggled at the thought that you guys had a vote, not for any kind of actual candidate, or for a functioning human who was fit to act as president, or really, to have power of anything at all that was concrete and legally binding. You just voted to give this colossal orange arsehole the power to pull you out of all sense of reality, and at that point you would have no say in what would happen. What the hell was any one voting FOR when they voted Trump? Nothing. You voted for nothing but uncertainty because you had nothing to hold that clearly deranged senile maniac to. The only binding power you had was giving his organised crime family license to fuck you all over.\n> \n> In the future, don't vote for known criminal celebrity sex pests. Make sure your candidates are at least sane, and have actual policies, binding policies, already stated and prepared. Make sure you know what they are actually going to DO before you vote on it.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1512695555.0,
    "date_created": "2017-12-07",
    "time_created": "12:12:35",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwvxp6",
    "parent_id": "t1_dqwoa8v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "All too true. \n\nCountries which hold referendums as part of their political process don't make these mistakes. They publish detailed policy options describing what will happen for each of the possible outcomes. \n\n",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1512700870.0,
    "date_created": "2017-12-07",
    "time_created": "13:41:10",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwy30v",
    "parent_id": "t1_dqwoa8v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Exactly this!\n\nWhen you try to explain this to people you just get the reply:\n\n'What else is there to decide? Just leave the EU, it's simple!'\n\nSome people don't even want to negotiate:\n\n'Why negotiate? Just leave straight away, that'll teach 'em!\n\nWe have our fair share of not very bright people here in Blighty :-)",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512702901.0,
    "date_created": "2017-12-07",
    "time_created": "14:15:01",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwzjft",
    "parent_id": "t1_dqwq1qb",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Exactly this! Couldn't have put it better.\n\nCouple of typos (if you're as anal as me) probably not provably. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512704277.0,
    "date_created": "2017-12-07",
    "time_created": "14:37:57",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqxy4ya",
    "parent_id": "t1_dqwq1qb",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Fun fact: a greater proportion of the Catalonian electorate voted for independence (39.6%) on a 40% turnout than voted leave in the UK",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512747832.0,
    "date_created": "2017-12-08",
    "time_created": "02:43:52",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwr6hr",
    "parent_id": "t1_dqwq1qb",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Remoaner idiocy.",
    "controversiality": 1,
    "ups": -3,
    "downs": 0,
    "score": -3,
    "created": 1512696468.0,
    "date_created": "2017-12-07",
    "time_created": "12:27:48",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7kcg",
    "parent_id": "t1_dqw77ks",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Tory criticise story?",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1512668360.0,
    "date_created": "2017-12-07",
    "time_created": "04:39:20",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwnyyo",
    "parent_id": "t1_dqw86eo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Most of Scandinavia would like a word with you.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1512693556.0,
    "date_created": "2017-12-07",
    "time_created": "11:39:16",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwd86r",
    "parent_id": "t1_dqw86eo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yeah but then you see several countries who have really focussed on quality education, and they are doing better than ever.\n\nhttps://www.youtube.com/watch?v=-LpRQvKx6r0\n",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512681185.0,
    "date_created": "2017-12-07",
    "time_created": "08:13:05",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwb3hu",
    "parent_id": "t1_dqw5okn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "See here's the problem I keep coming up against! I don't know if you're joking or not. It's perfectly likely that someone would post such an asinine comment and actually mean it for real. \n\nDon't make me cry. Please be joking. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512677246.0,
    "date_created": "2017-12-07",
    "time_created": "07:07:26",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwflxp",
    "parent_id": "t1_dqw5okn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Da! Spasibo!\n\nErm, I mean Yes ~~comrade~~! ... Mate!",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512684653.0,
    "date_created": "2017-12-07",
    "time_created": "09:10:53",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwi737",
    "parent_id": "t1_dqwboy3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> all 650 excruciating pages of it?\n\nYou mean they had a detailed plan for leaving the Union? How boring!",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1512687761.0,
    "date_created": "2017-12-07",
    "time_created": "10:02:41",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwf0ys",
    "parent_id": "t1_dqwboy3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "At least they had a white paper. Imagine that: a detailed, concrete plan of how they'd leave a supranational union.\n\nOn leaving specific institutions, the SNP paper lays out that they'd retain Sterling (under Bank of England control, accepting no Scottish influence); keep the monarch as head of state; join the Common Travel Area to retain free movement with the UK; apply to join NATO as a new member; and have a transitional period to negotiate continuous EU membership and Single Market access before independence.\n\nI didn't need to read 650 pages to get that. It took ten minutes.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1512683866.0,
    "date_created": "2017-12-07",
    "time_created": "08:57:46",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw8z6t",
    "parent_id": "t1_dqw7qr5",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You're right. The ignorance averages out and the right answer should be reached. There are three main issues with tWotC with respect to Brexit:\n\n* Each 'voter' should be independent and the population diverse. The impact of the press probably resulted in some distortion.\n* The options should be balanced in scope. That was not the case, the leave vote embodied a plurality of positions (at least hard and soft Brexit) whereas remain was one.\n* There should be a clear objective. Again leave embodied a range of objectives (immigration reduction, market liberalisation, increased sovereignty).\n\nDue to these reasons I don't think any referendum on leaving the EU could have been 'well posed'. ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1512672152.0,
    "date_created": "2017-12-07",
    "time_created": "05:42:32",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwt4h1",
    "parent_id": "t1_dqw7qr5",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Not sure why you're getting downvotes and I'm not. To clarify it's not me and I think we largely agree...",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512698235.0,
    "date_created": "2017-12-07",
    "time_created": "12:57:15",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7wf4",
    "parent_id": "t1_dqw7qr5",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No there are plenty of countries that get around the wisdom of crowds by banning opposition parties from campaigning.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512669266.0,
    "date_created": "2017-12-07",
    "time_created": "04:54:26",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7630",
    "parent_id": "t1_dqw6zq0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'm not trying to do anything. It's just a quote from David Davis, the man who now doesn't see the point of informing the public as to what might happen after Brexit.\n\n",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1512667301.0,
    "date_created": "2017-12-07",
    "time_created": "04:21:41",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7ppc",
    "parent_id": "t1_dqw6zq0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No one is saying that the votes should be restricted to certain types of people, Davis's quote was originally a criticism of the then Labour government.  \n\nNow its being used to criticise himself.  ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1512668759.0,
    "date_created": "2017-12-07",
    "time_created": "04:45:59",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw784y",
    "parent_id": "t1_dqw6zq0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I don't think they want to restrict the vote I think that point to hypocrisy that Davis belives people should be as informed as possible and then now claims that he is \"not a fan of economic models\" and doesn't have any Brexit assessment ready. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512667453.0,
    "date_created": "2017-12-07",
    "time_created": "04:24:13",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7yn3",
    "parent_id": "t1_dqw6zq0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I mean, sometimes there's a difference between what's fair and whats best. We have controls on the majority for a reason. Hitler was voted in legally and all that jazz. \n\nSufficed to say, one person one vote isn't necessarily ALWAYS the right approach. That's why we elect people in the first place; to do the shit we can't reasonably expect the average citizen to fully understand without being paid to take the time to understand it.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512669434.0,
    "date_created": "2017-12-07",
    "time_created": "04:57:14",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw81h1",
    "parent_id": "t1_dqw6zq0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Referendums = changing the system. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512669650.0,
    "date_created": "2017-12-07",
    "time_created": "05:00:50",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwb620",
    "parent_id": "t1_dqw6zq0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Stop trying to 'inflate' people's vote you bastard! /s :-)",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512677396.0,
    "date_created": "2017-12-07",
    "time_created": "07:09:56",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw9c5p",
    "parent_id": "t1_dqw6zq0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "In this context, being informed isn't about whether or not you understand how the EU operates. \n\nIt's about whether you know what the options represent: whether you know what voting Leave would result in. \n\nBy Davis's own logic, there should have been lengthy debates in parliament about leaving prior to the referendum and there should have been an agreement on what leaving and remaining would look like. \n\nIt wasn't a case of voters just not bothering to read up on, for example, the single market. They simply couldn't know whether voting to leave was a vote for leaving the single market or not - they were uninformed. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512673110.0,
    "date_created": "2017-12-07",
    "time_created": "05:58:30",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7fc4",
    "parent_id": "t1_dqw6zq0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "We shouldn't restrict based on wealth or social standing. Just about being informed. Smart people will generally be more informed so smarter decisions would be made.",
    "controversiality": 0,
    "ups": -1,
    "downs": 0,
    "score": -1,
    "created": 1512667986.0,
    "date_created": "2017-12-07",
    "time_created": "04:33:06",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwgfmu",
    "parent_id": "t1_dqwb67v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The youth demographic (18-24) overwhelmingly voted Remain. ",
    "controversiality": 0,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512685692.0,
    "date_created": "2017-12-07",
    "time_created": "09:28:12",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwoubr",
    "parent_id": "t1_dqwb67v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Our education system isn't doing a bad job at preparing people for advertising, fake news and generally deceptive propaganda. I remember lessons on bias, the press and newspapers etc. It's all relevant to internet based news as well. Even though that wasn't really part of it. It could probably do better, but it could do a lot worse.\n\nThe problem is there is no way in the UK that adults are educated about the changing world. To generalise, the internet has made younger people better informed because they know how to use it. The older generations that have used the internet for work have had to teach themselves.\n\nThere's a large part of the population that \"don't like computers\" yet still use them. They are the most likely people to get duped. Working in IT support it's always the over 50s who click on the wrong email, get a virus and can't fix it. Even if they happen to be head of the company and otherwise pretty on the ball.\n\nIt's not the lack of capability to understand which stories are fake news. It's the lack of a willingness to learn how that so many older people have that winds me up.\n\nTry teaching an old person how to print a photograph properly. A huge number just decide to get someone else to do it for them.",
    "controversiality": 0,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512694319.0,
    "date_created": "2017-12-07",
    "time_created": "11:51:59",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwowm3",
    "parent_id": "t1_dqwj341",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Nah mate you've misinterpreted this. The point is he said people should be informed in 2002 and then didn't do any impact assessments on Brexit thus leaving the public uninformed.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1512694381.0,
    "date_created": "2017-12-07",
    "time_created": "11:53:01",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwpxqu",
    "parent_id": "t1_dqwj341",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It's David Davis saying this. Not a remainder.\n\nIt's an example of the principal of referenda being discussed before we got Cameron in charge.\n\nRight wing David Davis citing left wing Clement Attlee who \"famously described the referendum as the device of demagogues and dictators\".\n\nThen going onto say why and when that statement is true.\n\nCircumstances which happen to match the recent referenda under Cameron, with the exception of the one for Scottish independence where they produced a white paper.\n\nIf you can still think Brexit is a good idea while knowing the referendum wasn't fairly fought.\n\nYou can still think Brexit is a good idea while knowing democracy and parliament being ignored and rigged is a bad thing.\n\nIf you think Brexit is a good idea and know the government is incompetent.\n\nOr you can ignore those things because Brexit is happening and everything will be fine.\n\nThose who want Brexit have the most reason to want a competent government in charge. Yet they keep defending this one.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512695339.0,
    "date_created": "2017-12-07",
    "time_created": "12:08:59",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqx0oyq",
    "parent_id": "t1_dqwj341",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Your whole second paragraph. OP never said any of this - you did. \n\n\"Brexit discussion on Reddit is one giant circlejerk\". Doesn't your post disprove this?\n\nDidn't down vote you. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512705363.0,
    "date_created": "2017-12-07",
    "time_created": "14:56:03",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwouns",
    "parent_id": "t1_dqwj341",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">They didn't know what they were voting for\n\nThe thing is, they didn't. Not in any detail. They couldn't possibly. There was no official set of policy objectives for leaving the EU. Did it mean joining EEA/EFTA? Leaving the single market? The customs union? The ECJ? \n\nThis lack of clarity is coming back to bite us now. \n\n> I have noticed that many remainers who I managed to have a civil debate with didn't even know much at all about the organization they were voting to remain a part of.\n\nThat's not good, but it's not quite as bad as leave voters being ill informed. Some remain voters just wanted the status quo, and if you're happy with the status quo there's less need to understand it. ",
    "controversiality": 0,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512694328.0,
    "date_created": "2017-12-07",
    "time_created": "11:52:08",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw88mb",
    "parent_id": "t1_dqw7u8q",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "He has recently and quite shamefully consistently refused to provide or order impact assessment on Brexit (Informing) to/for parliament.\n\nI imagine he also opposes a final referendum on the matter, once the public know exactly what they would be voting for. Though frankly I think that's less hypocrisy and more collective responsibility of the Cabinet.\n\ntl;dr it's criticising his current actings as hypocrisy, not the campaign per se.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1512670186.0,
    "date_created": "2017-12-07",
    "time_created": "05:09:46",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw89xr",
    "parent_id": "t1_dqw7u8q",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Because we asked the public to vote on Brexit when nobody knew what it would mean. The quote thus invalidates the current position of David Davis and undermines his current Brexit position, using his own words.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1512670284.0,
    "date_created": "2017-12-07",
    "time_created": "05:11:24",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwucy8",
    "parent_id": "t1_dqwbecx",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No it shouldn't. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512699383.0,
    "date_created": "2017-12-07",
    "time_created": "13:16:23",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw63uj",
    "parent_id": "t1_dqw5fun",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "*Their propaganda. \n\nI don't think there's much misleading about it though which makes it less like propaganda and more like facts.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1512664608.0,
    "date_created": "2017-12-07",
    "time_created": "03:36:48",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw5kpa",
    "parent_id": "t1_dqw5fun",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Don't listen to my 2002 propaganda, but believe my 2017 rubbish.",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1512663314.0,
    "date_created": "2017-12-07",
    "time_created": "03:15:14",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqxavwm",
    "parent_id": "t1_dqx5v3k",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You do all your banking at the post office don’t you.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512717431.0,
    "date_created": "2017-12-07",
    "time_created": "18:17:11",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw4i6b",
    "parent_id": "t1_dqw3m5e",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Your username suggests that you're the personification of brexit.",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1512660866.0,
    "date_created": "2017-12-07",
    "time_created": "02:34:26",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw694b",
    "parent_id": "t1_dqw3m5e",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It's like Stephen Hawking getting called stupid by Joey Essex.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1512664971.0,
    "date_created": "2017-12-07",
    "time_created": "03:42:51",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw5bsg",
    "parent_id": "t1_dqw3m5e",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Ha ha. Brexit is being shelved right as well speak. TM couldn't be doing a better job at it. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1512662728.0,
    "date_created": "2017-12-07",
    "time_created": "03:05:28",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw40eh",
    "parent_id": "t1_dqw3m5e",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Ever so slightly sensitive, aren’t you?",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1512659795.0,
    "date_created": "2017-12-07",
    "time_created": "02:16:35",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7r4f",
    "parent_id": "t1_dqw7mj2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Was there ever a serious suggestion that the public would be asked to vote on a matter where the answers would be provided after the vote had happened?\n\nI don't think there was even an acknowledgement of the questions that we are now facing. It was presented as if we simply leave the EU, sign a few bits of paper and that's that. You can see that attitude in a few comments on this thread. \n\nIt's just complete denial that there's anything complicated to discuss, that there are any answers to give. ",
    "controversiality": 0,
    "ups": 68,
    "downs": 0,
    "score": 68,
    "created": 1512668865.0,
    "date_created": "2017-12-07",
    "time_created": "04:47:45",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwmuvy",
    "parent_id": "t1_dqw7mj2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> We are now trusting the government\n\na key reason most of us voted to remain!",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512692520.0,
    "date_created": "2017-12-07",
    "time_created": "11:22:00",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqy45w3",
    "parent_id": "t1_dqw7mj2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Also, could one not say that is what has been happening here. Leave represents a mix of potential endings, all of which were mixed into just one vote. \n\nOfficially, Leave officially represented leaving the single market, for one. People in this sub act like their was some ambiguity on that question, but it was (at the time of the campaign) made very clear. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512763401.0,
    "date_created": "2017-12-08",
    "time_created": "07:03:21",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqws8dn",
    "parent_id": "t1_dqwalf9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "As lazy and stupid as he's purported to be, I'm uncomfortable attributing Brexit's difficulties to his personal attributes since it would have been a shitshow whoever was in charge. Whoever's trepanning the country to release the evil spirits, it was never going to end well.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1512697429.0,
    "date_created": "2017-12-07",
    "time_created": "12:43:49",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwc5ck",
    "parent_id": "t1_dqwalf9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Tory whip?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512679316.0,
    "date_created": "2017-12-07",
    "time_created": "07:41:56",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwv9r8",
    "parent_id": "t1_dqwalf9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You cavy do an impact assessment unless you have a thought through scenario to assess. So Davis is right that there are too many unknowns and variables. The real problem is that we should really have these locked down by now. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512700233.0,
    "date_created": "2017-12-07",
    "time_created": "13:30:33",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwl6ch",
    "parent_id": "t1_dqwalf9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Power corrupts, innit",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512690883.0,
    "date_created": "2017-12-07",
    "time_created": "10:54:43",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwvi25",
    "parent_id": "t1_dqw79vk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I dunno did you see the EU page of false story's in the UK press? \n\n The only one i had heard of was the banana one, and non of them were used as arguments in the referendum. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512700455.0,
    "date_created": "2017-12-07",
    "time_created": "13:34:15",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqx6cai",
    "parent_id": "t1_dqw79vk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "\"30\"",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512712410.0,
    "date_created": "2017-12-07",
    "time_created": "16:53:30",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwaddr",
    "parent_id": "t1_dqwa34e",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I agree that Cameron made a terrible, irresponsible decision by deciding to hold the referendum in the timeframe that he did. However now that the referendum is over, do you not think we still deserve to be informed of the process and the potential repercussions? \n\nDavis is now in charge of exactly the scenario that he warned us about 15 years ago. Surely the principled thing to do would be to stand down. ",
    "controversiality": 0,
    "ups": 58,
    "downs": 0,
    "score": 58,
    "created": 1512675656.0,
    "date_created": "2017-12-07",
    "time_created": "06:40:56",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqx54tt",
    "parent_id": "t1_dqwa34e",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">I don't get what the point of the post is, not the sentiment.\n\nThe point of the post is pretty obvious. Davis is asserting that for a referendum to be valid it has to specify the policy details for all the available options. It therefore follows that the EU referendum was flawed. Upvotes all round. \n\n>I'm pretty sure if, when the referendum was being considered, David Cameron organised a convention amongst those advocating leave to decide upon an organisational structure, gave them the funds and staff to properly draft their proposed option, debate it in parliament, then hold a referendum, Davis, Gove et Al would have welcomed it.\n\nThat would be the right way to go about it. In retrospect Cameron's way played into their hands because voters who wanted any path for leaving the EU could be persuaded to vote leave. \n\n>This was all designed to give Cameron and Remain an advantage. It only failed because Elliott and Cummings were that much better and fudged the options.\n\nUp until then I saw Cameron as a reasonably astute politician. How on earth did he leave such an open goal? ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512710938.0,
    "date_created": "2017-12-07",
    "time_created": "16:28:58",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqx8nub",
    "parent_id": "t1_dqx3o33",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "shame these are only internet votes that are worthless, and the only votes that counted were on june 23rd\n\nshame",
    "controversiality": 0,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512714993.0,
    "date_created": "2017-12-07",
    "time_created": "17:36:33",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqxd2ct",
    "parent_id": "t1_dqx3o33",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You got proof of this actually happening?",
    "controversiality": 0,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512719922.0,
    "date_created": "2017-12-07",
    "time_created": "18:58:42",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw693r",
    "parent_id": "t1_dqw5q5v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">I voted for leave, felt well informed, still feel well informed and am still committed to seeing it through. \n\nExactly what did you feel well informed about, out of interest? \n\n",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1512664969.0,
    "date_created": "2017-12-07",
    "time_created": "03:42:49",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw637n",
    "parent_id": "t1_dqw5q5v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "So, you well were informed at the time - presumably informed enough to see that Brexit could very well lead to the break up of the UK, with either a hard border or special economic zone for NI, and with Scotland wanting any special deal which benefits them as much as possible. Presumably you liked the idea of the DUP, a party 262,000 people voted for, being in effective control of UK politics, and are still happy with that. This is a party which voted against the GFA and frankly wants a return to the troubles. Presumably you were also well informed enough to know that May considered any CJEU influence an absolute red line, including that of the regulatory bodies, such as medicine, or space, and were also well informed enough to know that with less than 18 months to go until we leave, that our government will have done no work on setting up our own regulatory bodies. Presumably will also have known that basic foodstuffs would increase their price by 15% in some cases, and you are perfectly happy with that.\n\nThe point is, it is my job, professionally, to identify these sorts of potential risks from a legal perspective, and I didn't (in my wildest dreams) think the DUP would be running the UK, actively trying to destroy any deal, nor that May would be idiotic enough to leave all of the regulatory bodies without finding a replacement (so, we're in for a world of pain in 14 months without a transitional period...)",
    "controversiality": 0,
    "ups": 75,
    "downs": 0,
    "score": 75,
    "created": 1512664563.0,
    "date_created": "2017-12-07",
    "time_created": "03:36:03",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw77kd",
    "parent_id": "t1_dqw5q5v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Ok, since you've responded seriously, I will too.\n\nI'm a remainer. What gets me is that there wasn't and still isn't any plan or blueprint. I can see how remaining would affect me. I know my industry, which is well integrated with the EU, will continue to do well. Outside the EU is a blur. We are 18 months from the vote and we still have no idea what this weak government wants for the UK. What is the way ahead..how do they see post-Brexit UK? What is their plan to make the UK prosper in the years ahead? \n\nSaying we'll sign multiple trade deals doesn't really cut it for me, especially when it's been suggested that they want to try cut and paste the deals we already have with other countries through the EU to apply to the UK alone. Where is the benefit we were told would come from bespoke trade deals?\n\nI could accept Brexit, even though I personally appreciate what the EU has done for me if the government came out with a solid plan for the road ahead that I could agree with. I could even try to accept it if the government came out with a logical plan that I didn't agree with. What I can't accept is the government winging it without a clue (reports yesterday suggest the cabinet haven't even discussed how the UK will look after we leave yet). \n\nWe could be heading to hell in a handcart and my job, my families security and their future could be going along with it. So sorry, you are not well informed if the government hasn't even discussed the future. Nobody is well informed and that includes Davis, Johnson and May. To be in this position after 18 months is a disgrace. \n\nThe fear of the prospect of future integration (which Cameron had an exemption for the UK) is not being well informed. ",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1512667410.0,
    "date_created": "2017-12-07",
    "time_created": "04:23:30",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqxc7q6",
    "parent_id": "t1_dqw5q5v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Sadly, those downvotes and some of the abusive comments made in reply to you are the reason why many intelligent  brexit supporters who are open to debate and discussion tend not to post here.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1512718946.0,
    "date_created": "2017-12-07",
    "time_created": "18:42:26",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw75n2",
    "parent_id": "t1_dqw5q5v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "We do know that 'eventual federalisation' must have been approved by the UK voters through a referendum, so that's a load of bunk. We could have rejected it then, as other countries have rejected treaties and forced amendments. Also, we have Cameron's opt out to any further integration. \n\nIt is disingenuous to claim that a vote to leave and a vote to remain are even remotely similar in their predicibility. One is the status quo, the other is a mix of utterly contradictory proposals and ideals that are so divergent the cabinet cant even discuss them without bringing down the government,\n",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1512667270.0,
    "date_created": "2017-12-07",
    "time_created": "04:21:10",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw5tgv",
    "parent_id": "t1_dqw5q5v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">I voted for leave, felt well informed, still feel well informed and am still committed to seeing it through.\n\nWhich part of the Leave campaigns' rhetoric did you disregard, then? ",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1512663895.0,
    "date_created": "2017-12-07",
    "time_created": "03:24:55",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw618b",
    "parent_id": "t1_dqw5q5v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Just out of interest, when you weighed up the      impact on nearly 60 sectors of the UK economy, where did you get your information from? ",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1512664428.0,
    "date_created": "2017-12-07",
    "time_created": "03:33:48",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw70yi",
    "parent_id": "t1_dqw5q5v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "But people, in general, are not well informed. There's just no getting away from it. The EU is such that to be acquainted and educated about the way that it operates and functions, and then to weigh up the financial, political and social impacts it has would take someone to be very well read up on and knowledgeable on its practices. Should people have had the choice? I'm not sure. It's a very difficult question to answer as we're a democracy and the public, in theory, should have the choice. But the general public cannot realistically make a well informed pragmatic decision on something that matters so much to the future of the country. \n\nEdit: a word.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1512666936.0,
    "date_created": "2017-12-07",
    "time_created": "04:15:36",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7apd",
    "parent_id": "t1_dqw5q5v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> I voted for leave, felt well informed\n\nI downvoted you because of this. At the time of the referendum no one knew what Brexit actually meant, so you could not have been well informed.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1512667645.0,
    "date_created": "2017-12-07",
    "time_created": "04:27:25",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwa769",
    "parent_id": "t1_dqw5q5v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">The problem is that whenever you are comparing “the status quo” with “something new” \n\nThis is where I see Remainers having a HUGE blind spot. For many, Remain was the status quo and Leave was this big jump into the unknown. But for a lot of Leave voters, it was Leave instinctively felt like an attempt to maintain the status quo they had enjoyed for much of their (perhaps longer) lives. When it comes to the EU, the most obvious change is in immigration. Someone living in a nice part of London or Cambridge, for example, immigration has long been accepted and normalised, both EU and non EU, for many decades. Someone living in Norfolk only really began to experience immigration in the last 10 years, and all of it exclusively from less developed parts of eastern Europe. That's a disruption to the status quo for him. Oh and your downvotes are just indicative of how unbalanced this whole sub has become. It's become like a religious EU cult. \n\ntl;dr, the 'status quo' was different depending on who you were and where you lived.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1512675251.0,
    "date_created": "2017-12-07",
    "time_created": "06:34:11",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7a4x",
    "parent_id": "t1_dqw5q5v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">Delusional statement insulting people \n\n>People point out the stupidity\n\nLOL OMG WHY CAN'T WE JUST HAVE A CIVIL DEBATE, SO MUCH FOR THE TOLERANT LEFT",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1512667603.0,
    "date_created": "2017-12-07",
    "time_created": "04:26:43",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqy0t69",
    "parent_id": "t1_dqw5q5v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "voting on reddit is not fit for this purpose",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512754555.0,
    "date_created": "2017-12-08",
    "time_created": "04:35:55",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw845d",
    "parent_id": "t1_dqw5q5v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> I downvoted because i think this is just an inflammatory post.\n\n> Can’t we just have a friendly debate?\n\nPick one.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1512669855.0,
    "date_created": "2017-12-07",
    "time_created": "05:04:15",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7r79",
    "parent_id": "t1_dqw5q5v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I downvoted because you downvoted the post, yet still came on and had a conversation.  \n\nNot very good Reddiquette.  \n\nAnd then you moan about wanting debate, something you initially tried to subvert. You can't have it both ways. \n\n",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1512668870.0,
    "date_created": "2017-12-07",
    "time_created": "04:47:50",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7ygw",
    "parent_id": "t1_dqw5q5v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Since all of this new information has come to light, we were all **objectively** uninformed. Leave or Remain.\n\nFor example, we had no idea at all that May would call an election, lose her majority, and be forced to use an NI unionist party to prop herself up, thus making any question on the Irish border a murky question, thus hanging up trade talks.\n\nYes, I get your point, \"crystal ball\" and all that. But we were being convinced of voting for a concept completely on the concept of principle and ideology with no thought to practicality. I voted Remain but 100% understand the reasons people voted Leave (well, the good federalization based reasons anyway, not the crappy \"take back control I hate immigrants\" reasons), but at that point we were expecting nothing much more than \"we invoke A50 then we're out\". It did not take a crystal ball to know/learn what would be involved in the ongoing negotations, which literally [no-one from the government or advocating for Leave had even thought about](https://www.youtube.com/watch?v=GTH3uozfHMM) and apparently with David Davis lying about having done assessments, we're STILL not really thinking about it.\n\nSure, I'm sure there's an argument for blaming the EU for these stalls, not conceding stuff and being firm on their stance, etc., but this is a negotiation, and they have the leverage. We're the ones leaving them, after all.\n\nWe voted for the government to do something with the assumption that they would be able to get it done. A fair assumption, since government should be prepared for both outcomes of a referendum if they're going to offer it. It's seeming day by day more likely that they can't, not at least without completely bricking our economy and relationship with the EU and the rest of the world.\n\nEither the government and Leave campaigners knew this difficulty and kept us uninformed, or they just didn't do their due diligence, which makes them negligent. I'm backing the latter, personally. Either way, we didn't have the whole picture when the referendum was given to us. No-one did, and no-one ever could, since it was a process that had never happened in the history of the EU, marketed to us as \"oh y'know we can just leave\". It's why we should never have had a referendum on it in the first place. Not because we're dumb. Because requiring a crystal ball for 80% of the picture is, in absolutely no reasonable universe, \"informed\", no matter how smart you are.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1512669420.0,
    "date_created": "2017-12-07",
    "time_created": "04:57:00",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw95om",
    "parent_id": "t1_dqw5q5v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Sadly, just because you *feel* well informed doesn't mean that you are.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1512672634.0,
    "date_created": "2017-12-07",
    "time_created": "05:50:34",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw9u4z",
    "parent_id": "t1_dqw5q5v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "None of us are informed enough even now to make a judgement, it is simply not true you were informed enough last year. You just felt like you were.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1512674378.0,
    "date_created": "2017-12-07",
    "time_created": "06:19:38",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwr261",
    "parent_id": "t1_dqw5q5v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "**EDIT: WOW, SO MUCH FOR THE TOLERANT LEFT**",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512696358.0,
    "date_created": "2017-12-07",
    "time_created": "12:25:58",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqx7uz9",
    "parent_id": "t1_dqw5q5v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "People downvoting this guy for responding should go to /uk ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512714145.0,
    "date_created": "2017-12-07",
    "time_created": "17:22:25",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqx5k1h",
    "parent_id": "t1_dqw5q5v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> The quote is presented in a different context as if to insinuate that Brexit voters were not well informed (and by extension Davies is a hypocrit) and I think that’s an unfair comparison to draw. \n\nThat's not what I got from it at all. \n\nBrexit voters *could not possibly* be well informed, because the policy options for leaving the EU were not set out. Were they voting for EEA membership? To leave the customs union? To leave the single market? How about ECJ? \n\nThat's not Davis' fault because he didn't get to set out how the EU referendum was run. He's not a hypocrite, he's just playing the cards he was dealt. \n\nIf he starts banging on about how the EU referendum in some way represents \"the will of the people\", *then* he's a hypocrite. Doubly so if he think it's a mandate for any particular way of leaving the EU. I'm not aware that he's committed any of those sins, so I'm not going to call him a hypocrite.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512711447.0,
    "date_created": "2017-12-07",
    "time_created": "16:37:27",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7bi2",
    "parent_id": "t1_dqw5q5v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You might be \"well informed\" though I actually don't think you are (do you also get all your \"research\" from right wing rags?) because even with absolute shit show you still want it to go through. The vast majority though working class especially wouldnt of had a fucking clue.  They just listened to right wing rags for years that blamed the EU for everything. \n\nShow us your sources of research. ",
    "controversiality": 1,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512667703.0,
    "date_created": "2017-12-07",
    "time_created": "04:28:23",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwa6hp",
    "parent_id": "t1_dqw5q5v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">Can’t we just have a friendly debate?\n\nAre you kidding? You and your ilk have rang the death knell of this Country, your xenophobic exceptionalism has ruined 70years of a United Europe, culturally and then economically and now your far-right rhetoric (don’t kid yourself it’s anything else) has infiltrated our society as acceptable thought.\n\nSo no, we can’t be fucking friends, we can’t have a nice cup of tea and a chat about how you have fucked the next 3 generations of Britons. \n\nDavid Davis, fucked you, he fucked you in your face, he doesn’t give a shit, he laughs about the fact no economic assessments have been done ffs. \n\nYou thinking you were well informed shows the base level you’re operating at since the Tories have come out and *admitted* they lied their why to the win. \n",
    "controversiality": 0,
    "ups": -31,
    "downs": 0,
    "score": -31,
    "created": 1512675207.0,
    "date_created": "2017-12-07",
    "time_created": "06:33:27",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwci74",
    "parent_id": "t1_dqw5q5v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> I voted for leave, felt well informed, still feel well informed and am still committed to seeing it through. \n\nI think Brexit is a terrible idea but I accept that there are serious arguments for it and that you can hold a perfectly justified view supporting it. But the existence of that (and yourself) doesn't run contrary to the point OP is making, which is that for a nationwide referendum we need more than just vague ideas. It becomes a rorschach test where people fill in what they want. For some, they wanted immigration to stop and they saw Leave as the best way to do it, for others they were more concerned with UK sovereignty, others had misinformed views of EU laws, some thought we'd see more funding for the NHS, etc etc.\n\nWithout specifics Leave voters were able to come together supporting contradictory ideas and Remain couldn't effectively counter that because it was such a general vote. I think whatever the end of Brexit talks, if you took the final agreement and put THAT to a vote, it would never win, and that's ultimately the point Davis was making 15 years ago - you can push unpopular legislation through by using a vague referendum first, legislating after. ",
    "controversiality": 0,
    "ups": -1,
    "downs": 0,
    "score": -1,
    "created": 1512679949.0,
    "date_created": "2017-12-07",
    "time_created": "07:52:29",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqx2i29",
    "parent_id": "t1_dqw5q5v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> I voted for leave, felt well informed, still feel well informed and am still committed to seeing it through.\n\nFeeling well informed is not the same as actually being well informed.",
    "controversiality": 0,
    "ups": -1,
    "downs": 0,
    "score": -1,
    "created": 1512707118.0,
    "date_created": "2017-12-07",
    "time_created": "15:25:18",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwhza5",
    "parent_id": "t1_dqwg7lm",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">You remind me of that South Park episode where everyone sniffs there own farts.\n\n*their",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1512687511.0,
    "date_created": "2017-12-07",
    "time_created": "09:58:31",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwj4j2",
    "parent_id": "t1_dqwg7lm",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I don't think that insulting the OP is a productive contribution to the conversation",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1512688778.0,
    "date_created": "2017-12-07",
    "time_created": "10:19:38",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw5pa9",
    "parent_id": "t1_dqw5gul",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Did you? Even government doesn't know what you voted for. There is no assessment of Brexit, we have no idea what it will do it has been admitted yesterday. How can you stand there and say you knew what you voted for, when we just officially admitted that no one has a fucking clue what we voted for. ",
    "controversiality": 0,
    "ups": 138,
    "downs": 0,
    "score": 138,
    "created": 1512663617.0,
    "date_created": "2017-12-07",
    "time_created": "03:20:17",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw74u4",
    "parent_id": "t1_dqw5gul",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Even **the cabinet** can't agree about what the electorate voted for, 18 months after the referendum.",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1512667210.0,
    "date_created": "2017-12-07",
    "time_created": "04:20:10",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw5myw",
    "parent_id": "t1_dqw5gul",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Turns out key leave campaigners like Davis didnt know either so they have nothing to feel bad about.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1512663466.0,
    "date_created": "2017-12-07",
    "time_created": "03:17:46",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7t51",
    "parent_id": "t1_dqw5gul",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I was sick of hearing we needed a rerun of the 1975 referendum because people didn’t know what they were voting for.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512669016.0,
    "date_created": "2017-12-07",
    "time_created": "04:50:16",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw618d",
    "parent_id": "t1_dqw5gul",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I was on top of everything, reading all the things. I knew what remain was, I've done that, I've seen that but Leave? What the hell would that be? It was a guess, a stab in the dark, wishy thinking... \n\nSo as an elector I can say without a doubt I had no idea what I'd be voting for, and nobody else possibly could say they did either, bar voting for the unknown.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1512664428.0,
    "date_created": "2017-12-07",
    "time_created": "03:33:48",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwerpk",
    "parent_id": "t1_dqw5gul",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "mate they literally didn't. I'd wager most still don't on both sides",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512683509.0,
    "date_created": "2017-12-07",
    "time_created": "08:51:49",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw5nv0",
    "parent_id": "t1_dqw5gul",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Where did op say that?",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1512663522.0,
    "date_created": "2017-12-07",
    "time_created": "03:18:42",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwqsmf",
    "parent_id": "t1_dqw5gul",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It truly amuses me that the same people who will act like downvoting their condescending shit article posts is a crime will automatically dispense massive downvotes to anyone questioning their singular view of how the world and the brexit vote in particular work.\n\nThe moment the snide shittery of the reddit remainer is pointed out: namely their arrogant and constant assumptions that \"leave voters didn't know what they were voting for\" they collectively lose their shit and start slinging ad hominems, downvotes and other trite and sad attempts to divert the topic unto one more... palatable to their weak minds.\n\nI've come to the conclusion that the average person using /r/UKpolitics must be completely deluded, since it seems to be articles and comments which are logical and truthful which they disdain.\n\nInsult corbyn/labour? downvotes. \n\nInsult Brexits remain campaign or in anyway imply that brexit could be a positive thing/call out the EU for being corrupt? downvotes.\n\nInsult left leaning politicians from America such as Barack Obama? downvotes. (you'll get plenty of upvotes on a good trump bashing post though naturally)\n\nWhen I say 'insult' I actually mean \"point out legitimate flaws/atrocities/controversies\"",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512696115.0,
    "date_created": "2017-12-07",
    "time_created": "12:21:55",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwduct",
    "parent_id": "t1_dqwdm2v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That's not remotely what I was going for. The post is illustrating the contrast between Davis saying 15 years ago that the public should be as informed as possible, and yesterday saying there are no impact assessments and they'd be a waste of time anyway.\n\nBut it is amusing seeing you jump to the conclusion that it's a personal attack on leavers, especially since it's a quote by Mr Leave himself. ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1512682147.0,
    "date_created": "2017-12-07",
    "time_created": "08:29:07",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwyylz",
    "parent_id": "t1_dqwyf07",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yeah, the communist that is Corbyn.\n\nOn a more serious note, we need a new centrist party to emerge to heal the split the country is in.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512703726.0,
    "date_created": "2017-12-07",
    "time_created": "14:28:46",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqxz44f",
    "parent_id": "t1_dqxlpgt",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "If you read Jefferson's letter it is in the context of the many disparate States becoming consolidated under one constitution. He is expressing surprise and delight (I think), that it has been effective, that the states still maintain their autonomy, but support a federal legislature. The quote is saying that being well informed was necessary for this agreement and cooporation and trust to flourish.\n\nYou're right though, the statement on its own isn't the whole truth.\n\nJefferson is also meant to have said:\n\n> The cornerstone of democracy rests on the foundation of an educated electorate.\n\nwhich is again slightly different. Maybe people can be trusted with their own government *without* democracy, but Jefferson was committed to it, and I don't know another effective way.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512750110.0,
    "date_created": "2017-12-08",
    "time_created": "03:21:50",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw78rk",
    "parent_id": "t1_dqw5ilx",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "\"here we go fobbing off Barnier\"",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512667497.0,
    "date_created": "2017-12-07",
    "time_created": "04:24:57",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwaozt",
    "parent_id": "t1_dqw8yqf",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Looks like another victim infected gibberingidiotitus, better visit your GP. ",
    "controversiality": 1,
    "ups": -2,
    "downs": 0,
    "score": -2,
    "created": 1512676372.0,
    "date_created": "2017-12-07",
    "time_created": "06:52:52",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwyh2s",
    "parent_id": "t1_dqwq6aj",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "All in good fun I know, but seriously, the Yanks *do* have a series of checks and balances to prevent abuses of power which are codified and legally binding. In fact Trump has struggled to get a lot of his policies enacted for this very reason. \n\nOne thing that this brexit sh*t has highlighted is just how weak and unfit for purpose our just about democratic system here in the UK really is. ",
    "controversiality": 1,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512703270.0,
    "date_created": "2017-12-07",
    "time_created": "14:21:10",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqx261u",
    "parent_id": "t1_dqwvxp6",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "My state in the US had a referendum last year to legalize marijuana. We had actual policy drawn up, this is what the legislature had to do, and we voted on that. It was even summarized on the ballot.\n\nOf course, as soon as we passed it the legislature starting passing bills to amend what we wanted, but we couldn't stop them from doing that.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512706777.0,
    "date_created": "2017-12-07",
    "time_created": "15:19:37",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqx2isr",
    "parent_id": "t1_dqwzjft",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "A few months back, I pulled someone up for using 'pacific' instead of 'specific' used like: \"I like to play my games in a pacific way\". He then informed me that he meant pacific, as in he likes to play his games as a pacifist. \n\n\nNow the tables have turned, as I actually meant provably, as in it's beyond evident now that the net result of brexit will be negative. I guess someone will be along in all caps sooner or later to ask me to PROVE IT.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512707145.0,
    "date_created": "2017-12-07",
    "time_created": "15:25:45",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwrm4m",
    "parent_id": "t1_dqwr6hr",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Prob going to get some shit for this, I fucking *agonised* over the decision absorbing as much information as I could get my hands on from both sides (and discounting lots as it was from biased or obviously-false sources). In the end I voted leave, which I now admit was a huge mistake. I've felt like absolute fucking shit the last few months as more and more things transpired and feel like I was manipulated. \n\n\nKinda pokes a hole in your insult.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1512696862.0,
    "date_created": "2017-12-07",
    "time_created": "12:34:22",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwwck9",
    "parent_id": "t1_dqwr6hr",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512701257.0,
    "date_created": "2017-12-07",
    "time_created": "13:47:37",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7v0g",
    "parent_id": "t1_dqw7kcg",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Tory critic is e-story. ",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1512669160.0,
    "date_created": "2017-12-07",
    "time_created": "04:52:40",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwqtul",
    "parent_id": "t1_dqwnyyo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I like pretty much every Scandinavian person I have met, however I think it's unrealistic for me to speak with every single one of them, and what I have to offer isn't worth a general audience.\n\nIf I had time I absolutely would talk to all of them, but my days are numbered :)",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1512696147.0,
    "date_created": "2017-12-07",
    "time_created": "12:22:27",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwb5m3",
    "parent_id": "t1_dqwb3hu",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I’m very much joking sir. But yes someone probably believes that way somewhere. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1512677370.0,
    "date_created": "2017-12-07",
    "time_created": "07:09:30",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwoymf",
    "parent_id": "t1_dqwf0ys",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "But know one can know, experts sometimes get it wrong, so now you're just mis-informed /s",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512694433.0,
    "date_created": "2017-12-07",
    "time_created": "11:53:53",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwa2vk",
    "parent_id": "t1_dqw8z6t",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think fundamentally a problem arises from the fact that the govt, who proposed the referendum, did not want a change in the status quo and so didn't produce a clear 'what brexit means' plan in the way the ScotGov did in 2014 for Independence. This left a vacuum into which a million different interpretations could be projected",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1512674970.0,
    "date_created": "2017-12-07",
    "time_created": "06:29:30",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw97fk",
    "parent_id": "t1_dqw8z6t",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You don't reckon posing the options in a balanced and clear framework like [this one](https://www.instituteforgovernment.org.uk/sites/default/files/Trade%20options%20new%20v2.jpg) wouldn't have been sufficient.\n\nWith a large number of nuanced options, the press would have a much harder job influencing the outcome with the simple \"us vs them\"-style narrative of two options.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512672763.0,
    "date_created": "2017-12-07",
    "time_created": "05:52:43",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqx3527",
    "parent_id": "t1_dqw8z6t",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> The options should be balanced in scope. That was not the case, the leave vote embodied a plurality of positions (at least hard and soft Brexit) whereas remain was one.\n\nThe referendum could have had a different option/choice for each leave position.\n",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512708115.0,
    "date_created": "2017-12-07",
    "time_created": "15:41:55",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwq085",
    "parent_id": "t1_dqw7ppc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yet Davies didn't organise the referendum Cameron did. Davies is dealing with the result of it. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512695404.0,
    "date_created": "2017-12-07",
    "time_created": "12:10:04",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7uas",
    "parent_id": "t1_dqw7fc4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Smarter decisions for smart people maybe, how would anyone guarantee these decisions are in the interest of less smart people? Everyone should get a vote, end of. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1512669106.0,
    "date_created": "2017-12-07",
    "time_created": "04:51:46",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwgugf",
    "parent_id": "t1_dqw7fc4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "And let me guess, you would be one of these smart people given the vote yes? \n\nWhat you really mean is that you consider your opponents stupid because really you are too stupid to understand why they think what they do and and rather than try and argue against a position you don't understand, you just want to take away their vote Much easier for you eh, seeing as your so smart?",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1512686189.0,
    "date_created": "2017-12-07",
    "time_created": "09:36:29",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7zda",
    "parent_id": "t1_dqw7fc4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I mean if we want to get picky we already restrict on age at a fairly arbitrary age.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512669488.0,
    "date_created": "2017-12-07",
    "time_created": "04:58:08",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwtlqb",
    "parent_id": "t1_dqwoubr",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I agree, I remember learning about bias and critical thinking as it applied to science, when I left school it started being much more in the forefront in high school education. I know from personal experience that high schools now dedicate entire lessons to discussing and critically thinking about current affairs which is a vast improvement. You're right that it could be worse but ,ofcourse, we shouldn't judge a system by how much worse it could be.\n\nIn terms of the older generation, I think it's a bit of both, the focus on critical thinking didn't feel as necessary when the degree of information available was a lot smaller before the internet and now it's crucial. The older generation grew up without these tools but it's not like if we get older we are incapable of learning. At the same time, I would argue that even willingness to critically think has to be something you learn. Critical thinking, like going to the gym, is hard, it takes time and resources. While there will some who enjoy it, for the rest of us the only way to do it is to learn to do it a little at a time until it becomes a habit. ",
    "controversiality": 0,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512698677.0,
    "date_created": "2017-12-07",
    "time_created": "13:04:37",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwq2o2",
    "parent_id": "t1_dqw89xr",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Davies didn't organise the referendum Cameron did. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512695464.0,
    "date_created": "2017-12-07",
    "time_created": "12:11:04",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqx2554",
    "parent_id": "t1_dqw89xr",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No, it doesn't. It only means that we should've had another referendum on what type of Brexit to have, or for parliament to decide like normal. Only the government is terrible. ",
    "controversiality": 0,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512706753.0,
    "date_created": "2017-12-07",
    "time_created": "15:19:13",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwv5os",
    "parent_id": "t1_dqwucy8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You didn't spot the sarcasm?",
    "controversiality": 0,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512700129.0,
    "date_created": "2017-12-07",
    "time_created": "13:28:49",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw6xdh",
    "parent_id": "t1_dqw694b",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "lol, post of the day!",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512666679.0,
    "date_created": "2017-12-07",
    "time_created": "04:11:19",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw5368",
    "parent_id": "t1_dqw40eh",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "This person is my favourite poster on all of reddit. They're literally absolutely insane, and they're an impenetrable wall of bile and hatred to anyone who disagrees with them, becoming somehow increasingly bitter as time has gone on. Facts merely bounce off them like a rubber wall made of self denial\n\nIts been wonderful to experience as you rarely get to really follow along so closely to such a tortured soul outside of a louis theroux documentary\n\n",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1512662166.0,
    "date_created": "2017-12-07",
    "time_created": "02:56:06",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7wxb",
    "parent_id": "t1_dqw7r4f",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "PROJECT FEAR! Lets just leave and be done.\n\nIt so incredible that people are willing to destroy the country they claim to love in pursuit of such a ill defined agenda. I'm so glad that I have a second, Irish, passport and am going to study in Europe. For one, the course fees are a fraction of what they are here. ",
    "controversiality": 0,
    "ups": 47,
    "downs": 0,
    "score": 47,
    "created": 1512669303.0,
    "date_created": "2017-12-07",
    "time_created": "04:55:03",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwjisp",
    "parent_id": "t1_dqw7r4f",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "If there is nothing complicated to discuss, then the ref question was ok, but if there was something complicated to discuss, what would the ref question/s be?\n\nI don't recall any comments from either side about complexity. Besides, anyone who claims that complexity is a reason not to leave would be shot down straight away; you don't avoid things just because they are hard.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512689199.0,
    "date_created": "2017-12-07",
    "time_created": "10:26:39",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwuwh3",
    "parent_id": "t1_dqws8dn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Well well! It was worth posting that for your reply. What an intelligent and thoughtful reply ;-)\n\n\"Trepanning the country to release the evil spirits\". \n\nBrilliant!",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512699890.0,
    "date_created": "2017-12-07",
    "time_created": "13:24:50",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwktv9",
    "parent_id": "t1_dqwaddr",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> I agree that Cameron made a terrible, irresponsible decision by deciding to hold the referendum in the timeframe that he did\n\nInterestingly, we're fast approaching a point where the people who call for another referendum won't be able to have one before we're legally bound to leave the EU. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1512690541.0,
    "date_created": "2017-12-07",
    "time_created": "10:49:01",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwlvul",
    "parent_id": "t1_dqwaddr",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "If your rank all of the prime ministers of the UK Cameron must surely be in the bottom 3. \n\nAs useless as Theresa May is, Cameron's arrogance and irresponsibility has completely driven the country off the cliff. Didn't even have the decency to clean up his mess, he just fucked off.\n\nWhat a bellend.  ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1512691577.0,
    "date_created": "2017-12-07",
    "time_created": "11:06:17",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwahfx",
    "parent_id": "t1_dqwaddr",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Sure. Provided it begin and start with the words 'yhe establishment fucked up and the people were right to vote for brexit', with the starting point that substantial and transformative changes to Britain's constitutional status are needed. The starting point would have to be that freedom of movement had to end unless a separate, clear mandate contradicted it.",
    "controversiality": 0,
    "ups": -8,
    "downs": 0,
    "score": -8,
    "created": 1512675908.0,
    "date_created": "2017-12-07",
    "time_created": "06:45:08",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqxz6zp",
    "parent_id": "t1_dqxd2ct",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It’s his entire post history ",
    "controversiality": 0,
    "ups": -1,
    "downs": 0,
    "score": -1,
    "created": 1512750310.0,
    "date_created": "2017-12-08",
    "time_created": "03:25:10",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw6ukq",
    "parent_id": "t1_dqw693r",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "£350m for the NHS and no more immigrants! What more do you need? /s",
    "controversiality": 1,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1512666477.0,
    "date_created": "2017-12-07",
    "time_created": "04:07:57",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw781a",
    "parent_id": "t1_dqw637n",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Break up of the union was project fear, European courts are evil, we don't need nasty eu regulation for ourselves or for trade, food prices will crash after we actually leave... - leavers, probably. ",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1512667446.0,
    "date_created": "2017-12-07",
    "time_created": "04:24:06",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwa1mz",
    "parent_id": "t1_dqw637n",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "They probably mean they were as informed as they could be. there were months of propaganda on both sides, lies on both sides(EU army anyone?) but at the end of the day you can only vote on the information you have in front of you.\n\nThe things you are saying as a definite are still not settled, you're as \"informed\" as everyone else.",
    "controversiality": 1,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512674884.0,
    "date_created": "2017-12-07",
    "time_created": "06:28:04",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7kqc",
    "parent_id": "t1_dqw637n",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I did say at the time that Brexit may lead to a breakup of the UK, I think it’s unlikely and still do though. The political situation is quite nuanced; NI politics doesn’t support Irish reunification at the moment and there isn’t much sign its shifting. Irish politics is entrenched in sectarian divisions that don’t tend to produce big swings in opinion (unlike Scottish independence which is fundamentally a civic movement rather than a sectarian one). The situation in Scotland is that they only just had a referendum and despite SNP landslides in the past they haven’t been able to galvanise public support for a second referendum. Scotland may yet try to leave but I think it’s unlikely - because even if they wanted another referendum only Westminster can allow it, and it’s unlikely they would only a few years after the last one.\n\nThe DUP is a complex topic. It’s worth remembering they only have any political clout in this government, so we are only talking about 5 years (a short time in legislative politics) not forever. I do actually have some sympathy for the DUP because the EU is also pushing for a situation that paves the way for NI to move away from the rUK and that doesn’t respect the GFA either. NI is a delicate balance and I do respect the right of the DUP to protect that balance. Right now we are in the middle of a rock and a hard place, with both sides duking it out. But the DUP will only have that ability for a few years. It’s entirely possible a future government with a stronger majority will simply reverse any agreements with the DUP and steamroll legislation through that affects them. ",
    "controversiality": 1,
    "ups": -5,
    "downs": 0,
    "score": -5,
    "created": 1512668390.0,
    "date_created": "2017-12-07",
    "time_created": "04:39:50",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw9gdq",
    "parent_id": "t1_dqw77kd",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It strikes me that what you don’t like is the unknown aspect of this. And clearly you are correct; Brexit represents risks which means some people will be losers and some people will be winners. The problem though is that risk and “blue-printing” isn’t the same as being ill informed... and this is the key thing; understanding the risks (I.e. that we may well be worse off in some respects) means being informed. Brexit is all about calculated risk (the risk of being worse off but getting more control over immigration and the UKs social and cultural future). \n\nI understand that for people who didn’t want or understand Brexit to start with, this must now be quite scary. All I can really say is that I empathise with you, but a majority of people want this and that means you’re coming along for the ride. It’s how democracy works. ",
    "controversiality": 0,
    "ups": -5,
    "downs": 0,
    "score": -5,
    "created": 1512673417.0,
    "date_created": "2017-12-07",
    "time_created": "06:03:37",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw69nu",
    "parent_id": "t1_dqw5tgv",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Which parts of Remain’s campaign did you disregard? ",
    "controversiality": 0,
    "ups": -39,
    "downs": 0,
    "score": -39,
    "created": 1512665008.0,
    "date_created": "2017-12-07",
    "time_created": "03:43:28",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw75ao",
    "parent_id": "t1_dqw618b",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The tone of your questions strikes me as pretty aggressive and I was hoping this wouldn’t go that way. There is obviously still a lot of ill feeling between people who voted remain and those who voted leave I guess. I don’t know why people are trying to “call me out” on what I said, as if to demonstrate I wasn’t well informed. Indeed if you go back and trawl my post history you’ll see I was of the feeling that single market membership in its present state was unlikely after Brexit, that the £350mil to the NHS a week claim was never going to happen for obvious reasons and that the negations would involve a lot of negotiation (what a surprise!). At the same time I didn’t believe remains lies about punishment budgets or opt outs on “ever closer union” when clearly they weren’t going to materialise in any practical sense.\n\nBoth sides talked a LOT of shit and whether a person fell for it or not doesn’t define whether they were “well informed”, it defines whether they’re gullible. ",
    "controversiality": 1,
    "ups": -8,
    "downs": 0,
    "score": -8,
    "created": 1512667244.0,
    "date_created": "2017-12-07",
    "time_created": "04:20:44",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw79mn",
    "parent_id": "t1_dqw70yi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think you are conflating people disagreeing with you to people being ill informed, I guess because psychologically it’s easier to believe other people are stupid that to accept that sometimes people feel differently about something even when all things are equal. ",
    "controversiality": 0,
    "ups": -7,
    "downs": 0,
    "score": -7,
    "created": 1512667564.0,
    "date_created": "2017-12-07",
    "time_created": "04:26:04",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7w34",
    "parent_id": "t1_dqw7apd",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "18 months later, not much has changed.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1512669241.0,
    "date_created": "2017-12-07",
    "time_created": "04:54:01",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwao8p",
    "parent_id": "t1_dqwa769",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Thanks, I agree entirely. It’s the occasional sensible reply or genuine debate that keeps me going here.\n\nMy gut feeling is that the conservatives will manage to hold out until 2022 and that Corbyn won’t be able to secure a majority even after Brexit. I think the shock of defeat or minority will be similar to when Kinnock lost in 1992. The question is then whether labour can put forward a centrist alternative that can win... or whether the conservatives either under a radically reformed May OR other leader can hold power. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1512676329.0,
    "date_created": "2017-12-07",
    "time_created": "06:52:09",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwbct6",
    "parent_id": "t1_dqwa769",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Alternative tl;dr: you redefined the *status quo* to mean the opposite and/or something in the past and that even then was arguably mythical.\n(Although to be fair I kinda get your point...)",
    "controversiality": 1,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512677777.0,
    "date_created": "2017-12-07",
    "time_created": "07:16:17",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwbi24",
    "parent_id": "t1_dqw845d",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Heh. Asking a Leaver to rationally choose from contradictory choices... \n\nWe're going leave the EU, stop immigration and have legal and regulatory divergence (sovereignty!) AND we're also going to be a free trading global superpower!\n\nHave. Cake. And. Eat. It.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1512678070.0,
    "date_created": "2017-12-07",
    "time_created": "07:21:10",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqx6f7i",
    "parent_id": "t1_dqx5k1h",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Brexit voters could not possibly be well informed\n\nSo were remainers voting for an EU army? were they voting for a united states of europe? were they voting for an opt out on ever closer union? were they voting on qualified majority voting or national vetos?\n\nIt strikes me there is a huge lack of empathy in this thread that is typical of the emotive angst that Brexit seems to have generated. Everyone seems to think that the horse they backed is morally superior. \n\nWhat I was pointing out is that I was well informed, and part of being informed is \"knowing what you don't know\". i.e. I am saying I went into that referendum 100% aware that we were dealing with an unknown quantity that may well result in a country that is, at least on paper, poorer. It may mean changes in travel arrangements, it may mean relocation of some business. Appreciating that you don't know, but have considered, what may happen is part of being informed. \n\nI think remainers struggle to appreciate that many of the same arguments could be applied to them if the situation were reversed.   \n\n",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512712506.0,
    "date_created": "2017-12-07",
    "time_created": "16:55:06",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqxddrf",
    "parent_id": "t1_dqw7bi2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Feels over reals, obviously.\n\nHe thinks the glory this country will bask in after Brexit, whenever that ends up being, is worth the hardships (even though the benefit is undefined and unquantifiable, and the losses are in defined areas and only slightly more unquantifiable).",
    "controversiality": 0,
    "ups": -1,
    "downs": 0,
    "score": -1,
    "created": 1512720280.0,
    "date_created": "2017-12-07",
    "time_created": "19:04:40",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqxd8j3",
    "parent_id": "t1_dqwa6hp",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">You and your ilk have rang the death knell of this Country\n\n>xenophobic exceptionalism\n\n>your far-right rhetoric\n\nKinder, gentler politics?",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1512720115.0,
    "date_created": "2017-12-07",
    "time_created": "19:01:55",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqxmcp5",
    "parent_id": "t1_dqwa6hp",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> ruined 70years of a United Europe\n\nWell this was sort-of the point - we weren't on board with a United Europe.",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1512730704.0,
    "date_created": "2017-12-07",
    "time_created": "21:58:24",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqx8vvg",
    "parent_id": "t1_dqwa6hp",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You sound full of hate.",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1512715231.0,
    "date_created": "2017-12-07",
    "time_created": "17:40:31",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqy2q4i",
    "parent_id": "t1_dqwa6hp",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Lol",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512759869.0,
    "date_created": "2017-12-08",
    "time_created": "06:04:29",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqy3onh",
    "parent_id": "t1_dqwa6hp",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Hilarious seeing how furious people get",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512762296.0,
    "date_created": "2017-12-08",
    "time_created": "06:44:56",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqxycxm",
    "parent_id": "t1_dqwa6hp",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Please give me a lesson of where Europe has been united in the last 70 years?\n\nAlso you sound like a dick.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1512748332.0,
    "date_created": "2017-12-08",
    "time_created": "02:52:12",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqyaqxe",
    "parent_id": "t1_dqwa6hp",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "This is how im going to paint the anti-brexit crowd from now on, thanks. :^)",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512773855.0,
    "date_created": "2017-12-08",
    "time_created": "09:57:35",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqy0f7j",
    "parent_id": "t1_dqwa6hp",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I feel you bro.",
    "controversiality": 0,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512753483.0,
    "date_created": "2017-12-08",
    "time_created": "04:18:03",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwt4kq",
    "parent_id": "t1_dqwj4j2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Lol if you'd watched the episode you'd of seen why I said it. This whole subreddit is full of inaudible screeching, one massive liberal echo chamber full of kids crying.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512698238.0,
    "date_created": "2017-12-07",
    "time_created": "12:57:18",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw9jm2",
    "parent_id": "t1_dqw5pa9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1512673643.0,
    "date_created": "2017-12-07",
    "time_created": "06:07:23",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7x6b",
    "parent_id": "t1_dqw5pa9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I know exactly what I voted for. Brexit means Brexit. Duh. ",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1512669322.0,
    "date_created": "2017-12-07",
    "time_created": "04:55:22",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw8jjc",
    "parent_id": "t1_dqw5pa9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "People were asked whether they wanted the UK to continue as a member of the EU, or leave the EU. That's actually reasonably simple as a question, and something you can answer in terms of a preference.  The issue is implementation, but people weren't asked to vote for a specific implementation either way, but rather a direction.  I realise it's something that people have stopped going on about, bu the referendum really was advisory, the idea was that the Government would listen to what people had to say and then act upon it.\n\nSo, those who voted leave did know what we voted for as much as those who voted remain.  What the government delivers (and again, either way..) will depend on what is achievable with the EU, and how capable the government is.",
    "controversiality": 1,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512670999.0,
    "date_created": "2017-12-07",
    "time_created": "05:23:19",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw8a91",
    "parent_id": "t1_dqw5pa9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The statement doesn’t make much sense anyway. You never know exactly what you’re voting for because it hasn’t happened yet. You have to just weigh up what could happen and decide and that’s what the people did. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512670308.0,
    "date_created": "2017-12-07",
    "time_created": "05:11:48",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw8n98",
    "parent_id": "t1_dqw5pa9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "To be fair nobody voting remain really knew what they were voting for either. Ever closer union? EU a la carte? Multi speed? Who knows?",
    "controversiality": 1,
    "ups": -3,
    "downs": 0,
    "score": -3,
    "created": 1512671277.0,
    "date_created": "2017-12-07",
    "time_created": "05:27:57",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw5r4u",
    "parent_id": "t1_dqw5pa9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I don't know about anyone else, but I voted to leave the EU...",
    "controversiality": 0,
    "ups": -57,
    "downs": 0,
    "score": -57,
    "created": 1512663740.0,
    "date_created": "2017-12-07",
    "time_created": "03:22:20",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7c9u",
    "parent_id": "t1_dqw74u4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "No, the cabinet is very clear what the electorate voted for - to leave the EU. Where there is debate is how that is achieved and what the end result will be wrt. our relationship with certain institutions within the EU.",
    "controversiality": 0,
    "ups": -6,
    "downs": 0,
    "score": -6,
    "created": 1512667763.0,
    "date_created": "2017-12-07",
    "time_created": "04:29:23",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw5oyx",
    "parent_id": "t1_dqw5nv0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I never said they did...",
    "controversiality": 0,
    "ups": -7,
    "downs": 0,
    "score": -7,
    "created": 1512663596.0,
    "date_created": "2017-12-07",
    "time_created": "03:19:56",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwc2r0",
    "parent_id": "t1_dqwaozt",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The little rhyme of this has terrible rhythm, are you denying this? Oh look, he said 'fuck', this guy is really funny! The guy is clearly insane.",
    "controversiality": 0,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512679186.0,
    "date_created": "2017-12-07",
    "time_created": "07:39:46",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwzm81",
    "parent_id": "t1_dqwrm4m",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "And good on you for your honesty. Don't feel like shit, we all make mistakes - I certainly do. At least you've got the balls to admit it. \n\nAnd while I am at it, at least you've made the effort to construct two well reasoned and polite comments - rather than just calling people silly, childish names, like some on this thread. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1512704350.0,
    "date_created": "2017-12-07",
    "time_created": "14:39:10",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqx5tb9",
    "parent_id": "t1_dqwwck9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "i hope you become politician, and this comment comes back to haunt you.",
    "controversiality": 0,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512711752.0,
    "date_created": "2017-12-07",
    "time_created": "16:42:32",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwfh6i",
    "parent_id": "t1_dqw7v0g",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Tory cri \"Tic\", I ses \"Tory\".",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1512684479.0,
    "date_created": "2017-12-07",
    "time_created": "09:07:59",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwr7z7",
    "parent_id": "t1_dqwqtul",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Your endeavour in this matter is appreciated.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512696506.0,
    "date_created": "2017-12-07",
    "time_created": "12:28:26",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwgk9s",
    "parent_id": "t1_dqwb5m3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Thank you!",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512685847.0,
    "date_created": "2017-12-07",
    "time_created": "09:30:47",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwac05",
    "parent_id": "t1_dqwa2vk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Completely agree, however, I'm not sure how much the government that proposed the referendum is to blame as we've had a 'Brexit government' for over a year and 'what Brexit means' remains very unclear.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512675565.0,
    "date_created": "2017-12-07",
    "time_created": "06:39:25",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwa80k",
    "parent_id": "t1_dqw97fk",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Not really, the example above at least has the context of 'We've voted for Brexit', what do we want achieve now (the moon on a stick)? For the vote to makes sense from a tWotC viewpoint there needs to be an objective for the referendum. For example, to maximise the UK's GDP should we remain/soft brexit/hard brexit? Then tWotC might give the 'correct' answer, but as objectives are not well-defined, each voter will be answering a different question.\n\nI also think the role of the press has been exaggerated. The only reason they are relevant is because the margin of the outcome was so small. In that case it doesn't make sense to design votes to minimise the effect of the press.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512675305.0,
    "date_created": "2017-12-07",
    "time_created": "06:35:05",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqx7oen",
    "parent_id": "t1_dqx3527",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> omg such a fixed referendum, you just split the leave vote.\n\n-Nigel Farage, after losing the referendum.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512713950.0,
    "date_created": "2017-12-07",
    "time_created": "17:19:10",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwrnt5",
    "parent_id": "t1_dqwq2o2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "And?",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512696906.0,
    "date_created": "2017-12-07",
    "time_created": "12:35:06",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqxiu14",
    "parent_id": "t1_dqx2554",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "By his own reasoning, the referendum result has no standing. You didn't understand the post; I'm just explaining it to you.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512726786.0,
    "date_created": "2017-12-07",
    "time_created": "20:53:06",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw6fz2",
    "parent_id": "t1_dqw5368",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "They think nobody knows who they are, but it's very clearly Dave Davis.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1512665446.0,
    "date_created": "2017-12-07",
    "time_created": "03:50:46",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw5xly",
    "parent_id": "t1_dqw5368",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Nice, can we keep him, pleeeeeze. It's nearly Xmas ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1512664180.0,
    "date_created": "2017-12-07",
    "time_created": "03:29:40",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw709s",
    "parent_id": "t1_dqw5368",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It sometimes scares me when I think how much of their time these people spend being hateful and actively trying to spread it to others. \n\nI mean, I know we're all on reddit, but sometimes I go in hoping to learn something, and I can't get my head around people who just show up to shout shout shout and put their hands over their ears at the same time, lest they accidentally have their opinion questioned.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512666886.0,
    "date_created": "2017-12-07",
    "time_created": "04:14:46",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw8g4c",
    "parent_id": "t1_dqw5368",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "lol ",
    "controversiality": 0,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512670748.0,
    "date_created": "2017-12-07",
    "time_created": "05:19:08",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw9uwt",
    "parent_id": "t1_dqw7wxb",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Well, a lot of us aren't that lucky",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1512674433.0,
    "date_created": "2017-12-07",
    "time_created": "06:20:33",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwag7n",
    "parent_id": "t1_dqw7wxb",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512675834.0,
    "date_created": "2017-12-07",
    "time_created": "06:43:54",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwdfce",
    "parent_id": "t1_dqw7wxb",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You won't be entitled to EU fees after brexit enjoy paying international fees if you haven't already been guaranteed to stay on EU fees.",
    "controversiality": 0,
    "ups": -3,
    "downs": 0,
    "score": -3,
    "created": 1512681502.0,
    "date_created": "2017-12-07",
    "time_created": "08:18:22",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqxbisb",
    "parent_id": "t1_dqwjisp",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "David Davis said that it would be too difficult to produce impact reports, so he didn't.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512718146.0,
    "date_created": "2017-12-07",
    "time_created": "18:29:06",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwvq2y",
    "parent_id": "t1_dqwuwh3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'll be here all week",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512700667.0,
    "date_created": "2017-12-07",
    "time_created": "13:37:47",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwmu9y",
    "parent_id": "t1_dqwktv9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Article 50 can be revoked. ",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512692504.0,
    "date_created": "2017-12-07",
    "time_created": "11:21:44",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwcp2p",
    "parent_id": "t1_dqwahfx",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">\"The starting point would have to be that freedom of movement had to end unless a separate, clear mandate contradicted it.\"\n\nThat mandate exists. It's called the Single Market, which all EU representatives have consistently repeated is not negotiable. You either allow freedom of movement or are not allowed access. \n\nI think people are wearing rather rose-tinted glasses about both the UK's ability to maintain a working economy outside of this market, and their ability to negotiate the dozens of required trade treaties with every major country or economic bloc. These take years at the best of times, often over a decade. Is the UK really going to keep itself as part of manufacturing and service (both of which go back and forth internationally dozens of times from raw material or marketing idea to finished product)? What does the UK population, under-trained and unproductive, have to offer besides its macroeconomically strategic location? \n\nA UK outside of the Single Market completely will suffer a crippling crisis and quickly become a backwater of incredible inequality and an impoverished population being treated like the US proletariat, with none of the Human Rights protections they currently have. There's a reason why the Tories want the Human Rights Act repealed:\n\nhttps://www.liberty-human-rights.org.uk/human-rights/what-are-human-rights/human-rights-act/human-rights-act-mythbuster\n\nBy the way, there *are* restrictions available for immigration within EU laws, and most Western Europe countries use them, for example:\n\nhttps://en.wikipedia.org/wiki/Dano_v_Jobcenter_Leipzig\n\nThe UK made the *specific* choice not to require any. All of those \"benefit scrounger\" Romanians (a small minority, but one that looks good in tabloid covers) could have been turned away within the margins of EU law by the UK government. The UK government specifically *didn't*, partly because of a neoliberal outlook, but mainly because they wanted to play the bigotry card and whip up the plebs for their own political benefit.\n",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1512680283.0,
    "date_created": "2017-12-07",
    "time_created": "07:58:03",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwb730",
    "parent_id": "t1_dqwahfx",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">The starting point would have to be that freedom of movement had to end\n\nI liked this wee thread and your well argued points (even if I disagree with some of it)...\n... until you went and ruined it by trying to suggest that you know perfectly what has a mandate when all that has some backing is a vague pipe-dream to leave the EU.\n\n\n\n",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1512677455.0,
    "date_created": "2017-12-07",
    "time_created": "07:10:55",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqxwcjq",
    "parent_id": "t1_dqw6ukq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "This is low effort crap. You really don’t have anything to say do you.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1512744083.0,
    "date_created": "2017-12-08",
    "time_created": "01:41:23",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwaxhe",
    "parent_id": "t1_dqw781a",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Is English not your first language or are you joking? \n\nIf English is not your first language, just to politely let you know, that didn't make any sense. If you're joking a smiley or a /s helps to let others know. ",
    "controversiality": 0,
    "ups": -6,
    "downs": 0,
    "score": -6,
    "created": 1512676887.0,
    "date_created": "2017-12-07",
    "time_created": "07:01:27",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwf0e2",
    "parent_id": "t1_dqwa1mz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "There were decades of propaganda if someone's primary source was the tabloid media.",
    "controversiality": 1,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512683844.0,
    "date_created": "2017-12-07",
    "time_created": "08:57:24",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw87zw",
    "parent_id": "t1_dqw7kqc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "So your prescience with regards to Ireland largely comes down to ignoring the problem for 5 years (bearing in mind we're leaving in 2019), and then just hoping it'll go away? That strikes me as a little naive, to say the best. Especially considering we need a solution in the next 4 days if we don't want a completely hard brexit - which, given there has been no work on developing our own regulatory bodies - I hope we can both agree would be calamitous to the economic, political, and constitutional stability of the UK?",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1512670139.0,
    "date_created": "2017-12-07",
    "time_created": "05:08:59",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw9p7g",
    "parent_id": "t1_dqw9gdq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Brexit is all about calculated risk (the risk of being worse off but getting more control over immigration and the UKs social and cultural future).\n\nActually you are wrong. The vote said we leave the EU. It didn't mention culture, immigration, or social future. We could leave the EU and stay in the EFTA and accept EU rules and immigration and still have fulfilled the vote.\n\nYou are imprinting your own desires on something that does not specifically promise them. That is uninformed. If there was a white paper, or a proposal from the government that leaving the EU would mean more control of immigration etc then OK..but as it stands, control of immigration is up there with £350m for the NHS.\n\nThe government have said we will have control..the government have said that we'll still need the same level of immigration.\n\nWhich is right? Schroedingers Tories..we won't know till we get it\n\n> for people who didn’t want or understand Brexit to start with\n\nNobody does. Again you are imprinting. Will we have a free trade utopia that destroys our industry? Will we have a shut off protectionist country that protects workers? Will we have a nice halfway Norway type deal that both Farage and Banks suggested..Nobody knows, and we were promised all three.\n\n> some people will be losers and some people will be winners\n\nIt's looking like the only winners so far will be the vulture capitalists like Legutim..or whatever they are called\n\nSo again, removing your own biases..everyone is uninformed. There was no information or vision to make an informed choice. The Brexit campaign did well by appealing to all outcomes. In the real world, only one will be true and nobody knows what one...even the government that are set to implement it\n\nYou have a vision for Brexit you still think will be fulfilled. Corbyn has another one that he thinks will be fulfilled. Both are diametrically opposite. If Tusk is right and May falls..who's Brexit is more likely to happen, and will you still be as happy? Who will be the next PM..Hammond, Johnson or Corbyn..Only one will try and deliver the Brexit you think you voted for. The other two will deliver completely different Brexits.  \n\n> you’re coming along for the ride. It’s how democracy works.\n\nRemember those words if we have PM Corbyn with a majority government in 6 months and Brexit is cancelled...that's how democracy works.  ",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1512674036.0,
    "date_created": "2017-12-07",
    "time_created": "06:13:56",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwhj2v",
    "parent_id": "t1_dqw9gdq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Brexit is all about calculated risk (the risk of being worse off but getting more control over immigration and the UKs social and cultural future)\n\nWas the manner in which those goals were weighed against each other really \"calculated\"? Seems to have been done based on emotions.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512687001.0,
    "date_created": "2017-12-07",
    "time_created": "09:50:01",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw6s80",
    "parent_id": "t1_dqw69nu",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I KNOW YOU ARE BUT WHAT AM I",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1512666307.0,
    "date_created": "2017-12-07",
    "time_created": "04:05:07",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7a4t",
    "parent_id": "t1_dqw69nu",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I personally disregarded almost all of it, still voted remain though",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1512667603.0,
    "date_created": "2017-12-07",
    "time_created": "04:26:43",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw8qmp",
    "parent_id": "t1_dqw69nu",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "pretty much all of it, but still voted remain because i could see from the start that our government wouldn't be able to get it done in a way that didn't absolutely terrify me.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1512671523.0,
    "date_created": "2017-12-07",
    "time_created": "05:32:03",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7q1q",
    "parent_id": "t1_dqw69nu",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "What is there to disregard? Some of us aren't fans of fucking the country over for 0 reason. ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1512668783.0,
    "date_created": "2017-12-07",
    "time_created": "04:46:23",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwhnzg",
    "parent_id": "t1_dqw69nu",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That's a great question, actually. Which part of Remain's campaign did *you* disregard?",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512687157.0,
    "date_created": "2017-12-07",
    "time_created": "09:52:37",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw6ujo",
    "parent_id": "t1_dqw69nu",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That Brexit could start WW3...",
    "controversiality": 0,
    "ups": -7,
    "downs": 0,
    "score": -7,
    "created": 1512666475.0,
    "date_created": "2017-12-07",
    "time_created": "04:07:55",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7h3v",
    "parent_id": "t1_dqw75ao",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Don't take this as hostile, but you didn't answer his question.",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1512668119.0,
    "date_created": "2017-12-07",
    "time_created": "04:35:19",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7fja",
    "parent_id": "t1_dqw75ao",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Both sides did not talk a lot of shit, one talked exponentially more than the other. One was based on lies and mistruths. One continues now to deny and use word games to avoid what they said. ",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1512668002.0,
    "date_created": "2017-12-07",
    "time_created": "04:33:22",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw8jyv",
    "parent_id": "t1_dqw75ao",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Dude they just asked a simple question.",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1512671034.0,
    "date_created": "2017-12-07",
    "time_created": "05:23:54",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw956g",
    "parent_id": "t1_dqw75ao",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "If Cameron and Osborne had stayed in place there most definitely would have been a budget that cut government spending and would possibly have raised taxes. I can't see how it was a lie if that was their intention. I also believe Cameron would have stayed if he could, but he got a call that morning telling him his time was up.\n\nThe opt out was negotiated with the EU, how could you call it a lie?",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1512672595.0,
    "date_created": "2017-12-07",
    "time_created": "05:49:55",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwa46v",
    "parent_id": "t1_dqw75ao",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">The tone of your questions strikes me as pretty aggressive and I was hoping this wouldn’t go that way.\n\nMate, you are so full of shit. I saw you in another thread calling people \"bre-moaners\" and getting uppity when you were told you're coming across as childish and arrogant. Now you're here tone-policing anyone you disagree with? Ha! What a load of bollocks.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1512675058.0,
    "date_created": "2017-12-07",
    "time_created": "06:30:58",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwz6ha",
    "parent_id": "t1_dqw75ao",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "So if both sides were talking shit, doesn't that prove OPs point? I don't know what your point is - that *you* are unsurprised isn't particularly interesting.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512703935.0,
    "date_created": "2017-12-07",
    "time_created": "14:32:15",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7sm1",
    "parent_id": "t1_dqw79mn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Actually it seems like he's saying in a very diplomatic way that the average intellect of the country is somewhere around \"fucking stupid\" on any given day, and that regardless of whether you're a bricklayer or a brain surgeon it doesn't stop you from being \"fucking stupid\" in areas that aren't you area of expertise, and that outside of the few people who literally get paid to spend their time keeping up to date with how every aspect of an extremely integrated governmental system operates, most people haven't really got the time in their day to give it the hundred or so hours of thought and research into both sides to even approach what could be considered a balanced and informed opinion on the situation.\n\nSo even if you ignore the fact that, of those who ARE in a position to give a balanced and informed opinion, a sizeable majority believe Leaving is a bad idea, and put that down to those people having more investment in the system they're paid to understand, that fact alone DOESNT then qualify any Tom, Dick or Harry to form a predominantly emotional decision on something most people take a decade or two of their professional life to actually get to grips with properly.",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1512668976.0,
    "date_created": "2017-12-07",
    "time_created": "04:49:36",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw8not",
    "parent_id": "t1_dqw79mn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'm not conflating anything. I think it's the same on both sides of leave and remain. I know I wasn't informed enough and I'd argue that the majority of people in this thread weren't either. Did anyone who voted leave foresee the shit show that has happened so far? Probably not. \n",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1512671308.0,
    "date_created": "2017-12-07",
    "time_created": "05:28:28",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwht4q",
    "parent_id": "t1_dqw79mn",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> I think you are conflating people disagreeing with you to people being ill informed\n\nNo, he's conflating people refusing to listen to the relevant experts with being people being misinformed.",
    "controversiality": 0,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512687318.0,
    "date_created": "2017-12-07",
    "time_created": "09:55:18",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqxy1jt",
    "parent_id": "t1_dqx6f7i",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I think it is not just Brexiteers that were uninformed, it was Remainers too, that's the point. It comes down to a personal risk assessment. If you believe that the current status quo is acceptable then you feel it's a risk to exchange that for the unknown. If you believe the current status quo is unacceptable, which you may for social or ideological reasons, then it is not a risk to exchange it for the unknown, rather it is a risk to keep it.\n\nPersonally, I feel the much lower risk, culturally, socially and economically would have been to remain in the EU. I sincerely hope the gamble pays off for the majority, but my optimism needs to be fed substantially more evidence before it can wake up.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512747621.0,
    "date_created": "2017-12-08",
    "time_created": "02:40:21",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqz4jfi",
    "parent_id": "t1_dqx6f7i",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Remainers could vote for the status quo  and assume that it would continue as long as their elected government wished. The UK has opt outs for most of the controversial changes. \n\nA better argument is that the continued integration of the Eurozone, and in particular the Banking Union, is taking the EU in a direction that might not be in the interests of the UK even given that the UK will not play a part in it.  This is the core of the case for leaving the EU, but the leave campaigns never even mentioned it. \n\nYou have researched the \"known unknowns\", but they are still unknown. Would you have been happy with any of the range of options from EEA membership to 'no deal'? Would other leave voters? \n\nYou mention empathy and go on to accept that there may well be a significant cost for individuals and businesses. How do you think the people who have to pay that cost for an outcome they didn't want will react? If your local authority CPOs your house to build a road, that's a decision made by a democratically elected body, nominally for the greater good, but you'll still be compensated. I've not heard a single suggestion that \npeople who lose their right to live and work in other EU countries should be compensated, or that businesses that are adversely affected should be compensated. It's all \"you lost, suck it up and lose your business or your work opportunities\".\n",
    "controversiality": 0,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512806142.0,
    "date_created": "2017-12-08",
    "time_created": "18:55:42",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqyctj3",
    "parent_id": "t1_dqxd8j3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512776203.0,
    "date_created": "2017-12-08",
    "time_created": "10:36:43",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqybu0l",
    "parent_id": "t1_dqxmcp5",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "And Merkel is currently busy murdering that dream more than it already was by forcing Poland and Czech to take refugees at, essentially, gunpoint. ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1512775111.0,
    "date_created": "2017-12-08",
    "time_created": "10:18:31",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqy1p01",
    "parent_id": "t1_dqy0f7j",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "i wanna feel you bro.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1512757048.0,
    "date_created": "2017-12-08",
    "time_created": "05:17:28",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwb8mi",
    "parent_id": "t1_dqw9jm2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "To you. It wasn't the status quo to everyone.",
    "controversiality": 0,
    "ups": -8,
    "downs": 0,
    "score": -8,
    "created": 1512677543.0,
    "date_created": "2017-12-07",
    "time_created": "07:12:23",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw8l75",
    "parent_id": "t1_dqw7x6b",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It will also be red, white and blue. Simples!",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1512671121.0,
    "date_created": "2017-12-07",
    "time_created": "05:25:21",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw8d0l",
    "parent_id": "t1_dqw7x6b",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "/s is truly needed those days more than ever.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1512670517.0,
    "date_created": "2017-12-07",
    "time_created": "05:15:17",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw94av",
    "parent_id": "t1_dqw8jjc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "This being the case a 52/48 result would indicate a slow and minor removal from the EU while doing as little damage as possible. ",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1512672535.0,
    "date_created": "2017-12-07",
    "time_created": "05:48:55",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw91d3",
    "parent_id": "t1_dqw8jjc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Remain was for things to continue as they are. We already know what that is like so we were well informed.\n\n\nLeave still isn't clear what leaving involves now so how people know we what they were voting for then I don't understand. ",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1512672314.0,
    "date_created": "2017-12-07",
    "time_created": "05:45:14",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw8c1k",
    "parent_id": "t1_dqw8a91",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "But we don't even know what could happen as we haven't assess it yet we don't know what is best case scenario and worse case scenario. We don't even know what No Deal really means to us. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1512670444.0,
    "date_created": "2017-12-07",
    "time_created": "05:14:04",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw8vu0",
    "parent_id": "t1_dqw8n98",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "errr status quo?",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1512671907.0,
    "date_created": "2017-12-07",
    "time_created": "05:38:27",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw6km8",
    "parent_id": "t1_dqw5r4u",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "What does that mean, exactly?\n\nLeave the single market? Leave the customs union? Saw off the UK from the crust of the Earth and float to go chill with Hawaii?",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1512665770.0,
    "date_created": "2017-12-07",
    "time_created": "03:56:10",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw5v1y",
    "parent_id": "t1_dqw5r4u",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "And did you voted to stay in single market or leave,did you voted to keep a freedom of movement or not, did you voted for EU nationals to keep their rights, lose some of them or get deported, did you vote for hard,soft or no deal Brexit? Did you know what voting leave will do to economy when you voted for it. If you did please give Davis ring because he needs that information ASAP. \n\nUnless you can tell me exactly what leaving EU means (Brexit is Brexit is not valid answer here) you have no clue what you voted for. ",
    "controversiality": 0,
    "ups": 80,
    "downs": 0,
    "score": 80,
    "created": 1512664003.0,
    "date_created": "2017-12-07",
    "time_created": "03:26:43",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw6jp9",
    "parent_id": "t1_dqw5r4u",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Ok.\n\nSo leave everything exactly the same as now, CU, SM, FoM, and all regulatory alignment and ECJ, but just take our MEPs and any major voice and decision making we have out of the European Parliament.\n\nWe've still left the EU.",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1512665705.0,
    "date_created": "2017-12-07",
    "time_created": "03:55:05",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw5vun",
    "parent_id": "t1_dqw5r4u",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yes....but what did you vote to do instead? We're all still waiting.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1512664059.0,
    "date_created": "2017-12-07",
    "time_created": "03:27:39",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw75bu",
    "parent_id": "t1_dqw5r4u",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "So you didn't vote to leave the Single Market and the Customs Union then?",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1512667247.0,
    "date_created": "2017-12-07",
    "time_created": "04:20:47",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7mpu",
    "parent_id": "t1_dqw7c9u",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> ...leave the EU. Where there is debate is how that is achieved and what the end result will be wrt. our relationship with certain institutions within the EU.\n\nSo, *contrary to the whole point of this post* and which you are still somehow arguing, the electorate therefore did NOT “know exactly what they are voting for”...\n\nLeave EU. Saying the cabinet are *clear* on that is pathetic. It’s not much better - and I’m being intentionally hyperbolic here - than voting on ending poverty. Or any other vague pipe-dream.\n*The Cabinet are clear that everyone had voted to be rich...* ta da! \nGet on with it! What’s the problem?!\n\nTL;DR Leave EU = vague and complex (and as we are seeing with NI issue arguably contradictory to other commitments)\n",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1512668538.0,
    "date_created": "2017-12-07",
    "time_created": "04:42:18",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw6e2z",
    "parent_id": "t1_dqw5oyx",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "So downvoters are downvoting for a wrong reason like morons.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1512665316.0,
    "date_created": "2017-12-07",
    "time_created": "03:48:36",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwnv9q",
    "parent_id": "t1_dqwc2r0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Failed creativity is better than no creativity.\n\nTry joining in the fun instead of being a prat.",
    "controversiality": 0,
    "ups": -1,
    "downs": 0,
    "score": -1,
    "created": 1512693459.0,
    "date_created": "2017-12-07",
    "time_created": "11:37:39",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwo2cg",
    "parent_id": "t1_dqwac05",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Honestly the pre-ref government is massive to blame in my view; primarily for holding the ref on a simple majority threshold and a binary question. No nation worth its salt conducts massive constitutional change on 52% of the vote. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512693636.0,
    "date_created": "2017-12-07",
    "time_created": "11:40:36",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqx8top",
    "parent_id": "t1_dqx7oen",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Plus he was going to challenge it if it was 52-48 for remain.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512715166.0,
    "date_created": "2017-12-07",
    "time_created": "17:39:26",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw73lu",
    "parent_id": "t1_dqw5xly",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You have to feed him and take him for walks. A fuckwit is for life, not just for Christmas.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1512667125.0,
    "date_created": "2017-12-07",
    "time_created": "04:18:45",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw74db",
    "parent_id": "t1_dqw709s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Learn things? You're crazy, we don't do that here.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512667177.0,
    "date_created": "2017-12-07",
    "time_created": "04:19:37",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw8gsc",
    "parent_id": "t1_dqw709s",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Oh my, the irony meter has exploded.",
    "controversiality": 0,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512670797.0,
    "date_created": "2017-12-07",
    "time_created": "05:19:57",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw9ce9",
    "parent_id": "t1_dqw8g4c",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "<3",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512673127.0,
    "date_created": "2017-12-07",
    "time_created": "05:58:47",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwam5y",
    "parent_id": "t1_dqw9uwt",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I know, and I feel really bad for them. I voted and will continue to vote to stop this madness, but I will not shackle myself to a sinking ship. ",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1512676202.0,
    "date_created": "2017-12-07",
    "time_created": "06:50:02",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwg1ui",
    "parent_id": "t1_dqw9uwt",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It only cost us Northern Irish decades of violence and discrimination! A bargain really. ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1512685217.0,
    "date_created": "2017-12-07",
    "time_created": "09:20:17",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwc00q",
    "parent_id": "t1_dqw9uwt",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You technically can move whenever you want, to whichever EU country you want, and you have about a year to do so.\n\nI'm certainly thinking about it.\n",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1512679044.0,
    "date_created": "2017-12-07",
    "time_created": "07:37:24",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwaogi",
    "parent_id": "t1_dqwag7n",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Not being snarky but do you have any evidence of this? I accept that there is evidence of Russian interference, but your claim is quite specific. Genuinely interested - I think this Russian thing may be huge. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1512676342.0,
    "date_created": "2017-12-07",
    "time_created": "06:52:22",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwdj30",
    "parent_id": "t1_dqwdfce",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Irish passport\n\n",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512681666.0,
    "date_created": "2017-12-07",
    "time_created": "08:21:06",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwpyec",
    "parent_id": "t1_dqwmu9y",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Only until we leave",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1512695355.0,
    "date_created": "2017-12-07",
    "time_created": "12:09:15",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwu3v9",
    "parent_id": "t1_dqwmu9y",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "There hasn't been a legal decision on this yet, and there's nothing to suggest this in Article 50. Looking at what we have right now, the date we leave can only be changed by something stipulated in the withdrawal agreement, or postponed with the consent of all EU28 members. If we want to avoid this, we'd have to ask the European Council and hope they are sympathetic. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512699148.0,
    "date_created": "2017-12-07",
    "time_created": "13:12:28",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwn7le",
    "parent_id": "t1_dqwcp2p",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "My argument is that there is no mandate for the single market.\n\nThe answer is simple: convince the British electorate to forgo any democratic control over immigration from the EU in perpetuity through a referendum or clear manifesto mandate.\n",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512692846.0,
    "date_created": "2017-12-07",
    "time_created": "11:27:26",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwfxwg",
    "parent_id": "t1_dqwb730",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It always comes back to ending freedom of movement. No matter how many times brexiters try to convince themselves and others it was about democracy or trade, it's a lie. The lie is always revealed in the end when the brexiter replies \"but then we'd still have freedom of movement and we voted to end that\".\n\nGiven a choice, brexiters will choose economic hardship over freedom of movement.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1512685081.0,
    "date_created": "2017-12-07",
    "time_created": "09:18:01",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwmskq",
    "parent_id": "t1_dqwb730",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "There has been a clear preference amongst the electorate for decades for immigration to be reduced. Brexit confirmed this. Ignoring this and pretending otherwise achieves nothing.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512692458.0,
    "date_created": "2017-12-07",
    "time_created": "11:20:58",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwcv4i",
    "parent_id": "t1_dqwaxhe",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I apologise, I see my error and will correct it.\n\nAnd to Are\n\nTypo to typright\n\nUntil reddit shall give up her karma and convert our posts into glory.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512680576.0,
    "date_created": "2017-12-07",
    "time_created": "08:02:56",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwcmd8",
    "parent_id": "t1_dqwaxhe",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Is English not your first language or are you joking? \n\nIf English is not your first language, just to politely let you know, I totally understood what /u/precedential was trying to say. If you need help understanding comedy try starting with knock, knock jokes and work your way up from there.",
    "controversiality": 1,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512680151.0,
    "date_created": "2017-12-07",
    "time_created": "07:55:51",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwvv93",
    "parent_id": "t1_dqwhj2v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Seems to have been done based on emotions.\n\nIs peoples emotional happiness an unreasonable goal? Your question seems like a philosophical one rather than a practical one. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512700806.0,
    "date_created": "2017-12-07",
    "time_created": "13:40:06",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7mg4",
    "parent_id": "t1_dqw7a4t",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Ditto.\n\n\"The world has become increasingly more interconnected, and we as a species can only thrive if we set our differences aside if we work together. Do you want to take a step backwards?\" No.\n\nWell then. Big picture it isn't really much of a question.",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1512668519.0,
    "date_created": "2017-12-07",
    "time_created": "04:41:59",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwkotm",
    "parent_id": "t1_dqwhnzg",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Lots. The bit where Cameron said that A50 would be triggered on the day we voted to leave the EU, the part where Osborne said there would be a revenge budget if leave won, and so on. How about you? ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512690400.0,
    "date_created": "2017-12-07",
    "time_created": "10:46:40",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw78o3",
    "parent_id": "t1_dqw6ujo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Ah yes, the remain campaign section led by Boris Johnson. \n\nHow astute. ",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1512667491.0,
    "date_created": "2017-12-07",
    "time_created": "04:24:51",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw861a",
    "parent_id": "t1_dqw6ujo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Ah, from prominent Remain voice Boris, of course. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1512669992.0,
    "date_created": "2017-12-07",
    "time_created": "05:06:32",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7hws",
    "parent_id": "t1_dqw6ujo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That was Leave rhetoric.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1512668178.0,
    "date_created": "2017-12-07",
    "time_created": "04:36:18",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwa0qz",
    "parent_id": "t1_dqw7h3v",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "God don't be so aggressive, just accept my opinion don't question it. So much bad blood.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1512674827.0,
    "date_created": "2017-12-07",
    "time_created": "06:27:07",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwa88l",
    "parent_id": "t1_dqw956g",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It's a crying shame that people still don't realise how significant this was. It was for the first time recognition of the rights of non-Eurozone members to not be discriminated against. It would effectively have been the precursor to two speed Europe if we'd capitalised on it.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1512675320.0,
    "date_created": "2017-12-07",
    "time_created": "06:35:20",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwao3y",
    "parent_id": "t1_dqw956g",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "The biggest lie Remain told, since long before the referendum, is immigration is great, can do no wrong, and we need it for our economy. This stifled objection to it, even when it reached unprecedented and record levels. During the referendum, [Gordon Brown was asked about EU migration during the referendum](http://www.telegraph.co.uk/news/2016/06/13/think-gordon-brown-has-learnt-from-his-bigoted-woman-howler-on-i/), and instead he ranted about The Sun's \"agenda\". I reckon this mendacious type of behaviour is worse than \"let's spend the EU membership fee on our own public services\".",
    "controversiality": 0,
    "ups": -5,
    "downs": 0,
    "score": -5,
    "created": 1512676321.0,
    "date_created": "2017-12-07",
    "time_created": "06:52:01",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwhbaj",
    "parent_id": "t1_dqw7sm1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Intelligence is normally distributed so on any given day 50% of people are smarter than the other 50%. That 52% voted to leave therefore nullifies any notion that leave is related to intelligence. 52% of people are not morons and when people talk about the “type” of person that voted leave what they actually tend to be talking about is class and education (which of course are closely related) rather than actual ‘intelligence’. The truth is that most people’s intelligence lies within a fairly narrow range and the differences between us relate to education and knowledge (which are at least partly affected by the environment people grow up in) rather than raw ability. \n\nI find the whole notion that people would raise intelligence in this debate insulting to both sides. Brexit has to do with social and class issues, it has nothing to do with intelligence. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512686746.0,
    "date_created": "2017-12-07",
    "time_created": "09:45:46",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dr04kas",
    "parent_id": "t1_dqw7sm1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Thank you. You were able to put it into words much better than me.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512870233.0,
    "date_created": "2017-12-09",
    "time_created": "12:43:53",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqycx80",
    "parent_id": "t1_dqyctj3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Don't be silly, I wouldn't call you a retard. Though if you were suggesting that leavers are then that might not be the smartest comparison to make.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512776315.0,
    "date_created": "2017-12-08",
    "time_created": "10:38:35",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqyd3so",
    "parent_id": "t1_dqy1p01",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You, back to /r/drama!",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1512776515.0,
    "date_created": "2017-12-08",
    "time_created": "10:41:55",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwfmvv",
    "parent_id": "t1_dqwb8mi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That’s... not how status quo works. ",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1512684689.0,
    "date_created": "2017-12-07",
    "time_created": "09:11:29",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwkigz",
    "parent_id": "t1_dqwb8mi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I don't think that phrase means what you think it means...",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512690225.0,
    "date_created": "2017-12-07",
    "time_created": "10:43:45",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw8f7y",
    "parent_id": "t1_dqw8d0l",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Not in this sub, we're British. If people don't know you're being sarcastic you're doing it wrong. ",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1512670682.0,
    "date_created": "2017-12-07",
    "time_created": "05:18:02",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw9knc",
    "parent_id": "t1_dqw94av",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">This being the case a 52/48 result would indicate a slow and minor removal from the EU while doing as little damage as possible.\n\nThat would be down to the government, which we can all put pressure on, we even had a GE..  That's broadly what all the noise has been about since the referendum though isn't it? People have been making  a lot of noise to try and pressure the government into taking one stance or another.  \n\nAs to a slow and minor removal from the EU, that depends on what the EU wants to allow and what the UK government sees as important. Given we are leaving the EU, we still need to balance the benefits and the costs. There is little point in going for a slow and minor exit, if that leaves the UK in a worse position than a more complete exit would.  At this point it is about finding the 'best' outcome after all, and as we can see there are a lot of different views on that.  But then that's why we have Parliament and MPs representing us, to have a say in that, set the direction and get the best possible exit so that the UK can take advantage of having left the EU.\n\nOh and I doubt that you'll find many people that want to see an exit process that does anything more than as little damage as possible.  ",
    "controversiality": 0,
    "ups": -2,
    "downs": 0,
    "score": -2,
    "created": 1512673714.0,
    "date_created": "2017-12-07",
    "time_created": "06:08:34",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw9k60",
    "parent_id": "t1_dqw94av",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "How many of those remain votes were because of the fear, uncertainty and doubt being spread by the remain side? I know a lot that did so out of fear of house prices dropping for example. ",
    "controversiality": 0,
    "ups": -2,
    "downs": 0,
    "score": -2,
    "created": 1512673680.0,
    "date_created": "2017-12-07",
    "time_created": "06:08:00",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw9gnj",
    "parent_id": "t1_dqw91d3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">Remain was for things to continue as they are. \n\nRemain was a vote for the UK to remain in the EU. That would mean less immediate change, but obviously change in the future (the EU needs it if nothing else, and the EU, like everything else isn't static). It was a somewhat known quantity.  But the vote was to remain in the EU, not 'for things to continue as they are'.\n\n>Leave still isn't clear what leaving involves now..\n\nVoters knew that their vote would lead to the UK leaving the EU. The specifics of that process and the ongoing relationship were far less clear than remaining, it was a vote for a change.  To a certain extent the exact outcome is unknowable, because it relies on the EU's agreement as much as anything else.  The point however was that people wanted the UK to leave the EU and they knew that would involve the government having to work through both the exit and the future relationship.\n\n>so how people know we what they were voting for then I don't understand.\n\nBecause you are trying to tie it into a specific outcome, or set of outcomes. Given that those outcomes depend on a negotiation with the EU you could argue that it is never possible to vote in an informed manner to leave the EU, because you feel that the aim of leaving the EU isn't sufficient in and of itself.\n\nSurely you see that that doesn't make a lot of sense? I mean when people voted to remain in the EEC in 1975 they didn't know exactly what they were voting for, they couldn't have been expected to. The same goes broadly for the Scottish independence referendum, or any future vote in Northern Ireland (and Ireland..). The moment you have a vote that triggers a process with other parties involved, you can really only set the direction and shop some of the possibilities (for the EEC it was for an economic, social and political union that was still forming, for Scotland it was for an independent Scotland based on a vision from the Scottish Government, in Ireland it will be based on any number of visions for a united Ireland).  Whether the promises can be delivered, where there are compromises, where practicality and political realities collide there will always be difference.\n\nBut the idea that you can't decide whether the UK should continue as part of the EU or not, when you know what the EU is, how it works, and what the broad aspirations and direction of travel are, because you don't know exactly what the exit process might end up with is a bit silly.\n\nWe'd all like certainty, remain may have given us a little more of it, but at the end of the day, you don't need certainty to make a decision on a principle. ",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1512673437.0,
    "date_created": "2017-12-07",
    "time_created": "06:03:57",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw9ikw",
    "parent_id": "t1_dqw91d3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "With this kind of logic the status quo would be the only choice in any referendum. Or were you expecting the UK to negotiate terms of exit with the EU before the vote?",
    "controversiality": 0,
    "ups": -2,
    "downs": 0,
    "score": -2,
    "created": 1512673571.0,
    "date_created": "2017-12-07",
    "time_created": "06:06:11",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwb5nj",
    "parent_id": "t1_dqw91d3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">Remain was for things to continue as they are.\n\nMeaning what - a static situation, or a continual slide towards further integration? This was another vague assertion Remain made. Nobody knows what the EU will look like in 15-20 years, we do know that we will be a part of what it decides to look like.",
    "controversiality": 0,
    "ups": -2,
    "downs": 0,
    "score": -2,
    "created": 1512677371.0,
    "date_created": "2017-12-07",
    "time_created": "07:09:31",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw8ede",
    "parent_id": "t1_dqw8c1k",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "And we never could have known unless we activated article 50 by which point the decision would be final and we’d have to leave the EU. You can’t honestly say that just because the public didn’t know the nuances of leaving that their decision was wrong and we should have just accepted staying. ",
    "controversiality": 0,
    "ups": -2,
    "downs": 0,
    "score": -2,
    "created": 1512670616.0,
    "date_created": "2017-12-07",
    "time_created": "05:16:56",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw91aa",
    "parent_id": "t1_dqw8vu0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You can vote for whatever you want",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512672308.0,
    "date_created": "2017-12-07",
    "time_created": "05:45:08",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwctkd",
    "parent_id": "t1_dqw8vu0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That wasn't an option.",
    "controversiality": 0,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512680502.0,
    "date_created": "2017-12-07",
    "time_created": "08:01:42",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw77du",
    "parent_id": "t1_dqw6km8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You’re not gonna get an answer cos he can’t admit he doesn’t have a clue ",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1512667396.0,
    "date_created": "2017-12-07",
    "time_created": "04:23:16",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw5wwc",
    "parent_id": "t1_dqw5v1y",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "~~Brexit means Brexit~~\n\nLeaving the EU means leaving the EU",
    "controversiality": 0,
    "ups": -77,
    "downs": 0,
    "score": -77,
    "created": 1512664131.0,
    "date_created": "2017-12-07",
    "time_created": "03:28:51",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw6qw5",
    "parent_id": "t1_dqw6jp9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "All the benefits, none of the down sides! What a utopia, what a dream! Why hasn’t anyone thought of this before?!\n\n.......",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1512666211.0,
    "date_created": "2017-12-07",
    "time_created": "04:03:31",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw88vn",
    "parent_id": "t1_dqw6jp9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "This is exactly the kind of balanced, fair argument that we need! /s",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512670205.0,
    "date_created": "2017-12-07",
    "time_created": "05:10:05",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw8k6i",
    "parent_id": "t1_dqw6jp9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "And if government had decided to take that approach then that might happen. However, neither the government nor the opposition are.",
    "controversiality": 0,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512671049.0,
    "date_created": "2017-12-07",
    "time_created": "05:24:09",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw69kk",
    "parent_id": "t1_dqw5vun",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "They’re going to take back their country! Although from who and what they’re going to do with it are yet to be decided.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1512665002.0,
    "date_created": "2017-12-07",
    "time_created": "03:43:22",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw8b6u",
    "parent_id": "t1_dqw7mpu",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It’s impossible to see the future, that doesn’t mean sticking with the status quo for.. reasons",
    "controversiality": 0,
    "ups": -4,
    "downs": 0,
    "score": -4,
    "created": 1512670377.0,
    "date_created": "2017-12-07",
    "time_created": "05:12:57",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7073",
    "parent_id": "t1_dqw6e2z",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Leave voters, being emotional and irrational.\n\nI cant believe it!",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1512666880.0,
    "date_created": "2017-12-07",
    "time_created": "04:14:40",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwos8l",
    "parent_id": "t1_dqwnv9q",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'm not quite sure that is true. Failed creativity creates an ugly mess, as happened here. I'm not sure how this little poem is particularly fun, what an odd man you are.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512694266.0,
    "date_created": "2017-12-07",
    "time_created": "11:51:06",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwpeos",
    "parent_id": "t1_dqwo2cg",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "While I agree the referndum was a massive mistake I was sympathizing with the task of creating a cogent vote for Brexit. Any nuance to the leave vote would have been shouted down as 'splitting the leave vote' and, as borne out by the result, lots of people didn't like the EU but for lots of different reasons.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512694849.0,
    "date_created": "2017-12-07",
    "time_created": "12:00:49",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw76gr",
    "parent_id": "t1_dqw73lu",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'll stock up on chlorinated chicken.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1512667327.0,
    "date_created": "2017-12-07",
    "time_created": "04:22:07",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7dk5",
    "parent_id": "t1_dqw74db",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I mean you've just taught me that we don't learn things so where does that leave us... ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512667856.0,
    "date_created": "2017-12-07",
    "time_created": "04:30:56",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw989a",
    "parent_id": "t1_dqw8gsc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Don't you mean irony YARD, none of that filthy metric system anymore sonny.\n\nBesides, irony is an elitist concept peddled by expert comedians, who I don't believe. I get all my comedic knowledge from my mates down at the pub.",
    "controversiality": 0,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512672821.0,
    "date_created": "2017-12-07",
    "time_created": "05:53:41",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwpilu",
    "parent_id": "t1_dqwg1ui",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "ah nostalgia",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1512694950.0,
    "date_created": "2017-12-07",
    "time_created": "12:02:30",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwdrv0",
    "parent_id": "t1_dqwc00q",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You'll need a visa. It's too late to arrive and be considered for citizenship through Freedom of Movement.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1512682041.0,
    "date_created": "2017-12-07",
    "time_created": "08:27:21",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwc19c",
    "parent_id": "t1_dqwc00q",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I’m considering Germany but the language barrier may be a problem. I believe you have to learn some as my friend had to who emigrated there",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512679108.0,
    "date_created": "2017-12-07",
    "time_created": "07:38:28",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqx4z2h",
    "parent_id": "t1_dqwc00q",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "good riddance!",
    "controversiality": 0,
    "ups": -1,
    "downs": 0,
    "score": -1,
    "created": 1512710735.0,
    "date_created": "2017-12-07",
    "time_created": "16:25:35",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwigja",
    "parent_id": "t1_dqwaogi",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'd say it isn't. I know quite a few brexiters IRL who's attitude to *anything* complex is to just repeat their demand as if their willing it to happen just automatically irons out all the details. They do this for domestic muslim terrorists too (just deport them) and when pressed on the nuance just say \"I don't care, just X\" where X is the original demand.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512688055.0,
    "date_created": "2017-12-07",
    "time_created": "10:07:35",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwtqjh",
    "parent_id": "t1_dqwpyec",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Well, clearly. If there is a serious proposal for a second referendum though I think (and the EU people have said) there won’t be a problem pausing the process for that to happen. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512698801.0,
    "date_created": "2017-12-07",
    "time_created": "13:06:41",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwunkc",
    "parent_id": "t1_dqwu3v9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yes, we would need the consent of the other 27 member states. But they have stated this would be a formality and obviously they would prefer us not to leave. This is not really a legal problem. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512699659.0,
    "date_created": "2017-12-07",
    "time_created": "13:20:59",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwimfb",
    "parent_id": "t1_dqwfxwg",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">  brexiters will choose economic hardship over freedom of movement.\n\nwhich is funny, because economic hardship is what they cite as the reason for wanting to end FOM",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1512688232.0,
    "date_created": "2017-12-07",
    "time_created": "10:10:32",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwnc8o",
    "parent_id": "t1_dqwmskq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Even accepting that's the case, we didn't have a referendum on a **clear** option that we were leaving the EU AND specifically ending FoM/reducing immigration (possibly as part of completely leaving the EU Single Market, or other options that still required FoM). \n\nThat *may* have been what some proportion wanted. Others may have wanted 'sovereignty'. Others 'free trade'. We just don't know.... And you stating that this is somehow 'clear' is, again, where I get annoyed.\n\nThis whole thread is literally about the fact that people were not voting on a clear option. \nAnd that we are now in the mess we are in with no clear way forward....",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1512692964.0,
    "date_created": "2017-12-07",
    "time_created": "11:29:24",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwcxqm",
    "parent_id": "t1_dqwcmd8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Ta m8, I fink da prevous guy was trynna be a cunt, but wasn't sure. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512680699.0,
    "date_created": "2017-12-07",
    "time_created": "08:04:59",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwh0b6",
    "parent_id": "t1_dqwcmd8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You understood the comment, I didn't, so I politely asked for clarification. Not sure why this upset you so much. Have a nice day!",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512686384.0,
    "date_created": "2017-12-07",
    "time_created": "09:39:44",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwz1y8",
    "parent_id": "t1_dqwkotm",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "And so on? Or you can only think of two things? It was just one half of the Tories against the other anyway and one side did a shitty job. I think both sides kind of cheated anyway, that's not a reason to validate the result.",
    "controversiality": 0,
    "ups": -1,
    "downs": 0,
    "score": -1,
    "created": 1512703814.0,
    "date_created": "2017-12-07",
    "time_created": "14:30:14",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwabqo",
    "parent_id": "t1_dqwa88l",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Unfortunately you have to rely on an honest press to report accurately. The minute Cameron stepped off the plane with no immigration promise, the papers ignored everything else and called him a failure. It was a huge concession he got",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1512675548.0,
    "date_created": "2017-12-07",
    "time_created": "06:39:08",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwazyj",
    "parent_id": "t1_dqwao3y",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Try looking up the dictionary. Brown or Remain or whoever may have said immigration is good for the economy..that is undoubtedly true. More workers, more skills, more opportunities for employers to open up or expand. Is it good for everyone..that is arguable. Studies have found that only a small section of society suffer by a very small amount. \n\nEU immigration adds billions to the government each year through taxes, which should provide better services if the government is willing..especially as the majority of EU immigrants are younger, healthier and have less children than the general population, so use less services. So therefore should add more to help the person in the street.\n\nSo..I'm struggling to see the lie. You may not like immigration, but that doesn't alter facts, and there's no real lie.\n\nAnd yes, Brown was telling the truth. The Sun did have an agenda. It still has. ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1512677036.0,
    "date_created": "2017-12-07",
    "time_created": "07:03:56",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwb0ko",
    "parent_id": "t1_dqwao3y",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I don't know about do no wrong, but statistically immigration is good for our economy, so what did you want the remain campaign to say? I agree that they should have acknowledged people's fears, but they shouldn't have just said immigration is bad just to make people feel better.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1512677075.0,
    "date_created": "2017-12-07",
    "time_created": "07:04:35",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwj9h3",
    "parent_id": "t1_dqwhbaj",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">  it has nothing to do with intelligence.\n\nthen why are you trying so hard to be evidence to the contrary?",
    "controversiality": 1,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512688924.0,
    "date_created": "2017-12-07",
    "time_created": "10:22:04",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqydzy6",
    "parent_id": "t1_dqyd3so",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "We must first spread the word of glorious mayocide.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512777482.0,
    "date_created": "2017-12-08",
    "time_created": "10:58:02",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwlcnq",
    "parent_id": "t1_dqwfmvv",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Sure it can be. Status quo takes time to bed in. For example, our current net migration level is at record highs. It’s not normal, but it may become the new normal over a period of time. Or we could reduce it back to normal levels, which means the record high time period would be widely understood to have been an aberration. A disruption to the status quo.\n\nGet it? ",
    "controversiality": 0,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512691053.0,
    "date_created": "2017-12-07",
    "time_created": "10:57:33",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw9trm",
    "parent_id": "t1_dqw9knc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "If you wish to keep this as an advisory only referendum you have to concede it was so close that the government must consider that we need to keep a large amount of the systems in place. \n\nHow they achieve that is up to HMG but I'd suggest it would take previous agreements and not having article 50 released so soon. \n\n> Oh and I doubt that you'll find many people that want to see an exit process that does anything more than as little damage as possible. \n\nPossibly but the ones that exist are very loud and far too many in the Tory party/papers who want a full Brexit regardless of the cost.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1512674353.0,
    "date_created": "2017-12-07",
    "time_created": "06:19:13",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwamwc",
    "parent_id": "t1_dqw9k60",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Let's not move on to manipulating people's perception of things shall we...",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512676248.0,
    "date_created": "2017-12-07",
    "time_created": "06:50:48",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw9o7x",
    "parent_id": "t1_dqw9k60",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Doesn't matter in ajehals scenario the reasoning is beside the point it's just an indicator of the direction the public wish to travel and it is only slightly towards the leave. Which implies a soft and slow leave after preparations are made.\n\nIn this scenario the current implementation would be closer to a 75%+ leave vote.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512673968.0,
    "date_created": "2017-12-07",
    "time_created": "06:12:48",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwjm5n",
    "parent_id": "t1_dqw9gnj",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Is it silly to expect the following... \n\n\n\nSome broad outlines for different options and open discussion. Time for people to consider these various options and compare estimates of changes that came with them. Leave didn't do that and still haven't.\n\n\n\nIt's basic planning if you have an uncertain event to broadly consider some of the possible outcomes. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1512689296.0,
    "date_created": "2017-12-07",
    "time_created": "10:28:16",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwj65s",
    "parent_id": "t1_dqw9ikw",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It wasn't a logic based statement.\n\n\nI was expecting some broad outlines for different options and open discussion. Time for people to consider these various options and compare estimates of changes that came with them. Leave didn't do that and still haven't.\n\n\nIt's basic planning if you have an uncertain event to broadly consider some of the possible outcomes. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512688827.0,
    "date_created": "2017-12-07",
    "time_created": "10:20:27",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwcxbq",
    "parent_id": "t1_dqwb5nj",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Cameron negotiated a permanent opt-out for the UK on any move towards closer integration. While we would still be crafting EU legislation and sitting at all the decision-making tables, we would not have been forced to, for example, unify our defences, or integrate tax systems, or indeed anything else that would move us towards a single European state.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1512680680.0,
    "date_created": "2017-12-07",
    "time_created": "08:04:40",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwjcx0",
    "parent_id": "t1_dqwb5nj",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Meaning membership of the EU and all the positive and negative things that come with it.\n\nEdit: nobody knows what it will look like but it isn't like the changes happen in a vacuum. The member states decide. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512689026.0,
    "date_created": "2017-12-07",
    "time_created": "10:23:46",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw8ygx",
    "parent_id": "t1_dqw8ede",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Your first statement is false: the government could have (and should have) modelled several end scenarios to the negotiations which they believed were achievable, and explained those scenarios to the public *before triggering article 50 and before the general election*, so the public had an idea what the view of leaving was.\n\nThey haven't done that at all yet, and won't, because it appears they don't know what the possible end scenarios actually are, and haven't discussed it themselves. They should have said \"we want to aim for option a, but there might need to be flexibility, because it's a negotiation; if we feel option a isn't possible, option b would become our preferred choice\" etc. The fact that this hasn't happened is what is causing the government to be hamstrung: there has been no proper debate about the factual nature of Brexit yet, neither in government, nor in the public sphere.",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1512672101.0,
    "date_created": "2017-12-07",
    "time_created": "05:41:41",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw6zoy",
    "parent_id": "t1_dqw5wwc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Ah yes, another one from the \"Its easy, how do you Brexit? You just Brexit!\" crowd. And suggesting he is informed as well, classic.",
    "controversiality": 0,
    "ups": 37,
    "downs": 0,
    "score": 37,
    "created": 1512666842.0,
    "date_created": "2017-12-07",
    "time_created": "04:14:02",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw6hs8",
    "parent_id": "t1_dqw5wwc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Fucking hell. I think this country is done, I recommend anyone with any intellect and gumption to just get the hell out before it floats away and sinks under its own stupidity in the Atlantic.",
    "controversiality": 0,
    "ups": 53,
    "downs": 0,
    "score": 53,
    "created": 1512665571.0,
    "date_created": "2017-12-07",
    "time_created": "03:52:51",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw6gbv",
    "parent_id": "t1_dqw5wwc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "As u/Grand_Strategy said:\n\n>And did you vote to stay in single market or leave, did you vote to keep a freedom of movement or not, did you vote for EU nationals to keep their rights, lose some of them or get deported, did you vote for hard, soft or no deal Brexit? Did you know what voting leave will do to economy when you voted for it?",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1512665471.0,
    "date_created": "2017-12-07",
    "time_created": "03:51:11",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7a0u",
    "parent_id": "t1_dqw5wwc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "But a brexit of which particular combination of colours did you vote for?",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1512667594.0,
    "date_created": "2017-12-07",
    "time_created": "04:26:34",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwraw6",
    "parent_id": "t1_dqw5wwc",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You people are fucking braindead",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512696579.0,
    "date_created": "2017-12-07",
    "time_created": "12:29:39",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw962g",
    "parent_id": "t1_dqw8k6i",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That wouldn't happen anyway. Why should the EU allow us all the benifits of being in the EU without being in it? Really they hold most of the cards here while we have an uno card, card against humanity card and an oster card in our hand ad are convinced we have a full house.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1512672662.0,
    "date_created": "2017-12-07",
    "time_created": "05:51:02",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw8w81",
    "parent_id": "t1_dqw8b6u",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Sigh, I don't even know where to begin with this comment....\nDo I actually answer your simplistic points first or do I address the fact that you're side-stepping the debate here...? Hmm.\n\nLet's stay on the debate and then come back to your points.\n\nThe main point - under debate here - is that the electorate were not well informed and *not clear on what they were voting for* since there was no clear definition of what leaving the EU meant. As we have clearly seen there are many many definitions of what Brexit might entail. Some of which are contradictory to other commitments (eg. NI).\n\n>It’s impossible to see the future\n\nSimplistic crap. It's *impossible* to *perfectly* predict the future.\nIt's perfectly possible to predict many useful aspects of the future even if it's not perfect and mistakes occur. \nThere were many aspects of Brexit that were pretty well predicted. \n\n(As an aside, yes yes, we can debate that the immediate crash has not happened to the extent forecast. You know what, even that's instructive to behavioural economics. Economists failed to understand the circular logic that if a majority of ~~the population~~ voters thought Brexit was a good idea then they would also think there was no economic issue and carry on spending which has so far carried the economy.... rather like in a cartoon where bugs bunny has run over a cliff and defies gravity by carrying on running for a while. I'm still pretty confident that economic 'gravity' - especially macro-economics and trade flow - is well enough understood.)\n\nBringing this point back the point of the debate, we could have modelled and considered the impact of all the major Brexit scenarios. Even if the forecasts were not perfect we could still have understood the *relative* merits of each pretty well.\n\nYour approach is just justifying jumping off a cliff....\n\n>that doesn’t mean sticking with the status quo for.. reasons\n\nCompletely different argument. I'd be the first to agree that the UK is not perfect and there are many things that need to be changed.\nBurning down the house is not a good approach...",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1512671936.0,
    "date_created": "2017-12-07",
    "time_created": "05:38:56",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw8fb6",
    "parent_id": "t1_dqw8b6u",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You see at my work place before we commit to something we do risk assessment and impact assessment to determine likely outcome. You can't see a future but you can gather as much information as possible. \"Hold to your seats we are going in blind\" is not really a way I want country to be run. ",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1512670689.0,
    "date_created": "2017-12-07",
    "time_created": "05:18:09",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwq4yo",
    "parent_id": "t1_dqwos8l",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Without failed creativity there is no creativity. For every success there are countless failures.\n\nIf you want creativity at all, you can't complain when it fails.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512695522.0,
    "date_created": "2017-12-07",
    "time_created": "12:12:02",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqy3pid",
    "parent_id": "t1_dqwpeos",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "What I would have done is have an STV vote with multiple different options, that allowed people to rank by preference. I feel like this could have provided a solution ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512762355.0,
    "date_created": "2017-12-08",
    "time_created": "06:45:55",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw8gin",
    "parent_id": "t1_dqw7dk5",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Universe implodes",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512670777.0,
    "date_created": "2017-12-07",
    "time_created": "05:19:37",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwht4h",
    "parent_id": "t1_dqwdrv0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You sure? That's sad if it is the case but I have heard nothing about that.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512687318.0,
    "date_created": "2017-12-07",
    "time_created": "09:55:18",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwj855",
    "parent_id": "t1_dqwc19c",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I have the exact same problem. You can get by in Berlin without, but not really if you want a decent job. And I don't like German :P\n",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1512688886.0,
    "date_created": "2017-12-07",
    "time_created": "10:21:26",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwuwbd",
    "parent_id": "t1_dqwc19c",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yeah I mean you do generally have to learn a language when you move to another country. I moved to Catalunya 4 months ago after having studied Spanish for a year and soon I'll be working on my Catalan. I've met people who only speak English and they do survive but it must be a weird existence.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512699886.0,
    "date_created": "2017-12-07",
    "time_created": "13:24:46",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqxznoc",
    "parent_id": "t1_dqx4z2h",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Screwing over a country so thoroughly that only the real hardcore patriots remain in it is certainly an interesting tactic.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512751465.0,
    "date_created": "2017-12-08",
    "time_created": "03:44:25",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwmtgr",
    "parent_id": "t1_dqwigja",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Are they the same people who take that approach to restaurant and retail staff, by any chance?\n\n> I'm sorry, we have sold out of X. Can I get you something else? I recommend Y.\n>\n> I don't want Y. Get me my X.\n>\n> I'm afraid I won't be able to; as I explained, we've already sold out.\n>\n> It's very simple, just go and bring me X. Stop being so obstructive! I demand to speak to the manager!",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512692482.0,
    "date_created": "2017-12-07",
    "time_created": "11:21:22",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwuony",
    "parent_id": "t1_dqwtqjh",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> If there is a serious proposal for a second referendum though\n\nIt took [seven months to get through Parliament](https://services.parliament.uk/bills/2015-16/europeanunionreferendum/stages.html). [SIs were still being put through five months later](http://www.legislation.gov.uk/all?title=European%20Union%20Referendum%20regulations). Then you have a campaign period, which could take at least three months. So if we use that as a precedent you'd need to start the process at least 12 months before 29th March 2019. This would be March next year. \n\nSo either a lot happens between now and March, or something very extraordinary happens the year after that, to get a referendum before leaving. \n",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512699686.0,
    "date_created": "2017-12-07",
    "time_created": "13:21:26",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwmwsp",
    "parent_id": "t1_dqwimfb",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "But it’s not the real reason is it. We all know that. ",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1512692568.0,
    "date_created": "2017-12-07",
    "time_created": "11:22:48",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwmxdh",
    "parent_id": "t1_dqwimfb",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That is not the reason I cite for ending FoM, my reason is democratic.\n\nFor decades the primary issue that the British electorate has is not a national competency. That undermines the legitimacy of a parliamentary democracy where the sole point of our elected officials is to be a conduit to resolve the publics issues.",
    "controversiality": 0,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512692582.0,
    "date_created": "2017-12-07",
    "time_created": "11:23:02",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwo2t1",
    "parent_id": "t1_dqwnc8o",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "To which we can consult decades of polling which shows people really want to cut immigration. \n\nI don't disagree clarity would be helpful. I just suggest we start from the position that both campaigns told people a vote to leave meant ending single market membership, so that is the point we should start from.",
    "controversiality": 0,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512693647.0,
    "date_created": "2017-12-07",
    "time_created": "11:40:47",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwguue",
    "parent_id": "t1_dqwcxqm",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I was not trying to be a cunt, I genuinely didn't understand your comment, hence why I tried to reply as politely as possible. ",
    "controversiality": 0,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512686203.0,
    "date_created": "2017-12-07",
    "time_created": "09:36:43",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwaoup",
    "parent_id": "t1_dqwabqo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Precisely. People held this up as an example of the EU being 'unreformable', yet this opt-out could have been the beginning of a series of huge reforms. \n\nThis was a negotiation first and foremost for British special treatments. It wasn't an attempt at reform, it was twisted gun to the head situation, reform doesn't happen overnight, not in the EU at least, it takes coalition building and skilled diplomacy but it is possible. It's depressing that the leave side ignore that.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1512676364.0,
    "date_created": "2017-12-07",
    "time_created": "06:52:44",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwbpd2",
    "parent_id": "t1_dqwazyj",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "This argument can be destroyed. Let's say your premise is true and immigration is good for the economy. If we doubled out net migration number? That would be a positive. If we opened our border to India and half of Africa, and immigration drastically increase, that would be a positive. Quantity and quality. It's all irrelevant, because of your dogma : \"Immigration is good for the economy\". You've also conflated 'immigration' and 'EU immigration'. Remain combined them both during the referendum and didn't differentiate between the two. They were both good. \n\nSee now you want to put caveats in, you want to dismiss the above as nonsensical hypotheticals. Going by your logic, there can never be a point where immigration isn't good for the economy. This is a bold faced lie. ",
    "controversiality": 0,
    "ups": -6,
    "downs": 0,
    "score": -6,
    "created": 1512678473.0,
    "date_created": "2017-12-07",
    "time_created": "07:27:53",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwbt0b",
    "parent_id": "t1_dqwb0ko",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "An acknowledgement that there might come a point when immigration is bad for the economy .. due to quality and quantity. If we take your premise to be true, then logically we could double or triple net migration and you'd still be singing the same tune. There is never a \"too high\" tipping point .. this was the general consensus of Remain. \n\nNaturally if they conceded this, it would have been a boost for Leave, so they didn't.",
    "controversiality": 0,
    "ups": -1,
    "downs": 0,
    "score": -1,
    "created": 1512678669.0,
    "date_created": "2017-12-07",
    "time_created": "07:31:09",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqye1po",
    "parent_id": "t1_dqydzy6",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Briton is primed.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512777535.0,
    "date_created": "2017-12-08",
    "time_created": "10:58:55",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwm9x3",
    "parent_id": "t1_dqwlcnq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Membership in the EC stretches back to the 1970s. I don't know what you threshold for \"status quo\" is, but 40 years seems a pretty safe bet... Even if you want to focus on immigration, Schengen is more than 20 years old. How long does something have to be around before it becomes status quo for you?",
    "controversiality": 0,
    "ups": 4,
    "downs": 0,
    "score": 4,
    "created": 1512691962.0,
    "date_created": "2017-12-07",
    "time_created": "11:12:42",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwa4rf",
    "parent_id": "t1_dqw9trm",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">If you wish to keep this as an advisory only referendum you have to concede it was so close that the government must consider that we need to keep a large amount of the systems in place.\n\nBut only if that actually works for the UK and the EU.  I'd agree that we should end up with a really close relationship with the EU, I'd happily keep FoM and access to the single market and a customs arrangement, while being open to the EU in the same way makes sense.  At the same time I don't think remaining a member of the single market and customs union makes sense if we are not a member of the EU. We lose representation and would be subject to a lot of restrictions and obviously direct regulatory  control. That'd essentially be a case of having even more downsides than the current arrangement, with fewer benefits.\n\n>How they achieve that is up to HMG but I'd suggest it would take previous agreements and not having article 50 released so soon.\n\nPossibly, but the EU wasn't going to discuss anything until we triggered A50, so it's a bit of a non-starter.  \n\n>Possibly but the ones that exist are very loud and far too many in the Tory party/papers who want a full Brexit regardless of the cost.\n\nI think most leave voters want the UK to leave the EU, that's not unreasonable. Even those that make a lot of noise about leaving *'Right now!'* are making that argument on the basis that they think that will do the least damage to the UK.",
    "controversiality": 0,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512675095.0,
    "date_created": "2017-12-07",
    "time_created": "06:31:35",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwk07g",
    "parent_id": "t1_dqwjm5n",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">Some broad outlines for different options and open discussion.\n\nWe did have broad outlines, different options and open discussion. There was a huge amount of that in the two years leading to the referendum. That included discussions about how other European, non-EU countries operate, how Canada, the US, China and Japan interact with the EU and the world and so on.  There were many discussions in an adversarial sense about the impact of the various models that were presented and/or argued about.\n\n>Time for people to consider these various options and compare estimates of changes that came with them.  Leave didn't do that and still haven't.\n\nThe campaign may or may not have (I don't feel it did a lot to be honest, neither side really did) but people did. And obviously the issue remains that whatever people choose as an outcome, there is no way to guarantee it, or even push in one direction unless there is support to do so from not only the UK, but also the EU.  \n\n>It's basic planning if you have an uncertain event to broadly consider some of the possible outcomes.\n\nWhich has been done by everyone bar the government (because the leader of the remain campaign, and then Prime Minister, refused to allows the civil service to plan).  The UK is now trying to build the closest trading and institutional relationship outside of the CU, SM and EU, that's essentially the Tory aim and indeed Labours aim...",
    "controversiality": 0,
    "ups": -1,
    "downs": 0,
    "score": -1,
    "created": 1512689708.0,
    "date_created": "2017-12-07",
    "time_created": "10:35:08",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwd8l4",
    "parent_id": "t1_dqwcxbq",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "That's your interpretation of that so called opt out. It wasn't cast in stone. Even if it were so, and we did secure this opt out .. there would have surely come a point where we needed to either go in or come out. Otherwise what is to stop every other country demanding opt outs from certain integration measures they dislike? Something would have to give. \n\nSome Remain voters were EU federalists .. they would quite like to forget about that opt out and go full steam ahead. Some Remain voters had their nerves calmed and were reassured by the optout, meaning they were glad we could remain distance from the EU while they further integrated. Remain wasn't one cohesive voice.",
    "controversiality": 0,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512681202.0,
    "date_created": "2017-12-07",
    "time_created": "08:13:22",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwn1v3",
    "parent_id": "t1_dqwjcx0",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Not quite. Countries are outvoted by the majority in a lot of areas. We have a veto for certain things, but to imply we alone could steer the direction of the EU not reality. \n\nIf the EU decide to do X after Britain voted against it, how would you feel, and what would you do? Suck it up? Vote for an anti EU party? Assume they know best? ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512692702.0,
    "date_created": "2017-12-07",
    "time_created": "11:25:02",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7b0a",
    "parent_id": "t1_dqw6zoy",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Well, some Brexit voters were saying a week after the referendum *'Are we still in the EU?  I thought we'd have left by now!'*\n\n--\n\nClick your fingers! Brexit happens.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1512667668.0,
    "date_created": "2017-12-07",
    "time_created": "04:27:48",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw7mv9",
    "parent_id": "t1_dqw6hs8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "But i thought to leave the eu, all you do is walk out of the door.\n\nSeriously though what was the actual reason for even wanting to leave eu",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1512668550.0,
    "date_created": "2017-12-07",
    "time_created": "04:42:30",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw8502",
    "parent_id": "t1_dqw6hs8",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "This. totally utterly this.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1512669918.0,
    "date_created": "2017-12-07",
    "time_created": "05:05:18",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwoe4u",
    "parent_id": "t1_dqw7a0u",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "How do you like your Brexits? Hard of soft boiled?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512693931.0,
    "date_created": "2017-12-07",
    "time_created": "11:45:31",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw9n4f",
    "parent_id": "t1_dqw962g",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">Why should the EU allow us all the benifits of being in the EU without being in it?\n\nProbably because it would mean we had some benefits, bit lost quite a significant proportion, and we'd essentially be handing a lot of money and control over to a set of institutions we had absolutely no say in anymore.  The description above (removing all our representation from EU bodies, while remaining in all the regulated entities) would be utterly bizarre. I mean, it'd be like taking the 'no sovereignty' argument and fuelling it to nightmare proportions, it might be a bit hyperbolic, but it'd essentially make the UK an EU colony (rules applied, taxes and cash extracted, but no say or influence). ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512673891.0,
    "date_created": "2017-12-07",
    "time_created": "06:11:31",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw9sdw",
    "parent_id": "t1_dqw962g",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "It's not actually better than actually being in the EU.\n\nYou have to accept what they say without having any decision making ability.\n\n'[possible] Regulatory alignment for the whole of the UK' was put out by David Davis yesterday.\n\nWell, what's the point of leaving then?  Norway, with EEA/EFTA relationship still pay into the EU, to meet their obligations.\n\n> That wouldn't happen anyway.\n\nWe don't know. There hasn't been a single considered official Brexit plan put out by anyone in parliament which covers all issues.\n\nHalf of the Government want this, the other half want that, and even those halves are split on other issues.\n\nEvery time another issue comes up that hadn't been thought about it becomes, 'we could do this' or 'we'll deal with it in later negotiations'.\n\nThe only one who has come out with a plain stance so far is LibDems, which is just 'Cancel it, and done with'.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512674258.0,
    "date_created": "2017-12-07",
    "time_created": "06:17:38",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw96gz",
    "parent_id": "t1_dqw8w81",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Firstly, r/Iamverysmart is that way\n\nSecondly, you’ve written a lot of crap to make one basic point that is that it is possible to predict what would happen (something I never denied) and that because of some of the negative economic forecasts at the time we should have remained. \n\nWell the difference is you’re talking about economic implications, many of which have now been proven to have been exaggerated by remainers, while I took this to refer to the arduous and stalling negotiations and that was impossible to predict especially with conflicting predictions from people across the spectrum as to how highly the U.K. is valued by Europe and how hard they’d try to make it for us. \n\nSo while I agree that obviously predictions and speculation was possible and did happen, there was always going to be surprises and things that weren’t anticipated but that doesn’t mean the decision to leave was a poor one. ",
    "controversiality": 0,
    "ups": -5,
    "downs": 0,
    "score": -5,
    "created": 1512672691.0,
    "date_created": "2017-12-07",
    "time_created": "05:51:31",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw8z3x",
    "parent_id": "t1_dqw8fb6",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "“Risk assessment” this was also done for Brexit except unless you have a sightseer in your work place who can see the future with perfect clarity, it’s impossible to know how things will unfold once the plan sets in motion. Similarly it was impossible to know how the EU and it’s members would react once Article 50 had been triggered. \n\nThat does not mean that the decision to take the leap and leave was a mistake. ",
    "controversiality": 0,
    "ups": -2,
    "downs": 0,
    "score": -2,
    "created": 1512672148.0,
    "date_created": "2017-12-07",
    "time_created": "05:42:28",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwt0dw",
    "parent_id": "t1_dqwq4yo",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Right, but one has to recognise it as failure and call it out as such, otherwise people will carry on reproducing low quality work.\n\nWhat a stupid argument, this is a reddit thread, the guy was trying to be funny and it really isn't, but for someone reason ukpolitics has entered into some sort of left wing collective hysteria where anything mildly critical of the Tories is considered a work of genius.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512698131.0,
    "date_created": "2017-12-07",
    "time_created": "12:55:31",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqy3trc",
    "parent_id": "t1_dqy3pid",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Farage would insist on the same number of remain options as leave options (otherwise 'it's a fix'). The whole issue is the Brexiteers wanted different, incompatible things; but they agreed they wanted to leave but will never agree how and then complain it doesn't get done...",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512762630.0,
    "date_created": "2017-12-08",
    "time_created": "06:50:30",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwmedl",
    "parent_id": "t1_dqwht4h",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "kinda-sorta true - FoM rights for UK citizens will end on Leave Day (29th jan 2019) so you can go there now and work until that point, but after that point you'd need some other work visa. But provisions for FoM-acquired residency rights rolling over into intrinsic residency rights or an expedited path to citizenship ended when a50 was notified, because two years isn't enough time to acquire those rights under normal circumstances. UK citizens who had moved *before* a50 but wouldn't have sufficient time to acquire citizenship of their current resident nation are usually being treated as special cases, because it's a 'no fault of their own' situation (and most countries have a much more compassionate and reasonable immigration system than the UK's, which is largely telling the few remaining long-term EU FoM workers who haven't decided it's not worth staying in xenophobe-land, to fuck off despite these people often being UK resident for decades and having dependent family here)",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1512692082.0,
    "date_created": "2017-12-07",
    "time_created": "11:14:42",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwja80",
    "parent_id": "t1_dqwht4h",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yes of course. In order to live and work in another country outside the EU you need a company to sponsor you or have a great deal of money and a business case to establish yourself.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512688947.0,
    "date_created": "2017-12-07",
    "time_created": "10:22:27",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwkn2p",
    "parent_id": "t1_dqwj855",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "At first he was in Wurzburg, Bavaria and it was beautiful. We were in 35c weather floating down the river on lilos with beers, was amazing but now he’s moved to Munich ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512690352.0,
    "date_created": "2017-12-07",
    "time_created": "10:45:52",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqxekfy",
    "parent_id": "t1_dqwuwbd",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "How did you find getting a job out there? Many i see on here are looking to germany but climate is a consideration for me and i speak fluent spanish so that's where my heart is set. Issue is, most people seem to have IT skills and though postgrad educated it's in social sciences and I'm struggling with ideas beyond tefl at the moment which I'd like to avoid if possible!",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512721665.0,
    "date_created": "2017-12-07",
    "time_created": "19:27:45",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwrgk2",
    "parent_id": "t1_dqwmtgr",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "\"At this point sir, you're already talking to a manager. Can you pick something else and ill give your table free, nonalcoholic coffee afterwards.\"\n\nWorking high demand seasonal hospo, this phrase become as easy to say as \"chips, rice or half and half?\"",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512696720.0,
    "date_created": "2017-12-07",
    "time_created": "12:32:00",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqx31cl",
    "parent_id": "t1_dqwuony",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Yeah as I’ve said, I wouldn’t see an issue with pausing or halting the article 50 process if there was a genuine prospect of a second referendum. The EU have said as much. So has the guy who wrote article 50, incidentally. I’m not sure which part of that isn’t clear. ",
    "controversiality": 0,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512707948.0,
    "date_created": "2017-12-07",
    "time_created": "15:39:08",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwsn01",
    "parent_id": "t1_dqwmxdh",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'd agree if it wasn't for the fact that our own politicians clearly can't be trusted. I actually trust the EU parliament to look after the UK more than I trust the current morons in power.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512697796.0,
    "date_created": "2017-12-07",
    "time_created": "12:49:56",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqx3mgj",
    "parent_id": "t1_dqwmxdh",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I don't trust the British government and I don't have any issue with the level of democracy in the EU. It seems to work, more or less, at least better than the UK.\n\nAnd... what does that have to do with ending FoM? ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512708813.0,
    "date_created": "2017-12-07",
    "time_created": "15:53:33",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwop05",
    "parent_id": "t1_dqwo2t1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> To which we can consult decades of polling which shows people really want to cut immigration. \n\nPeople want all sorts of things. They may want them a bit but not so much that they would pay for it or suffer negative consequences.\n\n>I don't disagree clarity would be helpful. \n\nGood\n\n>I just suggest we start from the position that both campaigns told people a vote to leave meant ending single market membership, \n\nI disagree. There were plenty of people wanting to Leave who quite clearly also said that we would still have full market access and that we could have our cake and eat it. Again lack of informed population and lack of clear option.\n\nAt the very least people were not clear on the price to pay for limiting immigration (in the dramatic manner of ending EU FoM - other less dramatic options controlling immigration and benefits are available).\n\n>so that is the point we should start from.\n\nI think this is just rather the point you would like!\n\n",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512694189.0,
    "date_created": "2017-12-07",
    "time_created": "11:49:49",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwh03z",
    "parent_id": "t1_dqwbpd2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">Gordon Brown: Immigration is a net positive for the economy.  \n  \n>xu85: Oh really! Well what if a 100 bajillion immigrants enter the country!?? It's not good now is it!!!!  \n  \nReductio ad absurdum.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1512686377.0,
    "date_created": "2017-12-07",
    "time_created": "09:39:37",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwc3fs",
    "parent_id": "t1_dqwbpd2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "So no lie then? The UK is one of the hardest places on earth to enter for non-EU immigrants. There are restrictions that see even legitimate visits halted because of random rules. Professors with no desire to move here have been stopped entering conferences. Authors have been stopped from launch tours..it's really more difficult than you think.\n\nCurrently we have a very high level of employment..under 5% of the workforce is out of work. That is almost unheard of. Nobody is suggesting letting every African or Asian into the country. The EU workers come because there are jobs available, when the jobs availability is low, they move on. They are here to work, not shirk for the vast majority. In that way, the market is self-regulating. Brexit will lower that availibility and more will move on to a more attractive location.\n\nI see no destroyed argument..just you playing a game of what ifs..I see no evidence of the lie you claimed either. Nobody made the argument that the whole world could move..it's nonsensical and desperate. The plain fact is that the immigration we had was very good for the economy as a whole, which is indisputable. Because the Tory government didn't pass down those benefits to the many..that doesn't change the fact that the economy prospered and the UK recovered very well after the GFC. The answer was to change the government to one that would spread the benefits more evenly..not kill the prosperity. Brexit will just encourage the current Tory government to accelerate what it is doing to the workforce. That's why the ordinary people at the bottom will be the hardest hit. \n\n",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1512679221.0,
    "date_created": "2017-12-07",
    "time_created": "07:40:21",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqx2ghc",
    "parent_id": "t1_dqwbpd2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Gordon Brown: \"Drinking water is important for maintaining a healthy body\n\n> xu85: OH! BUT WHAT IF I FORCE YOUR HEAD UNDERWATER AND KEEP YOU THERE! WATER'S NOT SO GOOD NOW IS IT!",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512707062.0,
    "date_created": "2017-12-07",
    "time_created": "15:24:22",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwnhvz",
    "parent_id": "t1_dqwm9x3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Ok.. but that entity called the EEC is a rather different beast to what it was 40 years ago. Different parts of the country have been differently affected by this entity. To a Londoner it’s probably the status quo by now. To a country farmer, his experience with the EU has been a surge in low skilled Bulgarian fruit pickers to his isolated community. This hasn’t happened over 40 years, but the last 5-10. It’s  disruption to the status quo in his world. \n\nNot a hard concept to understand. ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512693111.0,
    "date_created": "2017-12-07",
    "time_created": "11:31:51",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwabs1",
    "parent_id": "t1_dqwa4rf",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> I think most leave voters want the UK to leave the EU, that's not unreasonable. Even those that make a lot of noise about leaving 'Right now!' are making that argument on the basis that they think that will do the least damage to the UK.\n\nI'm more think of the ones who are prepared to close borders/give NI to Ireland, have only WTO and not pay anything, or generally not turn up to negotiate because of stubborn ideology ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512675551.0,
    "date_created": "2017-12-07",
    "time_created": "06:39:11",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwklo6",
    "parent_id": "t1_dqwk07g",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I'm going to reject everything you have said there as inaccurate. There may have been SOME who assessed the different possibilities accurately but only a small minority and only at a high level of single market means no border.\n\n\nThere was and is no detailed look at any of the broad outcomes made available to the electorate, that's a fact evidenced by what's happening in the commons.\n\n\nThe last part about the government being the only ones who haven't assessed the impact is just rubbish. Just look at all the volume of false, contradictory or downright delusion comments and media articles about what's on offer. Clearly not made by people with an understanding or accurate assessment. ",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512690313.0,
    "date_created": "2017-12-07",
    "time_created": "10:45:13",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwdsmu",
    "parent_id": "t1_dqwd8l4",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "[It is recognised that the United Kingdom, in the light of the specific situation it has under the Treaties, is not committed to further political integration into the European Union. The substance of this will be incorporated into the Treaties at the time of their next revision in accordance with the relevant provisions of the Treaties and the respective constitutional requirements of the Member States, so as to make it clear that the references to ever closer union do not apply to the United Kingdom.](http://eur-lex.europa.eu/legal-content/EN/TXT/?uri=OJ%3AJOC_2016_069_I_0001)\n\nA few paragrpahs below that quote:\n\nThe competences conferred by the Member States on the Union can be modified, whether to increase or reduce them, only through a revision of the Treaties **with the agreement of all Member States.**\n\nWe are a member of the EU. The EU is as much ours as it is Germany's or France's, or anyone's. The EU, which is to say we, get to decide the future of the EU. The EU isn't some lumbering overwhelming beast above us, literally everything that happens in it must be unanimously agreed by all members. If a member doesn't want something, they won't be forced to do it. If members don't want to intergrate closer, it won't happen. What we agreed was that everyone else could get closer and we wouldn't stop them. Everyone got what they want, nice win-win. If the time came that we wanted to integrate, then we would be perfectly able to. \n\nOf course it wasn't cast in stone, the EU hardly casts anything in stone. It's a club for nations, and it constantly evolves according to what those members unanimously agree upon. What was said, though, was a clear agreed principle: any new treaty about further closer integration was not something we needed to implement.  ",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512682076.0,
    "date_created": "2017-12-07",
    "time_created": "08:27:56",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqy86t5",
    "parent_id": "t1_dqwn1v3",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Are you aware of the veto procedure? ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512770535.0,
    "date_created": "2017-12-08",
    "time_created": "09:02:15",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw86ju",
    "parent_id": "t1_dqw7mv9",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Murica! ... sorry, Rexit! (maybe). Nationalist pride and lies believed to make you feel better. Arrogance maybe to think the UK is better off alone? Certainly not economics or welfare, despite how it was dressed. No one can come up with any numbers so what they voted for was a union jack.",
    "controversiality": 0,
    "ups": 5,
    "downs": 0,
    "score": 5,
    "created": 1512670035.0,
    "date_created": "2017-12-07",
    "time_created": "05:07:15",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwbobb",
    "parent_id": "t1_dqw9sdw",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Can I ask though, why do you think we have no say in the EU (before we left)? We have elected MEP's that are supposed to represent us to the EU.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512678415.0,
    "date_created": "2017-12-07",
    "time_created": "07:26:55",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw9nfb",
    "parent_id": "t1_dqw96gz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Literally nopthing has been exagerrated by remainers, as we havent even left the EU yet.\n",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512673913.0,
    "date_created": "2017-12-07",
    "time_created": "06:11:53",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw9zt3",
    "parent_id": "t1_dqw96gz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">Firstly, r/Iamverysmart is that way\n\nStandard Reddit *ad hominem*. \nNice. When I say nice, I mean pathetic. \nYou've probably had enough of experts too?\n\n>...it is possible to predict what would happen (something I never denied) ...\n\nEr, saying \"it's impossible to see the future\" rather looks like you were denying that!\n\n>and that because of some of the negative economic forecasts at the time we should have remained.\n\nYes, exactly.\n\n>Well the difference is you’re talking about economic implications... while I took this to refer to the arduous and stalling negotiations\n\nOh, despite not saying that (and we're somehow meant to know), you're only talking about predicting the negotiations?! Silly us.\n\n>the arduous and stalling negotiations and that was impossible to predict\n>there was always going to be surprises and things that weren’t anticipated\n\nImpossible to predict? Surprises? Not anticipated? FFS\nNo. Just no.\n\na/ the fact that the EU massively has the upper hand given relative economic strengths and impact was obvious and predicted.\n\nb/ Northern Ireland - this issue was entirely predicted to anyone paying fucking attention.\n\nYou - and many other Leavers - may however be surprised. Because, and this is the whole point of this thread, people were not well informed. \nAnd/or had their hands over their ears while singing \"La La La, can't hurt me!\" while they carried on believing what they wanted to believe....\n\n(Can anyone be bothered to help me out with some links to make the point that these aspects were entirely predicted and anticipated? I'm meant to be working...Heh.)",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512674765.0,
    "date_created": "2017-12-07",
    "time_created": "06:26:05",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwif9g",
    "parent_id": "t1_dqw96gz",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> Well the difference is you’re talking about economic implications, many of which have now been proven to have been exaggerated by remainers\n\nThe core of the economic concerns revolved around what would happen once the UK left the single market. And you haven't left the single market yet. So I don't understand how you can claim that the economic concerns have been disproven.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512688016.0,
    "date_created": "2017-12-07",
    "time_created": "10:06:56",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw91c2",
    "parent_id": "t1_dqw8z3x",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Could you link it to Davis please because he had to hand it over yesterday and said it doesn't exist. He would be relived to know it has been in fact done.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1512672311.0,
    "date_created": "2017-12-07",
    "time_created": "05:45:11",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwi2hl",
    "parent_id": "t1_dqw8z3x",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "You're saying \"We can't predict the future perfectly, so what's the point in making an educated guess about the consequences of our actions\". That is letting perfect be the enemy of good.\n\nEdit: Also, yeah, where is this risk assessment you speak of?",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512687613.0,
    "date_created": "2017-12-07",
    "time_created": "10:00:13",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwvdob",
    "parent_id": "t1_dqwt0dw",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Except that you added nothing.\n\nThere's a reason people encourage constructive criticism.\n\nJust throwing insults is pathetic. It adds nothing so shouldn't be taken seriously as an indication of anything. Least of all the quality of the work.\n\nIronically I'm calling out the quality of criticism and you're saying I'm wrong in doing so. The criticism is low quality work, it needs to be called out.",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512700336.0,
    "date_created": "2017-12-07",
    "time_created": "13:32:16",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwpmh5",
    "parent_id": "t1_dqwmedl",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I must say, though, I am pretty sure that once a deal has been reached, the EU will be quite lenient with UK migration. They understand that most migrants will tend to be younger, better-educated, healthier, and more risk-taking than the average population so it's a win-win. There were already talks of blanket opt-in citizenship offers, but they won't say much else while they're negotiating the deal itself.\n\nI certainly hope so. It would prove that at least one major political power in the world is behaving rationally and not driven by primitive ideology.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512695049.0,
    "date_created": "2017-12-07",
    "time_created": "12:04:09",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwnjqp",
    "parent_id": "t1_dqwja80",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Depends on the country. American investor status is like $500k dollars iirc.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512693160.0,
    "date_created": "2017-12-07",
    "time_created": "11:32:40",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqxenq2",
    "parent_id": "t1_dqxekfy",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Ah i can't help you there unfortunately, I'm studying a masters degree (with a student loan)",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512721776.0,
    "date_created": "2017-12-07",
    "time_created": "19:29:36",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwunn3",
    "parent_id": "t1_dqwrgk2",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I feel for you. But it frustrates me a bit, I always try to treat retail/restaurant staff like human beings. If was a c*nt, seems like I would get free stuff. \n\nOf course I already know the answer, 'being nice is it's own reward', but still... ;-)",
    "controversiality": 0,
    "ups": 2,
    "downs": 0,
    "score": 2,
    "created": 1512699661.0,
    "date_created": "2017-12-07",
    "time_created": "13:21:01",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqxi6u7",
    "parent_id": "t1_dqwsn01",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "But there is a significant difference:\n\n1) The EU parliament has basically no power (hence why they are called undemocratic; the commission etc. has the real power)\n\n2) When we the British public feel as you do that our politicians can't be trusted, what do we do? We vote them out. And what if we decide to feel that the European MPs can't be trusted? Oh wait, we can only vote the British ones out.\n\nThere is a total and clear lack of accountability. British MPs can be voted out. EU ones not so much.\n\nYou get that point, right?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512726038.0,
    "date_created": "2017-12-07",
    "time_created": "20:40:38",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqxf8rc",
    "parent_id": "t1_dqwop05",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "> we could have our cake and eat it\n\nThis phrase is beginning to annoy me now, especially since it's not even faithful to its own origin. The original saying goes\n\n\"You can have your cake and eat it, but you can't eat your cake and have it\"\n\nThe meaning being that if you have your cake (like in your hand, in the fridge, on a table... anywhere in your ownership) you can then eat it, but you can't eat it and somehow still have it in your possession. It's gone at that point.\n\nThe government is trying to eat its cake and have it, not have it and eat it.\n\nI'm not picking fault with you, though. This argument has been made by all kinds of people and has basically entered the national brexit debate in exactly the form you cite it.",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512722481.0,
    "date_created": "2017-12-07",
    "time_created": "19:41:21",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwcko1",
    "parent_id": "t1_dqwc3fs",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">So no lie then? The UK is one of the hardest places on earth to enter for non-EU immigrants. There are restrictions that see even legitimate visits halted because of random rules. Professors with no desire to move here have been stopped entering conferences. Authors have been stopped from launch tours..it's really more difficult than you think.\n\nSure mate, *now* it is so, it wasn't under Labour. You are trying to reassure me about my future anxieties by implying the rules we have in place will remain so forever, so don't worry my little head about it. This is disingenuous and you know it.\n\n>Currently we have a very high level of employment..under 5% of the workforce is out of work. That is almost unheard of. Nobody is suggesting letting every African or Asian into the country. The EU workers come because there are jobs available, when the jobs availability is low, they move on. They are here to work, not shirk for the vast majority. In that way, the market is self-regulating. Brexit will lower that availibility and more will move on to a more attractive location.\n\nAgain, you're using the current economic conditions and saying \"what's the problem\". I'm asking you to think about future scenarios, and to show you there are also unknown variables on the Remain side. Tomorrow, a recession might hit southern/Eastern Europe. Immigration triples. Why aren't you engaging with me? Do you concede that \"immigration is good for the economy\" is we had complete open borders with India, Pakistan and Bangladesh, for example? It's not a \"gotcha\" question, I want you to concede that although immigration may have been a benefit to us *so far to this point in time*, it doesn't logically follow that it will always be so. If you cannot acknowledge this basic concept, then there is no hope for you and you are just brainwashed. ",
    "controversiality": 0,
    "ups": -1,
    "downs": 0,
    "score": -1,
    "created": 1512680067.0,
    "date_created": "2017-12-07",
    "time_created": "07:54:27",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwagh8",
    "parent_id": "t1_dqwabs1",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">I'm more think of the ones who are prepared to close borders/give NI to Ireland, have only WTO and not pay anything, or generally not turn up to negotiate because of stubborn ideology\n\nThe problem is that that is more of a caricature than it is an extant group of people.  Pretty much no-one wants a closed border in NI (including the Kippers, DUP, Hard right Tories and indeed the right wing press.) and I haven't seen anyone suggest that we 'give' NI to Ireland. \n\nThe WTO, pay nothing thing has come up a few times as a result of a no-deal (as in, if there is no deal at all, we'll trade on WTO terms and they'll get nothing) but that's usually attached to the notion that it's safest to get out ASAP, and then build our relationships and trade agreements from outside of the A50 process because the EU won't deal with us reasonably within it.  I'd disagree, but it's not entirely insane either. \n\n",
    "controversiality": 0,
    "ups": 0,
    "downs": 0,
    "score": 0,
    "created": 1512675849.0,
    "date_created": "2017-12-07",
    "time_created": "06:44:09",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwrgn1",
    "parent_id": "t1_dqwklo6",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "\"I am going to reject everything you say as inaccurate because I voted leave therefore I know that I know better than everyone else possibly ever could on every single subject conceivable to human kind.\" - /u/Happylurker1",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512696722.0,
    "date_created": "2017-12-07",
    "time_created": "12:32:02",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwsvvj",
    "parent_id": "t1_dqwklo6",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": ">I'm going to reject everything you have said there as inaccurate.\n\nBut.. We literally had discussions where people suggested 'the Norway option' and trading on WTO rules and so on. It all came up in the campaigns, never mind the period before hand. I mean, fair enough, it's up to you what you discard as inaccurate, but it certainly isn't inaccurate to say that various models were discussed.\n\nAs to the point on Cameron and the civil service, that's not something that's up for debate, it was discussed at the time and criticised since.\n\n>only a small minority and only at a high level of single market means no border.\n\nIt was at a high level (that is to say discussing the general shape of access and so on rather than detail) but that's broadly to be expected given the detail would depend on any number of aspects, including the EU's approach.  Various approaches were talked about by different groups at different times \n to different levels of detail though.\n\nAs to the single market, there was discussion that ranged from remaining in it, through to trading on WTO terms.  Most of the debate seemed to focus on some level of access (Rather then membership) of the market, which seems to be both the current Government and opposition positions.\n\n>There was and is no detailed look at any of the broad outcomes made available to the electorate, that's a fact evidenced by what's happening in the commons.\n\nYou'd be right to say that the civil service were not instructed (by the government, which recommended remain) to put together outcomes or contingencies. That is because they were instructed specifically not to work on the issues with ministers who leaned toward leave either.\n\n>The last part about the government being the only ones who haven't assessed the impact is just rubbish. Just look at all the volume of false, contradictory or downright delusion comments and media articles about what's on offer. \n\nCompanies have looked at contingencies and outcomes, both the campaigns looked at outcomes (and presented them, both as possibilities and as nightmare scenarios) there are several different broad models from several different NGO's modelling the financial aspects depending on a variety of factors. Again, some of the latter have been used by both the leave and remain supporting people during, and since the referendum.  You are right that there is a lot of contradictory stuff out there, and a lot of delusional content (Again from remain and leave supporters), but that is also the nature of this debate. Different people want different exit scenarios, the only thing that tied the leave vote together was wanting the UK out of the EU after all (in much the same way that remain voters voted on a slew of reasons, with the common denominator being remaining in..).\n\n>Clearly not made by people with an understanding or accurate assessment.\n\nIf what you were expecting was a single outcome, explained in detail, then you are right. That didn't exist before the referendum. If you are looking for one now, you can look through the Governments negotiating positions, there is a shape of what the Government would like there, the problem (As it was always going to be) is that it also has to run into the shape the EU would like (also published essentially..) and they aren't quite the same.\n",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512698017.0,
    "date_created": "2017-12-07",
    "time_created": "12:53:37",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqxidzi",
    "parent_id": "t1_dqwdsmu",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Ah yes, the deal so bad that the Remain campaign wouldn't touch it with a barge pole. Surely if the deal was worth anything it would have been used in the campaign? Why wasn't it?",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512726263.0,
    "date_created": "2017-12-07",
    "time_created": "20:44:23",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw8bn8",
    "parent_id": "t1_dqw86ju",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "From what I gathered it was mostly because of immigration. That's all the news kept going on about. Its all  a joke at this point.",
    "controversiality": 0,
    "ups": 3,
    "downs": 0,
    "score": 3,
    "created": 1512670412.0,
    "date_created": "2017-12-07",
    "time_created": "05:13:32",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqwc4zb",
    "parent_id": "t1_dqwbobb",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "I said, If we 'Leave' but stay in CU, and SM to keep NI/ROI open border, [we will have to then also agree to the four freedoms], and also keep regulatory alignment with EU.\n\nWhy bother leaving, because we will have left and have no EP representation.\n\nAnd being in the SM and CU, we'd probably have to accept ECJ jurisdiction.\n\nYou said:\n\n> That wouldn't happen anyway. Why should the EU allow us all the benifits of being in the EU without being in it?\n\nI said:\n\n> It's not actually better than actually being in the EU.\n>\n> You have to accept what they say without having any decision making ability.\n\nand:\n\n> Well, what's the point of leaving then? Norway, [Who isn't a member of the EU] with EEA/EFTA relationship still pay into the EU, to meet their obligations.\n\n",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512679297.0,
    "date_created": "2017-12-07",
    "time_created": "07:41:37",
    "submission_id": "ukpolitics-7i4mmi"
  },
  {
    "id": "dqw9ovx",
    "parent_id": "t1_dqw9nfb",
    "subreddit_name_prefixed": "r/ukpolitics",
    "body": "Some Remainers were claiming the economy would be in ruins just from triggering article 50. ",
    "controversiality": 0,
    "ups": 1,
    "downs": 0,
    "score": 1,
    "created": 1512674013.0,
    "date_created": "2017-12-07",
    "time_created": "06:13:33",
    "submission_id": "ukpolitics-7i4mmi"
  }
]