[
  {
    "id": "dct5ei3",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 186,
    "downs": 0,
    "score": 186,
    "created": 1485230270.0,
    "date_created": "2017-01-23",
    "time_created": "14:57:50",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctisoi",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "To those who oppose Trump and are pleased by this, thank you for being intellectually honest, consistent, and understanding that policy matters more than those behind it. ",
    "controversiality": 0,
    "ups": 2320,
    "downs": 0,
    "score": 2320,
    "created": 1485245559.0,
    "date_created": "2017-01-23",
    "time_created": "19:12:39",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcsvy0m",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Can someone ELI5 what this means for the U.S. and the rest of the world? Also, how does it affect us, the common man?",
    "controversiality": 0,
    "ups": 2850,
    "downs": 0,
    "score": 2850,
    "created": 1485219911.0,
    "date_created": "2017-01-23",
    "time_created": "12:05:11",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcsy4w1",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I don't know enough about TPP to have a strong opinion on the matter but I remember a lot of people on Reddit showing their dislike for it. I guess a lot of people will be pleased about this.  \n  \n Edit: [Here](https://www.reddit.com/r/worldnews/comments/5ppzs5/president_donald_trump_signed_an_executive_order/dct75ux/) is an in depth answer I got about the TPP.  ",
    "controversiality": 0,
    "ups": 10658,
    "downs": 0,
    "score": 10658,
    "created": 1485222348.0,
    "date_created": "2017-01-23",
    "time_created": "12:45:48",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4u8b",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's almost like he explicitly said he would do it. ",
    "controversiality": 0,
    "ups": 871,
    "downs": 0,
    "score": 871,
    "created": 1485229670.0,
    "date_created": "2017-01-23",
    "time_created": "14:47:50",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct75ux",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I spent a lot of time writing this, and it doesn't appear to be showing up in the comments.  I'll try one more time as a top level comment - What the TPP actually does and why:\n\n\nI did a couple hours of research a few months ago.  The best I could come up with from neutral sources was what I put below.  Read all of the bullet points though, because I didn't neatly separate this list into pros and cons (if you even can).\n\n* It is an absurdly complicated subject, so take everything with a grain of salt.\n\n* It would be like NAFTA was for mexico <--> US / Canada, but with a few major differences.  \n\n* The first major difference, is that instead of targeting trade with Mexico, the point was to target trade with south east asia.\n\n* The second major difference was that NAFTA targeted manufacturing jobs (in return for cheaper goods).  TPP targeted service level jobs, and was very explicit in which industries for which countries.\n\n* For example, for the United States, jobs in nursing and retail work were specifically targeted and expected to be strongly adversely affected, in return for significantly expanded asian market penetration for things like American automotive exports and pharmaceuticals.\n\n* How could something like nursing be exported?  Well, that actually gets to the heart of the matter.  For the United States, the point of the TPP (and its sister acts) was to greatly, greatly strengthen and enforce IP law for south east asia, to match already existing IP and trade law in the US and Europe.\n\n* So whereas right now your bank probably hires American programmers, instead of programmers from Cambodia, for purely safety and enforcement reasons, that would change tomorrow.  And with the TPP, if you are a programmer, this would adversely affect you.  But nursing was specifically targeted, as bringing SE asia more in line with HIPAA guarantees would make it legally feasible to outsource more hospital overhead offshore.\n\n* This all means you could expect major offshoring of what are right now considered reputable and secure jobs in America, and for the act to be quite transformative for the economy.  In short, if your job isn't tied to the USA, and is easy to offshore, but hasn't been for logistic, legal or economic reasons, the TPP almost certainly changed the math involved with that equation (though of course it will be different for every job / industry).\n\n**Okay, so if America is trading away good jobs in entire industries, what does it get in return?**\n\n* Right now, if you are a large business that wants to get into Asian markets, you have two problems.  1) If you open in China, there's a good chance your designs will be eventually be stolen and given to a Chinese company, which the Chinese government will then later support at your expense.  And 2) The rest of SE asia has similar problems to varying degrees, and they all trade with China.\n\n* Additionally, right now Europe's economy is looking dead for the foreseeable future.  And since America isn't spending money jumpstarting our own economy, we're not likely to grow at a large rate any time soon either.\n\n* But asian economies are booming.  And as they do so, they are trading with each other, and making trade deals with each other that don't include us.  And that's a major disadvantage for America and Europe.\n\n* So the purpose of the TPP, from a western viewpoint, is to get SE asia into the same economic and legal framework as the western world, and open their markets to western companies.  \n\n* The second purpose of the TPP, is to get China to play ball too.  Right now, if we tell China to open their markets, and enforce western IP law, they'll laugh in our face (and do so).  We don't have the bartering chips for that deal.  But if the rest of SE asia is already doing so with the West, and builds their economies around such laws, then 15-20 years from now, it won't just be Europe / USA telling China to open their markets and enforce international IP law, it will be the vast majority of China's trading partners.  In short, it would be an economic coup d'etat for western powers, that would bring a _lot_ of money to large western companies and give Washington much more power in Asia.  If you are a citizen of the west, this is almost certainly a good thing.\n\n* So Obama and Clinton's bet, is that if we don't make a deal like the TPP, then Chinese (and by extension SE asian) companies are going to spring up as international competitors to American firms anyway.  And that increased competition represents lost profits that could otherwise have been made by western companies trading in China.  So by trading those jobs to outsourcing now, the US would be in a much more dominant position later, and it is worth the trade.\n\n**Okay, is that line of thinking valid?**\n\nYes and No.\n\n* If you are a CEO, or a powerful washington person.  Then yes, unequivocally.  The TPP means continued western and American worldwide economic hegemony and should be strongly fought for.  EU / USA firms cannot do business in China.  That's a major economic disadvantage for any western firm playing on that level.\n\n* For people who's jobs are not offshored, then yes, this is probably a good plan.  Just like NAFTA resulted in cheaper goods, TPP should result in cheaper services across the board.  \n\n* But if your job can be offshored (and the list of offshorable jobs the TPP will make cost effective to offshore is large), then it is more complicated.\n\n* If the USA had a real economic safety net, and put forward programs towards retraining and revitalizing areas specifically hit by offshoring and globalization, then you could vote for the TPP confidently.  This, for example is how the scandanavian countries handled integration into the EU, and overall there are very few cases of real economic hardship as the result of that integration.  Overall, it was a success story.\n\n* But after NAFTA, the USA implemented no such programs, whatsoever.  Economists at the time, believed them to be unnecessary.  The thinking was, that if free trade agreements resulted in more trade, which resulted in more jobs, then people who lost their jobs to outsourcing should have no difficulty finding new jobs in a free market.\n\n* The reality was that outsourcing resulted in chain effects whereby entire regions of the country lost all their good jobs, and the good jobs that remained moved to other US locations.  Combined with the fact that many people woke up one day to find that their entire career was no longer employable in their home country, meant that they simply could not find new work.  Add in again Greenspan's attempts to 'lower worker mobility to increase American labor competitiveness', and the end result is that today, in 2017, many families that lost their jobs due to nafta STILL are not employed.\n\nSo at the end of the day, you have to make a call.  Do you think that America will be like Scandanavia, and reinvest a portion of the profits reaped by greater access to Asian markets on economic growth, unemployment benefits, worker retraining and government programs?  Or do you think that America will call those things socialism, ignore the problem, and allow large companies to reap the economic rewards unmolested?\n\nPersonally, I fall into the second category, so I am very, very happy to see the TPP fail.  I think that given the second viewpoint, outsourcing service level jobs, in THIS economy, would be a death sentence for many, many people.  But that said, if you think that the first option is a possibility, then the TPP should be strongly supported.  And really, in an ideal world, if we could trust that America would take care of the people who would be harmed by the outsourcing, then we would want the TPP to pass, because increased trade and American competitiveness in the future is something that should be encouraged and worked towards.",
    "controversiality": 0,
    "ups": 22005,
    "downs": 0,
    "score": 22005,
    "created": 1485232159.0,
    "date_created": "2017-01-23",
    "time_created": "15:29:19",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcszdeq",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 7181,
    "downs": 0,
    "score": 7181,
    "created": 1485223713.0,
    "date_created": "2017-01-23",
    "time_created": "13:08:33",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct85qd",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "No matter what my opinions on trump is, he's doing what he said he would if he became president and he's not wasting time. I'll give him that. ",
    "controversiality": 0,
    "ups": 87,
    "downs": 0,
    "score": 87,
    "created": 1485233242.0,
    "date_created": "2017-01-23",
    "time_created": "15:47:22",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct5mqy",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 817,
    "downs": 0,
    "score": 817,
    "created": 1485230514.0,
    "date_created": "2017-01-23",
    "time_created": "15:01:54",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6apb",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Hillary and Obama were 100% behind TPP. You have to ask why? It is known as one of the most unpopular bills in both the senate and congress.",
    "controversiality": 0,
    "ups": 710,
    "downs": 0,
    "score": 710,
    "created": 1485231224.0,
    "date_created": "2017-01-23",
    "time_created": "15:13:44",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct2v2y",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Gotta give the man props for following through on his word\n\n",
    "controversiality": 0,
    "ups": 2870,
    "downs": 0,
    "score": 2870,
    "created": 1485227532.0,
    "date_created": "2017-01-23",
    "time_created": "14:12:12",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6gz8",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Good start, Trump, show me I was wrong about you. \n\nEdit after 6 months: Well, he didn't.",
    "controversiality": 0,
    "ups": 1169,
    "downs": 0,
    "score": 1169,
    "created": 1485231410.0,
    "date_created": "2017-01-23",
    "time_created": "15:16:50",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct9xs9",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Finally TPP is dead. Good.",
    "controversiality": 0,
    "ups": 113,
    "downs": 0,
    "score": 113,
    "created": 1485235181.0,
    "date_created": "2017-01-23",
    "time_created": "16:19:41",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct5zn0",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 146,
    "downs": 0,
    "score": 146,
    "created": 1485230894.0,
    "date_created": "2017-01-23",
    "time_created": "15:08:14",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct52lc",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Not happy with a lot of people Trumps put in place, but for the first thing he does to be a huge positive? Im down with that.",
    "controversiality": 0,
    "ups": 1560,
    "downs": 0,
    "score": 1560,
    "created": 1485229916.0,
    "date_created": "2017-01-23",
    "time_created": "14:51:56",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct2phw",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 1811,
    "downs": 0,
    "score": 1811,
    "created": 1485227359.0,
    "date_created": "2017-01-23",
    "time_created": "14:09:19",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcsxcsy",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "He doesn't waste time. ",
    "controversiality": 0,
    "ups": 1376,
    "downs": 0,
    "score": 1376,
    "created": 1485221492.0,
    "date_created": "2017-01-23",
    "time_created": "12:31:32",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcsvsk2",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's one promise he's kept, and he's been in office for two days.",
    "controversiality": 0,
    "ups": 7701,
    "downs": 0,
    "score": 7701,
    "created": 1485219742.0,
    "date_created": "2017-01-23",
    "time_created": "12:02:22",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct8mhi",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I think many sensible Americans, across party lines, will be quite pleased with this. \n\nBernie Sanders has already issued a letter of praise. Not everything is black and white. You may hate Trump for X, Y, and Z but we have to proceed issue by issue. \n\n",
    "controversiality": 0,
    "ups": 263,
    "downs": 0,
    "score": 263,
    "created": 1485233744.0,
    "date_created": "2017-01-23",
    "time_created": "15:55:44",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6ijw",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I am not a fan of Donald Trump one bit but I REALLY like this. ",
    "controversiality": 0,
    "ups": 301,
    "downs": 0,
    "score": 301,
    "created": 1485231457.0,
    "date_created": "2017-01-23",
    "time_created": "15:17:37",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcsyie8",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Now stop TTIP too please ",
    "controversiality": 0,
    "ups": 489,
    "downs": 0,
    "score": 489,
    "created": 1485222756.0,
    "date_created": "2017-01-23",
    "time_created": "12:52:36",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcsxkp0",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Pulling out of TPP is good, but we do ultimately need good trade relations with the countries involved.    The US does not exist inside a bubble.",
    "controversiality": 0,
    "ups": 3140,
    "downs": 0,
    "score": 3140,
    "created": 1485221738.0,
    "date_created": "2017-01-23",
    "time_created": "12:35:38",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4rgw",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You know, maybe it's gonna be alright after all.",
    "controversiality": 0,
    "ups": 311,
    "downs": 0,
    "score": 311,
    "created": 1485229587.0,
    "date_created": "2017-01-23",
    "time_created": "14:46:27",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6npa",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Credit where credit is due. ",
    "controversiality": 0,
    "ups": 69,
    "downs": 0,
    "score": 69,
    "created": 1485231612.0,
    "date_created": "2017-01-23",
    "time_created": "15:20:12",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcsxmbf",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Good job Mr. President. I'm far from a supporter of your administration, but I have to commend you all for removing us from this flaming pile of shit agreement.",
    "controversiality": 0,
    "ups": 13967,
    "downs": 0,
    "score": 13967,
    "created": 1485221788.0,
    "date_created": "2017-01-23",
    "time_created": "12:36:28",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6jvi",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Even if you don't like President Trump, the man is going to do some legitimately good things for the country.\n\nLike every president before him, and every one after him, he's going to do some good things, and some that won't turn out so well.\n\nGive the man credit where it's due, and remain critical of him where applicable as well.",
    "controversiality": 0,
    "ups": 428,
    "downs": 0,
    "score": 428,
    "created": 1485231496.0,
    "date_created": "2017-01-23",
    "time_created": "15:18:16",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcsybk9",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I can't believe I actually agree with him\n\nTPP needed to die",
    "controversiality": 0,
    "ups": 774,
    "downs": 0,
    "score": 774,
    "created": 1485222553.0,
    "date_created": "2017-01-23",
    "time_created": "12:49:13",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct8pjg",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Good. I wasn't thrilled about his election, but this was a great move. Now redo NAFTA, legalize doja at the Federal level, revamp ACA so that we have a health insurance system that reaches everybody and won't collapse on itself, pull Federal aid for international bullshit that we have no obligation to pay...such as other countries fighter jets and abortions. Start feeding the homeless here. Start fixing the infrastructure here. Worry about America for a change. Stop policing the damn world.",
    "controversiality": 0,
    "ups": 127,
    "downs": 0,
    "score": 127,
    "created": 1485233836.0,
    "date_created": "2017-01-23",
    "time_created": "15:57:16",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct5c09",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I remember testing for how candidate's agenda lined up with your own ideals. I have 8% in line with Trump which was literally the lowest of all candidates. That doesn't mean that I'm not going to support those rare 8% things he does just because he's the one who did it.",
    "controversiality": 0,
    "ups": 220,
    "downs": 0,
    "score": 220,
    "created": 1485230194.0,
    "date_created": "2017-01-23",
    "time_created": "14:56:34",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct57qr",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 136,
    "downs": 0,
    "score": 136,
    "created": 1485230070.0,
    "date_created": "2017-01-23",
    "time_created": "14:54:30",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6nh4",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm actually happy he did this.   One point for Trump. ",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1485231605.0,
    "date_created": "2017-01-23",
    "time_created": "15:20:05",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct34uy",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Great start. \n\nMember guys, Bernie was against the TPP too.  Hillary was for it, then when Bernie was against it - Hillary changed her tone.",
    "controversiality": 0,
    "ups": 300,
    "downs": 0,
    "score": 300,
    "created": 1485227827.0,
    "date_created": "2017-01-23",
    "time_created": "14:17:07",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct094z",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Day 1, folks. We are going to unlock the mysteries of space.",
    "controversiality": 0,
    "ups": 640,
    "downs": 0,
    "score": 640,
    "created": 1485224681.0,
    "date_created": "2017-01-23",
    "time_created": "13:24:41",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcszusr",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "REMEMBER OBAMA SUPPORTED TPP.",
    "controversiality": 0,
    "ups": 1998,
    "downs": 0,
    "score": 1998,
    "created": 1485224247.0,
    "date_created": "2017-01-23",
    "time_created": "13:17:27",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4low",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Gracias, Trump.",
    "controversiality": 0,
    "ups": 262,
    "downs": 0,
    "score": 262,
    "created": 1485229412.0,
    "date_created": "2017-01-23",
    "time_created": "14:43:32",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct8rd5",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1485233890.0,
    "date_created": "2017-01-23",
    "time_created": "15:58:10",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct91b1",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1485234196.0,
    "date_created": "2017-01-23",
    "time_created": "16:03:16",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct954y",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Shout-out to the mod team for keeping this thread on-topic and discussion-rich.",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1485234312.0,
    "date_created": "2017-01-23",
    "time_created": "16:05:12",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct0tla",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Thank you Trump. Fucking Justin Trudeau was spreading Canada's ass cheeks with that agreement.",
    "controversiality": 0,
    "ups": 529,
    "downs": 0,
    "score": 529,
    "created": 1485225289.0,
    "date_created": "2017-01-23",
    "time_created": "13:34:49",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct0m3h",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I actually agree with Trump on something...",
    "controversiality": 0,
    "ups": 369,
    "downs": 0,
    "score": 369,
    "created": 1485225070.0,
    "date_created": "2017-01-23",
    "time_created": "13:31:10",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct3jxl",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Well it feels weird to like something he did.",
    "controversiality": 0,
    "ups": 146,
    "downs": 0,
    "score": 146,
    "created": 1485228287.0,
    "date_created": "2017-01-23",
    "time_created": "14:24:47",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctb62g",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1485236520.0,
    "date_created": "2017-01-23",
    "time_created": "16:42:00",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctfqxa",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1485241797.0,
    "date_created": "2017-01-23",
    "time_created": "18:09:57",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcsy0g1",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Good. I'd say, even though I don't agree with a lot of his views, he's on the right track so far...SO FAR",
    "controversiality": 0,
    "ups": 727,
    "downs": 0,
    "score": 727,
    "created": 1485222215.0,
    "date_created": "2017-01-23",
    "time_created": "12:43:35",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct3inl",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I don't like how Trump is as a person, but I voted for him because I believed he would keep his promises. This is step one. Step two is renegotiate NAFTA. Step three is term limits for Congress and the House. Four is comprehensive immigration reform (I think a wall is a bit much). Then healthcare reform, i.e. only repeal Obamacare when a better plan is ready and open up interstate insurance.\n\nI say this knowing I'll probably be downvoted to Oblivion, but I firmly believe that he will do what he said. And if he doesn't I'll be the first to show my distaste in the voters booth in 2020.\n\nEdit: I'll expand on the wall. I've always looked at the wall in a metaphorical perspective. Fund law enforcement and beef up border patrol security and in effect, create a wall. If we did wind up building one that's ok too. As far as what I think is reasonable for immigration reform. Voter ID laws. Illegal to open bank accounts, get drivers licenses, insurance, or be on welfare if illegal.\n\nEdit 2: Hey thanks everyone for all the responses! I know my ideas aren't perfect and with my job (Coil Tubing operator in the oil and gas industry) I find it hard to take the time to sift through the BS. If y'all have some reputable reading material, even if it's a different viewpoint PM me and I'll try to read it when I get time. I'm on night shift and have to get ready for work, I'll try to get back with everyone when I can.\n\nEdit 3: And here comes the hate mail. Well we had a good run of talking before it turned ugly. To those who responded thoughtfully thank you.",
    "controversiality": 0,
    "ups": 1347,
    "downs": 0,
    "score": 1347,
    "created": 1485228247.0,
    "date_created": "2017-01-23",
    "time_created": "14:24:07",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct39ef",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "theres no way in hell hillary would have done this\n\nBut i bet bernie would have",
    "controversiality": 0,
    "ups": 339,
    "downs": 0,
    "score": 339,
    "created": 1485227963.0,
    "date_created": "2017-01-23",
    "time_created": "14:19:23",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcswc74",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Good. TPP was horseshit and you know it. It was bashed on Reddit for a good year so don't even pretend to hate it just because you don't like Trump. Hillary would've supported and it would've further dissolved the integrity of our country into a smarmy gray globalist substance. \n\nEdit: thanks for the gold",
    "controversiality": 0,
    "ups": 9905,
    "downs": 0,
    "score": 9905,
    "created": 1485220357.0,
    "date_created": "2017-01-23",
    "time_created": "12:12:37",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct7no2",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "We are ALL Trumpkins on this blessed day :) ",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1485232698.0,
    "date_created": "2017-01-23",
    "time_created": "15:38:18",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct9eqf",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "+1 for fair trade!",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1485234604.0,
    "date_created": "2017-01-23",
    "time_created": "16:10:04",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctez7q",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "He was a true American hero after all! Even Sanders likes him now!",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1485240894.0,
    "date_created": "2017-01-23",
    "time_created": "17:54:54",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcto9za",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "As an Australian, I am happy to piss on the ashes of the dead TPP, only after it is long dead though, I would not want to risk putting the fire out.\nThe TPP was a steaming pile of protectionist bullshit unde the guise of a trade agreement.\nGood riddance.\n",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1485252383.0,
    "date_created": "2017-01-23",
    "time_created": "21:06:23",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct7x1k",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I love all of the positivity in this thread! It's so nice to see everyone realizing that we've done the right thing. Good job, guys.",
    "controversiality": 0,
    "ups": 77,
    "downs": 0,
    "score": 77,
    "created": 1485232979.0,
    "date_created": "2017-01-23",
    "time_created": "15:42:59",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct69s0",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 65,
    "downs": 0,
    "score": 65,
    "created": 1485231196.0,
    "date_created": "2017-01-23",
    "time_created": "15:13:16",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct41vf",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "He has a lot to prove to his country and the rest of the world and he seems serious about it. Definitely more so than the joke he was in primaries. I'm honestly excited to see what President Trump and his administration bring to this country ",
    "controversiality": 0,
    "ups": 170,
    "downs": 0,
    "score": 170,
    "created": 1485228823.0,
    "date_created": "2017-01-23",
    "time_created": "14:33:43",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctaegf",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "-",
    "controversiality": 0,
    "ups": 75,
    "downs": 0,
    "score": 75,
    "created": 1485235684.0,
    "date_created": "2017-01-23",
    "time_created": "16:28:04",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6v9n",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 87,
    "downs": 0,
    "score": 87,
    "created": 1485231839.0,
    "date_created": "2017-01-23",
    "time_created": "15:23:59",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct8nk3",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Wow, President Trump did something good...hopefully he proves the doubters wrong.\n\nEdit:\n\nNice! Downvoted for hoping for the best outcome for the future...sorry he didn't build a wall so you can complain some more...",
    "controversiality": 0,
    "ups": 84,
    "downs": 0,
    "score": 84,
    "created": 1485233775.0,
    "date_created": "2017-01-23",
    "time_created": "15:56:15",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct7b2l",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is great. I'm not American but this affects a lot of countries.",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1485232318.0,
    "date_created": "2017-01-23",
    "time_created": "15:31:58",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct8u1w",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "GOOD! This was a nightmare idea from the beginning and has been covered accross reddit over and over. It kills how politics reddit is defending it just because of how badly they hate Trump. Reveals a lot about those folks. Hate Trump? Ok. But don't let ANYONE color your OWN opinion of other issues!!",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1485233972.0,
    "date_created": "2017-01-23",
    "time_created": "15:59:32",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6oum",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "LOL - These free trade agreements are NEVER About FREE trade. The US has had free trade since 1948. These are all about enriching multinational organizations at the cost of the working class. \n\n",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1485231648.0,
    "date_created": "2017-01-23",
    "time_created": "15:20:48",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6ph2",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1485231667.0,
    "date_created": "2017-01-23",
    "time_created": "15:21:07",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct7wyb",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Whatever you want to say, he's a president who's following through on his campaign promises.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1485232976.0,
    "date_created": "2017-01-23",
    "time_created": "15:42:56",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctcxui",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1485238501.0,
    "date_created": "2017-01-23",
    "time_created": "17:15:01",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctkfuu",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "SAY IT WITH ME: \"UNDER BUDGET AND AHEAD OF SCHEDULE\".",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1485247621.0,
    "date_created": "2017-01-23",
    "time_created": "19:47:01",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct79xj",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1485232284.0,
    "date_created": "2017-01-23",
    "time_created": "15:31:24",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctl2h3",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Top comments are failing to grasp the major issue and they're hiding the point behind a raft of details.\n\nThe overarching purpose, the vision, of these international deals, is to put corporations above national laws. \n\nThey give corporations the right to litigate against national and local governments if they interfere with their market access - interference like labor rules, environmental protection, or protection of small local businesses.\n\nAnd they move decisions to non-elected and often closed door tribunals whose decisions must be accepted with out any democratic participation of citizens. \n\nIn short, these deals are not \"trade\". They are structural reengineering of the machinery of government that shifts power from elected bodies and citizens to corporations. \n\nThis is about how the people want to be governed. Do you want to continue with the Democratic experiment? Or do you want to give those powers to unelected international bodies largely functioning for international corporations and banks.",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1485248427.0,
    "date_created": "2017-01-23",
    "time_created": "20:00:27",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct9b2s",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is why I voted for him, not Clinton.\n\nShe called it the fucking gold standard.\n\nShe kicked people out of the convention for even having a sign against it.\n\nSHE WAS 100% FOR THIS, OBAMA WAS FOR THIS.\n\nThey dont care about you: just corporate donors.",
    "controversiality": 0,
    "ups": 65,
    "downs": 0,
    "score": 65,
    "created": 1485234493.0,
    "date_created": "2017-01-23",
    "time_created": "16:08:13",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct76ht",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I was just at lunch, and made a comment to the folks I was with that \"While I am giving Trump a chance, thus far, I have not been impressed\". Well, color me impressed! ",
    "controversiality": 0,
    "ups": 51,
    "downs": 0,
    "score": 51,
    "created": 1485232179.0,
    "date_created": "2017-01-23",
    "time_created": "15:29:39",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct7lyw",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 122,
    "downs": 0,
    "score": 122,
    "created": 1485232646.0,
    "date_created": "2017-01-23",
    "time_created": "15:37:26",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct0wet",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Excellent move! We don't need TPP at all",
    "controversiality": 0,
    "ups": 120,
    "downs": 0,
    "score": 120,
    "created": 1485225376.0,
    "date_created": "2017-01-23",
    "time_created": "13:36:16",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctkrec",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Wait reddit likes the TPP now?? Damn guys, way to bandwagon right off the bridge.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1485248029.0,
    "date_created": "2017-01-23",
    "time_created": "19:53:49",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctoweu",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The TPP sold jobs to SEA in exchange for enforcing IP laws in SEA. It was a direct transfer of wealth from the working class to the elites. \n\nSidenote: Sad that half this thread is censored. People being overly sensitive?",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1485253128.0,
    "date_created": "2017-01-23",
    "time_created": "21:18:48",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctp7zs",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "ALL RIGHT! WAY TO GO DONNIE!!!!!",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1485253514.0,
    "date_created": "2017-01-23",
    "time_created": "21:25:14",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcttfzy",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Thank you Mr. President, my vote it seems means something after all. Keep up the great work.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1485258739.0,
    "date_created": "2017-01-23",
    "time_created": "22:52:19",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctzark",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I hope this means Canada pulls out of the TPP. I hate that agreement. What kind of mental case makes a trade agreement that allows corporations from foreign nations to sue their country if their people don't agree with their exploits?\n\nUnder the TPP, a corporation could sue America for the people of America blocking the production of oil drills....and a company has.\n\nhttp://www.cbc.ca/news/canada/calgary/transcanada-lawsuit-keystone-xl-pipeline-1.3392446\n\nThat's NAFTA and I endorse killing the trade agreement for that very reason. Corporations should not have the power to dictate the order and magnitude permitted to the people of foreign nations. \n\nI don't even agree that Corporations should have autonomy such that they can be used to protect individuals from accountability for the poor performance of the corporation.\n\nTrump should not had been able to declare bankruptcy if he was not really bankrupt by the crash of a casino that he owned.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1485268383.0,
    "date_created": "2017-01-24",
    "time_created": "01:33:03",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct8g3h",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1485233553.0,
    "date_created": "2017-01-23",
    "time_created": "15:52:33",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct56mi",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1485230036.0,
    "date_created": "2017-01-23",
    "time_created": "14:53:56",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct9i53",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Fucking hilarious that this is posted here while /r/news is headlined by a TMZ trump article. They've rally become a censored shit show over there. ",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1485234708.0,
    "date_created": "2017-01-23",
    "time_created": "16:11:48",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct8sxj",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I truly hope you continue to be a man of your word, Mr President.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1485233938.0,
    "date_created": "2017-01-23",
    "time_created": "15:58:58",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctjja9",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm in Australia, where the TPP has essentially no benefits to 99% of the population, so anything that makes it less likely to succeed is A-OK in my book.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1485246480.0,
    "date_created": "2017-01-23",
    "time_created": "19:28:00",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct3biv",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 86,
    "downs": 0,
    "score": 86,
    "created": 1485228028.0,
    "date_created": "2017-01-23",
    "time_created": "14:20:28",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct3yxa",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Holy shit that's awesome",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1485228732.0,
    "date_created": "2017-01-23",
    "time_created": "14:32:12",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct75qf",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "and now Reddit is going to shit themselves ",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1485232156.0,
    "date_created": "2017-01-23",
    "time_created": "15:29:16",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4wga",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Not gonna lie\n\n> President Donald Trump signed an executive order formally withdrawing the United States from\n\nThis part of the headline made my heart miss a beat",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1485229736.0,
    "date_created": "2017-01-23",
    "time_created": "14:48:56",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct8n5f",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "credit where credit is due, Trump has done something on his first day in office that Obama didn't do in 8 years  \n\nnow Trump can you pass an executive order to close Guantanimo?  ",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1485233763.0,
    "date_created": "2017-01-23",
    "time_created": "15:56:03",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct776i",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Thanks Trump!\n\nFuck the TPP. \n\nFuck Globalism.",
    "controversiality": 0,
    "ups": 85,
    "downs": 0,
    "score": 85,
    "created": 1485232200.0,
    "date_created": "2017-01-23",
    "time_created": "15:30:00",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctk423",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Trump is doing some good for the country in his first few days. Can't wait for the next 8 years",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1485247208.0,
    "date_created": "2017-01-23",
    "time_created": "19:40:08",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct55ho",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You know, maybe Trump wont be so bad afterall",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1485230002.0,
    "date_created": "2017-01-23",
    "time_created": "14:53:22",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct8gym",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "My President.",
    "controversiality": 0,
    "ups": 56,
    "downs": 0,
    "score": 56,
    "created": 1485233579.0,
    "date_created": "2017-01-23",
    "time_created": "15:52:59",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcszfdy",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm sure he will make some shitty choices but I 100% support not supporting TPP.",
    "controversiality": 0,
    "ups": 54,
    "downs": 0,
    "score": 54,
    "created": 1485223774.0,
    "date_created": "2017-01-23",
    "time_created": "13:09:34",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcsz5ab",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Thank you trump for following through. Tpp deserved to be burned at the stake and the donald has made it happen, i may not overall like our new president but i support this decision wholeheartedly.",
    "controversiality": 0,
    "ups": 113,
    "downs": 0,
    "score": 113,
    "created": 1485223464.0,
    "date_created": "2017-01-23",
    "time_created": "13:04:24",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctbdit",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1485236741.0,
    "date_created": "2017-01-23",
    "time_created": "16:45:41",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctixrx",
    "parent_id": "t3_5ppzs5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "now i can torrent movies in peace\n\nfuck the tpp and hollywood can kiss my ass",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1485245737.0,
    "date_created": "2017-01-23",
    "time_created": "19:15:37",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctc1ew",
    "parent_id": "t1_dct5ei3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 111,
    "downs": 0,
    "score": 111,
    "created": 1485237470.0,
    "date_created": "2017-01-23",
    "time_created": "16:57:50",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctsw70",
    "parent_id": "t1_dctisoi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah, it's called being a human and having more than one mindset, thankfully there are enough humans in the world to keep a balance against the donkeys and elephants that only see one thing their whole life.\n\nEdit: I did a grammar.",
    "controversiality": 0,
    "ups": 482,
    "downs": 0,
    "score": 482,
    "created": 1485258012.0,
    "date_created": "2017-01-23",
    "time_created": "22:40:12",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctuhwn",
    "parent_id": "t1_dctisoi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "No doubt! I want to rag on him no matter what he does, but the TPP was one of my hot button issues! *shrug* Thanks, Donnie!",
    "controversiality": 0,
    "ups": 135,
    "downs": 0,
    "score": 135,
    "created": 1485260163.0,
    "date_created": "2017-01-23",
    "time_created": "23:16:03",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctukk6",
    "parent_id": "t1_dctisoi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Policy is the only thing that matters; it's unfortunate the media plays up bullshit that doesn't matter, otherwise he and Hillary wouldn't even be in the race",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1485260267.0,
    "date_created": "2017-01-23",
    "time_created": "23:17:47",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcszxy5",
    "parent_id": "t1_dcsvy0m",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You likely won't see a balanced answer on reddit, and frankly many will *likely* be blatantly false.  If you're interested you'll likely have to do your own research elsewhere. \n\nWikipedia does an okay piece on it, although likely not the type of flavor you're looking for.\n\nhttps://en.wikipedia.org/wiki/Trans-Pacific_Partnership\n\nedit: added one more \"likely\".  bam, take that /u/biscuits0.",
    "controversiality": 0,
    "ups": 4660,
    "downs": 0,
    "score": 4660,
    "created": 1485224344.0,
    "date_created": "2017-01-23",
    "time_created": "13:19:04",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct3gk8",
    "parent_id": "t1_dcsy4w1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "the big negative points:\n\n*it was like north american free trade agreement but more global. (the reason so many manufacturing jobs moved to mexico)\n\n*allowed corporations to sue nations over losses.\n\nEdit: * the one reddit cared about most \n>also allowed for enforcement of draconian IP protections. ",
    "controversiality": 0,
    "ups": 5677,
    "downs": 0,
    "score": 5677,
    "created": 1485228183.0,
    "date_created": "2017-01-23",
    "time_created": "14:23:03",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct46zf",
    "parent_id": "t1_dcsy4w1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 254,
    "downs": 0,
    "score": 254,
    "created": 1485228979.0,
    "date_created": "2017-01-23",
    "time_created": "14:36:19",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct459g",
    "parent_id": "t1_dcsy4w1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Sanders was opposed to this trade deal because he felt it did not put American workers in priority. I think this trade deal would have been a smart strategy to take in order to decrease Chinese influence in the Asian pacific countries.",
    "controversiality": 0,
    "ups": 597,
    "downs": 0,
    "score": 597,
    "created": 1485228926.0,
    "date_created": "2017-01-23",
    "time_created": "14:35:26",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct67cx",
    "parent_id": "t1_dcsy4w1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I did a couple hours of research a few months ago.  The best I could come up with from neutral sources was what I put below.  Read all of the bullet points though, because I didn't neatly separate this list into pros and cons (if you even can).\n\n* It is an absurdly complicated subject, so take everything with a grain of salt.\n\n* It would be like NAFTA was for mexico <--> US / Canada, but with a few major differences.  \n\n* The first major difference, is that instead of targeting trade with Mexico, the point was to target trade with south east asia.\n\n* The second major difference was that NAFTA targeted manufacturing jobs (in return for cheaper goods).  TPP targeted service level jobs, and was very explicit in which industries for which countries.\n\n* For example, for the United States, jobs in nursing and retail work were specifically targeted and expected to be strongly adversely affected, in return for significantly expanded asian market penetration for things like American automotive exports and pharmaceuticals.\n\n* How could something like nursing be exported?  Well, that actually gets to the heart of the matter.  For the United States, the point of the TPP (and its sister acts) was to greatly, greatly strengthen and enforce IP law for south east asia, to match already existing IP and trade law in the US and Europe.\n\n* So whereas right now your bank probably hires American programmers, instead of programmers from Cambodia, for purely safety and enforcement reasons, that would change tomorrow.  And with the TPP, if you are a programmer, this would adversely affect you.  But nursing was specifically targeted, as bringing SE asia more in line with HIPAA guarantees would make it legally feasible to outsource more hospital overhead offshore.\n\n* This all means you could expect major offshoring of what are right now considered reputable and secure jobs in America, and for the act to be quite transformative for the economy.  In short, if your job isn't tied to the USA, and is easy to offshore, but hasn't been for logistic, legal or economic reasons, the TPP almost certainly changed the math involved with that equation (though of course it will be different for every job / industry).\n\n**Okay, so if America is trading away good jobs in entire industries, what does it get in return?**\n\n* Right now, if you are a large business that wants to get into Asian markets, you have two problems.  1) If you open in China, there's a good chance your designs will be eventually be stolen and given to a Chinese company, which the Chinese government will then later support at your expense.  And 2) The rest of SE asia has similar problems to varying degrees, and they all trade with China.\n\n* Additionally, right now Europe's economy is looking dead for the foreseeable future.  And since America isn't spending money jumpstarting our own economy, we're not likely to grow at a large rate any time soon either.\n\n* But asian economies are booming.  And as they do so, they are trading with each other, and making trade deals with each other that don't include us.  And that's a major disadvantage for America and Europe.\n\n* So the purpose of the TPP, from a western viewpoint, is to get SE asia into the same economic and legal framework as the western world, and open their markets to western companies.  \n\n* The second purpose of the TPP, is to get China to play ball too.  Right now, if we tell China to open their markets, and enforce western IP law, they'll laugh in our face (and do so).  We don't have the bartering chips for that deal.  But if the rest of SE asia is already doing so with the West, and builds their economies around such laws, then 15-20 years from now, it won't just be Europe / USA telling China to open their markets and enforce international IP law, it will be the vast majority of China's trading partners.  In short, it would be an economic coup d'etat for western powers, that would bring a _lot_ of money to large western companies and give Washington much more power in Asia.  If you are a citizen of the west, this is almost certainly a good thing.\n\n* So Obama and Clinton's bet, is that if we don't make a deal like the TPP, then Chinese (and by extension SE asian) companies are going to spring up as international competitors to American firms anyway.  And that increased competition represents lost profits that could otherwise have been made by western companies trading in China.  So by trading those jobs to outsourcing now, the US would be in a much more dominant position later, and it is worth the trade.\n\n**Okay, is that line of thinking valid?**\n\nYes and No.\n\n* If you are a CEO, or a powerful washington person.  Then yes, unequivocally.  The TPP means continued western and American worldwide economic hegemony and should be strongly fought for.  EU / USA firms cannot do business in China.  That's a major economic disadvantage for any western firm playing on that level.\n\n* For people who's jobs are not offshored, then yes, this is probably a good plan.  Just like NAFTA resulted in cheaper goods, TPP should result in cheaper services across the board.  \n\n* But if your job can be offshored (and the list of offshorable jobs the TPP will make cost effective to offshore is large), then it is more complicated.\n\n* If the USA had a real economic safety net, and put forward programs towards retraining and revitalizing areas specifically hit by offshoring and globalization, then you could vote for the TPP confidently.  This, for example is how the scandanavian countries handled integration into the EU, and overall there are very few cases of real economic hardship as the result of that integration.  Overall, it was a success story.\n\n* But after NAFTA, the USA implemented no such programs, whatsoever.  Economists at the time, believed them to be unnecessary.  The thinking was, that if free trade agreements resulted in more trade, which resulted in more jobs, then people who lost their jobs to outsourcing should have no difficulty finding new jobs in a free market.\n\n* The reality was that outsourcing resulted in chain effects whereby entire regions of the country lost all their good jobs, and the good jobs that remained moved to other US locations.  Combined with the fact that many people woke up one day to find that their entire career was no longer employable in their home country, meant that they simply could not find new work.  Add in again Greenspan's attempts to 'lower worker mobility to increase American labor competitiveness', and the end result is that today, in 2017, many families that lost their jobs due to nafta STILL are not employed.\n\nSo at the end of the day, you have to make a call.  Do you think that America will be like Scandanavia, and reinvest a portion of the profits reaped by greater access to Asian markets on economic growth, unemployment benefits, worker retraining and government programs?  Or do you think that America will call those things socialism, ignore the problem, and allow large companies to reap the economic rewards unmolested?\n\nPersonally, I fall into the second category, so I am very, very happy to see the TPP fail.  I think that given the second viewpoint, outsourcing service level jobs, in THIS economy, would be a death sentence for many, many people.  But that said, if you think that the first option is a possibility, then the TPP should be strongly supported.  And really, in an ideal world, if we could trust that America would take care of the people who would be harmed by the outsourcing, then we would want the TPP to pass, because increased trade and American competitiveness in the future is something that should be encouraged and worked towards.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1485231123.0,
    "date_created": "2017-01-23",
    "time_created": "15:12:03",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct8m8i",
    "parent_id": "t1_dct75ux",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 273,
    "downs": 0,
    "score": 273,
    "created": 1485233736.0,
    "date_created": "2017-01-23",
    "time_created": "15:55:36",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct8wdg",
    "parent_id": "t1_dct75ux",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 200,
    "downs": 0,
    "score": 200,
    "created": 1485234043.0,
    "date_created": "2017-01-23",
    "time_created": "16:00:43",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctc5u2",
    "parent_id": "t1_dct75ux",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Great write-up, thanks for posting this.\n\nJust to add a couple of important points:\n\n- Free trade only works *in principle* (ignoring lots of practical difficulties) to the benefit of all when you have free movement of both capital AND labor. We have this among states within the US, for example, and it's part of the secret to the US's historical economic susccess.\n- TPP would do nothing to help labor move, and so like the rest of globalization based solely on freedom of capital movement alone, it would continue to benefit only the capital class (i.e. rich shareholders) and screw workers both at home and abroad - and therefore fall short of most of its promised benefits.\n- TPP's aspirations to create working property rights regimes (i.e. where copyright and other IP is protected) were probably delusional. Enforcing copyright requires a working legal apparatus to support courts and litigation, and the only country in Asia that has anything approaching this is Japan (and *maybe* S. Korea). Creating such apparatus and enforcing IP would destroy a substantial portion of the manufacturing economy in virtually every SE Asian country, which would in turn make the shit at Walmart that the US imports from these countries by the boatload much more expensive. So the incentives are aligned entirely against this.\n- The only leverage the US has over SE Asia is as an importer. So either the US makes good on protectionist threats (like what Trump is making) to put huge tarrifs on everything coming out of Asia as a penalty for ignoring IP law (and environmental law, and child labor law, etc, etc.), or every country will just continue ignoring all of that law even if it's on the books. TPP probably would not have had much if any impact unless it was backed up by threats with real teeth, which it wasn't.",
    "controversiality": 0,
    "ups": 736,
    "downs": 0,
    "score": 736,
    "created": 1485237607.0,
    "date_created": "2017-01-23",
    "time_created": "17:00:07",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct8y2j",
    "parent_id": "t1_dct75ux",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Thanks for adding such a substantive post. I think you summed up the viewpoint from an American perspective extremely well. I agree strongly with most of your points, though I find myself falling more on the support side despite our seeming inability to provide proper adjustments and safety nets. \n\nThe economic and security ramifications of ceding US and Western economic influence in East Asia is a major mistake from my opinion and the sinking of this deal will cause serious long term negatives for US power on the world stage. Of course, that doesn't negate your perspective, which is valid. Ideally I want people to start railing against the inability of our politicians to reform our economic system to compete in a global economy and stop railing against free trade. Demand trade adjustment and retraining programs. Demand a more sensible tax code and effective safety net. \n\nBlaming free trade and globalization, which I believe are inevitable and mostly desirable, will put us further behind when we should be moving forward. That is my major issue with the current brand of populism. It wants to manipulate market forces and economic development instead of providing the support necessary for transition. \n\nEdit: a couple of words",
    "controversiality": 0,
    "ups": 2636,
    "downs": 0,
    "score": 2636,
    "created": 1485234097.0,
    "date_created": "2017-01-23",
    "time_created": "16:01:37",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct88ax",
    "parent_id": "t1_dct75ux",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 103,
    "downs": 0,
    "score": 103,
    "created": 1485233319.0,
    "date_created": "2017-01-23",
    "time_created": "15:48:39",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctbnmx",
    "parent_id": "t1_dct75ux",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> in an ideal world, if we could trust that America would take care of the people who would be harmed by the outsourcing, then we would want the TPP to pass, because increased trade and American competitiveness in the future is something that should be encouraged and worked towards\n\nSadly, I think this is why the TPP isn't viable; I don't think the American government will adopt this step. As it is now we aren't even facing the fact that workers are being displaced by a shift from a manufacturing to a service economy, much less jobs being \"offshored\" to Asia, if you will",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1485237047.0,
    "date_created": "2017-01-23",
    "time_created": "16:50:47",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctakn8",
    "parent_id": "t1_dct75ux",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Just to correct something, your bank isn't hiring American programmers. They're importing H1B immigrants to do the jobs as contractors. \n\nSource: 1 parent and 1 SOs parent in recruiting. The American to H1B ratio for jobs has been shrinking for a few years now, and is only gaining speed at this point in time. ",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1485235871.0,
    "date_created": "2017-01-23",
    "time_created": "16:31:11",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct2ikh",
    "parent_id": "t1_dcszdeq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 2452,
    "downs": 0,
    "score": 2452,
    "created": 1485227147.0,
    "date_created": "2017-01-23",
    "time_created": "14:05:47",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct2r8s",
    "parent_id": "t1_dcszdeq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 305,
    "downs": 0,
    "score": 305,
    "created": 1485227413.0,
    "date_created": "2017-01-23",
    "time_created": "14:10:13",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct7mpq",
    "parent_id": "t1_dct5mqy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 85,
    "downs": 0,
    "score": 85,
    "created": 1485232669.0,
    "date_created": "2017-01-23",
    "time_created": "15:37:49",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct7osu",
    "parent_id": "t1_dct5mqy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1485232733.0,
    "date_created": "2017-01-23",
    "time_created": "15:38:53",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctdgg5",
    "parent_id": "t1_dct6apb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Bernie was also against the TPP. It is interesting where Trump and Bernie agree Hilary and Obama disagree. ",
    "controversiality": 0,
    "ups": 508,
    "downs": 0,
    "score": 508,
    "created": 1485239106.0,
    "date_created": "2017-01-23",
    "time_created": "17:25:06",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct3oyf",
    "parent_id": "t1_dct2v2y",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 1199,
    "downs": 0,
    "score": 1199,
    "created": 1485228436.0,
    "date_created": "2017-01-23",
    "time_created": "14:27:16",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct5ztv",
    "parent_id": "t1_dct2v2y",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "He's got that for him that he doesn't fuck around.",
    "controversiality": 0,
    "ups": 194,
    "downs": 0,
    "score": 194,
    "created": 1485230899.0,
    "date_created": "2017-01-23",
    "time_created": "15:08:19",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct7gbk",
    "parent_id": "t1_dct2v2y",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Isn't it odd that it is now commendable for politicians to do what they promised? ",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1485232475.0,
    "date_created": "2017-01-23",
    "time_created": "15:34:35",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctb1nu",
    "parent_id": "t1_dct6gz8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "He's talking about a healthcare plan that will \"cover all Americans\" and \"give the government power to negotiate prices.\" He refuses to say \"single payer\" but he just might give us the upset of the decade.",
    "controversiality": 0,
    "ups": 433,
    "downs": 0,
    "score": 433,
    "created": 1485236386.0,
    "date_created": "2017-01-23",
    "time_created": "16:39:46",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctbcsa",
    "parent_id": "t1_dct6gz8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1485236720.0,
    "date_created": "2017-01-23",
    "time_created": "16:45:20",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct7kmj",
    "parent_id": "t1_dct5zn0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1485232605.0,
    "date_created": "2017-01-23",
    "time_created": "15:36:45",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6b82",
    "parent_id": "t1_dct5zn0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 128,
    "downs": 0,
    "score": 128,
    "created": 1485231239.0,
    "date_created": "2017-01-23",
    "time_created": "15:13:59",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct8qo2",
    "parent_id": "t1_dct52lc",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's almost as if people give the man a chance to do good things instead of immediately hating him before he gets in office that he'll actually get things done.",
    "controversiality": 0,
    "ups": 226,
    "downs": 0,
    "score": 226,
    "created": 1485233870.0,
    "date_created": "2017-01-23",
    "time_created": "15:57:50",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct43a6",
    "parent_id": "t1_dct2phw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 346,
    "downs": 0,
    "score": 346,
    "created": 1485228865.0,
    "date_created": "2017-01-23",
    "time_created": "14:34:25",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4mrk",
    "parent_id": "t1_dct2phw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 92,
    "downs": 0,
    "score": 92,
    "created": 1485229445.0,
    "date_created": "2017-01-23",
    "time_created": "14:44:05",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4r3q",
    "parent_id": "t1_dct2phw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 119,
    "downs": 0,
    "score": 119,
    "created": 1485229577.0,
    "date_created": "2017-01-23",
    "time_created": "14:46:17",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct3ktn",
    "parent_id": "t1_dct2phw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 156,
    "downs": 0,
    "score": 156,
    "created": 1485228314.0,
    "date_created": "2017-01-23",
    "time_created": "14:25:14",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct5r9f",
    "parent_id": "t1_dct2phw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 125,
    "downs": 0,
    "score": 125,
    "created": 1485230649.0,
    "date_created": "2017-01-23",
    "time_created": "15:04:09",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct66dt",
    "parent_id": "t1_dct2phw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 61,
    "downs": 0,
    "score": 61,
    "created": 1485231094.0,
    "date_created": "2017-01-23",
    "time_created": "15:11:34",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4zow",
    "parent_id": "t1_dct2phw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1485229831.0,
    "date_created": "2017-01-23",
    "time_created": "14:50:31",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct5ror",
    "parent_id": "t1_dct2phw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1485230661.0,
    "date_created": "2017-01-23",
    "time_created": "15:04:21",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct3l6b",
    "parent_id": "t1_dcsxcsy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's a good strategic move. It's one of his first moves as President so he does something that appeals more broadly across the political spectrum. If he started with a far right proposal, he'd upset the left voting population. Doing this makes the voting block have a good first impression of him (even to his non-supporters).",
    "controversiality": 0,
    "ups": 456,
    "downs": 0,
    "score": 456,
    "created": 1485228325.0,
    "date_created": "2017-01-23",
    "time_created": "14:25:25",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct51tn",
    "parent_id": "t1_dcsxcsy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 100,
    "downs": 0,
    "score": 100,
    "created": 1485229894.0,
    "date_created": "2017-01-23",
    "time_created": "14:51:34",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6vrd",
    "parent_id": "t1_dcsxcsy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "that was kinda the premise behind most of his campaign promises.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1485231854.0,
    "date_created": "2017-01-23",
    "time_created": "15:24:14",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcswbqh",
    "parent_id": "t1_dcsvsk2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Which is more than i can say for myself.",
    "controversiality": 0,
    "ups": 3241,
    "downs": 0,
    "score": 3241,
    "created": 1485220343.0,
    "date_created": "2017-01-23",
    "time_created": "12:12:23",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcsyag4",
    "parent_id": "t1_dcsvsk2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Actually more - he froze federal hiring with certain exceptions (military, public safety).",
    "controversiality": 0,
    "ups": 915,
    "downs": 0,
    "score": 915,
    "created": 1485222519.0,
    "date_created": "2017-01-23",
    "time_created": "12:48:39",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcsyfp4",
    "parent_id": "t1_dcsvsk2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "he started re-negotiating NAFTA. his ~~brother~~son in law is going to meet canadian cabinet ministers soon to start the renegotiation.  \n\nsay what you want about Trump, but he sure works swiftly.  \n\nEDIT: wrong family member",
    "controversiality": 0,
    "ups": 1504,
    "downs": 0,
    "score": 1504,
    "created": 1485222676.0,
    "date_created": "2017-01-23",
    "time_created": "12:51:16",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct1r2c",
    "parent_id": "t1_dcsvsk2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And I never liked the TPP, so I'm okay with this.",
    "controversiality": 0,
    "ups": 225,
    "downs": 0,
    "score": 225,
    "created": 1485226300.0,
    "date_created": "2017-01-23",
    "time_created": "13:51:40",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctd1ab",
    "parent_id": "t1_dct6ijw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You don't have to like him as a person to like his policies. ",
    "controversiality": 0,
    "ups": 190,
    "downs": 0,
    "score": 190,
    "created": 1485238613.0,
    "date_created": "2017-01-23",
    "time_created": "17:16:53",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctfv7f",
    "parent_id": "t1_dct6ijw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Not a fan of him either but when he passes policies helping the American people, we should support him fully.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1485241939.0,
    "date_created": "2017-01-23",
    "time_created": "18:12:19",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct17f5",
    "parent_id": "t1_dcsyie8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Add TP to the list!!",
    "controversiality": 0,
    "ups": 100,
    "downs": 0,
    "score": 100,
    "created": 1485225709.0,
    "date_created": "2017-01-23",
    "time_created": "13:41:49",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct3vmf",
    "parent_id": "t1_dcsyie8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1485228633.0,
    "date_created": "2017-01-23",
    "time_created": "14:30:33",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4v0r",
    "parent_id": "t1_dcsyie8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Europe already killed TTIP.\n\nWe're just not into the US the way you guys want to think.",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1485229694.0,
    "date_created": "2017-01-23",
    "time_created": "14:48:14",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcsycut",
    "parent_id": "t1_dcsxkp0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "An opinion that isn't left or right? Someone who doesn't pick sides? A guy who actually considers things? Am I in heaven or /u/HighOnGoofballs?",
    "controversiality": 0,
    "ups": 1550,
    "downs": 0,
    "score": 1550,
    "created": 1485222592.0,
    "date_created": "2017-01-23",
    "time_created": "12:49:52",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct42ch",
    "parent_id": "t1_dcsxkp0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I feel that regardless of TPP Trump will strengthen ties with Japan, which is a natural stronghold against China's power.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1485228837.0,
    "date_created": "2017-01-23",
    "time_created": "14:33:57",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct369j",
    "parent_id": "t1_dcsxkp0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Just watched Spicer's press conference LIVE where he said Trump prefers bilateral trade agreements and that the administration is not for blocking free and fair trade but want to negotiate better terms for American industry and the American worker. (loosely paraphrasing)",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1485227869.0,
    "date_created": "2017-01-23",
    "time_created": "14:17:49",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct7evy",
    "parent_id": "t1_dct4rgw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I kept saying that either he will be a good OR average president.\n\nTrump is a douchebag, but that has nothing to do with being a good politician. Elon Musk and Steve Jobs, as far as I know, are/were also douchebags but they are/were good at their job.\n\nI also never thought he is racist or sexist, he is just a rude douchebag.",
    "controversiality": 0,
    "ups": 69,
    "downs": 0,
    "score": 69,
    "created": 1485232434.0,
    "date_created": "2017-01-23",
    "time_created": "15:33:54",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcsz3tv",
    "parent_id": "t1_dcsxmbf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is one. I'm interested if he will impose term limits on congress as promised is the other one.",
    "controversiality": 0,
    "ups": 3730,
    "downs": 0,
    "score": 3730,
    "created": 1485223420.0,
    "date_created": "2017-01-23",
    "time_created": "13:03:40",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct3a18",
    "parent_id": "t1_dcsxmbf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I was actually wondering if reddit would pull a 180 and defend TPP because Trump killed it",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1485227981.0,
    "date_created": "2017-01-23",
    "time_created": "14:19:41",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctd2w5",
    "parent_id": "t1_dct6jvi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's hard when all our favourite shows keep endlessly repeating how horrible he is. \n\nFrankly I hope this stops soon. I can't take four years of Samantha Bee and Colbert making fun of every single thing he does.",
    "controversiality": 0,
    "ups": 151,
    "downs": 0,
    "score": 151,
    "created": 1485238665.0,
    "date_created": "2017-01-23",
    "time_created": "17:17:45",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct3us9",
    "parent_id": "t1_dcsybk9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You'd be surprised if you dig in. He has some good ideas and some bad ideas. Either way, we're only a few days in and there has already been 31 strikes on ISIS & TPP has been killed. So far, so good. ",
    "controversiality": 0,
    "ups": 76,
    "downs": 0,
    "score": 76,
    "created": 1485228609.0,
    "date_created": "2017-01-23",
    "time_created": "14:30:09",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct8sda",
    "parent_id": "t1_dct8pjg",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Wow. Well done. Way to actually make logical suggestions as opposed to just saying \"it's broke\". Thank you. ",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1485233921.0,
    "date_created": "2017-01-23",
    "time_created": "15:58:41",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcte324",
    "parent_id": "t1_dct5c09",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1485239841.0,
    "date_created": "2017-01-23",
    "time_created": "17:37:21",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct5cag",
    "parent_id": "t1_dct57qr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 83,
    "downs": 0,
    "score": 83,
    "created": 1485230203.0,
    "date_created": "2017-01-23",
    "time_created": "14:56:43",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct9g49",
    "parent_id": "t1_dct6nh4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "10 points for GRIFFENDORE!",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1485234646.0,
    "date_created": "2017-01-23",
    "time_created": "16:10:46",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctenms",
    "parent_id": "t1_dct34uy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "bernie actually came out with a statement today praising trump for it and says he is willing to work with trump more on stuff like this. obviously trump and bernie's differences lie with the social politics more than anything",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1485240519.0,
    "date_created": "2017-01-23",
    "time_created": "17:48:39",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct41f4",
    "parent_id": "t1_dct094z",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 378,
    "downs": 0,
    "score": 378,
    "created": 1485228809.0,
    "date_created": "2017-01-23",
    "time_created": "14:33:29",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct2xa5",
    "parent_id": "t1_dct094z",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "We already know the mitochondria is the powerhouse of the cell, how much more could there possibly be to figure out?",
    "controversiality": 0,
    "ups": 151,
    "downs": 0,
    "score": 151,
    "created": 1485227598.0,
    "date_created": "2017-01-23",
    "time_created": "14:13:18",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct0vwd",
    "parent_id": "t1_dcszusr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The Gold Standard",
    "controversiality": 0,
    "ups": 762,
    "downs": 0,
    "score": 762,
    "created": 1485225360.0,
    "date_created": "2017-01-23",
    "time_created": "13:36:00",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct396u",
    "parent_id": "t1_dcszusr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "How can we forget. You put it in all capital letters. ",
    "controversiality": 0,
    "ups": 258,
    "downs": 0,
    "score": 258,
    "created": 1485227956.0,
    "date_created": "2017-01-23",
    "time_created": "14:19:16",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct0ede",
    "parent_id": "t1_dcszusr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 174,
    "downs": 0,
    "score": 174,
    "created": 1485224841.0,
    "date_created": "2017-01-23",
    "time_created": "13:27:21",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6dc8",
    "parent_id": "t1_dct4low",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "De nada, wey.",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1485231301.0,
    "date_created": "2017-01-23",
    "time_created": "15:15:01",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct9jky",
    "parent_id": "t1_dct8rd5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's going to happen. Everyone hated Andrew Jackson and Teddy Roosevelt.  The leaders of their day thought they were charlatans and that the world had just ended. People boycotted Lincoln's inauguration after he failed to win the popular vote. \n\nSound familiar?",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1485234752.0,
    "date_created": "2017-01-23",
    "time_created": "16:12:32",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4hok",
    "parent_id": "t1_dct0tla",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 114,
    "downs": 0,
    "score": 114,
    "created": 1485229293.0,
    "date_created": "2017-01-23",
    "time_created": "14:41:33",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4wx5",
    "parent_id": "t1_dct0tla",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And Obama was lubing it up.",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1485229750.0,
    "date_created": "2017-01-23",
    "time_created": "14:49:10",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct57w2",
    "parent_id": "t1_dct0tla",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This only sort of falls on Trudeau. It was negotiated before he took office, and he didn't outright ratify it while potentially showing support. It's probably dead now though, no reason to join if the US doesn't.",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1485230074.0,
    "date_created": "2017-01-23",
    "time_created": "14:54:34",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct654y",
    "parent_id": "t1_dct0m3h",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I mean, he literally came out against TPP in the beginning. He praised Bernie for being a voice of reason in the DNC for being against it. ",
    "controversiality": 0,
    "ups": 96,
    "downs": 0,
    "score": 96,
    "created": 1485231058.0,
    "date_created": "2017-01-23",
    "time_created": "15:10:58",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct3d2k",
    "parent_id": "t1_dct0m3h",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "With politics it is important to remember that we agree with politicians on most things. Donald and Hillary both agree murder is immoral for instance. Differences mostly stem from how to fix things and less about what the problem is. ",
    "controversiality": 0,
    "ups": 81,
    "downs": 0,
    "score": 81,
    "created": 1485228076.0,
    "date_created": "2017-01-23",
    "time_created": "14:21:16",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4uhj",
    "parent_id": "t1_dct0m3h",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You might feel a lot of that in the next 4 years, as it turns out the boogeyman image the media slandered him as isn't entirely true.",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1485229677.0,
    "date_created": "2017-01-23",
    "time_created": "14:47:57",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct70j1",
    "parent_id": "t1_dct3jxl",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's almost like.. you were lied to by the media for a year in an effort to get the other person elected.",
    "controversiality": 0,
    "ups": 57,
    "downs": 0,
    "score": 57,
    "created": 1485231999.0,
    "date_created": "2017-01-23",
    "time_created": "15:26:39",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctbeay",
    "parent_id": "t1_dctb62g",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1485236765.0,
    "date_created": "2017-01-23",
    "time_created": "16:46:05",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcsyjpi",
    "parent_id": "t1_dcsy0g1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "He was the DNC's pick all along, we've been bamboozeled again.",
    "controversiality": 0,
    "ups": 291,
    "downs": 0,
    "score": 291,
    "created": 1485222797.0,
    "date_created": "2017-01-23",
    "time_created": "12:53:17",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4sid",
    "parent_id": "t1_dct3inl",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And that's how it's supposed to work. We speak with our votes.",
    "controversiality": 0,
    "ups": 290,
    "downs": 0,
    "score": 290,
    "created": 1485229618.0,
    "date_created": "2017-01-23",
    "time_created": "14:46:58",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct5ysh",
    "parent_id": "t1_dct3inl",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "What often gets lost is people are permitted to vote for the person whose policies they feel are best for the country. That's not necessarily the same as voting for the nicest person. \n\nTrump the individual is abhorrent in his mannerism. But I wasn't voting for who I'd want to be my pal. ",
    "controversiality": 0,
    "ups": 62,
    "downs": 0,
    "score": 62,
    "created": 1485230870.0,
    "date_created": "2017-01-23",
    "time_created": "15:07:50",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct58vb",
    "parent_id": "t1_dct3inl",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You're missing a crucial next step: change his mind on climate change and listen to the science. ",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1485230103.0,
    "date_created": "2017-01-23",
    "time_created": "14:55:03",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4ax5",
    "parent_id": "t1_dct3inl",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "honestly not trying to instigate or troll or anything. I'm genuinely curious and figured I'd take the opportunity to speak directly to a trump supporter that seems to be a reasonable human being: \n\nhow do you feel about his promise to drain the swamp vs. his cabinet picks?\n\nAnd how do you feel about his tax returns?\n\nEdit: rip inbox",
    "controversiality": 0,
    "ups": 76,
    "downs": 0,
    "score": 76,
    "created": 1485229097.0,
    "date_created": "2017-01-23",
    "time_created": "14:38:17",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct7uq5",
    "parent_id": "t1_dct39ef",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Hilary would have let the issue die off from public attention, then basically pass the same thing through various back channels, executive and department rules that were on page 182, sub-paragraph C, of some other headline law. \n\nAt least this full on puts an end to it, hopefully you see more of this when congress gets all weasily and tries to put shit like SOPA, net neutraliry, and other earmark fat into bills. \n\n",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1485232911.0,
    "date_created": "2017-01-23",
    "time_created": "15:41:51",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct47mq",
    "parent_id": "t1_dct39ef",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 221,
    "downs": 0,
    "score": 221,
    "created": 1485228998.0,
    "date_created": "2017-01-23",
    "time_created": "14:36:38",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcswrfg",
    "parent_id": "t1_dcswc74",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This. TPP was literally The Devil here on Reddit. Now, everybody seems to like it. \n\nLook at this thread on r/documentary with 17k upvotes from just 5 months ago.\n\n[The nightmare of TPP, TTIP, TISA explained. (2016) A short video from WikiLeaks about the globalists' strategy to undermine democracy by transferring sovereignty from nations to trans-national corporations.](https://np.reddit.com/r/Documentaries/comments/4vsqmr/the_nightmare_of_tpp_ttip_tisa_explained_2016_a/)",
    "controversiality": 0,
    "ups": 2990,
    "downs": 0,
    "score": 2990,
    "created": 1485220834.0,
    "date_created": "2017-01-23",
    "time_created": "12:20:34",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcszs8q",
    "parent_id": "t1_dcswc74",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Honestly, most people probably don't have the knowledge or experience to know if the TPP is good or bad. \n\nAll that most people can do is compare which politicians and institutions have been for or against the TPP (and why they felt that way). And possibly which politicians and institutions have been for or against similar trade deals. Maybe they can compare similarities between deals, however different economic situations might affect those comparisons and make them completely bogus.\n\nI know I can't pick out good information on the TPP from bad information. I just don't know enough about international trade/ macroeconomics to detect BS. And I know that this is a cloudy issue; it would be very difficult for me to know what is a nuanced claim and what is a poor extrapolation of facts. \n\nTrump has shown me that he is a poor user of facts. Anti-Vax, anti climate change, the cyber... I know more about those subjects, I don't think that his narrative is a good representation of the truth. So that does make me more supportive of TPP.\n\nI generally like the idea of diplomacy and deals, so I am generally someone more supportive of something like the TPP.\n\nBut I couldn't recognize a great trade deal from a decent trade deal, so I'm not going to weight in. I wish other people would join me in doing so. They just look like idiots if they change position because of politics.\n\nJust look at Hilary Clinton with TPP, or Republicans on Russia. (Russia gets more aggressive over the last 4 years, but a change in politics means that Republicans are treating them like they are less aggressive?)\n\nSo yeah, definitely laugh at those who change position, but don't blame them for it. I'm sure that you have changed position of something once you learned more about it or once it was liked by someone you dislike.",
    "controversiality": 0,
    "ups": 556,
    "downs": 0,
    "score": 556,
    "created": 1485224168.0,
    "date_created": "2017-01-23",
    "time_created": "13:16:08",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcsxwo4",
    "parent_id": "t1_dcswc74",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Hillary claimed to be against it after winning the Primary. Whether or not she would have taken action is unknowable now.",
    "controversiality": 0,
    "ups": 128,
    "downs": 0,
    "score": 128,
    "created": 1485222099.0,
    "date_created": "2017-01-23",
    "time_created": "12:41:39",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6hho",
    "parent_id": "t1_dct69s0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 77,
    "downs": 0,
    "score": 77,
    "created": 1485231425.0,
    "date_created": "2017-01-23",
    "time_created": "15:17:05",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6zb0",
    "parent_id": "t1_dct41vf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "What if he really makes America great again? ",
    "controversiality": 0,
    "ups": 121,
    "downs": 0,
    "score": 121,
    "created": 1485231962.0,
    "date_created": "2017-01-23",
    "time_created": "15:26:02",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct91xc",
    "parent_id": "t1_dct7lyw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1485234215.0,
    "date_created": "2017-01-23",
    "time_created": "16:03:35",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4ern",
    "parent_id": "t1_dct3biv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1485229209.0,
    "date_created": "2017-01-23",
    "time_created": "14:40:09",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct3gh5",
    "parent_id": "t1_dct3biv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1485228181.0,
    "date_created": "2017-01-23",
    "time_created": "14:23:01",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctcndo",
    "parent_id": "t1_dct75qf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Supposedly r/politics has become pro-TPP overnight. Bless their hearts.",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1485238162.0,
    "date_created": "2017-01-23",
    "time_created": "17:09:22",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctcto9",
    "parent_id": "t1_dct4wga",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "A. NATO\n\nB. UN\n\nC. TPP\n\nD. Solar System",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1485238366.0,
    "date_created": "2017-01-23",
    "time_created": "17:12:46",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct7myz",
    "parent_id": "t1_dct55ho",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "that's the spirit!",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1485232678.0,
    "date_created": "2017-01-23",
    "time_created": "15:37:58",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctu79r",
    "parent_id": "t1_dctsw70",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Those donkeys and elephants are the loudest, unfortunately",
    "controversiality": 0,
    "ups": 89,
    "downs": 0,
    "score": 89,
    "created": 1485259743.0,
    "date_created": "2017-01-23",
    "time_created": "23:09:03",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6oy6",
    "parent_id": "t1_dcszxy5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I did a couple hours of research a few months ago.  The best I could come up with from neutral sources was what I put below.  Read all of the bullet points though, because I didn't neatly separate this list into pros and cons (if you even can).\n\n* It is an absurdly complicated subject, so take everything with a grain of salt.\n\n* It would be like NAFTA was for mexico <--> US / Canada, but with a few major differences.  \n\n* The first major difference, is that instead of targeting trade with Mexico, the point was to target trade with south east asia.\n\n* The second major difference was that NAFTA targeted manufacturing jobs (in return for cheaper goods).  TPP targeted service level jobs, and was very explicit in which industries for which countries.\n\n* For example, for the United States, jobs in nursing and retail work were specifically targeted and expected to be strongly adversely affected, in return for significantly expanded asian market penetration for things like American automotive exports and pharmaceuticals.\n\n* How could something like nursing be exported?  Well, that actually gets to the heart of the matter.  For the United States, the point of the TPP (and its sister acts) was to greatly, greatly strengthen and enforce IP law for south east asia, to match already existing IP and trade law in the US and Europe.\n\n* So whereas right now your bank probably hires American programmers, instead of programmers from Cambodia, for purely safety and enforcement reasons, that would change tomorrow.  And with the TPP, if you are a programmer, this would adversely affect you.  But nursing was specifically targeted, as bringing SE asia more in line with HIPAA guarantees would make it legally feasible to outsource more hospital overhead offshore.\n\n* This all means you could expect major offshoring of what are right now considered reputable and secure jobs in America, and for the act to be quite transformative for the economy.  In short, if your job isn't tied to the USA, and is easy to offshore, but hasn't been for logistic, legal or economic reasons, the TPP almost certainly changed the math involved with that equation (though of course it will be different for every job / industry).\n\n**Okay, so if America is trading away good jobs in entire industries, what does it get in return?**\n\n* Right now, if you are a large business that wants to get into Asian markets, you have two problems.  1) If you open in China, there's a good chance your designs will be eventually be stolen and given to a Chinese company, which the Chinese government will then later support at your expense.  And 2) The rest of SE asia has similar problems to varying degrees, and they all trade with China.\n\n* Additionally, right now Europe's economy is looking dead for the foreseeable future.  And since America isn't spending money jumpstarting our own economy, we're not likely to grow at a large rate any time soon either.\n\n* But asian economies are booming.  And as they do so, they are trading with each other, and making trade deals with each other that don't include us.  And that's a major disadvantage for America and Europe.\n\n* So the purpose of the TPP, from a western viewpoint, is to get SE asia into the same economic and legal framework as the western world, and open their markets to western companies.  \n\n* The second purpose of the TPP, is to get China to play ball too.  Right now, if we tell China to open their markets, and enforce western IP law, they'll laugh in our face (and do so).  We don't have the bartering chips for that deal.  But if the rest of SE asia is already doing so with the West, and builds their economies around such laws, then 15-20 years from now, it won't just be Europe / USA telling China to open their markets and enforce international IP law, it will be the vast majority of China's trading partners.  In short, it would be an economic coup d'etat for western powers, that would bring a _lot_ of money to large western companies and give Washington much more power in Asia.  If you are a citizen of the west, this is almost certainly a good thing.\n\n* So Obama and Clinton's bet, is that if we don't make a deal like the TPP, then Chinese (and by extension SE asian) companies are going to spring up as international competitors to American firms anyway.  And that increased competition represents lost profits that could otherwise have been made by western companies trading in China.  So by trading those jobs to outsourcing now, the US would be in a much more dominant position later, and it is worth the trade.\n\n**Okay, is that line of thinking valid?**\n\nYes and No.\n\n* If you are a CEO, or a powerful washington person.  Then yes, unequivocally.  The TPP means continued western and American worldwide economic hegemony and should be strongly fought for.  EU / USA firms cannot do business in China.  That's a major economic disadvantage for any western firm playing on that level.\n\n* For people who's jobs are not offshored, then yes, this is probably a good plan.  Just like NAFTA resulted in cheaper goods, TPP should result in cheaper services across the board.  \n\n* But if your job can be offshored (and the list of offshorable jobs the TPP will make cost effective to offshore is large), then it is more complicated.\n\n* If the USA had a real economic safety net, and put forward programs towards retraining and revitalizing areas specifically hit by offshoring and globalization, then you could vote for the TPP confidently.  This, for example is how the scandanavian countries handled integration into the EU, and overall there are very few cases of real economic hardship as the result of that integration.  Overall, it was a success story.\n\n* But after NAFTA, the USA implemented no such programs, whatsoever.  Economists at the time, believed them to be unnecessary.  The thinking was, that if free trade agreements resulted in more trade, which resulted in more jobs, then people who lost their jobs to outsourcing should have no difficulty finding new jobs in a free market.\n\n* The reality was that outsourcing resulted in chain effects whereby entire regions of the country lost all their good jobs, and the good jobs that remained moved to other US locations.  Combined with the fact that many people woke up one day to find that their entire career was no longer employable in their home country, meant that they simply could not find new work.  Add in again Greenspan's attempts to 'lower worker mobility to increase American labor competitiveness', and the end result is that today, in 2017, many families that lost their jobs due to nafta STILL are not employed.\n\nSo at the end of the day, you have to make a call.  Do you think that America will be like Scandanavia, and reinvest a portion of the profits reaped by greater access to Asian markets on economic growth, unemployment benefits, worker retraining and government programs?  Or do you think that America will call those things socialism, ignore the problem, and allow large companies to reap the economic rewards unmolested?\n\nPersonally, I fall into the second category, so I am very, very happy to see the TPP fail.  I think that given the second viewpoint, outsourcing service level jobs, in THIS economy, would be a death sentence for many, many people.  But that said, if you think that the first option is a possibility, then the TPP should be strongly supported.  And really, in an ideal world, if we could trust that America would take care of the people who would be harmed by the outsourcing, then we would want the TPP to pass, because increased trade and American competitiveness in the future is something that should be encouraged and worked towards.",
    "controversiality": 0,
    "ups": 8851,
    "downs": 0,
    "score": 8851,
    "created": 1485231651.0,
    "date_created": "2017-01-23",
    "time_created": "15:20:51",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct348p",
    "parent_id": "t1_dcszxy5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 770,
    "downs": 0,
    "score": 770,
    "created": 1485227808.0,
    "date_created": "2017-01-23",
    "time_created": "14:16:48",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct47h1",
    "parent_id": "t1_dcszxy5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This should be a bot reply to anything submitted to r/politics, news, worldnews, and ELI5 that contains certain keywords.  ",
    "controversiality": 0,
    "ups": 351,
    "downs": 0,
    "score": 351,
    "created": 1485228994.0,
    "date_created": "2017-01-23",
    "time_created": "14:36:34",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6wzr",
    "parent_id": "t1_dcszxy5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Say likely one more time.",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1485231891.0,
    "date_created": "2017-01-23",
    "time_created": "15:24:51",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4kcf",
    "parent_id": "t1_dcszxy5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "**I'd be careful** with wikipedia on anything less than 10, maybe even 20, years old. **Especially with something controversial**.\n\nEDIT: Bolded for ephasis since people are acting like I said \"Wikipedia is always wrong and completely worthless!\"",
    "controversiality": 0,
    "ups": 61,
    "downs": 0,
    "score": 61,
    "created": 1485229371.0,
    "date_created": "2017-01-23",
    "time_created": "14:42:51",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct46ka",
    "parent_id": "t1_dct3gk8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Also a huge expansion in copyright time and expectations of enforcement that come off a bit...extreme.",
    "controversiality": 0,
    "ups": 1359,
    "downs": 0,
    "score": 1359,
    "created": 1485228967.0,
    "date_created": "2017-01-23",
    "time_created": "14:36:07",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct3zmg",
    "parent_id": "t1_dct3gk8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Wasn't there indications that Comcast, Verizon, and other telecom companies had huge influence in the writing too? Not sure if I'm getting it right.",
    "controversiality": 0,
    "ups": 496,
    "downs": 0,
    "score": 496,
    "created": 1485228752.0,
    "date_created": "2017-01-23",
    "time_created": "14:32:32",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct3tm8",
    "parent_id": "t1_dct3gk8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> *allowed corporations to sue nations over losses.\n\nthis is what makes it so fucking dumb",
    "controversiality": 0,
    "ups": 3620,
    "downs": 0,
    "score": 3620,
    "created": 1485228575.0,
    "date_created": "2017-01-23",
    "time_created": "14:29:35",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct46bn",
    "parent_id": "t1_dct3gk8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 125,
    "downs": 0,
    "score": 125,
    "created": 1485228959.0,
    "date_created": "2017-01-23",
    "time_created": "14:35:59",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4uts",
    "parent_id": "t1_dct459g",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Iirc, china is not part of the TTP. So decreasing China influence would definitely be a big part of the deal.\n\nQuick edit: a few have already said china plans on putting forth their own trade deal. This article mentions it's a 16 nation deal and obviously has been in the works well before trump signed the withdrawal today.\n\nhttps://www.google.com/amp/s/amp.smh.com.au/world/china-eyes-opportunity-as-us-pulls-out-of-transpacific-partnership-20170123-gtxbi1.html?client=safari",
    "controversiality": 0,
    "ups": 217,
    "downs": 0,
    "score": 217,
    "created": 1485229688.0,
    "date_created": "2017-01-23",
    "time_created": "14:48:08",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctj1cc",
    "parent_id": "t1_dctc5u2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">Enforcing copyright requires a working legal apparatus to support courts and litigation\n\n\nThis is probably the most important point. Only megacorps like Apple who make billions will be able to grind the gears of an Asian Nation's feeble court system and actually get a case to trail. Everyone else will be in the same boat they're in now.",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1485245862.0,
    "date_created": "2017-01-23",
    "time_created": "19:17:42",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcth9fk",
    "parent_id": "t1_dctc5u2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "So as per your 3rd bullet, Trump saying no to the TPP may help keep prices low on imports while protecting those jobs mentioned in the TPP, potentially avoiding more economic turmoil for family's? \n\nAs per your 4th bullet, the TPP was more international politics as a showboat than anything with substantial weight? \n\n\nSide note. Swype on SwiftKey has decided to Swype every other word. So many grammatical errors and wrong words were made. ",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1485243650.0,
    "date_created": "2017-01-23",
    "time_created": "18:40:50",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcthkw6",
    "parent_id": "t1_dctc5u2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> when you have free movement of both capital AND labor\n\nWhy does this never seem to come up and yet is a central tenant to open borders?",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1485244045.0,
    "date_created": "2017-01-23",
    "time_created": "18:47:25",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctct2z",
    "parent_id": "t1_dct8y2j",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> Demand trade adjustment and retraining programs. Demand a more sensible tax code and effective safety net. \n\nIt is is worth noting that by and large this is what Obama/Clinton (and most democrats) support. Build wealth through free trade, then redistribute it through social programs, such as public education and healthcare. This is one of my biggest issues with Sanders, is that he drove it into the heads of millions of uninformed voters that free trade agreements are always bad. Generating wealth for your country is good, provided you then use that wealth in an effective manner. The problem is Republicans in congress who adamantly oppose any such measures. ",
    "controversiality": 0,
    "ups": 576,
    "downs": 0,
    "score": 576,
    "created": 1485238346.0,
    "date_created": "2017-01-23",
    "time_created": "17:12:26",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctbw0c",
    "parent_id": "t1_dct8y2j",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> Ideally I want people to start railing against the inability of our politicians to reform our economic system to compete in a global economy and stop railing against free trade. Demand trade adjustment and retraining programs. Demand a more sensible tax code and effective safety net.\n\nThis is especially true because in the long term, the effects of globalization will happen *anyway*, as OP mentioned. The government can't protect you indefinitely from globalization and automation and all that other jazz. Tearing up the TPP helps in the short term, but ultimately we are going to need those other things. \n\nAnd I don't think Trump's party is going to get us there. ",
    "controversiality": 0,
    "ups": 56,
    "downs": 0,
    "score": 56,
    "created": 1485237300.0,
    "date_created": "2017-01-23",
    "time_created": "16:55:00",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctdwn1",
    "parent_id": "t1_dctakn8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "H1B is pretty horribly abused, and even at its core is a pretty awful program (though it started with good intents), yes you are right.  But that's a different issue :)",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1485239629.0,
    "date_created": "2017-01-23",
    "time_created": "17:33:49",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct2wzs",
    "parent_id": "t1_dct2ikh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 832,
    "downs": 0,
    "score": 832,
    "created": 1485227589.0,
    "date_created": "2017-01-23",
    "time_created": "14:13:09",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct43vy",
    "parent_id": "t1_dct2r8s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 146,
    "downs": 0,
    "score": 146,
    "created": 1485228884.0,
    "date_created": "2017-01-23",
    "time_created": "14:34:44",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct346s",
    "parent_id": "t1_dct2r8s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 182,
    "downs": 0,
    "score": 182,
    "created": 1485227807.0,
    "date_created": "2017-01-23",
    "time_created": "14:16:47",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctdne4",
    "parent_id": "t1_dctdgg5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Bernie is honest to a fault. A real liberal. I remember in 2008 when Ron Paul ran for Congress and one of his closest friends was Dennis Kucinich. 100% polar opposites in every policy, but united in one important way. Both were honest politicians. Which is so rare they became friends.",
    "controversiality": 0,
    "ups": 154,
    "downs": 0,
    "score": 154,
    "created": 1485239330.0,
    "date_created": "2017-01-23",
    "time_created": "17:28:50",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4dy5",
    "parent_id": "t1_dct3oyf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 1515,
    "downs": 0,
    "score": 1515,
    "created": 1485229185.0,
    "date_created": "2017-01-23",
    "time_created": "14:39:45",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctds9c",
    "parent_id": "t1_dctb1nu",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "inb4 Trump dominates the youth demographic in 2020\n",
    "controversiality": 0,
    "ups": 298,
    "downs": 0,
    "score": 298,
    "created": 1485239485.0,
    "date_created": "2017-01-23",
    "time_created": "17:31:25",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcti3tx",
    "parent_id": "t1_dctb1nu",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I am conservative and I would give up my left nut for single payer.\n\n(*not literally, I am attached to my left nut, but you get the idea of how strongly I feel about it*)",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1485244700.0,
    "date_created": "2017-01-23",
    "time_created": "18:58:20",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctj0sg",
    "parent_id": "t1_dct8qo2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This reignites what little hope I still have. Seeing his cabinet picks is a struggle, as most of them are garbage people for these positions, but I learned a lot from my dad. Even though he didn't vote for Obama either time, he still respected him and accepted him as the democratically elected president.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1485245843.0,
    "date_created": "2017-01-23",
    "time_created": "19:17:23",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct651b",
    "parent_id": "t1_dct4mrk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1485231055.0,
    "date_created": "2017-01-23",
    "time_created": "15:10:55",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct667b",
    "parent_id": "t1_dct4r3q",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1485231089.0,
    "date_created": "2017-01-23",
    "time_created": "15:11:29",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6cv3",
    "parent_id": "t1_dct5r9f",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 104,
    "downs": 0,
    "score": 104,
    "created": 1485231287.0,
    "date_created": "2017-01-23",
    "time_created": "15:14:47",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6qkc",
    "parent_id": "t1_dct3l6b",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 332,
    "downs": 0,
    "score": 332,
    "created": 1485231697.0,
    "date_created": "2017-01-23",
    "time_created": "15:21:37",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcsxgqw",
    "parent_id": "t1_dcswbqh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Same to me. My new year resolutions are all dead. ",
    "controversiality": 0,
    "ups": 1280,
    "downs": 0,
    "score": 1280,
    "created": 1485221614.0,
    "date_created": "2017-01-23",
    "time_created": "12:33:34",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct21n4",
    "parent_id": "t1_dcswbqh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Same here. I haven't even been in office one day.",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1485226627.0,
    "date_created": "2017-01-23",
    "time_created": "13:57:07",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct260u",
    "parent_id": "t1_dcsyag4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Ironically, federal hiring freezes [_increase_ federal spending](http://www.gao.gov/products/FPCD-82-21), because they result in more work being done by contractors. Since this was discovered, no president has tried to use a hiring freeze to constrain federal spending.\n\nTrump is different, because he cares more about how he is perceived by his supporters than how much the government actually spends.",
    "controversiality": 0,
    "ups": 868,
    "downs": 0,
    "score": 868,
    "created": 1485226761.0,
    "date_created": "2017-01-23",
    "time_created": "13:59:21",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct06gz",
    "parent_id": "t1_dcsyfp4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is what I'm really interested in. Let's see how it goes.",
    "controversiality": 0,
    "ups": 318,
    "downs": 0,
    "score": 318,
    "created": 1485224600.0,
    "date_created": "2017-01-23",
    "time_created": "13:23:20",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcszi0f",
    "parent_id": "t1_dcsyfp4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I guess one reason is because he's a businessman instead of a politician?",
    "controversiality": 0,
    "ups": 842,
    "downs": 0,
    "score": 842,
    "created": 1485223854.0,
    "date_created": "2017-01-23",
    "time_created": "13:10:54",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcteboj",
    "parent_id": "t1_dctd1ab",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah. Big difference. I love Obama personally but disagree on several of his policies. ",
    "controversiality": 0,
    "ups": 122,
    "downs": 0,
    "score": 122,
    "created": 1485240127.0,
    "date_created": "2017-01-23",
    "time_created": "17:42:07",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctg620",
    "parent_id": "t1_dctd1ab",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's one thing that has always bothered me about the way that campaigns are run: we act as though *liking* the President is actually a factor.  I don't personally give a flying fuck if they're the most unlikeable person on the planet.  I'm not having them over for a beer any time soon.  I care about them effectively running my country and being savvy diplomats.",
    "controversiality": 0,
    "ups": 69,
    "downs": 0,
    "score": 69,
    "created": 1485242308.0,
    "date_created": "2017-01-23",
    "time_created": "18:18:28",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct1yei",
    "parent_id": "t1_dct17f5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 135,
    "downs": 0,
    "score": 135,
    "created": 1485226528.0,
    "date_created": "2017-01-23",
    "time_created": "13:55:28",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct7nxi",
    "parent_id": "t1_dct17f5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Frighteningly relevant username.",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1485232707.0,
    "date_created": "2017-01-23",
    "time_created": "15:38:27",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcsyfeb",
    "parent_id": "t1_dcsycut",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Anyone who agrees with everything a politician does, or disagrees with everything a different politician does, is not a supporter, but a fanboy.",
    "controversiality": 0,
    "ups": 1529,
    "downs": 0,
    "score": 1529,
    "created": 1485222667.0,
    "date_created": "2017-01-23",
    "time_created": "12:51:07",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6mf0",
    "parent_id": "t1_dcsycut",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "A safe opinion literally everyone agrees with?\n\nGive me a break, nothing profound or original was said here. ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1485231575.0,
    "date_created": "2017-01-23",
    "time_created": "15:19:35",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct04o9",
    "parent_id": "t1_dcsz3tv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Passing term limits is a Don Quixotian task. They've been promising it for years and I don't see it ever happening. I don't even think it would make a big difference if it did happen. All it would do is turn lawmakers into lobbyists faster. \n\nEdit: by popular demand the correct term should be 'quixotic'. ",
    "controversiality": 0,
    "ups": 1866,
    "downs": 0,
    "score": 1866,
    "created": 1485224547.0,
    "date_created": "2017-01-23",
    "time_created": "13:22:27",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct11kc",
    "parent_id": "t1_dcsz3tv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "To impose a term limit on Congress would probably require an amendment to the constitution. An amendment needs two-thirds agreement by both the House and the Senate, plus three-fourths of the states.\n\nEdit: Got the percentages wrong",
    "controversiality": 0,
    "ups": 55,
    "downs": 0,
    "score": 55,
    "created": 1485225532.0,
    "date_created": "2017-01-23",
    "time_created": "13:38:52",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct07y2",
    "parent_id": "t1_dcsz3tv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm pretty sure he can't do this on his own.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1485224644.0,
    "date_created": "2017-01-23",
    "time_created": "13:24:04",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctosth",
    "parent_id": "t1_dctd2w5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I choose not to watch those shows because of how toxicly partisan they are.",
    "controversiality": 0,
    "ups": 33,
    "downs": 0,
    "score": 33,
    "created": 1485253006.0,
    "date_created": "2017-01-23",
    "time_created": "21:16:46",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcteu8t",
    "parent_id": "t1_dctd2w5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I had to stop watching a lot of these shows because they just can't keep it in their pants when it comes to Trump, that and it was revealed Colbert was taking orders from the DNC.",
    "controversiality": 0,
    "ups": 70,
    "downs": 0,
    "score": 70,
    "created": 1485240735.0,
    "date_created": "2017-01-23",
    "time_created": "17:52:15",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctlzd9",
    "parent_id": "t1_dctd2w5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> I can't take four years of Samantha Bee and Colbert making fun of every single thing he does.\n\nUnfortunately they won't stop. This is what is meant when they refer to the \"liberal media\".",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1485249557.0,
    "date_created": "2017-01-23",
    "time_created": "20:19:17",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctm7ni",
    "parent_id": "t1_dctd2w5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "They're just asshurt that he made *every last one of them* look like an idiot when he won.",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1485249843.0,
    "date_created": "2017-01-23",
    "time_created": "20:24:03",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6cqq",
    "parent_id": "t1_dct3us9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": " > there has already been 31 strikes on ISIS\n\nOh, fuck.",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1485231283.0,
    "date_created": "2017-01-23",
    "time_created": "15:14:43",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctfvgg",
    "parent_id": "t1_dcte324",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Wanting him to fail is like hoping the pilot of your plane crashes because you don't like him.",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1485241947.0,
    "date_created": "2017-01-23",
    "time_created": "18:12:27",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct69a3",
    "parent_id": "t1_dct5cag",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1485231182.0,
    "date_created": "2017-01-23",
    "time_created": "15:13:02",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6efm",
    "parent_id": "t1_dct41f4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "He's building an iron man suit for the president. ",
    "controversiality": 0,
    "ups": 56,
    "downs": 0,
    "score": 56,
    "created": 1485231333.0,
    "date_created": "2017-01-23",
    "time_created": "15:15:33",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct5gyg",
    "parent_id": "t1_dct41f4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Fingers crossed for better electric car infrastructure.",
    "controversiality": 0,
    "ups": 132,
    "downs": 0,
    "score": 132,
    "created": 1485230343.0,
    "date_created": "2017-01-23",
    "time_created": "14:59:03",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct72ql",
    "parent_id": "t1_dct41f4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Elon Musk is actually on Trump's board of advisors. So they will be more often than many ppl may think.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1485232066.0,
    "date_created": "2017-01-23",
    "time_created": "15:27:46",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct3vdw",
    "parent_id": "t1_dct2xa5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The sun is the powerhouse of the solar system.",
    "controversiality": 0,
    "ups": 22,
    "downs": 0,
    "score": 22,
    "created": 1485228626.0,
    "date_created": "2017-01-23",
    "time_created": "14:30:26",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctby0t",
    "parent_id": "t1_dct4hok",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "\"if china kills our economy, we win.\"\n\n-justin, probably",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1485237362.0,
    "date_created": "2017-01-23",
    "time_created": "16:56:02",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctcnb5",
    "parent_id": "t1_dct654y",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "but CNN never told its viewers that",
    "controversiality": 0,
    "ups": 85,
    "downs": 0,
    "score": 85,
    "created": 1485238160.0,
    "date_created": "2017-01-23",
    "time_created": "17:09:20",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct7kja",
    "parent_id": "t1_dct3d2k",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1485232602.0,
    "date_created": "2017-01-23",
    "time_created": "15:36:42",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct04ff",
    "parent_id": "t1_dcsyjpi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Pretty sure the DNC wanted TPP",
    "controversiality": 0,
    "ups": 323,
    "downs": 0,
    "score": 323,
    "created": 1485224539.0,
    "date_created": "2017-01-23",
    "time_created": "13:22:19",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct64fb",
    "parent_id": "t1_dct4sid",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I spoke. I want the things in my comment. If he shirks then I'll vote against him. ",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1485231036.0,
    "date_created": "2017-01-23",
    "time_created": "15:10:36",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6ppm",
    "parent_id": "t1_dct58vb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I want this as well! I think that's where we come in. Climate change is real and is an issue, and this is coming from and Oilfield Worker!",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1485231673.0,
    "date_created": "2017-01-23",
    "time_created": "15:21:13",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct5ftb",
    "parent_id": "t1_dct4ax5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Not the biggest fan. Ole Devos I think was a horrible pick. Perry is an exceptional leader but I'm not a fan of his climate denial. Now General Mattis, literally could not have picked someone better. I need to look into his other cabinet members more deeply. It's been a hectic couple weeks at work. I'm sure some will piss me off and others I'll like.\n\nHe should give us his tax returns.\n\nEdit: couldn't of to could not have because grammar is hard.",
    "controversiality": 0,
    "ups": 93,
    "downs": 0,
    "score": 93,
    "created": 1485230310.0,
    "date_created": "2017-01-23",
    "time_created": "14:58:30",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct59z1",
    "parent_id": "t1_dct4ax5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "His cabinet picks make no sense if you see them as continuing the mission of that department. They make much more sense if you see the picks as proactively reducing the size and scope of that department. They are moves towards a reduction in government bloat, inefficiency, status quo, and corruptive stagnation.",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1485230136.0,
    "date_created": "2017-01-23",
    "time_created": "14:55:36",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcsyclf",
    "parent_id": "t1_dcswrfg",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> This. TPP was literally The Devil here on Reddit. Now, everybody seems to like it.\n\nI never know what to think about these things.\n\nWhen you listen to others you find out that everything is somehow always 100% bad *and* 100% good. ",
    "controversiality": 0,
    "ups": 436,
    "downs": 0,
    "score": 436,
    "created": 1485222584.0,
    "date_created": "2017-01-23",
    "time_created": "12:49:44",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcsy6lz",
    "parent_id": "t1_dcswrfg",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Where are you seeing people supporting TPP? I thought reddit was unanimous in their hatred of it. ",
    "controversiality": 0,
    "ups": 344,
    "downs": 0,
    "score": 344,
    "created": 1485222400.0,
    "date_created": "2017-01-23",
    "time_created": "12:46:40",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct2eqp",
    "parent_id": "t1_dcszs8q",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I like this comment. I'm a Bernie-crat but honestly I've heard some nuance about TPP. For instance, that it's either us or China that's gonna make a trade pact in that region, so if it's not us, we lose out on having those trade partners. \n\nI'm worried that Trump's approach to trade and keeping jobs in the US is just gonna accelerate automation. At that point, the TPP becomes irrelevant as far as jobs are concerned, so then what was the point of losing out on those trade partners and export deals.",
    "controversiality": 0,
    "ups": 114,
    "downs": 0,
    "score": 114,
    "created": 1485227031.0,
    "date_created": "2017-01-23",
    "time_created": "14:03:51",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcte8sb",
    "parent_id": "t1_dct6zb0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "A successful Trump presidency is a liberal's worst nightmare",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1485240030.0,
    "date_created": "2017-01-23",
    "time_created": "17:40:30",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct8xmm",
    "parent_id": "t1_dct6zb0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah, no, that guy said something once that I read about on salon and it was pretty fucking horrendous and triggering so fuck you and fuck Donald Drumpf!\n\n/r/politics",
    "controversiality": 0,
    "ups": 56,
    "downs": 0,
    "score": 56,
    "created": 1485234083.0,
    "date_created": "2017-01-23",
    "time_created": "16:01:23",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctqwz0",
    "parent_id": "t1_dctcndo",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Holy crap is that subreddit a crap hole. Wow.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1485255548.0,
    "date_created": "2017-01-23",
    "time_created": "21:59:08",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctvloz",
    "parent_id": "t1_dctu79r",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "According to Google, the loudest animal is in fact the blue whale.  Or maybe the tiger pistol shrimp.  Or the sperm whale.  As with politics, you get to choose which internet source to believe...",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1485261776.0,
    "date_created": "2017-01-23",
    "time_created": "23:42:56",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctuy4o",
    "parent_id": "t1_dct6oy6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I shared this post with my dad, who has spent 1-2 months in China per year over the last decade managing manufacturing and distribution of products for the US market. His response (emphasis mine):\n\n> Honestly, I didn’t understand TPP to this granular level, so thanks for sharing.\n>  \n> The problem with this thinking is that it presumes linear, short term behavior on part of China, which is 180 degrees from the way they always behave.  US thinks in quarters, China thinks in quarter-centuries, or longer.  They always play the long game.  **There is no advantage to them to allow a level playing field, as they believe over the long term, they will pivot their economy to mostly domestic consumption based**, rather than the current export base, and do not need to allow US to attempt to gain footing in their markets.\n>  \n> **This “give now to get later” scheme has never worked well and is purely western style thinking.**  This is exactly what China loves about us, we’re very predictable and they think about their economy very geo-politically, or militaristically.  Based on this, I have to fall squarely against TPP.  Our own motives will get used against us.\n>  \n> I also don’t agree at all that we have no chips to play now, although they’d be very painful chips to play out.  **We are their largest trading partner, by far – this is the advantage we hold today that we may not hold in 5-10 years.**  if US was willing to suffer a jump in prices here for the average consumer good, then we may be able to hurt them enough to play the game by our rules and open their markets.  This may well actually have to occur to cause movement in China.  This is exactly the game Trump is threatening to play, and it’s a high risk play.  **Although I hate the guy, here is one area where his balls might work to our advantage – or fuck up the global economy for decades and spin the US into a recession overnight.  I’d call this 50/50.**  He may be able to browbeat his suppliers and banks in the US, but now he’s dealing with a national identity.",
    "controversiality": 0,
    "ups": 262,
    "downs": 0,
    "score": 262,
    "created": 1485260807.0,
    "date_created": "2017-01-23",
    "time_created": "23:26:47",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct9qps",
    "parent_id": "t1_dct6oy6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Now that ladies and gentlemen, is a reply \n",
    "controversiality": 0,
    "ups": 704,
    "downs": 0,
    "score": 704,
    "created": 1485234968.0,
    "date_created": "2017-01-23",
    "time_created": "16:16:08",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct9qdi",
    "parent_id": "t1_dct6oy6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Excellent objective (as objective as anyone can be given the complexity of the subject matter) analysis.\n\nPerhaps 5 - 10 years ago, I would have been all in on the comparative advantages of TPP and the dynamic capacity of the economy and its laborforce to adapt.  This was even with the nagging declines in real wages for the last couple of decades but were offset by women entering the laborforce creating two income households.\n\nBut so much has structurally changed since then. TPP thus became a plan created by the wealthy FOR THE BENEFIT OF THE WEALTHY...and the perhaps 20% of the population with advanced skills and abilities, but at the expense of the vast majority of the general population.\n\nMajor wtf momements were: So democrats, the traditional party of the blue collar worker now wants to throw them under the bus for greater returns in the creative content and tech fields?  So republicans, the traditional party of corporate CEOs and laissez faire economics now wants to pursue protectionist policies to curb globalization and restore domestic manufacturing for the benefit of blue collar workers?  The then the biggest wtf of all is the traditional bases on each side simply elected to alter their personal ideology rather than change their party affiliation.  ",
    "controversiality": 0,
    "ups": 643,
    "downs": 0,
    "score": 643,
    "created": 1485234958.0,
    "date_created": "2017-01-23",
    "time_created": "16:15:58",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct841e",
    "parent_id": "t1_dct6oy6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 161,
    "downs": 0,
    "score": 161,
    "created": 1485233192.0,
    "date_created": "2017-01-23",
    "time_created": "15:46:32",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcta02d",
    "parent_id": "t1_dct6oy6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">If the USA had a real economic safety net, and put forward programs towards retraining and revitalizing areas specifically hit by offshoring and globalization, then you could vote for the TPP confidently. This, for example is how the scandanavian countries handled integration into the EU, and overall there are very few cases of real economic hardship as the result of that integration. Overall, it was a success story.\n\nThis is my biggest problem with republican policies, people are unable to afford to retrain and they think \"it's not the governments job to deal with your education and training\". This is a problem that's going to happen no matter what as we replace labor with machines.  Manufacturing is not decreasing, but the number of manufacturing jobs are.",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1485235252.0,
    "date_created": "2017-01-23",
    "time_created": "16:20:52",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctebsk",
    "parent_id": "t1_dct6oy6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">Do you think that America will be like Scandanavia, and reinvest a portion of the profits reaped by greater access to Asian markets on economic growth, unemployment benefits, worker retraining and government programs? Or do you think that America will call those things socialism, ignore the problem, and allow large companies to reap the economic rewards unmolested?\n\nIt seems like there's been a larger pattern of the latter, historically. Is there anything at all that might lead us to believe the government will invest in retraining and such? Especially with a conservative-dominated legislature and a republican president. I'm not going to act like I know how a lot of the government works, I'm still in school. It just seems like, given the circumstances, our government will continue to favor big business and label these needed programs as socialism.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1485240131.0,
    "date_created": "2017-01-23",
    "time_created": "17:42:11",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctkcad",
    "parent_id": "t1_dct6oy6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's part of a bigger longer narrative too:\n\n**Chip:** Whoa, wages are like 10c an hour in China and other poor countries! Let's move our  manufacturing there! We'll save trillions! \n\n**Todd:** That'll make manufactured stuff cheaper, but millions of Americans will lose their manufacturing jobs!\n\n**Chip**: Sure, their crappy, low-wage, dangerous, unhealthy, mind-numbing factory-drone jobs. But we'll save so much money, we can use some of it to help out those guys, and still be ahead! We can give out retirements, benefits, maybe a basic income, subsidise education and training! Americans can gradually move into less horrible work! Still way cheaper than keeping those jobs here. And with goods being so much cheaper, they could all take a pay cut and still be better off.\n\n**Todd:** So mostly we re-train those workers? To do what?\n\n**Chip:** How about a nice cushy office job? Over time, Americans can get more educated, and do more office-type work instead. Improve processes. Design products. Make movies, music, art, games. Software. Ideas. Funner, safer, work. More interesting work. *Intellectual* work.\n\n**Todd:** But China and the developing countries will just copy it all! They already just steal all those designs and processes. They pirate that stuff. We won't be as rich!\n\n**Chip:** OK then - how about we do a free trade agreement every few years. Each time we give them more access to manufacture stuff for us, but, in return, we sneak in tighter Intellectual Property laws! Then we can still get paid for doing all the fun work. They can get paid to manufacture stuff. Everyone is better off!\n\n\n(It's not even a bad idea, and is actually working in some first-world countries. Except that Americans are extremely right-wing and have an almost hysterical socialism phobia, so the rich and powerful haven't allowed much of that re-training, education, benefits, basic income and stuff they were supposed to do for all those Americans who lost their jobs. As a result, everyone is worse off, even the rich, even though they have more money in their bank accounts now). ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1485247493.0,
    "date_created": "2017-01-23",
    "time_created": "19:44:53",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctrfr5",
    "parent_id": "t1_dct6oy6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Great post man. This was probably the least biased explanation someone could come up with, so kudos to you for that.  For the record I am with you on tpp sucking but I also think automation is gonna kill a hell of a lot more jobs than anything else and we're still not prepared for that. \n\nThe jobs not automated are outsourced, and the pool of new jobs created are not big enough to handle displaced workers or their families. \n\nImagine entire logistics and transportation workers wiped out and replaced with automated vehicles and boats. \n\n\nTaxi cabs, and bus services are generally an area that covers the working poor and lower middle class. Those jobs are being upended by uber drivers, and those uber drivers will have their jobs upended by ubers automated fleet. The phone app pay thing is just to get around existing taxi license laws in the same airbnb is unlicensed hotels. \n\nThey're hella useful on the consumer end but not the displacement of workers end. \n\nWe still haven't decided on UBI's efficacy yet (Finlands experiments not withstanding) in a post resource economy that may rapidly come about as a result of automation and the development of AI (could kill us or solve our organisational and structural problems with non zero sum solutions). \n\nI can see a lot of ways that the poorest and hardest to retrain get fucked over if there is no living wage so I'm skeptical about the potential pluses outweighing the massive minuses. \n\nFurthermore I can see Ubi being used as a political tool by successive governments as people get weaned onto having it, you might end up having to exchange more freedoms in return for keeping your living wages increasing at the rate they would be increased.\n\nI can also see a world where mass automation may lead to cars that you can't drive on your own, or that you have only a list of preapproved destinations your self driving car can travel too.  All rights and freedoms restricted 'in the interest of yours and others safety'. \n\nNo random trip to the beach, last minute change on an empty road making a dodgy uturn because no one is around.  No stopping a car near an accident to quickly save someone's life.  No choice.  With choice comes risk.  Taking away rights minimises risk but also autonomy. Automation reduces personal autonomy paradoxically.        ",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1485256195.0,
    "date_created": "2017-01-23",
    "time_created": "22:09:55",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct47cv",
    "parent_id": "t1_dct348p",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 235,
    "downs": 0,
    "score": 235,
    "created": 1485228990.0,
    "date_created": "2017-01-23",
    "time_created": "14:36:30",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6bzy",
    "parent_id": "t1_dct47h1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> This should be a bot reply to anything submitted to ~~r/politics, news, worldnews, and ELI5~~ any political subreddit that contains ~~certain key~~words.",
    "controversiality": 0,
    "ups": 177,
    "downs": 0,
    "score": 177,
    "created": 1485231262.0,
    "date_created": "2017-01-23",
    "time_created": "15:14:22",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct8ykw",
    "parent_id": "t1_dct6wzr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "see edit.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1485234112.0,
    "date_created": "2017-01-23",
    "time_created": "16:01:52",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct642p",
    "parent_id": "t1_dct4kcf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Waaay better than asking reddit... and wasn't going to offer up what I think are better sources, but are also sources that are clearly in support of the TPP...",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1485231025.0,
    "date_created": "2017-01-23",
    "time_created": "15:10:25",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6mtz",
    "parent_id": "t1_dct46ka",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm trying to recall, isn't this also the trade deal that had some ridiculous power stretch that people into media were worried would infringe on and make it slightly illegal to do things such as cosplay?",
    "controversiality": 0,
    "ups": 646,
    "downs": 0,
    "score": 646,
    "created": 1485231587.0,
    "date_created": "2017-01-23",
    "time_created": "15:19:47",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct7z1z",
    "parent_id": "t1_dct46ka",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The worrying part of the TPP was also that it forced nations to adopt and expand criminal punishment for IP infringement.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1485233042.0,
    "date_created": "2017-01-23",
    "time_created": "15:44:02",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct46hf",
    "parent_id": "t1_dct3zmg",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Every huge player had influence, the hilarious part is they had greater access than the politicians who were to decide about it. ",
    "controversiality": 0,
    "ups": 675,
    "downs": 0,
    "score": 675,
    "created": 1485228964.0,
    "date_created": "2017-01-23",
    "time_created": "14:36:04",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct47rz",
    "parent_id": "t1_dct3tm8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And it's actually not entirely true, so there's that",
    "controversiality": 0,
    "ups": 177,
    "downs": 0,
    "score": 177,
    "created": 1485229003.0,
    "date_created": "2017-01-23",
    "time_created": "14:36:43",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct3xvy",
    "parent_id": "t1_dct3tm8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The fact that ISDS is entirely misconstrued by the vast majority of people is what's so fucking dumb ",
    "controversiality": 0,
    "ups": 684,
    "downs": 0,
    "score": 684,
    "created": 1485228701.0,
    "date_created": "2017-01-23",
    "time_created": "14:31:41",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4pth",
    "parent_id": "t1_dct46bn",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> Democrats are pro-free trade and Republicans are anti-free trade, what a world.\n\nYeah holy shit what a switcheroo",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1485229538.0,
    "date_created": "2017-01-23",
    "time_created": "14:45:38",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct70ox",
    "parent_id": "t1_dct46bn",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> This is a ridiculous oversimplification of NAFTA and its results. It is literally a bullshit talking point.\n\n100% agree. Only 12% of manufacturing jobs were lost to ALL trade. Are some of those due to NAFTA? Sure, but the net benefits (lower priced goods, other non manufacturing jobs) far outweigh the cost. \n\nThe other 88% of jobs that didn't go obsolete were lost to automation. Unless we want to pretend robots don't exist, we likely aren't getting those jobs back no matter what.",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1485232004.0,
    "date_created": "2017-01-23",
    "time_created": "15:26:44",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct5hvs",
    "parent_id": "t1_dct4uts",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "What he means is that in light of our withdrawal, the door is now open for China to construct their own global trade deal, complete with rules beneficial to them, and drafted without our input.\n\nThe big issue most people have with withdrawing support for the TPP, is that for the first time since WWII America will not be writing the global economic rules. It signals a shift is the global economy, and people are fearful that China will take the reigns in our absence. \n",
    "controversiality": 0,
    "ups": 300,
    "downs": 0,
    "score": 300,
    "created": 1485230370.0,
    "date_created": "2017-01-23",
    "time_created": "14:59:30",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctoc3w",
    "parent_id": "t1_dcth9fk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> So as per your 3rd bullet, Trump saying no to the TPP may help keep prices low on imports while protecting those jobs mentioned in the TPP, potentially avoiding more economic turmoil for family's?\n\nNot necessarily. My understanding (not an economist) is that large, multilateral trade agreements (especially NAFTA) have been instrumental in keeping prices down for the consumer *because* of the offshoring of manufacturing jobs and the nature of free trade itself.  If companies can't get the cheap labor overseas or in Mexico, that cost gets passed along to the consumer.\n\nI'm not sure I'm following his logic completely when he talks about a legal apparatus for IP crippling the manufacturing sector of SE Asian countries. He could be 100% right, but that seems like speculation to me. Where else have we seen the enforcement of IP standards tear a manufacturing sector to shreds? I don't recall, personally.  \n\nWould TPP not have created a level playing field in terms of IP and helped these countries to navigate the establishment of and mechanisms for working within such an apparatus? Thereby making IP more secure and above-board? I can't see how that is bad for American companies or their workers. But like I said, not an economist, so please someone else feel free to enlighten me on the subject.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1485252455.0,
    "date_created": "2017-01-23",
    "time_created": "21:07:35",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctik1p",
    "parent_id": "t1_dcthkw6",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Because of the \"polish plumber\" problem.\n\nThis free movement of labor means that people from elsewhere will be migrating after the jobs. But historically, communities react poorly to that and its a political loser to back it.\n\nFurthermore, it only benefits the poor/lower class/young, who are able to move around chasing jobs. It has no impact on the CEO's and higher ups who draft the pacts. Their jobs and wealth is safe, and they historically give precious little fucks for others.\n\nAnother important thing is that the jobs that move will pay less than the jobs that exist. This is, when your comp sci job gets outsourced to India, it is done because they can get away with paying a lot less there. This means that, if you had a job, it is now somewhere else, and pays a lot less.\n\nSo, in short, the jobs move to Cambodia and pay Cambodian wages, destroying American livelihoods.\n\nIn theory, people should be able to find new jobs, but in practice, there are so many more poor Cambodians that, even the new jobs created will get swamped by them. Especially since the theory is that new, high wage jobs will be created that somehow people from \"elsewhere\" can't do.\n\nBut, people from elsewhere are remarkably similar in capabilities, and charge a lot less, meaning its a race to the bottom.",
    "controversiality": 0,
    "ups": 72,
    "downs": 0,
    "score": 72,
    "created": 1485245259.0,
    "date_created": "2017-01-23",
    "time_created": "19:07:39",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctexuy",
    "parent_id": "t1_dctct2z",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">This is one of my biggest issues with Sanders, is that he drove it into the heads of millions of uninformed voters that free trade agreements are always bad. Generating wealth for your country is good, provided you then use that wealth in an effective manner. The problem is Republicans in congress who adamantly oppose any such measures.\n\nI would argue that while a trade agreement may indeed be in the country's long-term interest, it seems reasonable to me that voters should demand the government prepare for near-term fallout *before* it signs on, not after.",
    "controversiality": 0,
    "ups": 228,
    "downs": 0,
    "score": 228,
    "created": 1485240852.0,
    "date_created": "2017-01-23",
    "time_created": "17:54:12",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcteu1t",
    "parent_id": "t1_dctct2z",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The problem is that wealth never makes its way into the average citizens hands because our economy runs through corporations.  Instead it is pooled into the hands of the 1% or the very few who own a large amount of stock.\n\nEdit: thanks for the gilding, stranger",
    "controversiality": 0,
    "ups": 512,
    "downs": 0,
    "score": 512,
    "created": 1485240728.0,
    "date_created": "2017-01-23",
    "time_created": "17:52:08",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcteutb",
    "parent_id": "t1_dctct2z",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> It is is worth noting that by and large this is what Obama/Clinton (and most democrats) support. Build wealth through free trade, then redistribute it through social programs, such as public education and healthcare.\n\nSupport but do not implement. I am not saying it is their fault with how obstructionist congress has been but we are only getting the free trade and none of the safety.",
    "controversiality": 0,
    "ups": 96,
    "downs": 0,
    "score": 96,
    "created": 1485240753.0,
    "date_created": "2017-01-23",
    "time_created": "17:52:33",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctghq3",
    "parent_id": "t1_dctct2z",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The problem is in reality the players who basically own congress have no interest in the redistribution of that wealth. The whole trickle down economics thing fails because the rich take the extra money and point blank refuse to let any of it trickle down. So Sanders is right, in that on paper these trade deals are great for everyone IF the money trickles down, in reality the trade deals make the rich richer, increase the divide between the rich and poor and it's bad for everyone but the rich.\n\nAs usual, these trade agreements are always sold on the best case scenario, we need this for this money to filter down to you, but the reality is as with NAFTA, they come up with reasons to not pay to retrain or create new economic opportunities and don't give a flying fuck about the individuals who lose their jobs. They only care about that bottom line as it effects their bank accounts.\n\nTTP or no TTP, it doesn't matter, the rich are out for themselves.",
    "controversiality": 0,
    "ups": 60,
    "downs": 0,
    "score": 60,
    "created": 1485242701.0,
    "date_created": "2017-01-23",
    "time_created": "18:25:01",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctd7ni",
    "parent_id": "t1_dctct2z",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I agree wholeheartedly. I'm pretty independent minded, but over the last few years I've been most frustrated with the lack of discussion about how we advance our economy and change how we think about social responsibility. I think some of the more centrist politicians on either side could get behind this, but the fact is there has been little to no discussion about the real causes of structural unemployment and globalization. \n\nI don't recall Obama even mentioning the importance of automation before his farewell speech, and Democrats certainly didn't during the election. I guess it was easier to go full populist and promise to stop those evil outsourcers instead of advancing an informed argument. ",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1485238818.0,
    "date_created": "2017-01-23",
    "time_created": "17:20:18",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctcpk1",
    "parent_id": "t1_dctbw0c",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It sounds a lot like what Millenials have harped on Boomers for.  Opting for present stability and kicking the can of losing ground and competitiveness down the road to the next generation. \n\nIn a \"Fuck yours, got mine\" sense, killing the TPP is wonderful.  In the sense that it'll fuck over future generations and the fact that America still refuses to provide safety nets and transitions for these situations \"Cuz Socialism!\" It's less than ideal.",
    "controversiality": 0,
    "ups": 80,
    "downs": 0,
    "score": 80,
    "created": 1485238232.0,
    "date_created": "2017-01-23",
    "time_created": "17:10:32",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctfbsd",
    "parent_id": "t1_dctdwn1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I get giving the H1B for a super-talented Ph.D. research scientist.\n\nI do not get why its allowed for a cookie-cutter Java developer.",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1485241298.0,
    "date_created": "2017-01-23",
    "time_created": "18:01:38",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct2xxb",
    "parent_id": "t1_dct2wzs",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 288,
    "downs": 0,
    "score": 288,
    "created": 1485227618.0,
    "date_created": "2017-01-23",
    "time_created": "14:13:38",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4o2s",
    "parent_id": "t1_dct43vy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 377,
    "downs": 0,
    "score": 377,
    "created": 1485229486.0,
    "date_created": "2017-01-23",
    "time_created": "14:44:46",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4oyq",
    "parent_id": "t1_dct43vy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 55,
    "downs": 0,
    "score": 55,
    "created": 1485229513.0,
    "date_created": "2017-01-23",
    "time_created": "14:45:13",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4ri2",
    "parent_id": "t1_dct346s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 66,
    "downs": 0,
    "score": 66,
    "created": 1485229588.0,
    "date_created": "2017-01-23",
    "time_created": "14:46:28",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4bq3",
    "parent_id": "t1_dct346s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 159,
    "downs": 0,
    "score": 159,
    "created": 1485229120.0,
    "date_created": "2017-01-23",
    "time_created": "14:38:40",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctg033",
    "parent_id": "t1_dctdne4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 79,
    "downs": 0,
    "score": 79,
    "created": 1485242104.0,
    "date_created": "2017-01-23",
    "time_created": "18:15:04",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcte8yc",
    "parent_id": "t1_dctdne4",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm a Trump supporter, and even though they couldn't have a more different opinion on most things, I'd of been OK with Bernie winning. ",
    "controversiality": 0,
    "ups": 54,
    "downs": 0,
    "score": 54,
    "created": 1485240036.0,
    "date_created": "2017-01-23",
    "time_created": "17:40:36",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6pxh",
    "parent_id": "t1_dct4dy5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "funny, but he actually did return a large check to the Treasury (1.2mm i think) because he was under the initial funds they gave him for his cabinet search. I know it doesn't sound like much, but it's a far cry from the \"who gives a fuck about an actual budget, it's just money, we will go print some more\" that the last 4 presidents had. \n\n[here's the source if anyone's wondering](https://www.c-span.org/video/?c4649448/trump-team-return-20-unused-transition-costs-treasury)",
    "controversiality": 0,
    "ups": 1039,
    "downs": 0,
    "score": 1039,
    "created": 1485231679.0,
    "date_created": "2017-01-23",
    "time_created": "15:21:19",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcteeq5",
    "parent_id": "t1_dctds9c",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Lmao I would laugh so hard at all the changing attitudes. I'm not a Trump supporter, but I am not anti-Trump either. To me, this was a good start to what promises to be an interesting 4 years to say the least. ",
    "controversiality": 0,
    "ups": 272,
    "downs": 0,
    "score": 272,
    "created": 1485240228.0,
    "date_created": "2017-01-23",
    "time_created": "17:43:48",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctkzxe",
    "parent_id": "t1_dcti3tx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I would LITERALLY give your left nut for single payer.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1485248333.0,
    "date_created": "2017-01-23",
    "time_created": "19:58:53",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctka9k",
    "parent_id": "t1_dctj0sg",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It seems like you have the right idea, I do like some of his cabinet picks but I understand they aren't perfect, nobody is. That second part of your comment is what makes the most sense in this entire thread, I'll never understand this whole ordeal with people saying he is not their president. I didn't vote for Obama in 2012 and I certainly disagreed with him on a lot of issues but he was still the president and I respected the man and his position which is why I'm amazed at the lack of maturity that a good portion of Americans are showing today with Trump.",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1485247424.0,
    "date_created": "2017-01-23",
    "time_created": "19:43:44",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct7xg9",
    "parent_id": "t1_dct6qkc",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "He sure is a businessman.",
    "controversiality": 0,
    "ups": 176,
    "downs": 0,
    "score": 176,
    "created": 1485232993.0,
    "date_created": "2017-01-23",
    "time_created": "15:43:13",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcsyrjg",
    "parent_id": "t1_dcsxgqw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Twist: his New Years resolution was to run an orphanage.",
    "controversiality": 0,
    "ups": 565,
    "downs": 0,
    "score": 565,
    "created": 1485223042.0,
    "date_created": "2017-01-23",
    "time_created": "12:57:22",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct39dq",
    "parent_id": "t1_dct260u",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Just curious, how is freezing federal jobs part of his campaign promises? I thought he was promising to create jobs. I'm not saying you're wrong or trying to start a fight, I'm just curious.",
    "controversiality": 0,
    "ups": 109,
    "downs": 0,
    "score": 109,
    "created": 1485227962.0,
    "date_created": "2017-01-23",
    "time_created": "14:19:22",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct34yo",
    "parent_id": "t1_dct260u",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Paying contractors to do work may cost more today but it saves us from having to pay crushing government pensions in the future. ",
    "controversiality": 0,
    "ups": 463,
    "downs": 0,
    "score": 463,
    "created": 1485227830.0,
    "date_created": "2017-01-23",
    "time_created": "14:17:10",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4p29",
    "parent_id": "t1_dct06gz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "If there's one good quality about Trump is that he's going to a actually *DO* things. He isn't a politician and his career/livelihood isn't tied to politics so he can afford to play it like you and I would rather than like a politician.\n\nWhether the choices he's making are good or bad I'll leave for each to decide, but the fact is that Trump doesn't have to go through all the political hoops to get things done.",
    "controversiality": 0,
    "ups": 398,
    "downs": 0,
    "score": 398,
    "created": 1485229516.0,
    "date_created": "2017-01-23",
    "time_created": "14:45:16",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct77q0",
    "parent_id": "t1_dct06gz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I think it was pretty telling that the President of Mexico and the PM of Canada both said they were willing to renegotiate NAFTA the day after Trump won the election. ",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1485232217.0,
    "date_created": "2017-01-23",
    "time_created": "15:30:17",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct3nmj",
    "parent_id": "t1_dcszi0f",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Haha I geuss he's a politician now",
    "controversiality": 0,
    "ups": 222,
    "downs": 0,
    "score": 222,
    "created": 1485228397.0,
    "date_created": "2017-01-23",
    "time_created": "14:26:37",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctjrky",
    "parent_id": "t1_dctg620",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "So much this. People act like Obama is exponentially better than Trump because he's chill and can take a joke and because Trump has shitty hair and a spray tan, that means he can't run the country effectively. I think Obama is/was a cool guy, very professional and a family man but his foreign policies were abysmal and he was just another corporate puppet.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1485246768.0,
    "date_created": "2017-01-23",
    "time_created": "19:32:48",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct338c",
    "parent_id": "t1_dct1yei",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 86,
    "downs": 0,
    "score": 86,
    "created": 1485227777.0,
    "date_created": "2017-01-23",
    "time_created": "14:16:17",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcsyjzm",
    "parent_id": "t1_dcsyfeb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Looking at you /r/politics and /r/The_Donald ",
    "controversiality": 0,
    "ups": 606,
    "downs": 0,
    "score": 606,
    "created": 1485222806.0,
    "date_created": "2017-01-23",
    "time_created": "12:53:26",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct1wir",
    "parent_id": "t1_dct04o9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Trump wants to enact a lobbying ban for 5 years after leaving government and a lifetime ban on lobbying for foreign governments but needless to say it'll be hard to iron out all the loopholes that would probably leave\n\nEdit: Woah woah people. I didn't say he will be able to do it, I also didn't say he was the first to try. I'm just saying what he put in his first 100 day plan. ",
    "controversiality": 0,
    "ups": 609,
    "downs": 0,
    "score": 609,
    "created": 1485226469.0,
    "date_created": "2017-01-23",
    "time_created": "13:54:29",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct2kkw",
    "parent_id": "t1_dct04o9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Just an fyi, the word 'quixotic' may be useful to you!",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1485227210.0,
    "date_created": "2017-01-23",
    "time_created": "14:06:50",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct2vrn",
    "parent_id": "t1_dct04o9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Serving your country in this manner should be a privilege not a career. The House and Senate should be the People's houses, not 20-30-40 yr career politician's piggy banks.",
    "controversiality": 0,
    "ups": 346,
    "downs": 0,
    "score": 346,
    "created": 1485227553.0,
    "date_created": "2017-01-23",
    "time_created": "14:12:33",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct0exy",
    "parent_id": "t1_dct04o9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I think it would make a massive difference actually but that's a whole different conversation.\n\nI agree that it's either impossible or very hard to do, hence why I am interested in seeing what's going to happen.",
    "controversiality": 0,
    "ups": 72,
    "downs": 0,
    "score": 72,
    "created": 1485224859.0,
    "date_created": "2017-01-23",
    "time_created": "13:27:39",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct0swl",
    "parent_id": "t1_dct04o9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This. You'll end up with a revolving appointee of localized powerful groups of monied people and likely only raise the bar for change. It wouldn't fix the core issue, which is money in politics from wealthy interest groups, it's just changes the face of that group more frequently. It's a smoke and mirrors change with no real effect on American politics.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1485225270.0,
    "date_created": "2017-01-23",
    "time_created": "13:34:30",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct0ljm",
    "parent_id": "t1_dct04o9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I think corporations would be thrilled to have inexperienced and easily manipulated politicians revolving door in and out of a system in which the only knowledgeable players would be the lobbyists.",
    "controversiality": 0,
    "ups": 791,
    "downs": 0,
    "score": 791,
    "created": 1485225054.0,
    "date_created": "2017-01-23",
    "time_created": "13:30:54",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct344i",
    "parent_id": "t1_dct11kc",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The states can also call for and pass amendments without any input from Congress. This second method (which has never before been used but is legal) requires 2/3rds of the state legislatures to call for a Convention. The Convention can propose as many amendments as it likes, with a 3/4ths vote from the states required to pass them.",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1485227805.0,
    "date_created": "2017-01-23",
    "time_created": "14:16:45",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctfscq",
    "parent_id": "t1_dcteu8t",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That was the kicker for me. When I read the wikileaks articles listing the media inclusions - I just bailed. That was disgusting. ",
    "controversiality": 0,
    "ups": 55,
    "downs": 0,
    "score": 55,
    "created": 1485241844.0,
    "date_created": "2017-01-23",
    "time_created": "18:10:44",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct744t",
    "parent_id": "t1_dct6cqq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Damn. I thought I kept up with current events but I didn't know about that",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1485232107.0,
    "date_created": "2017-01-23",
    "time_created": "15:28:27",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct9gec",
    "parent_id": "t1_dct6efm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I don't think there ever was a comic about a bilionaire-vigilante president.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1485234654.0,
    "date_created": "2017-01-23",
    "time_created": "16:10:54",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6wip",
    "parent_id": "t1_dct5gyg",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The wall will be running on solar power in a few days",
    "controversiality": 0,
    "ups": 62,
    "downs": 0,
    "score": 62,
    "created": 1485231877.0,
    "date_created": "2017-01-23",
    "time_created": "15:24:37",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4zmu",
    "parent_id": "t1_dct3vdw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1485229830.0,
    "date_created": "2017-01-23",
    "time_created": "14:50:30",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcthask",
    "parent_id": "t1_dctcnb5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "There's a lot of things most of the MSM never told any of its viewers, and a great many blatantly spun things that they told them as well.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1485243698.0,
    "date_created": "2017-01-23",
    "time_created": "18:41:38",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct1p66",
    "parent_id": "t1_dct04ff",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "But what did the Alternative DNC want?",
    "controversiality": 0,
    "ups": 133,
    "downs": 0,
    "score": 133,
    "created": 1485226241.0,
    "date_created": "2017-01-23",
    "time_created": "13:50:41",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct75su",
    "parent_id": "t1_dct5ftb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Muslims are fucking trash.  Upvote if you agree",
    "controversiality": 0,
    "ups": 63,
    "downs": 0,
    "score": 63,
    "created": 1485232158.0,
    "date_created": "2017-01-23",
    "time_created": "15:29:18",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct90w3",
    "parent_id": "t1_dct59z1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I see where you're coming from, but from my side of the aisle it looks entirely like classic \"Starve the Beast\" tactics.  It's my understanding that the public sector, if properly funded is just as efficient and often cheaper than privatization.  My information is coming from the sources listed in this editorial: https://newint.org/features/2015/12/01/private-public-sector/ ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1485234183.0,
    "date_created": "2017-01-23",
    "time_created": "16:03:03",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct5axy",
    "parent_id": "t1_dcsyclf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Planet Money on NPR had some good episodes on TPP.  You may also want to check out the wikipedia article - https://en.m.wikipedia.org/wiki/Trans-Pacific_Partnership.  As you imply, it wasn't objectively 100% bad or 100% good.  The main points were to reduce/eliminate tariffs and raise all nations' environmental, commercial, and labor laws to similar standards.  Most economists predicted it would have a positive impact for all countries involved (economists generally say that free trade is a good thing, since it allows all countries to focus on the industries which they are best at.  You don't want the US making cheap plastic toys when it could be making more airplanes, for instance).\n\nReddit, I suspect, generally abhorred the copyright/IP section of the TPP which would've made Asian countries subject to the same sort of IP laws the US has.  Another touchy subject is Investor State Dispute Settlement (ISDS), in which foreign companies could sue countries for discriminating against them or wrongly seizing assets, etc.  These suits would be settled by third party arbitrators.   I suspect many redditors saw this as an attack on a country's sovereignty, although the counter argument is that the trade deal would have no teeth without a mechanism like this.",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1485230163.0,
    "date_created": "2017-01-23",
    "time_created": "14:56:03",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcsyncj",
    "parent_id": "t1_dcsy6lz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Probably /r/politics , the sub suffers from such a strong Trump hate it impacts rational discussion severely. It's actually pretty funny that /r/worldnews seems to be one of the less ~~bias~~ biased subs for discussing american politics. ",
    "controversiality": 0,
    "ups": 447,
    "downs": 0,
    "score": 447,
    "created": 1485222910.0,
    "date_created": "2017-01-23",
    "time_created": "12:55:10",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcu2mbx",
    "parent_id": "t1_dctvloz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I like Otters. So my alternative facts say that Otters are in fact the loudest",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1485276720.0,
    "date_created": "2017-01-24",
    "time_created": "03:52:00",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcu8t77",
    "parent_id": "t1_dctuy4o",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Your father seems intelligent. Wonderful to have his perspective. Thanks.",
    "controversiality": 0,
    "ups": 57,
    "downs": 0,
    "score": 57,
    "created": 1485293249.0,
    "date_created": "2017-01-24",
    "time_created": "08:27:29",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcucga5",
    "parent_id": "t1_dctuy4o",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Good points about the psychology and consequences of using our only weapon.\n\nReducing our purchases is the only way to get anything from China.  Even then, I don't think you get much in the way of concessions.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1485298887.0,
    "date_created": "2017-01-24",
    "time_created": "10:01:27",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctveq9",
    "parent_id": "t1_dct9qps",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Has it been sent to Best Of yet?",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1485261482.0,
    "date_created": "2017-01-23",
    "time_created": "23:38:02",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctan3l",
    "parent_id": "t1_dct9qdi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "For real. I'm having trouble seeing how this deal helps any Americans that aren't already very well off. And it seems like it has great potential to negatively affect those already near the bottom.",
    "controversiality": 0,
    "ups": 278,
    "downs": 0,
    "score": 278,
    "created": 1485235948.0,
    "date_created": "2017-01-23",
    "time_created": "16:32:28",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctbpkq",
    "parent_id": "t1_dct9qdi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> The then the biggest wtf of all is the traditional bases on each side simply elected to alter their personal ideology rather than change their party affiliation.\n\nTribalism. Most people support their political party the same way they'd support a sports team, through the ups and downs.",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1485237104.0,
    "date_created": "2017-01-23",
    "time_created": "16:51:44",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcte8wr",
    "parent_id": "t1_dct9qdi",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "As a person who tends to agree with the political right, I take issue with the assertion that anti-globalization stances are necessarily anti-free market.\n\nIn the interest of keeping this in terms of what the average business considers, let's not get into monetary policy (even though it's a huge contributor to the debate). Instead, let's focus on two major points: 1) differences in scale, and 2) protectionism by US trading partners. \n\nScale: There are differences in scale that must be taken into account. A city may have certain laws and regulations that deviate from those imposed by a county, which may deviate from those imposed by a state, which may deviate from those imposed by a country. Few people would argue that California is a more business-friendly state than Texas. But the difference in laws between California and Texas is miniscule compared to the difference in laws between the US and China. A California business might consider moving to Texas to pay a lower minimum wage, but might also stay in California due to other factors, like infrastructure. But when confronted with the opportunity to head into SE Asia to pay slave wages for products, you're gonna try to find a way into SE Asia. \n\nProtectionism: China (and others) impose numerous and steep barriers to entry for US imports, while we don't do the same to them. There is no analogy for this in the United States... We learned our lesson under the Articles of the Confederation, and created the Commerce Clause to prevent those kinds of things from happening. Now let's say you want to sell products to the US and China. Only an idiot -- or somebody without access to the necessary resources -- would produce in the US... just look at the options. Produce in US: pay higher US wages, deal with larger quantity of US regulations, pay massive Chinese fees to sell to the larger market, jump through a bunch of Chinese hoops to sell to the larger market, and get your IP stolen anyway. Produce in China: pay slave wages, deal with practically no regulations, easily sell to both markets, and still get your IP stolen (but at least you're making more money). The choice is obvious. \n\nRelationship of scale and protectionism, and how this fits into a pro-free market stance: At this point we aren't talking about businesses operating in a singular free market -- we are talking about two totally different markets. For capitalism to work in the best interest of those people who make up the market, the governments in charge of facilitating capitalism need to operate more or less on the same page. Every single law doesn't need to be exactly the same, but at some point the differences become so vast that you're not in a free market -- you're in a system that exploits slave labor and asymmetrically punishes half the actors through Chinese protectionism before trade even starts.  \n\nMy hope is that we are able to reach agreements with country's like China that allow the promise of globalism to come to fruition. For that to happen, we are probably going to need the leverage that proportionate protectionism can provide. I view policy proposals like tariffs on goods produced by American-owned companies oversees as a way to force other countries to come to the negotiating table so we can have fair and free trade. ",
    "controversiality": 0,
    "ups": 37,
    "downs": 0,
    "score": 37,
    "created": 1485240035.0,
    "date_created": "2017-01-23",
    "time_created": "17:40:35",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcthfpi",
    "parent_id": "t1_dcta02d",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This kind of thinking is built into the American mindset - that you should only benefit off the sweat of your own brow, and anyone can make it if they just work hard enough.\n\nThat's not really how societies work, but I think most countries have some weird cultural fixations which can both help and harm them.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1485243867.0,
    "date_created": "2017-01-23",
    "time_created": "18:44:27",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct7n7t",
    "parent_id": "t1_dct6mtz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yep.  And fanfiction and fanart communities were panicked too.",
    "controversiality": 0,
    "ups": 610,
    "downs": 0,
    "score": 610,
    "created": 1485232685.0,
    "date_created": "2017-01-23",
    "time_created": "15:38:05",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct7s3e",
    "parent_id": "t1_dct6mtz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 323,
    "downs": 0,
    "score": 323,
    "created": 1485232833.0,
    "date_created": "2017-01-23",
    "time_created": "15:40:33",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4xyh",
    "parent_id": "t1_dct46hf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah the politicians had access to the documents for a few hours, without legal counsel. The companies had their own copy their lawyers could pore over. \n\nHorrifying.",
    "controversiality": 0,
    "ups": 635,
    "downs": 0,
    "score": 635,
    "created": 1485229781.0,
    "date_created": "2017-01-23",
    "time_created": "14:49:41",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4ocf",
    "parent_id": "t1_dct47rz",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Care to elaborate?",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1485229494.0,
    "date_created": "2017-01-23",
    "time_created": "14:44:54",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct5utr",
    "parent_id": "t1_dct5hvs",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Xi Jinping showing up to Davos should make that quite clear. Where the US pulls back, China will surge forward.",
    "controversiality": 0,
    "ups": 172,
    "downs": 0,
    "score": 172,
    "created": 1485230754.0,
    "date_created": "2017-01-23",
    "time_created": "15:05:54",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct95nr",
    "parent_id": "t1_dct5hvs",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "But \"America\" didn't write it. Multinational corporations did.\n\n",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1485234328.0,
    "date_created": "2017-01-23",
    "time_created": "16:05:28",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct83wf",
    "parent_id": "t1_dct5hvs",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is straight up fear-mongering and totally without a basis in fact.\n\nIf you can get a sexual identity issue in there somehow, we'd have a trifecta.  \n\nGlobal trade deals are important, but what actually counts is markets.  If the US market suddenly becomes very expensive for outsiders to sell in, that's going to create a lot of knock on effects.  Presumably one of those will be increased US production with matching internal consumption.  \n\nLook, China can do as they please, but if the US stopped importing manufactured good from China tomorrow, their economy would collapse in days.  (as would ours)",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1485233188.0,
    "date_created": "2017-01-23",
    "time_created": "15:46:28",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctq388",
    "parent_id": "t1_dctoc3w",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Realistically speaking, greater enforcement of IP abroad, (or domestically for that matter,) primarily benefits corporations and not regular consumers.  Corporations own most of the IP and are nearly the only entities with pockets deep enough to use the court systems to enforce IP ownership.  Ultimately, unless you believe in trickle down economics, greater IP enforcement anywhere just makes stuff more expensive and/or less available to regular people. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1485254554.0,
    "date_created": "2017-01-23",
    "time_created": "21:42:34",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctm5cl",
    "parent_id": "t1_dctik1p",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> Especially since the theory is that new, high wage jobs will be created that somehow people from \"elsewhere\" can't do\n\nThis is my favorite sentiment that americans seem to have. The world is FILLED with intelligent people and we dont seem to realize it. In the past, the US was one of the only stable nations in the world so huge numbers of smart people flocked here which greatly, hugely, massively boosted our ability to create intellectual goods. Many more stable countries exist now though so the impetus to leave is much lower, especially in Asia. America needs to wake up and understand that we need to educate our own citizens and focus on creating an intelligent citizenry because we cant rely heavily anymore on importing genius and at the same time, those same countries are going to start competing strongly in the intellectual field.",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1485249760.0,
    "date_created": "2017-01-23",
    "time_created": "20:22:40",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctks4h",
    "parent_id": "t1_dctexuy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 37,
    "downs": 0,
    "score": 37,
    "created": 1485248053.0,
    "date_created": "2017-01-23",
    "time_created": "19:54:13",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctysll",
    "parent_id": "t1_dctexuy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "After reading this thread, I think I have a much more informed position on the TPP, where I can actually defend Trumps decision to reverse it. Not something I expected to be able to do.\n\nI doubt Hillary could have, or even would have wanted to pass the support making such a deal would require. While Trump reversing US policy on this one does harm our current geo-political presence it doesn't prevent us from expanding out there some time in the future. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1485267335.0,
    "date_created": "2017-01-24",
    "time_created": "01:15:35",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctmitm",
    "parent_id": "t1_dcteu1t",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The same \"Mr. Burns\" type who would gladly offshore jobs to Asia if it means it saves a bunch of money and they would be able to take advantage of foreign labour laws that would be considered \"slavery\" in comparison to western civilization's.  ",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1485250230.0,
    "date_created": "2017-01-23",
    "time_created": "20:30:30",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcthlvn",
    "parent_id": "t1_dcteu1t",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah there's definitely a missing piece in where wealthy people are forced to pay their fair share into the system, tax loopholes and offshore tax havens are shutdown. ",
    "controversiality": 0,
    "ups": 100,
    "downs": 0,
    "score": 100,
    "created": 1485244079.0,
    "date_created": "2017-01-23",
    "time_created": "18:47:59",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctfyuw",
    "parent_id": "t1_dcteutb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Blame the overly simplistic \"fuck you, I got mine\" trickle-down mindset. Far too many people believe they are personally paying for others healthcare, welfare, safety-net, etc..  They are unable to grasp anything more absract than \"kill or be killed\". Reactionary policies never work. But now they are \"leading\" us for the next 4 years, over a cliff.",
    "controversiality": 0,
    "ups": 66,
    "downs": 0,
    "score": 66,
    "created": 1485242063.0,
    "date_created": "2017-01-23",
    "time_created": "18:14:23",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctglod",
    "parent_id": "t1_dctd7ni",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You may not recall hearing about but Obama and Hillary both have spoke often about automation being the real job killer.  Google it.  You will find plenty of news articles going back 2-3 years where this has been harped on.  \n\nHillary called this out during the election many times in Oct and Nov as free trade was being discussed but it was all lost in news coverage of Trump's latest tweet.\n\nCheck out Hillary's job plan.  It called for strong retraining programs to combat automation.\nhttps://www.hillaryclinton.com/issues/workforce-and-skills/",
    "controversiality": 0,
    "ups": 34,
    "downs": 0,
    "score": 34,
    "created": 1485242836.0,
    "date_created": "2017-01-23",
    "time_created": "18:27:16",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcteesf",
    "parent_id": "t1_dctcpk1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Considering there's very little stability for the millennial generation, you can't blame them for having reservations about trading the last of it way. It's especially worrisome when you have to bank on the government pulling through to actually get some benefit from the deal.",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1485240230.0,
    "date_created": "2017-01-23",
    "time_created": "17:43:50",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctdgej",
    "parent_id": "t1_dctcpk1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "To be fair, specifically in the general election, millenials as a generation voted for the candidate more likely to support the TPP (despite the fact she claimed to oppose it) and Boomers heavily voted for the candidate more likely to oppose it. ",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1485239105.0,
    "date_created": "2017-01-23",
    "time_created": "17:25:05",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctf3z9",
    "parent_id": "t1_dctcpk1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The TPP is not the only conceivable trade agreement that we could come up with. It's absurd to say that because this particular deal needed to be killed there are no better potential treaties to be made.\n\nAs it stood the TPP would have entrenched (further) the ability of major companies to circumvent the democratic process. Which is to say treaties like NAFTA and the TPP make it so that all those countries that sign on to utilize US IP law or regulatory framework will suddenly be unable to regulate their own domestic industries as they see fit because they're bound to the regulatory framework outlined by the US \n\nHow would a Swede like it if they suddenly had to relax their labor laws because the Swedish government signed a trade agreement like this saying they had to? Or deregulate their banking industry?\n\nThis isn't an either/or proposition despite what all the people in this thread saying \"see that's why I didn't support Bernie!\"\n\nDeals like NAFTA didn't *just* outsource American jobs, that wasn't the only negative, they also weakened the negotiating power of labor for years to come. \n\nTrade agreements in this vein make it easier and easier for *capital* to move across borders while immigration laws worldwide become increasingly strict and exclusive. \n\nThe choice isn't \"support neo-liberal trade agreements or oppose globalization entirely and fuck you I got mine\". And the idea that it is only helps those that will benefit from neo-liberal trade agreements        ",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1485241047.0,
    "date_created": "2017-01-23",
    "time_created": "17:57:27",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctl7tf",
    "parent_id": "t1_dctfbsd",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The h1b was meant for the PhD research scientist. It's supposed to be used as a last resort if a company can't find what they need in the United States. The problem is there is almost nothing enforcing that. Companies only have to 'look' to fill the position for a few days and the biggest problem is the rules surrounding prevailing wage. So what they end up doing is making the most low effort search in the smallest corner of the most unread newspaper and use all sorts of loopholes to come up with a bullshit prevailing wage number.\n\nTrump was all for fixing these laws and raising the prevailing wage (after all, he's aware of the loopholes, seeing how the first lady was brought over on one) early in his campaign but he flip flopped on that pretty quick.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1485248611.0,
    "date_created": "2017-01-23",
    "time_created": "20:03:31",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct3juo",
    "parent_id": "t1_dct2xxb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 213,
    "downs": 0,
    "score": 213,
    "created": 1485228284.0,
    "date_created": "2017-01-23",
    "time_created": "14:24:44",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4vbr",
    "parent_id": "t1_dct4o2s",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1485229703.0,
    "date_created": "2017-01-23",
    "time_created": "14:48:23",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct67tb",
    "parent_id": "t1_dct4ri2",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1485231138.0,
    "date_created": "2017-01-23",
    "time_created": "15:12:18",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct50zv",
    "parent_id": "t1_dct4bq3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 78,
    "downs": 0,
    "score": 78,
    "created": 1485229870.0,
    "date_created": "2017-01-23",
    "time_created": "14:51:10",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctgfue",
    "parent_id": "t1_dctg033",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I believe Ron Paul paved the way for Donald Trump.\n\nThe media attacked Ron Paul in the same pattern, and the RNC stole the votes the same way the DNC did to Bernie.\n\nThe models of the press were recalled, and Trump was able to attack the corruption of the media on a large scale.",
    "controversiality": 0,
    "ups": 63,
    "downs": 0,
    "score": 63,
    "created": 1485242637.0,
    "date_created": "2017-01-23",
    "time_created": "18:23:57",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctfre1",
    "parent_id": "t1_dcte8yc",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah, the same here. Bernie believed his words, and even if I did not agree. I think human beings deep down feel a connection when a person speaks and believes in what they say.",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1485241812.0,
    "date_created": "2017-01-23",
    "time_created": "18:10:12",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct71zj",
    "parent_id": "t1_dct6pxh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 326,
    "downs": 0,
    "score": 326,
    "created": 1485232045.0,
    "date_created": "2017-01-23",
    "time_created": "15:27:25",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct9php",
    "parent_id": "t1_dct6pxh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Aside from this, I heard on the radio (grain of salt) that anytime a foreign diplomat or dignitary stays at one of his hotels those profits will be allotted to the national debt. Great idea!",
    "controversiality": 0,
    "ups": 145,
    "downs": 0,
    "score": 145,
    "created": 1485234931.0,
    "date_created": "2017-01-23",
    "time_created": "16:15:31",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctfn7r",
    "parent_id": "t1_dct6pxh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm truly hoping that more things like this come to light and he turns out to be the biggest surprise in American political history.  He's already done some very positive things, this and the TPP being two of them, but there has been virtually no unbiased reports on it so far.  ",
    "controversiality": 0,
    "ups": 15,
    "downs": 0,
    "score": 15,
    "created": 1485241673.0,
    "date_created": "2017-01-23",
    "time_created": "18:07:53",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctcxlv",
    "parent_id": "t1_dct6pxh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "1.2 millimeters is a rather small check, if you ask me.",
    "controversiality": 0,
    "ups": 27,
    "downs": 0,
    "score": 27,
    "created": 1485238494.0,
    "date_created": "2017-01-23",
    "time_created": "17:14:54",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcth97l",
    "parent_id": "t1_dcteeq5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I've been laughing.  Remember r/politics during the primaries?  Hillary was evil, corrupt, unfit - then suddenly #imwithher.  Those people as a collective have no self awareness and no objectivity.",
    "controversiality": 0,
    "ups": 166,
    "downs": 0,
    "score": 166,
    "created": 1485243642.0,
    "date_created": "2017-01-23",
    "time_created": "18:40:42",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctlm47",
    "parent_id": "t1_dcteeq5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm not a Trump supporter and I'm fairly anti-Trump but if he turns out to do good then I'll totally rethink my position for sure. I think most are like that. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1485249106.0,
    "date_created": "2017-01-23",
    "time_created": "20:11:46",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctsmum",
    "parent_id": "t1_dcteeq5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "If people are honest with themselves, they should be hoping for Trump's success right now - his success means the country's success.\n\nOnly the most depraved, cynical, partisan hacks should be hoping for national ruin just to spite Trump.  You know, the same type of depraved, cynical, partisan hacks that hoped for Obama's failure.\n\nFuck those guys.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1485257681.0,
    "date_created": "2017-01-23",
    "time_created": "22:34:41",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctf3vk",
    "parent_id": "t1_dct7xg9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Just as scott adams predicted.",
    "controversiality": 0,
    "ups": 37,
    "downs": 0,
    "score": 37,
    "created": 1485241043.0,
    "date_created": "2017-01-23",
    "time_created": "17:57:23",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcszldp",
    "parent_id": "t1_dcsyrjg",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's not my fault, they keep running away!",
    "controversiality": 0,
    "ups": 258,
    "downs": 0,
    "score": 258,
    "created": 1485223957.0,
    "date_created": "2017-01-23",
    "time_created": "13:12:37",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct3s93",
    "parent_id": "t1_dct39dq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The promise to create jobs heavily implies private sector jobs. In the US, creating jobs and shrinking government are ideologically separate for a lot of people. One, in theory, grows on it's own, gives people more money, and generates tax revenue. The other uses tax money to pay for government workers people that we may or may not need. I don't necessarily agree, but that's roughly the logic.",
    "controversiality": 0,
    "ups": 71,
    "downs": 0,
    "score": 71,
    "created": 1485228534.0,
    "date_created": "2017-01-23",
    "time_created": "14:28:54",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct3b36",
    "parent_id": "t1_dct34yo",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Great point. Using contractors creates competition as well",
    "controversiality": 0,
    "ups": 211,
    "downs": 0,
    "score": 211,
    "created": 1485228013.0,
    "date_created": "2017-01-23",
    "time_created": "14:20:13",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct7zjp",
    "parent_id": "t1_dct4p29",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I kind of came to the same conclusion. Might as well just see how it plays out he is POTUS now anyway. At least he is doing something instead of just talking about and never following through or blatantly just spewing lies knowing they will never have a chance.",
    "controversiality": 0,
    "ups": 111,
    "downs": 0,
    "score": 111,
    "created": 1485233057.0,
    "date_created": "2017-01-23",
    "time_created": "15:44:17",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct7m5g",
    "parent_id": "t1_dct4p29",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I think he has to go through the same political hoops (legal and bureaucratic processes). But I agree he doesn't (yet) have the same personal constraints and motivations that career politicians develop over time, which often binds them to interests other than the citizens, and slows their bias for action.\n\nHoping he actually accomplishes some good.",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1485232651.0,
    "date_created": "2017-01-23",
    "time_created": "15:37:31",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct8aeq",
    "parent_id": "t1_dct4p29",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 69,
    "downs": 0,
    "score": 69,
    "created": 1485233383.0,
    "date_created": "2017-01-23",
    "time_created": "15:49:43",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4xfw",
    "parent_id": "t1_dct3nmj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "We need a new term for Trump. A businesstician. ",
    "controversiality": 0,
    "ups": 206,
    "downs": 0,
    "score": 206,
    "created": 1485229765.0,
    "date_created": "2017-01-23",
    "time_created": "14:49:25",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctkqs6",
    "parent_id": "t1_dctjrky",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Absolutely.  IIRC Citibank had a direct hand in appointing most of his administration,  pretty blatantly too. ",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1485248008.0,
    "date_created": "2017-01-23",
    "time_created": "19:53:28",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct3cm0",
    "parent_id": "t1_dct338c",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1485228062.0,
    "date_created": "2017-01-23",
    "time_created": "14:21:02",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcszzgo",
    "parent_id": "t1_dcsyjzm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You're right about /r/politics, but /r/The_Donald should get a pass. The very nature of their existence is to be fanboys. That's like getting upset at /r/SandersForPresident for wanting Bernie Sanders to be president. ",
    "controversiality": 0,
    "ups": 1125,
    "downs": 0,
    "score": 1125,
    "created": 1485224390.0,
    "date_created": "2017-01-23",
    "time_created": "13:19:50",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct155p",
    "parent_id": "t1_dcsyjzm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "/r/the_donald admits we're just fanboys and that the sub is just a circle jerk. /r/politics claims to be unbiased",
    "controversiality": 0,
    "ups": 366,
    "downs": 0,
    "score": 366,
    "created": 1485225639.0,
    "date_created": "2017-01-23",
    "time_created": "13:40:39",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4bzx",
    "parent_id": "t1_dct1wir",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "There already is a lobbying ban. They just turn into lobbying \"consultants\".",
    "controversiality": 0,
    "ups": 246,
    "downs": 0,
    "score": 246,
    "created": 1485229128.0,
    "date_created": "2017-01-23",
    "time_created": "14:38:48",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct0q5a",
    "parent_id": "t1_dct0exy",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I think it would basically institutionalize the revolving door, and create an even larger information/knowledge/influence disparity between elected representatives and special interest representatives.\n\nIt's a sticky issue IMO.",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1485225188.0,
    "date_created": "2017-01-23",
    "time_created": "13:33:08",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct1bu7",
    "parent_id": "t1_dct0ljm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "As opposed to entrenched congresspeople who go golfing with the CEO of Megacompany Inc every other weekend?",
    "controversiality": 0,
    "ups": 1569,
    "downs": 0,
    "score": 1569,
    "created": 1485225843.0,
    "date_created": "2017-01-23",
    "time_created": "13:44:03",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct1una",
    "parent_id": "t1_dct0ljm",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The young and naive are the ones who make the difference. It's a lot harder to corrupt someone for the first time than to do it every subsequent time.",
    "controversiality": 0,
    "ups": 56,
    "downs": 0,
    "score": 56,
    "created": 1485226411.0,
    "date_created": "2017-01-23",
    "time_created": "13:53:31",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4h7j",
    "parent_id": "t1_dct344i",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That is legally true, but as you said it has never been used successfully.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1485229279.0,
    "date_created": "2017-01-23",
    "time_created": "14:41:19",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctfxer",
    "parent_id": "t1_dctfscq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yep and for anyone who wasn't sure whether or not it was true, his response to the allegations which were basically \"So what? Grow the fuck up.\" should've been enough to convince them.",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1485242014.0,
    "date_created": "2017-01-23",
    "time_created": "18:13:34",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctgd1z",
    "parent_id": "t1_dctfscq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "For me as well.  Total bummer because I always hoped he would be more based like Jon Stewart was.  \n\nI throw up inside every time I see the Daily Show on now.  ",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1485242542.0,
    "date_created": "2017-01-23",
    "time_created": "18:22:22",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctkv1s",
    "parent_id": "t1_dct9gec",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "No but there was a video game. Saint's Row 4. You are a gang leader who throws a terrorist former U.S. General into a pit of lava and then gets elected. You have the choice to either cure cancer or defeat world hunger, via the \"Fuck Cancer\" and \"Let Them Eat Cake\" Acts respectively.\n\nThat's when the aliens invade and blow up the planet to the song \"What is Love?\" by Haddaway.\n\nAlso Keith David is your Vice President.",
    "controversiality": 0,
    "ups": 7,
    "downs": 0,
    "score": 7,
    "created": 1485248158.0,
    "date_created": "2017-01-23",
    "time_created": "19:55:58",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct8u2g",
    "parent_id": "t1_dct6wip",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is actually what he meant all along. The US-Mexico border will just be lined with a massive array of solar panels to provide clean energy to both countries (part of the NAFTA renegotiation) - we're gonna fix illegal immigration by making Mexico a better place to live so people don't feel like they have to sneak into the US illegally.",
    "controversiality": 0,
    "ups": 63,
    "downs": 0,
    "score": 63,
    "created": 1485233973.0,
    "date_created": "2017-01-23",
    "time_created": "15:59:33",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct32ee",
    "parent_id": "t1_dct1p66",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Bernie Sanders",
    "controversiality": 0,
    "ups": 255,
    "downs": 0,
    "score": 255,
    "created": 1485227753.0,
    "date_created": "2017-01-23",
    "time_created": "14:15:53",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcu9b4i",
    "parent_id": "t1_dctveq9",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I'm here from /r/depthhub\n",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1485294133.0,
    "date_created": "2017-01-24",
    "time_created": "08:42:13",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctnqcl",
    "parent_id": "t1_dctan3l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Sounds like a good deal for American corporations, and America's government in terms of presence on the world stage and influence in the global economy. But when I think of people I know, I can't think of one person who would be helped by this, while I can think of numerous people who would be hurt. After reading ep1032's write-up, I can't imagine supporting this bill. I have zero faith in our government to retrain and support the negatively impacted people of this country. It would be more blue-collar and now also white-collar professionals left to twist in the wind with no answers and no help.",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1485251731.0,
    "date_created": "2017-01-23",
    "time_created": "20:55:31",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctg5vn",
    "parent_id": "t1_dctan3l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "So just from the top comment I actually understand why Dems are\\were in favor and it seems because the implication is we greatly increase our economic power and flow the money back into the us for new job training and creation like OP was talking about in Scandinavian countries when the EU was created.\n\nI understand why Dems were now in favor of it but it was completely flawed because half of the country doesn't believe in \"handouts\" in the form of free schooling for replacement jobs, and thus it would never happen and trade agreements hurt us badly job wise.",
    "controversiality": 0,
    "ups": 28,
    "downs": 0,
    "score": 28,
    "created": 1485242303.0,
    "date_created": "2017-01-23",
    "time_created": "18:18:23",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctdojh",
    "parent_id": "t1_dctbpkq",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yes. I am listening to Juan Williams arguing for TPP right now and he sounds like a traditional Republican ideologue.  Has got to be tribalism.  And it also reveals how superficial tribal belief systems can be.  And maybe myself included, but something must be done for working class folk or society is not going to hold it together imo.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1485239367.0,
    "date_created": "2017-01-23",
    "time_created": "17:29:27",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct7uku",
    "parent_id": "t1_dct7n7t",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Alright thats what I thought. If that's the case, I guess glory glory hallelujah? I honestly don't know enough to say otherwise, but I know anything that makes fan appreciation and derivative non-paid works illegal doesn't deserve to be around.",
    "controversiality": 0,
    "ups": 271,
    "downs": 0,
    "score": 271,
    "created": 1485232906.0,
    "date_created": "2017-01-23",
    "time_created": "15:41:46",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct8dov",
    "parent_id": "t1_dct7s3e",
    "subreddit_name_prefixed": "r/worldnews",
    "body": ">2nd world countries...\n\nThis is incorrect terminology. \"The second world\" is defined as the communist countries. The terms first, second, and third world were dubbed during the Cold War to divide capitalist countries allied with America (First world), communist countries allied with the Soviet Union (second world), and those who aligned with neither (third world). The latter were generally poor countries, so the name stuck to define poverty-stricken states.\n\nThis is largely irrelevant, but I just thought this would be a neat TIL.",
    "controversiality": 0,
    "ups": 628,
    "downs": 0,
    "score": 628,
    "created": 1485233482.0,
    "date_created": "2017-01-23",
    "time_created": "15:51:22",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6jtx",
    "parent_id": "t1_dct4xyh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Exactly. They could only have access to a few physical pages at a time, of a 2,000 page document. They weren't allowed to take photos of it, make notes, nor copy any of it. Basically flat out allowing corporations to run the govt. ",
    "controversiality": 0,
    "ups": 410,
    "downs": 0,
    "score": 410,
    "created": 1485231495.0,
    "date_created": "2017-01-23",
    "time_created": "15:18:15",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6ec0",
    "parent_id": "t1_dct4xyh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's what made me most scared. If it's too evil for even our politicians to look at, it must be pretty bad. ",
    "controversiality": 0,
    "ups": 118,
    "downs": 0,
    "score": 118,
    "created": 1485231330.0,
    "date_created": "2017-01-23",
    "time_created": "15:15:30",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4tsj",
    "parent_id": "t1_dct4ocf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> **Can corporations use ISDS to initiate a dispute settlement proceeding solely because they lost profits?**\n\n> No.  Our investment rules do not guarantee firms a right to future profits or to expected investment outcomes.  Rather, they only provide protections for a limited and clearly specified set of rights.  For instance, if a country decides to take away the property of a business without any compensation, that business can seek compensation through a neutral arbitration.  Like U.S. law, the goal of impartial arbitration is to promote fairness, not to protect profit.\n\nhttps://ustr.gov/about-us/policy-offices/press-office/blog/2015/march/isds-important-questions-and-answers",
    "controversiality": 0,
    "ups": 215,
    "downs": 0,
    "score": 215,
    "created": 1485229656.0,
    "date_created": "2017-01-23",
    "time_created": "14:47:36",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4wk4",
    "parent_id": "t1_dct4ocf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Corporations could sue nations for losses if the nations enacted laws or made decisions which directly favored local/national companies over international companies.\n\nThink about Coca-Cola operating in Thailand, then Thailand offers a tax benefit to all 'Thailand based' soda companies. This favors them over Coca-Cola\n\nIt's not just some random 'I lost money so I'll sue'",
    "controversiality": 0,
    "ups": 53,
    "downs": 0,
    "score": 53,
    "created": 1485229739.0,
    "date_created": "2017-01-23",
    "time_created": "14:48:59",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4twc",
    "parent_id": "t1_dct4ocf",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It allows companies to sue if governments break the terms of the agreement by acting more favorably towards their own companies / industries vs. those of other signatory governments.  Pretty mundane. ",
    "controversiality": 0,
    "ups": 36,
    "downs": 0,
    "score": 36,
    "created": 1485229659.0,
    "date_created": "2017-01-23",
    "time_created": "14:47:39",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcubjnp",
    "parent_id": "t1_dctks4h",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> it might just be that it's the end of US history.\n\nThat part terrifies me. Every time that anyone talks about the finale of the country so lightly...I imagine this is the fear, to some extent, that a portion of the rest of the planet could feel when their country is on the verge of evaporating overnight. I think I'm on the declining side of an empire, and I'm only now waking up to realizing that, globally speaking, _I'm the bad guy_, it seems.\n\nAs a USA citizen, I wish that...well, maybe I'm uninformed, but it feels like there's no weight to my voice in rural appalachia. It feels like no manner of outcry or activism in my area would have substantive change.\n\nThis is just my opinion, though. \n\nSorry for the micro-rant. That sentence riled up some feelings.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1485297627.0,
    "date_created": "2017-01-24",
    "time_created": "09:40:27",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctg5bn",
    "parent_id": "t1_dctfyuw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "> Blame the overly simplistic \"fuck you, I got mine\" trickle-down mindset. \n\nBelieve me, I do. But I still think that if you can't moderate the effects of free trade then you shouldn't implement it willy nilly.",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1485242284.0,
    "date_created": "2017-01-23",
    "time_created": "18:18:04",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctfnod",
    "parent_id": "t1_dctdgej",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yah.  I should say I'm a millenial and voted Hillary.  So did all of my friends.  \n\nRethinking it.  It could boil down to one more \"Not my problem\" act that our Boomers are gonna ship down the road.  ",
    "controversiality": 0,
    "ups": 12,
    "downs": 0,
    "score": 12,
    "created": 1485241689.0,
    "date_created": "2017-01-23",
    "time_created": "18:08:09",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct3qt7",
    "parent_id": "t1_dct3juo",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 103,
    "downs": 0,
    "score": 103,
    "created": 1485228490.0,
    "date_created": "2017-01-23",
    "time_created": "14:28:10",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct55sy",
    "parent_id": "t1_dct4vbr",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 31,
    "downs": 0,
    "score": 31,
    "created": 1485230012.0,
    "date_created": "2017-01-23",
    "time_created": "14:53:32",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcth9mr",
    "parent_id": "t1_dctgfue",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Ron Paul supporter in 2008 and 2012. Still pissed.",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1485243658.0,
    "date_created": "2017-01-23",
    "time_created": "18:40:58",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctl358",
    "parent_id": "t1_dctgfue",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "He discredited the press which was rightfully so. But at the same time we reached a point where nothing was believable in American news anymore. As a Canadian looking in I almost thought it was a joke. \n\nThe media isn't a free body but rather a special interest group that only reports on what they feel like rather than what they need to be reporting (like TPP ..etc. The amount of coverage was not noticable). Same goes with Canadian news on that topic (which is currently churning out Syrian refugee stories like mad for the last year. I heard the same Syrian cookie company bankrolled by the liberal party like 9 times now).\n\n When Donald Trump won the primary it was like hold on, non-stop Donald reporting. Does Donald have a love child? Why does this Jewish Transsexual Millienal support Donald (turns out it was 4chan)?, CNN's non stop coverage of facebook topics as legit news ...etc\n\nNow we blame the election on fake news when the media was the one that instigated it.\n\n",
    "controversiality": 0,
    "ups": 30,
    "downs": 0,
    "score": 30,
    "created": 1485248449.0,
    "date_created": "2017-01-23",
    "time_created": "20:00:49",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctpujd",
    "parent_id": "t1_dctgfue",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is why Trump is a true revolution. The RNC did everything to stop him and republicans bailed on him but he could not be stooped.  He defied them all. He is the closest to Ron Paul we will ever get .",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1485254274.0,
    "date_created": "2017-01-23",
    "time_created": "21:37:54",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct7xa0",
    "parent_id": "t1_dct71zj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "didn't mean it like that, but reading it I see how mine comes off like that. Was more saying it's funny that he actually sent a physical check back to the treasury. ",
    "controversiality": 0,
    "ups": 120,
    "downs": 0,
    "score": 120,
    "created": 1485232987.0,
    "date_created": "2017-01-23",
    "time_created": "15:43:07",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctayt4",
    "parent_id": "t1_dct9php",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That... actually IS a good idea. Wow!",
    "controversiality": 0,
    "ups": 99,
    "downs": 0,
    "score": 99,
    "created": 1485236299.0,
    "date_created": "2017-01-23",
    "time_created": "16:38:19",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctpq6x",
    "parent_id": "t1_dcth97l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "funny they are probably all pro tpp today.",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1485254126.0,
    "date_created": "2017-01-23",
    "time_created": "21:35:26",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct1nou",
    "parent_id": "t1_dcszldp",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Maybe if he built some kind of structure to block them from doing this?",
    "controversiality": 0,
    "ups": 154,
    "downs": 0,
    "score": 154,
    "created": 1485226197.0,
    "date_created": "2017-01-23",
    "time_created": "13:49:57",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct3l68",
    "parent_id": "t1_dct3b36",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Rarely do I find you get much quality work out of low-bid initiatives.",
    "controversiality": 0,
    "ups": 195,
    "downs": 0,
    "score": 195,
    "created": 1485228325.0,
    "date_created": "2017-01-23",
    "time_created": "14:25:25",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcth90t",
    "parent_id": "t1_dct7zjp",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This is why I laugh at everyone who argues \"he has no experience for the job!\" So what? Being a politician isn't like being a doctor or a lawyer where you can't possibly understand what you're doing without years of experience. Politics is infested with people who become successful because they've either greased enough palms or were born with the right last name. The fact that we could've had 3 Bushes and 2 Clintons since George SR's presidency should tell you everything. People with no business experience can come into government positions and have the ability to decide economic policy, corporate policy, and trade deals. How does that make them more qualified than somebody who has excelled at business their entire life? ",
    "controversiality": 0,
    "ups": 23,
    "downs": 0,
    "score": 23,
    "created": 1485243637.0,
    "date_created": "2017-01-23",
    "time_created": "18:40:37",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct61f8",
    "parent_id": "t1_dct4xfw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "thanks for your contribution, W",
    "controversiality": 0,
    "ups": 78,
    "downs": 0,
    "score": 78,
    "created": 1485230945.0,
    "date_created": "2017-01-23",
    "time_created": "15:09:05",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct701g",
    "parent_id": "t1_dct4xfw",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Polishman.\n\nwait",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1485231985.0,
    "date_created": "2017-01-23",
    "time_created": "15:26:25",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct1lhk",
    "parent_id": "t1_dcszzgo",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's the places like /r/politics that like to pretend that they're an unbiased source of political information and opinions that are shitty. ",
    "controversiality": 0,
    "ups": 983,
    "downs": 0,
    "score": 983,
    "created": 1485226131.0,
    "date_created": "2017-01-23",
    "time_created": "13:48:51",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct3euo",
    "parent_id": "t1_dct155p",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Yeah, that's a big difference.  It's implied by being a default sub called POLITICS that you won't get downvoted into oblivion for posting contrary to their bias.  \n\nThere is even a sub called r/AskThe_Donald where nothing will be downvoted if counter to their opinions.  It's a place where those supporters honestly try to convince opposition to support Donald, or explain why they think the way they do.  You don't have to agree with them, but you won't be downvoted for debating, unlike r/politics.\n\nIf r/politics was serious about being unbiased, they would disable downvoting and ban people who habitually circumvented the rule for personal beliefs. ",
    "controversiality": 0,
    "ups": 212,
    "downs": 0,
    "score": 212,
    "created": 1485228131.0,
    "date_created": "2017-01-23",
    "time_created": "14:22:11",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4z43",
    "parent_id": "t1_dct4bzx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "When he talks about a 'ban' he's actually talking about properly formalising what is in place currently with additional restrictions on people lobbying (whether they call themselves consultants or not) to close the current loopholes being abused.\n\nThe abuse of the whole 'consultant' angle is one thing he explicitly wants to fix.\n\nHis whole plan according to his website is:\n\n> **First:** I am going to re-institute a 5-year ban on all executive branch officials lobbying the government for 5 years after they leave government service. I am going to ask Congress to pass this ban into law so that it cannot be lifted by executive order.\n> \n> **Second:** I am going to ask Congress to institute its own 5-year ban on lobbying by former members of Congress and their staffs.\n> \n> **Third:** I am going to expand the definition of lobbyist so we close all the loopholes that former government officials use by labeling themselves consultants and advisors when we all know they are lobbyists.\n> \n> **Fourth:** I am going to issue a lifetime ban against senior executive branch officials lobbying on behalf of a foreign government.\n> \n> **And Fifth:** I am going to ask Congress to pass a campaign finance reform that prevents registered foreign lobbyists from raising money in American elections.\n\n[Source](https://www.donaldjtrump.com/press-releases/trump-details-ethics-reform-plan)",
    "controversiality": 0,
    "ups": 393,
    "downs": 0,
    "score": 393,
    "created": 1485229814.0,
    "date_created": "2017-01-23",
    "time_created": "14:50:14",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct1jfh",
    "parent_id": "t1_dct1bu7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "We agree on the problem, I don't agree on the solution.  Public campaign financing, reversing citizens united, and making campaign donation limits (say $20 per individual, no corporate financing) all would be much, much more effective then term limits which would most likely enhance the problem.   ",
    "controversiality": 0,
    "ups": 952,
    "downs": 0,
    "score": 952,
    "created": 1485226067.0,
    "date_created": "2017-01-23",
    "time_created": "13:47:47",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct529g",
    "parent_id": "t1_dct4h7j",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I mean this is a *huge* catch-22 type issue that seems like an appropriate first use of this method to me.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1485229907.0,
    "date_created": "2017-01-23",
    "time_created": "14:51:47",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctggth",
    "parent_id": "t1_dctfxer",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It wasn't just Colbert. It became clear this was like a vast network of propaganda bullshit guised under educational comedy and righteous battles for justice. Like an aggressive tumor, it spread through so many different facets of our sociological life. ",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1485242670.0,
    "date_created": "2017-01-23",
    "time_created": "18:24:30",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctgpkw",
    "parent_id": "t1_dctgd1z",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Jon Stewart always seemed well intentioned. I watched his show religiously for years. He continued to fight for rights even after he retired - and most importantly not just with his wallet. I think as I've grown up I may not agree with everything he says anymore, but I will always have the most utmost respect for that man. ",
    "controversiality": 0,
    "ups": 17,
    "downs": 0,
    "score": 17,
    "created": 1485242967.0,
    "date_created": "2017-01-23",
    "time_created": "18:29:27",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctb5io",
    "parent_id": "t1_dct8u2g",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And Mexico will pay for the panels (wall) and in return we will produce and install while sharing the energy. ",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1485236503.0,
    "date_created": "2017-01-23",
    "time_created": "16:41:43",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct3tgm",
    "parent_id": "t1_dct32ee",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Or at least not Hillary.",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1485228570.0,
    "date_created": "2017-01-23",
    "time_created": "14:29:30",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctgz34",
    "parent_id": "t1_dctg5vn",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I see it as a \"damn if you do, damn if you don't\" situation.\n\nPeople take global power of US for granted. For example, we're all used to international trading being done in USD, which gives the US financial system (and in terms, the US) huge global influences.\n\nWait until countries decide to trade in Yuan instead.",
    "controversiality": 0,
    "ups": 20,
    "downs": 0,
    "score": 20,
    "created": 1485243291.0,
    "date_created": "2017-01-23",
    "time_created": "18:34:51",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct991n",
    "parent_id": "t1_dct7uku",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This deal keeps sounding wackier and wackier.",
    "controversiality": 0,
    "ups": 93,
    "downs": 0,
    "score": 93,
    "created": 1485234431.0,
    "date_created": "2017-01-23",
    "time_created": "16:07:11",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct91zb",
    "parent_id": "t1_dct8dov",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Technically, Switzerland is a third world country.",
    "controversiality": 0,
    "ups": 201,
    "downs": 0,
    "score": 201,
    "created": 1485234216.0,
    "date_created": "2017-01-23",
    "time_created": "16:03:36",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctb9h5",
    "parent_id": "t1_dct8dov",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Here's another interesting addition: The terms were invented by a French historian/economist called Alfred Sauvy, and in his original article, \"the Third World\" was \"le Tiers Monde\". \"Tiers\" is actually a very archaic word for \"third\" - nowadays we would use \"troisième\" - and that's because it's a reference to the French Revolution in the 1780s, when \"the Third State\" (\"le Tiers État\") - the commoners - overthrew the \"First State\" (the church) and the \"Second State\" (the nobility). So the implication was that, in the 1950s, the capitalists and communists were so caught up in their own power struggles that they were vulnerable to rebellion from the poor, who of course suffered badly under both regimes.",
    "controversiality": 0,
    "ups": 11,
    "downs": 0,
    "score": 11,
    "created": 1485236621.0,
    "date_created": "2017-01-23",
    "time_created": "16:43:41",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct980m",
    "parent_id": "t1_dct8dov",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Genuinely, thank you. I've often wondered how the term came to be ",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1485234399.0,
    "date_created": "2017-01-23",
    "time_created": "16:06:39",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct82ul",
    "parent_id": "t1_dct6jtx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And politicians had to sign non disclosure agreement not to ever talk about it or its content.",
    "controversiality": 0,
    "ups": 159,
    "downs": 0,
    "score": 159,
    "created": 1485233156.0,
    "date_created": "2017-01-23",
    "time_created": "15:45:56",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct860u",
    "parent_id": "t1_dct6jtx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I can understand them wanting to keep the document on the down-low during the negotiation phase. But it's interesting that they couldn't even have notes to refer back to later in that room with the document, while representatives of dozens of corporations worldwide had unfiltered access to their own copies. \n\nThere's a double standard there. It's safe for one to have the information or its safe for none.",
    "controversiality": 0,
    "ups": 48,
    "downs": 0,
    "score": 48,
    "created": 1485233250.0,
    "date_created": "2017-01-23",
    "time_created": "15:47:30",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct7p44",
    "parent_id": "t1_dct6jtx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 280,
    "downs": 0,
    "score": 280,
    "created": 1485232742.0,
    "date_created": "2017-01-23",
    "time_created": "15:39:02",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct8c75",
    "parent_id": "t1_dct6jtx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "sounds so f'd up. ",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1485233437.0,
    "date_created": "2017-01-23",
    "time_created": "15:50:37",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6hhx",
    "parent_id": "t1_dct4tsj",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Well shit, that's downright reasonable.",
    "controversiality": 0,
    "ups": 120,
    "downs": 0,
    "score": 120,
    "created": 1485231425.0,
    "date_created": "2017-01-23",
    "time_created": "15:17:05",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct4l4i",
    "parent_id": "t1_dct3qt7",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1485229395.0,
    "date_created": "2017-01-23",
    "time_created": "14:43:15",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct8td7",
    "parent_id": "t1_dct7xa0",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1485233951.0,
    "date_created": "2017-01-23",
    "time_created": "15:59:11",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct2z1c",
    "parent_id": "t1_dct1nou",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Put up that fence!",
    "controversiality": 0,
    "ups": 74,
    "downs": 0,
    "score": 74,
    "created": 1485227652.0,
    "date_created": "2017-01-23",
    "time_created": "14:14:12",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct3j8n",
    "parent_id": "t1_dct1lhk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "So true. The veiled, sly fanboying is the issue. Places like T_D and r/sandersforpresident embrace the fanboyism",
    "controversiality": 0,
    "ups": 259,
    "downs": 0,
    "score": 259,
    "created": 1485228265.0,
    "date_created": "2017-01-23",
    "time_created": "14:24:25",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct93hd",
    "parent_id": "t1_dct1lhk",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "/r/politics is a hellhole. As a Californian Hillary voter, I can't stand that place. It's disgustingly partisan.",
    "controversiality": 0,
    "ups": 9,
    "downs": 0,
    "score": 9,
    "created": 1485234262.0,
    "date_created": "2017-01-23",
    "time_created": "16:04:22",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct53y3",
    "parent_id": "t1_dct4z43",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's a whole lot of asking a congress that's currently bent on preserving its own power...",
    "controversiality": 0,
    "ups": 113,
    "downs": 0,
    "score": 113,
    "created": 1485229957.0,
    "date_created": "2017-01-23",
    "time_created": "14:52:37",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct2h9v",
    "parent_id": "t1_dct1jfh",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I agree with reversing citizens united for sure, and having donation limits.\n\nBut where money ends, perks begin. And in that case if money is no longer able to be tracked, how do we keep lobbyists continuing to entice legislators? At least as it stands with money, we can clearly see where a politician is leaning. ",
    "controversiality": 0,
    "ups": 178,
    "downs": 0,
    "score": 178,
    "created": 1485227110.0,
    "date_created": "2017-01-23",
    "time_created": "14:05:10",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcthejv",
    "parent_id": "t1_dctb5io",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Holy shit. And, the President of Mexico loves this idea which is why Trump keeps saying how friendly they are with each other",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1485243826.0,
    "date_created": "2017-01-23",
    "time_created": "18:43:46",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctigle",
    "parent_id": "t1_dctgz34",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Once China allows the Yuan to be freely traded and not manipulated then we'll talk about it being the global trading and reserve currency. ",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1485245138.0,
    "date_created": "2017-01-23",
    "time_created": "19:05:38",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctc7vy",
    "parent_id": "t1_dct991n",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "it was the most draconian secret deal ever imagined giving corporations in member country jurisdiction over governments and customers in other sovereign states.",
    "controversiality": 0,
    "ups": 115,
    "downs": 0,
    "score": 115,
    "created": 1485237669.0,
    "date_created": "2017-01-23",
    "time_created": "17:01:09",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctai1d",
    "parent_id": "t1_dct91zb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "I bet its tough up there in the third world, so much hot cocoa and snow; how ever do they get by?",
    "controversiality": 0,
    "ups": 32,
    "downs": 0,
    "score": 32,
    "created": 1485235793.0,
    "date_created": "2017-01-23",
    "time_created": "16:29:53",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctcba2",
    "parent_id": "t1_dct91zb",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Switzerland is culturally, politically and economically aligned with the west.  \nThey just aren't allied with any other countries militarily, or fully integrated into an economic/political union like the EU (although they do adhere to most of its rules to have access to the common market).  \n\nFun fact: When Switzerland was criticized for not joining the EU, they changed their laws to allow any EU nation to join Switzerland as a canton.",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1485237774.0,
    "date_created": "2017-01-23",
    "time_created": "17:02:54",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctaw9k",
    "parent_id": "t1_dct82ul",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Totally not suspicious.",
    "controversiality": 0,
    "ups": 98,
    "downs": 0,
    "score": 98,
    "created": 1485236224.0,
    "date_created": "2017-01-23",
    "time_created": "16:37:04",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctb55f",
    "parent_id": "t1_dct82ul",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "How transparent!",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1485236492.0,
    "date_created": "2017-01-23",
    "time_created": "16:41:32",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctb6x8",
    "parent_id": "t1_dct82ul",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That is probably why it never stood a chance of being ratified by Congress.  Too much back room deals and loopoholes.",
    "controversiality": 0,
    "ups": 6,
    "downs": 0,
    "score": 6,
    "created": 1485236544.0,
    "date_created": "2017-01-23",
    "time_created": "16:42:24",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctb2rp",
    "parent_id": "t1_dct82ul",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And Hillary supported this for the longest time. Almost makes Trump's victory okay.",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1485236421.0,
    "date_created": "2017-01-23",
    "time_created": "16:40:21",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctp44j",
    "parent_id": "t1_dct860u",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "welcome to what globalization really means, it's where corporations clandestinely run the world through puppets, picking economic winners and losers whenever the wind changes and their profit margins start to slip.",
    "controversiality": 0,
    "ups": 10,
    "downs": 0,
    "score": 10,
    "created": 1485253383.0,
    "date_created": "2017-01-23",
    "time_created": "21:23:03",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct9i0l",
    "parent_id": "t1_dct7p44",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1485234704.0,
    "date_created": "2017-01-23",
    "time_created": "16:11:44",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6pwu",
    "parent_id": "t1_dct6hhx",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "clicks, upvotes, and retweets don't happen while being reasonable",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1485231679.0,
    "date_created": "2017-01-23",
    "time_created": "15:21:19",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct5qj0",
    "parent_id": "t1_dct4l4i",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1485230628.0,
    "date_created": "2017-01-23",
    "time_created": "15:03:48",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct3bit",
    "parent_id": "t1_dct2z1c",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And make the orphans pay for it!",
    "controversiality": 0,
    "ups": 128,
    "downs": 0,
    "score": 128,
    "created": 1485228028.0,
    "date_created": "2017-01-23",
    "time_created": "14:20:28",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct7bqp",
    "parent_id": "t1_dct3j8n",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "This thread is giving me a raging political boner right now.",
    "controversiality": 0,
    "ups": 78,
    "downs": 0,
    "score": 78,
    "created": 1485232337.0,
    "date_created": "2017-01-23",
    "time_created": "15:32:17",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct8glt",
    "parent_id": "t1_dct3j8n",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And much of what gets posted is a joke. They're not really hoping that trump becomes immortal and begins a human pan-galactic empire. They also don't really speak Russian when a trump/russia news article comes out.",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1485233568.0,
    "date_created": "2017-01-23",
    "time_created": "15:52:48",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct87g1",
    "parent_id": "t1_dct3j8n",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "And their meme game is emmaculate ",
    "controversiality": 0,
    "ups": 37,
    "downs": 0,
    "score": 37,
    "created": 1485233293.0,
    "date_created": "2017-01-23",
    "time_created": "15:48:13",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct629y",
    "parent_id": "t1_dct53y3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Do they want to screw with trump though? Say what you will about his Twitter habits, but they give him a LOT of power. Stock prices drop when a company upsets him and he chastises them on Twitter. \n\nDrop a few tweets naming individuals in congress who won't support the term limits, and all of a sudden their odds of reelection are looking slim. \n\nI say this after reading an article where the auto execs are quoted talking about Trump's tweets and how its shaping their decisions. ",
    "controversiality": 0,
    "ups": 222,
    "downs": 0,
    "score": 222,
    "created": 1485230970.0,
    "date_created": "2017-01-23",
    "time_created": "15:09:30",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct57ik",
    "parent_id": "t1_dct53y3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Well, Congress makes the laws...",
    "controversiality": 0,
    "ups": 18,
    "downs": 0,
    "score": 18,
    "created": 1485230063.0,
    "date_created": "2017-01-23",
    "time_created": "14:54:23",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6omd",
    "parent_id": "t1_dct53y3",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "He needs to try and push this shit now, then when congress blocks it he needs to get up on his bully pulpit and do what he does best: berate the government officials responsible for voting against him. He's got 2 years to threaten the re-election of these people before the midterms and make them look bad for going against the public's interests in favor of their own.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1485231640.0,
    "date_created": "2017-01-23",
    "time_created": "15:20:40",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct302l",
    "parent_id": "t1_dct2h9v",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "How do we prevent insider trading? Or investigate pay-to-play promises? It's doable.\n\nWe set up a division of the FBI or secret service or some other regulatory organization to monitor and investigate corruption and bribery and impose heavy criminal penalties to law breakers. If they are serious about it and actually act the culture can be changed. \n\nDoctors rarely get free dinners and beanie baby organs anymore because most employers don't allow drug reps to give their doctors anything. It's still there, but the culture for that really changed over time. \n\nWe can change the culture both formally and informally via shaming and criminal penalties, and this problem will be massively reduced. I fully believe that. \n\nI love my people in Washington, and I want people that know what they are doing and the history of the issues to stay there.  ",
    "controversiality": 0,
    "ups": 254,
    "downs": 0,
    "score": 254,
    "created": 1485227682.0,
    "date_created": "2017-01-23",
    "time_created": "14:14:42",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctj981",
    "parent_id": "t1_dcthejv",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "You guys are giving me a political boner.",
    "controversiality": 0,
    "ups": 29,
    "downs": 0,
    "score": 29,
    "created": 1485246130.0,
    "date_created": "2017-01-23",
    "time_created": "19:22:10",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctaq3y",
    "parent_id": "t1_dctai1d",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Having large breasted blonde women helps a bit. ",
    "controversiality": 0,
    "ups": 35,
    "downs": 0,
    "score": 35,
    "created": 1485236038.0,
    "date_created": "2017-01-23",
    "time_created": "16:33:58",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcthwsm",
    "parent_id": "t1_dctb6x8",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "but remember, they had us in mind. /s",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1485244457.0,
    "date_created": "2017-01-23",
    "time_created": "18:54:17",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctll2f",
    "parent_id": "t1_dctb2rp",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Seriously, I have a few liberal and independent friends I have to strong arm about this. The moral and ethical quagmire was thick.",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1485249071.0,
    "date_created": "2017-01-23",
    "time_created": "20:11:11",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctbqc5",
    "parent_id": "t1_dct9i0l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 26,
    "downs": 0,
    "score": 26,
    "created": 1485237129.0,
    "date_created": "2017-01-23",
    "time_created": "16:52:09",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6zc0",
    "parent_id": "t1_dct3bit",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "#",
    "controversiality": 0,
    "ups": 16,
    "downs": 0,
    "score": 16,
    "created": 1485231963.0,
    "date_created": "2017-01-23",
    "time_created": "15:26:03",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dcte9q6",
    "parent_id": "t1_dct7bqp",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's almost as if... Discussing politics can be even more fun and constructive... When we're friendly with the people we disagree with? \n\nNo, that can't be right.",
    "controversiality": 0,
    "ups": 19,
    "downs": 0,
    "score": 19,
    "created": 1485240061.0,
    "date_created": "2017-01-23",
    "time_created": "17:41:01",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctbrfr",
    "parent_id": "t1_dct87g1",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "We have the best memes, don't we folks?",
    "controversiality": 0,
    "ups": 13,
    "downs": 0,
    "score": 13,
    "created": 1485237161.0,
    "date_created": "2017-01-23",
    "time_created": "16:52:41",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct7sy4",
    "parent_id": "t1_dct629y",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Not to mention if they start a pissing match with him, he will just make it that much harder for them to pass any other laws.",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1485232857.0,
    "date_created": "2017-01-23",
    "time_created": "15:40:57",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct6tue",
    "parent_id": "t1_dct629y",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "The Art of the Deal baby! I too am hopeful he can intimidate them into having integrity",
    "controversiality": 0,
    "ups": 123,
    "downs": 0,
    "score": 123,
    "created": 1485231796.0,
    "date_created": "2017-01-23",
    "time_created": "15:23:16",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct3d5w",
    "parent_id": "t1_dct302l",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Beanie baby organs?",
    "controversiality": 0,
    "ups": 24,
    "downs": 0,
    "score": 24,
    "created": 1485228079.0,
    "date_created": "2017-01-23",
    "time_created": "14:21:19",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctawjc",
    "parent_id": "t1_dctaq3y",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "That's Sweden silly!",
    "controversiality": 0,
    "ups": 21,
    "downs": 0,
    "score": 21,
    "created": 1485236232.0,
    "date_created": "2017-01-23",
    "time_created": "16:37:12",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctarns",
    "parent_id": "t1_dctaq3y",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Sources?",
    "controversiality": 0,
    "ups": 8,
    "downs": 0,
    "score": 8,
    "created": 1485236086.0,
    "date_created": "2017-01-23",
    "time_created": "16:34:46",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctburk",
    "parent_id": "t1_dctbqc5",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "[removed]",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1485237263.0,
    "date_created": "2017-01-23",
    "time_created": "16:54:23",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dctb4ej",
    "parent_id": "t1_dct6tue",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "It's screwed up that you have to intimidate people elected for public service into having integrity. :-/",
    "controversiality": 0,
    "ups": 25,
    "downs": 0,
    "score": 25,
    "created": 1485236469.0,
    "date_created": "2017-01-23",
    "time_created": "16:41:09",
    "submission_id": "worldnews-5ppzs5"
  },
  {
    "id": "dct5xx9",
    "parent_id": "t1_dct3d5w",
    "subreddit_name_prefixed": "r/worldnews",
    "body": "Lol. Yeah. My dad is a doctor and back in the day he always got really weird drug company shit. There was always something stupid like a squeeze ball shaped like an organ or some other thing that had the drug's name on it to subconsciously cause doctors to write scripts for those drugs over the competition. I just remember these stupid beanie baby organs.",
    "controversiality": 0,
    "ups": 14,
    "downs": 0,
    "score": 14,
    "created": 1485230844.0,
    "date_created": "2017-01-23",
    "time_created": "15:07:24",
    "submission_id": "worldnews-5ppzs5"
  }
]