[
  {
    "id": "dr367ae",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "https://aliceandkev.wordpress.com/\n\nIt's a blog about playing as homeless characters in the Sims. It's long, and gets pretty weird at times, and I periodically almost spit out my beverage while reading it.",
    "controversiality": 0,
    "ups": 3213,
    "downs": 0,
    "score": 3213,
    "created": 1513034469.0,
    "date_created": "2017-12-11",
    "time_created": "10:21:09",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3830u",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I once had my home Linux server hacked while I was away on winter holiday.   Logging in remotely from my grandparents house I noticed that the server was behaving oddly, took a look at the log files and found them truncated, so sent a shutdown command so I could do forensics when I got home.\n\nWhat I ended up finding really did feel like swallowing the red pill.  Someone had hacked the server using a recent sendmail exploit and resold it to someone who was using it to host an 'eggdrop' IRC bot.   I logged into the IRC channel that it had been holding open and found a bunch of people sending short messages like 'CCs', or 'Root'.\n\nAbout five minutes in a longer message comes along.   Some guy is annoyed with a trade he has made, someone gave him a bad set of data and he wants to make his own data worthless in return before the buyer can get full use of it.\n\nSo on my screen there is suddenly a splat of information about some guy who lives in Texas, credit card, phone number, street address, and the first guy is urging everyone to buy stuff as quickly as possible before the credit limit is hit.\n\nFeeling I was fucked, I disconnected ASAP,  left an anonymous phone message on said Texas individual's answering machine advising them to check their Visa charges,  and hoped that my lack of foresight in not setting up an IP proxy or anything to hide my own identity wouldn't have either the FBI or organized crime breathing down my neck in a few days.",
    "controversiality": 0,
    "ups": 7559,
    "downs": 0,
    "score": 7559,
    "created": 1513036631.0,
    "date_created": "2017-12-11",
    "time_created": "10:57:11",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3639p",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I found out I had a stalker from high school when I was in community college and decided to Google my name for some dumb reason. I don't have a very common last name but there are still a few other people out there with my first and last name. \n\nI was like 10 pages deep in Google, place many do not ever go to and I found an old Tripod site that had my name in the url followed by one of my old AIM screen names. So I clicked it and was taken to a very basic page that had a ton of pictures stolen from my Myspace and others that had to have been taken without me knowing, thinks like me out working on my car or on the trampoline with my siblings in our yard...\n\nIt was really weird and I had no clue who it was until I scrolled all the way down and realized it was the girl I dated for a few months in Spring of our Sophomore year...she had a screen shot of a AIM conversation where I said I liked you way more than others or something on it and she took that and ran with it...",
    "controversiality": 0,
    "ups": 9320,
    "downs": 0,
    "score": 9320,
    "created": 1513034336.0,
    "date_created": "2017-12-11",
    "time_created": "10:18:56",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr34w4g",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "[Unlisted Videos](http://unlistedvideos.com/), a website that allows people to search for unlisted YouTube videos (but only if the video has been submitted to the site).  The site's database currently has over 71,000 videos that are searchable.  It includes unlisted videos from popular channels such as: [videogamedunkey](http://unlistedvideos.com/search.php?user=videogamedunkey), [h3h3Productions](http://unlistedvideos.com/search.php?user=h3h3Productions), [JonTron](http://unlistedvideos.com/search.php?user=JonTronShow), [PewDiePie](http://unlistedvideos.com/search.php?user=PewDiePie) etc.",
    "controversiality": 0,
    "ups": 1140,
    "downs": 0,
    "score": 1140,
    "created": 1513032871.0,
    "date_created": "2017-12-11",
    "time_created": "09:54:31",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr34ml8",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Early in the 90's I reached a site on the eastern coast of  Newfoundland that simply read \"You have reached the end of the internet, turn around and go back.\"",
    "controversiality": 0,
    "ups": 3028,
    "downs": 0,
    "score": 3028,
    "created": 1513032545.0,
    "date_created": "2017-12-11",
    "time_created": "09:49:05",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36mxq",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "The goddamned Rock-a-Fire Explosion.\n\nFor those of you old enough to remember this, before there was Chuck. E. Cheese... There was Showbiz Pizza. \n\nSome mad “genius” in Tampa started “perfecting” animatronics and creating characters for the birthday party celebrations... Only to see his precious creations get bought out, stripped down and repurposed.\n\nThere are some people out there who spend everything they make acquiring and maintaining these ancient monstrosities... Going to far as to program them to play their favorite songs by hand. \n\n[Here they are doing Nine Inch Nails.](https://youtu.be/RbnN6QmdrH4) \n\nThis is just the tip of the iceberg. I’m sorry, everyone. ",
    "controversiality": 0,
    "ups": 5276,
    "downs": 0,
    "score": 5276,
    "created": 1513034977.0,
    "date_created": "2017-12-11",
    "time_created": "10:29:37",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr33wak",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Board james. Started out as a board game review... by season 3 it's much more than that.",
    "controversiality": 0,
    "ups": 232,
    "downs": 0,
    "score": 232,
    "created": 1513031620.0,
    "date_created": "2017-12-11",
    "time_created": "09:33:40",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3fc31",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "if someone could just go ahead and turn this entire thread into a podcast that'd be great. thanks",
    "controversiality": 0,
    "ups": 231,
    "downs": 0,
    "score": 231,
    "created": 1513044195.0,
    "date_created": "2017-12-11",
    "time_created": "13:03:15",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr365ma",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I was on /r/tinder looking at some hilarious comebacks and putdowns. One of the top posts was a profile someone had posted of a young lady in a wheelchair, that had a wicked sense of humour around her situation.\n \nWell, turns out she was a redditor, and appeared in the comments section, chatting and joking away with other redditors about her profile.\n \nI went deeper and came across her story, which she'd [posted to Imgur](https://imgur.com/gallery/wtvDN) (possibly NSFW hospital images).\n \nSo from having a light-hearted chuckle at some funny Tinder chat, to going to bed deeply affected by one of the most, tragic, creepy/strange and yet uplifting human stories I've ever read was a pretty strange left turn.\n \nIf you're still on here /u/lifeproofbionicwoman - you rock!",
    "controversiality": 0,
    "ups": 10226,
    "downs": 0,
    "score": 10226,
    "created": 1513034414.0,
    "date_created": "2017-12-11",
    "time_created": "10:20:14",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr31bpb",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "[The Missing Germans](http://www.otherhand.org/home-page/search-and-rescue/the-hunt-for-the-death-valley-germans/). I read this all in one marathon session well into the wee hours. Essentially it's about a German family of four that were vacationing in the US and disappeared in Death Valley. A search-and-rescue guy hears about it and decides to try to solve the mystery.",
    "controversiality": 0,
    "ups": 19930,
    "downs": 0,
    "score": 19930,
    "created": 1513027916.0,
    "date_created": "2017-12-11",
    "time_created": "08:31:56",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr37eap",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "The Polaroids of [Jamie Livingston](http://photooftheday.hughcrawford.com/).  He took a Polaroid picture every day from 1979 to the day he died in 1997, his 41st birthday.  You have very little context of what is going on in his pictures but you can tell that they are very personal to him.  After browsing through hundreds of pictures I found myself building a narrative, recognizing new and old friends, getting clues as to his profession and wanting to know more.  I think I spent a few hours a day for a week just going through most of it. Damnit, now I'm going through it all over again. ",
    "controversiality": 0,
    "ups": 1977,
    "downs": 0,
    "score": 1977,
    "created": 1513035860.0,
    "date_created": "2017-12-11",
    "time_created": "10:44:20",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr34arh",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "This forum which is dedicated to 'baiting' the Nigerian prince email scammers:\n\nhttp://www.419eater.com/",
    "controversiality": 0,
    "ups": 12169,
    "downs": 0,
    "score": 12169,
    "created": 1513032131.0,
    "date_created": "2017-12-11",
    "time_created": "09:42:11",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36orq",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "For some reason, I find the  [Poles of Inaccessibility](https://en.m.wikipedia.org/wiki/Pole_of_inaccessibility) super fascinating. \n\n“A pole of inaccessibility marks a location that is the most challenging to reach owing to its remoteness from geographical features that could provide access.”\n\nFor example, Point Nemo (the Oceanic Pole of Inaccessibility) is so remote that if you were there and the International Space Station flew over you in orbit, you would be closer to it than to any land on Earth.\n\nedit: I realize that the ISS's orbit is only ~205-270 miles above Earth. My main point was that it's still pretty crazy to me that if you were here, you'd potentially be closer to an astronaut than to anyone on land. To put it in another perspective, you'd be a little more than 1 Pluto away from the nearest land. (Pluto's diameter is 1,475 miles, the nearest land from Point Nemo is 1,670 miles)",
    "controversiality": 0,
    "ups": 7621,
    "downs": 0,
    "score": 7621,
    "created": 1513035037.0,
    "date_created": "2017-12-11",
    "time_created": "10:30:37",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr31nwg",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Oh man, [Number Stations](https://youtu.be/u0F984w4vLQ) are incredibly creepy to me. Fascinating but creepy as hell.\n\n'A numbers station is a shortwave radio station characterized by broadcasts of formatted numbers, which are believed to be addressed to intelligence officers operating in foreign countries' - [Source](https://en.m.wikipedia.org/wiki/Numbers_station)\n\nEdit: [Meatcalculator](https://www.reddit.com/r/AskReddit/comments/7j1ady/comment/dr3e0ml?st=JB2P1I2Q&sh=2165cd74) posted a comment as someone who worked on a numbers station, thought I'd add it in here.\n\n[person_from_nowhere](https://www.reddit.com/r/AskReddit/comments/7j1ady/comment/dr3bli4?st=JB2PG3UQ&sh=6de2d6a2) also shared a story their dad told them about hearing a numbers station from the USSR when he was in the military.\n\n[Farlandan](https://www.reddit.com/r/AskReddit/comments/7j1ady/comment/dr3lsy2?st=JB2QG07H&sh=378e1af3) shared a story told to him by his CIA father who ran a numbers station.\n\n[SoupPlox](http://websdr.ewi.utwente.nl:8901/) is part of a group that tracks active number stations! You can find out more info on their website!\n\n[Turnersharkbitten](https://www.reddit.com/r/AskReddit/comments/7j1ady/comment/dr4mqqp?st=JB3GUXDK&sh=64ede71b) shared how they stumbled onto a numbers station while stationed in Miami and his commander pulled him aside the next day.",
    "controversiality": 0,
    "ups": 7078,
    "downs": 0,
    "score": 7078,
    "created": 1513028452.0,
    "date_created": "2017-12-11",
    "time_created": "08:40:52",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr344yb",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "[The Marion Zimmer Bradley/Walter Breen child sex abuse scandals](https://en.wikipedia.org/wiki/Marion_Zimmer_Bradley#Child_sex_abuse_allegations).  Yes, the author of the Mists of Avalon and the Darkover series, that Marion Zimmer Bradley. She died 15 years ago, but a few years it came out that she had molested her daughter, and probably other children, all while she had been a celebrated author, feminist, and important figure in the Sci Fi and Fantasy fandoms, from the 60s to the 90s.\n\nYou go down that rabbit hole, and then you find out that MZB's husband, Walter Breen, was a straight up child rapist pedophile who died in jail for it. MZB had defended him and covered up for his pedophilia even before they got married in the 60s. The \"Breendoggle\" scandal ripped apart the liberal hippy Sci Fi fandom in Berkeley; you can still find and read online various [fandoms zines](http://breendoggle.wikia.com/wiki/Breendoggle_Wiki) (newsletters) where this tiny community of a couple hundred nerds were hotly arguing over whether to ostracize Breen from the Sci Fi and Fantasy conventions because of his behaviour towards young boys. You can also find and read [transcripts from a 1990s lawsuit](https://web.archive.org/web/20160907053210/http://www.stephengoldin.com:80/MZB%20Website/Marion%20Zimmer%20Bradley%20%20In%20Her%20Own%20Words.html) against Breen's estate and MZB personally, where MZB comes off as an incredibly disgusting enabler and defender of him, as well as her own crimes against her daughter.\n\nWell, not to recap the whole thing here,  but that rabbit hole is a really horrifying and sickening look at the seedy underbelly of early 60s Sci Fi fandoms. Aside from the bad stuff, though, it's also the gateway to a really interesting look at the history of nerds and fandom, too, though. Link hopping around, you can get into some really fascinating minutiae-- like transcripts of 1960s and even 1940s fandom newsletters, where the early nerds obsessively categorized all the slang terms they used to talk about Flash Gordon or HG Wells. It's not all horrifying child rapists all the way down-- there's a lot of interesting similarities between early nerds and post-internet nerds.\n\n*Edit: to add links.",
    "controversiality": 0,
    "ups": 2518,
    "downs": 0,
    "score": 2518,
    "created": 1513031927.0,
    "date_created": "2017-12-11",
    "time_created": "09:38:47",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr33uod",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": " Back in the late 90s Compaq was shipping PCs with netbios sharing completely open. I learned that I can get into people's PCs by finding their IP while using Kazaa and Napster to look at their MP3s.I found this one guy in San Diego and as usual I'm going through his files, and I found a directory of child porno videos.A fucking collection. I called the FBI and gave  them his IP address. I never went searching in people's PCs again",
    "controversiality": 0,
    "ups": 6502,
    "downs": 0,
    "score": 6502,
    "created": 1513031563.0,
    "date_created": "2017-12-11",
    "time_created": "09:32:43",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3783v",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "It’s not a specific channel but I often get lost in the creepy side of YouTube.\n\nIt starts with a few stupid videos about ghosts or aliens. By the end of it I’m listen to stories about real people and human taxidermy. I’ve learned that real people are far, far more disturbing than any ghost or monster story.\n\nIt leaves me feeling creeped out and gross but also fascinated. I highly suggest giving it a go!",
    "controversiality": 0,
    "ups": 891,
    "downs": 0,
    "score": 891,
    "created": 1513035663.0,
    "date_created": "2017-12-11",
    "time_created": "10:41:03",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr33mvd",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "every now and then i look at all the proposed inevitable long-term physics repercussions that will wash over the universe. like the erosion of niagra falls, the loss of gravitational tidal lock with the moon & the last star dying in the cosmos type stuff https://en.m.wikipedia.org/wiki/Timeline_of_the_far_future\n\nEDIT: this is way more attention than i've ever gotten on Reddit, a thumbs up for all of you. but if you like my ramblings i do do (do do) a podcast i don't advertise called the unpanderers which is kind of like this? youtube the unpanderers, holy smokes folks!\n\nPSS - i love all your responses especially the 600million yrs C3 synthesis response",
    "controversiality": 0,
    "ups": 2494,
    "downs": 0,
    "score": 2494,
    "created": 1513031277.0,
    "date_created": "2017-12-11",
    "time_created": "09:27:57",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr30rn2",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Wikipedia's page on uncontacted tribes.  It's fascinating to read about first encounters, how everyone reacts, the ultimate outcome.  Every linked page about specific tribes is like it's own mini-drama.\nhttps://en.wikipedia.org/wiki/Uncontacted_peoples",
    "controversiality": 0,
    "ups": 12447,
    "downs": 0,
    "score": 12447,
    "created": 1513026972.0,
    "date_created": "2017-12-11",
    "time_created": "08:16:12",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr37m8e",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Opensecrets.org, look up your legislator's donors, then go to govtrack.us and look at the legislation they sponsor, co sponsor and vote on. Suprise!!\n\nI found my congressman pushed continuing a fed tax break on soda ash. I called him amd his office said it was for jobs and pressure from China but will only cost $30 million.  The last time it was passed they also did an impact study. No extra jobs, pressure??? Lol! They **raised** their prices 60% over that 4 year period and were an *extra* $1.5 billion more profitable!! To add insult to injury it wound up costing $150 million as mining operations simply shifted to federal lands for the break.\n\nWho was his #2 donor? You can already guess.",
    "controversiality": 0,
    "ups": 1233,
    "downs": 0,
    "score": 1233,
    "created": 1513036108.0,
    "date_created": "2017-12-11",
    "time_created": "10:48:28",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr2zopi",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "A few years back I came across demonbuster.com\n\nIt’s scary in the sense that they apparently believe there are demons in everything.\n\nEdit: corrected the web site name",
    "controversiality": 0,
    "ups": 1170,
    "downs": 0,
    "score": 1170,
    "created": 1513024965.0,
    "date_created": "2017-12-11",
    "time_created": "07:42:45",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr31hko",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "For cool stuff, Wikipedia's List of Unusual Articles. For a mixture of strange, sad, hilarious and frightening, sometimes all three at the same time, Fundies Say The Darndest Things got me through a lot of slow times back in the day. There was one thread in particular which achieved glory when the originally quoted poster turned up and ended up performing an online exorcism on an FSTDTer to expel the demon that was apparently making her lesbian. But in general there was plenty of gold, flat Earthers, space deniers, Moon deniers, disbelief in DNA, disbelief in primates, all sorts. ",
    "controversiality": 0,
    "ups": 3313,
    "downs": 0,
    "score": 3313,
    "created": 1513028180.0,
    "date_created": "2017-12-11",
    "time_created": "08:36:20",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr34gcc",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "A few years ago I developed pneumonia. I was out of commission for about a week. My kids were at school, my wife was at work and I was at home just trying to not stop breathing and keep as warm as possible.\n\nI saw an article about some member of the British royal family. Then I said \"Huh, I wonder if any other countries really have active royal families.\" So I started googling and began researching the Norwegian Royals.\n\nThen I found myself on the Wikipedia article for Ari Behn. It said he was a baptized member of *The Christian Community.* Having done quite a bit of reading on the subject of religion I was surprised I had never heard of this group. \n\nThis was a massive rabbit hole. You learn about the Christian Community and that leads you to Rudolph Steiner who leads you to biodynamics, Waldorf education and anthroposophy. \n\nThe bonus was that I felt like I learned a lot about something I was unaware of. The downside was that the next week I went back to work having dedicated myself to the subject full time and didn't know what to do with all of that knowledge or information. ",
    "controversiality": 0,
    "ups": 1325,
    "downs": 0,
    "score": 1325,
    "created": 1513032327.0,
    "date_created": "2017-12-11",
    "time_created": "09:45:27",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3446l",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "/r/subredditsimulator\n\nIts nothing but bots talking to each other using Markov chains of the subreddits they represent. It's hilarious and also kind of disturbing. All these bots just firing off responses trying to seem like people. Gets even weirder if you try to imagine it as a physical place. A bunch of physical representations of subreddits spouting off what sounds like gibberish to each other, undeterred that they make no sense. ",
    "controversiality": 0,
    "ups": 4241,
    "downs": 0,
    "score": 4241,
    "created": 1513031899.0,
    "date_created": "2017-12-11",
    "time_created": "09:38:19",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr31q10",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "There’s this series on YouTube called the “Marble Olympics.” I’m on mobile so I’ll link it later but this guy basically made different “events” and puts teams of marbles through them and color commentates. The production value isn’t bad considering what it is, and you WILL start rooting for a team. ",
    "controversiality": 0,
    "ups": 15246,
    "downs": 0,
    "score": 15246,
    "created": 1513028542.0,
    "date_created": "2017-12-11",
    "time_created": "08:42:22",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr35mik",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "There is a youtube channel called Sitting and Smiling.  It is literally full of videos of this guy who just sits and smiles for hours on end, and there are even some weird moments such as him pissing himself, a burglar walking into the room, etc.\n\nEDIT:  [Here is the channel](https://www.youtube.com/channel/UCqW54i24PGw1q7IxciRmgTA/featured)\nBTW, he still livestreams if you are intrigued enough to watch him.",
    "controversiality": 0,
    "ups": 734,
    "downs": 0,
    "score": 734,
    "created": 1513033774.0,
    "date_created": "2017-12-11",
    "time_created": "10:09:34",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr2vsa8",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "r/elsagate ",
    "controversiality": 0,
    "ups": 6153,
    "downs": 0,
    "score": 6153,
    "created": 1513015459.0,
    "date_created": "2017-12-11",
    "time_created": "05:04:19",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3aia1",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "www.notpron.com\n\n\nIt's browser based riddle. Some friends and I worked on it for weeks before giving up. I forgot how far we made it, I think to the 60s.",
    "controversiality": 0,
    "ups": 112,
    "downs": 0,
    "score": 112,
    "created": 1513039278.0,
    "date_created": "2017-12-11",
    "time_created": "11:41:18",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr2xbo4",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Serial killers on Wikipedia",
    "controversiality": 0,
    "ups": 7199,
    "downs": 0,
    "score": 7199,
    "created": 1513019683.0,
    "date_created": "2017-12-11",
    "time_created": "06:14:43",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr32q3k",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Old Cracked articles.",
    "controversiality": 0,
    "ups": 306,
    "downs": 0,
    "score": 306,
    "created": 1513030028.0,
    "date_created": "2017-12-11",
    "time_created": "09:07:08",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr30j09",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "[The Editing Room](http://www.the-editing-room.com/). They adjust movies' scripts highlithing plotholes and bad acting. How they break down and mock the stories is especially interesting if you have already seen the movie, they usually notice much more than a casual moviegoers sees.\n\nEDIT: since the site appears to have been hugged to death by reddit, you can check the google cache by searching \"The Editing Room + your movie\": [here The Phantom Menace](http://webcache.googleusercontent.com/search?q=cache:YJ6VwlcLHncJ:www.the-editing-room.com/phantommenace.html+&cd=1&hl=en&ct=clnk&gl=it&client=firefox-b)",
    "controversiality": 0,
    "ups": 19052,
    "downs": 0,
    "score": 19052,
    "created": 1513026546.0,
    "date_created": "2017-12-11",
    "time_created": "08:09:06",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr31kbx",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I somehow ended up on Reddit. Not sure how, or if it qualifies as scariest or most interesting.\n\nEdit: typo",
    "controversiality": 0,
    "ups": 4144,
    "downs": 0,
    "score": 4144,
    "created": 1513028300.0,
    "date_created": "2017-12-11",
    "time_created": "08:38:20",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr2wind",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "[SCP foundation ](http://www.scp-wiki.net/) is pretty great ",
    "controversiality": 0,
    "ups": 6398,
    "downs": 0,
    "score": 6398,
    "created": 1513017521.0,
    "date_created": "2017-12-11",
    "time_created": "05:38:41",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr2ymda",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "[History of askreddit](https://www.reddit.com/r/AskReddit/comments/4o1lw1/z/d48tvt8)\n\nEdit : [NSFL]For everyone asking for the [Dorritos story](https://i.imgur.com/Dtzklem_d.jpg?maxwidth=640&shape=thumb&fidelity=medium) NSFL,  sorry and I know it's too late , Read at your own risk \n\nEdit 2 : does anyone know what was \"peeping territorial wars\" about ?\n\nEdit 3 : anyone having problems with dorritos link,  u/ReaperOfFlowers wrote the whole story down in the comments. Thanks.\n\nSome more : ( don't worry these are lighthearted,  funny threads not like Dorr ): \n\n- [novelty accounts assemble](https://www.reddit.com/r/reddit.com/comments/etxhi/novelty_accounts_assemble/?utm_source=amp&utm_medium=comment_list)\n\n- [OP having a meltdown. .. about melts](https://www.reddit.com/r/grilledcheese/comments/2or1p3/you_people_make_me_sick/?utm_source=amp&utm_medium=comment_list)\n\n- [Predictable threads](https://www.reddit.com/r/HighQualityGifs/comments/77d9ou/the_predictable_threads_are_driving_me_insane?sort=top)\n\n- [Time traveller AMA](https://www.reddit.com/r/IAmA/comments/9z4d5/10_years_from_now_i_am_a_scientist_working_at_the/?utm_source=amp&utm_medium=comment_list)\n\n- [eight years old me ... we need to talk](https://www.reddit.com/r/AskReddit/comments/2i42bn/comment/ckyo27a)\n\n- [Shark tank with villains pitching diabolical plans ](https://www.reddit.com/r/WritingPrompts/comments/7d0x9k/wp_shark_tank_but_instead_of_an_entrepreneur/?utm_source=amp&utm_medium=comment_list)",
    "controversiality": 0,
    "ups": 3968,
    "downs": 0,
    "score": 3968,
    "created": 1513022746.0,
    "date_created": "2017-12-11",
    "time_created": "07:05:46",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3kqmb",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I bought a rooted phone, and have had to educate myself with how to use custom ROMs, the software that runs your phone.\n\nIn doing so I have learned a healthy fear of all things tech.  The amount of shit that 3rd parties do as a matter of fact with your data and private info is absolutley bonkers.  Background processes, scripts, permissions, and loads of stuff your phone came preloaded with, it is all there to track you, follow you, keep tabs on you, market you, predict you, identify you, and take advantage of you.\n\nTrust no one.  We are being spied on.  We line up for Nurse Ratched's sugar coated pills with each new device.",
    "controversiality": 0,
    "ups": 93,
    "downs": 0,
    "score": 93,
    "created": 1513049697.0,
    "date_created": "2017-12-11",
    "time_created": "14:34:57",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36jk1",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "This is a dangerous thread to browse during finals week...",
    "controversiality": 0,
    "ups": 608,
    "downs": 0,
    "score": 608,
    "created": 1513034870.0,
    "date_created": "2017-12-11",
    "time_created": "10:27:50",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr2wsqg",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Customer vs. Retail worker videos on YouTube. Entertainment at its finest.  ",
    "controversiality": 0,
    "ups": 993,
    "downs": 0,
    "score": 993,
    "created": 1513018278.0,
    "date_created": "2017-12-11",
    "time_created": "05:51:18",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr34pfj",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I was an active Mormon and researching something for a meeting. I came across a website that had great historical information and didn't at first appear to be an \"anti-Mormon\" site.  I read that the Restoration of the Priesthood doesn't have an actual date and immediately I thought that was BS because since I was a child I had read in Church publications all about the Restoration.  I could recite dates, names, places and what these great religious leaders were thinking at the time.  Yeah, about that...\n\nThis website showed strong evidence that it was all a lie, but I was sure they were wrong so I set out to prove they had the wrong facts.  I stared with the Church's publications, but dug deeper.  I searched for source material on college websites.  I found journals and other writings on archive.org.  I found websites that pulled together information from a dozen sources and assembled it in a way that was terrifying to read.  \n\nIn 2-weeks of near constant searching I went from a faithful member to feeling sick, crying and wanting to tear my own eyes out.  Then came anger and that feeling of betrayal.   I spent a couple hours nearly every day for the next year doing my best to prove everything wrong. I prayed, studied, fasted and in the end I had to be spiritually honest -- I had been lied to.\n\nEDIT:  I finally understand the statement \"RIP Inbox\"\n\nI have been responded to dozens of comments - I am doing my best while pretending to work.  :)\n\nEDIT 2:  My marriage ended after we both found out the truth.  After reflection, we were not a good match. In the Mormon faith you don't have sex prior to marriage so you end up with 22 year olds that date, but don't have sex.  This leads to getting married so you can have sex because having sex before marriage keeps you out of the temple - where you are saved.  So, your salvation is based upon getting to the temple.\n\nWithout the fear of losing our eternal salvation and family - the marriage crumbled.",
    "controversiality": 0,
    "ups": 20083,
    "downs": 0,
    "score": 20083,
    "created": 1513032644.0,
    "date_created": "2017-12-11",
    "time_created": "09:50:44",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr387nh",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "In 2012 a university administrator gave me the IP address of this old college server that held hundreds and hundreds of pages of html sites, midi files and ms paint jpgs linked in this little darknet. Finding something that was lost and forgotten on some old server with people's stories, comics and poetry was awesome. Of course I lost the IP...I like to think it's still online...",
    "controversiality": 0,
    "ups": 176,
    "downs": 0,
    "score": 176,
    "created": 1513036775.0,
    "date_created": "2017-12-11",
    "time_created": "10:59:35",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3936e",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "The Cloverfield \"ARG\" (Alternative Reality Game.) \n\n Basically when the trailer came out people were finding things which then led to secret websites, which would have to be investigated to find more clues about the movie. It's far too much to type out here but it went very deep. This has happened with both Cloverfield and 10 Cloverfield Lane and we are expecting it to happen when \"God Particle\" or whatever the third one will be named. /r/Cloververse is the subreddit for it.\n\nHere's one small example. During the trailer for 10 Cloverfield Lane we noticed they were drinking Swamp Pop, which was found as a real company in LA. People later bought 4 packs of it. With the 4 packs people were getting puzzle pieces. In the movie one of the characters is doing a puzzle but was frustrated because couldn't finish it as there were missing pieces. It's little stuff like that which makes it fun.\n\nAnother person found gps coordinates and found a box buried and it had a USB drive in it, turns out the USB had some audio files on it related to the movies (before they came out)\n\nOh and if you want to try that pop, world market carries it, I highly recommend the Praline Cream Soda. ",
    "controversiality": 0,
    "ups": 239,
    "downs": 0,
    "score": 239,
    "created": 1513037745.0,
    "date_created": "2017-12-11",
    "time_created": "11:15:45",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr2w8tz",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I needed an engrossing distraction from my anxiety so I started listening to a true crime podcast called Casefile. It’s really good, and did the trick. I would go to the subreddit after an episode, though it’s not very active. I stumbled on a post about the most horrifying case you’d ever read. That rabbit hole led me to David Parker Ray, who was never on Casefile. He sexually tortured dozens of women and had a video he’d make them watch when captured. After reading that transcript of that video I’m done with True Crime podcasts for a while. It’s literally the worst thing I’ve ever read. ",
    "controversiality": 0,
    "ups": 1213,
    "downs": 0,
    "score": 1213,
    "created": 1513016762.0,
    "date_created": "2017-12-11",
    "time_created": "05:26:02",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr338xy",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Building a PC on PC Part Picker. That stuff is dangerous, so many new words to learn, so little time.",
    "controversiality": 0,
    "ups": 748,
    "downs": 0,
    "score": 748,
    "created": 1513030753.0,
    "date_created": "2017-12-11",
    "time_created": "09:19:13",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr37a22",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "u/spontaneoush \n\nRedditor posts about trying heroin for the first time, how he won't get addicted, etc. Quickly becomes addicted, ends up \"dying\" and being resuscitated and ultimately getting clean.",
    "controversiality": 0,
    "ups": 82,
    "downs": 0,
    "score": 82,
    "created": 1513035726.0,
    "date_created": "2017-12-11",
    "time_created": "10:42:06",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr2w36d",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "TV Tropes: http://tvtropes.org\n\n[It's addictive](https://xkcd.com/609/)",
    "controversiality": 0,
    "ups": 3503,
    "downs": 0,
    "score": 3503,
    "created": 1513016312.0,
    "date_created": "2017-12-11",
    "time_created": "05:18:32",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr35fcr",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "This thread is so meta, as it leads me down a rabbit hole of looking through posted rabbit holes ",
    "controversiality": 0,
    "ups": 562,
    "downs": 0,
    "score": 562,
    "created": 1513033529.0,
    "date_created": "2017-12-11",
    "time_created": "10:05:29",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr31ovx",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Jedi fighting styles on wikipedia",
    "controversiality": 0,
    "ups": 813,
    "downs": 0,
    "score": 813,
    "created": 1513028493.0,
    "date_created": "2017-12-11",
    "time_created": "08:41:33",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr2vtyj",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Cicada 3301",
    "controversiality": 0,
    "ups": 1471,
    "downs": 0,
    "score": 1471,
    "created": 1513015591.0,
    "date_created": "2017-12-11",
    "time_created": "05:06:31",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr31sbe",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I kept clicking the porn ad and it kept taking me to different porn websites until I gave up ",
    "controversiality": 0,
    "ups": 659,
    "downs": 0,
    "score": 659,
    "created": 1513028638.0,
    "date_created": "2017-12-11",
    "time_created": "08:43:58",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr2zbxx",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "[Webdriver Torso](https://www.youtube.com/channel/UCsLiV4WJfkTEHH0b9PmRklw), a weird YouTube channel that's uploaded thousands of videos consisting of nothing but red and blue rectangles, with strange sounds playing over them. Video titles are all a random string of letters, and they're all only like 10 seconds long. Also one video of Paris, and one video of a cartoon in French, for no reason. Utterly bizarre.",
    "controversiality": 0,
    "ups": 2847,
    "downs": 0,
    "score": 2847,
    "created": 1513024261.0,
    "date_created": "2017-12-11",
    "time_created": "07:31:01",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3atsz",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "[Goodbye, Warden](http://www.goodbyewarden.com/#32) \n\nGoodbye, Warden a catalog of the last words of over 500 death row inmates in Texas. \n\nMany of them are very similar, but great care has been made to preserve exactly what was said and exactly how it was said. Some of them are confusing or disturbing. I’ve always wanted an excuse to share it. ",
    "controversiality": 0,
    "ups": 132,
    "downs": 0,
    "score": 132,
    "created": 1513039613.0,
    "date_created": "2017-12-11",
    "time_created": "11:46:53",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr2yyeg",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "There's this well known playlist on youtube called \"important videos\", it has about 300 videos that are mostly short and stupidly funny",
    "controversiality": 0,
    "ups": 23184,
    "downs": 0,
    "score": 23184,
    "created": 1513023483.0,
    "date_created": "2017-12-11",
    "time_created": "07:18:03",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr306pa",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Chris-Chan.\n\nEDIT: if you want a good summary on him.\n\nHis article on his own extensive wiki: https://sonichu.com/cwcki/Christian_Weston_Chandler\n\n\nAn hour-long documentary on him: https://youtu.be/bXjnakAlF-s",
    "controversiality": 0,
    "ups": 1412,
    "downs": 0,
    "score": 1412,
    "created": 1513025909.0,
    "date_created": "2017-12-11",
    "time_created": "07:58:29",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr312ra",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I feel bad admitting this but when hydraulic press videos first came out I was pretty hooked ",
    "controversiality": 0,
    "ups": 857,
    "downs": 0,
    "score": 857,
    "created": 1513027500.0,
    "date_created": "2017-12-11",
    "time_created": "08:25:00",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr33qst",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Family Feud highlights on YouTube",
    "controversiality": 0,
    "ups": 123,
    "downs": 0,
    "score": 123,
    "created": 1513031419.0,
    "date_created": "2017-12-11",
    "time_created": "09:30:19",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr32agn",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "*Missing 411*, and sovereign citizen fail videos. The latter is the funniest, most satisfying shit in existence right now. The former has me questioning reality.",
    "controversiality": 0,
    "ups": 459,
    "downs": 0,
    "score": 459,
    "created": 1513029391.0,
    "date_created": "2017-12-11",
    "time_created": "08:56:31",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr33ej4",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Hacker's Canyon. The closest thing to a legitimate 'unsolved mystery' I have ever found. This website has been live on the internet for over 10 years, there are thousands of pages with some really strange content, and despite the pure size of it all, the e-mail addresses on the website are still being replied to after all this time.\n\nI have no idea what is going on with that website, but there is no documentation on it. No Wikipedia article, no big forum discussion, absolutely nothing. I have tried to discuss this topic on Reddit multiple times in an attempt to pique someone's interest enough to help work it out, to finally solve it all, but I've never been able to get anyone interested. I'm 23 now and I've spent the majority of my life on the internet and there is absolutely nothing I've seen that has baffled me more than that site. \n\n[Here's](https://archive.4plebs.org/x/thread/14030289/) an archived post I made about it on 4chan a while back if anyone is curious. The website is discussed so little this link is one of the top 5 google results.. ",
    "controversiality": 0,
    "ups": 629,
    "downs": 0,
    "score": 629,
    "created": 1513030966.0,
    "date_created": "2017-12-11",
    "time_created": "09:22:46",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr2w5sf",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Pretty much any project by Alan Resnik.",
    "controversiality": 0,
    "ups": 586,
    "downs": 0,
    "score": 586,
    "created": 1513016516.0,
    "date_created": "2017-12-11",
    "time_created": "05:21:56",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr34ct4",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "[Strange Mysteries] (https://www.youtube.com/channel/UCaIyJ4xNpwHBfR6Jd0AgLWQ) About 10-minute science-oriented shorts that include topics like \"What Would A Civilization 1 Billion Years Older Than Us Be Like?\" and \"The Most Horrifying Theories of Mankind's Existence\"",
    "controversiality": 0,
    "ups": 116,
    "downs": 0,
    "score": 116,
    "created": 1513032204.0,
    "date_created": "2017-12-11",
    "time_created": "09:43:24",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr2vqpn",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "r/pens",
    "controversiality": 0,
    "ups": 335,
    "downs": 0,
    "score": 335,
    "created": 1513015339.0,
    "date_created": "2017-12-11",
    "time_created": "05:02:19",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr30gkh",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Watching 'extraordinary people' documentaries. They cover all sorts of medical and mental conditions, and life stories. It puts things into perspective.",
    "controversiality": 0,
    "ups": 275,
    "downs": 0,
    "score": 275,
    "created": 1513026421.0,
    "date_created": "2017-12-11",
    "time_created": "08:07:01",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr34jzn",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "This documentary on HBO called Tickled. Which is about a competitive tickling league and just spirals downward into weirder and weirder.",
    "controversiality": 0,
    "ups": 148,
    "downs": 0,
    "score": 148,
    "created": 1513032453.0,
    "date_created": "2017-12-11",
    "time_created": "09:47:33",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3rozt",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I saw a FB ad that mentioned listing countries that offer birthright citizenship.  I clicked it for the hell of it.  It listed the countries and the requirements.  I skimmed the list, it said Italy, and the requirements of which were if your ancestors were from Italy, you might qualify.  Wait...what?  My dad's side is Italian.  30 minutes later I was reading into the more proper requirements, and 2 hours later I was browsing ancestry dot com, digging for old family records of people I've never met.  Within another day or two, I sure thought I qualified.  More digging, and I actually did qualify.  That lead into 11 months of getting official documents, booking my appointment at the Italian consulate's office, getting documents translated into Italian, and I was ready.  With 56 different pieces of paper, I handed them all over, in order, and was given an unofficial thumbs up.  Italy now has to process things and I should get confirmation within a year.",
    "controversiality": 0,
    "ups": 102,
    "downs": 0,
    "score": 102,
    "created": 1513056796.0,
    "date_created": "2017-12-11",
    "time_created": "16:33:16",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr35gq6",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "David Mitchell's soap box. That rabbit hole just kept on going. After soap box.I saw all videos of \"Peep show\", then \"\"the Mitchel and Webb show\". when that ended I got into \"would I lie to you\". Then worst of all. I ended up with \"Quite Interesting\". It's a still ongoing binge",
    "controversiality": 0,
    "ups": 136,
    "downs": 0,
    "score": 136,
    "created": 1513033577.0,
    "date_created": "2017-12-11",
    "time_created": "10:06:17",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr33yl5",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Internet K-Hole : https://internetkholeblog.tumblr.com/\n\nPics from the 80s punk, goth, and metal scenes mostly.  Definitely good for trips back to what the underground was like back then!",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1513031701.0,
    "date_created": "2017-12-11",
    "time_created": "09:35:01",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3o52p",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "One day at work I found myself on the wikipedia entry for parrots (or maybe it was a specific parrot, I don't remember).\n\nI now own a cockatiel.  He is very sweet and I love him.  ",
    "controversiality": 0,
    "ups": 47,
    "downs": 0,
    "score": 47,
    "created": 1513053215.0,
    "date_created": "2017-12-11",
    "time_created": "15:33:35",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr35gc8",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "cesletter.com.\n\nAs a true blue, fully devout Mormon, I stumbled upon r/exmormon and the aforementioned CES Letter. I read the 80 page document in a couple of hours, diving deep into church history records in every rabbit hole I could find. Verified it all. \n\nMy world crumbled, I left the church, got divorced, my entire family calls me sinner and apostate when all I wanted was truth.\n\nSometimes I wish I could climb out of that rabbit hole and never put my nose in it.",
    "controversiality": 0,
    "ups": 237,
    "downs": 0,
    "score": 237,
    "created": 1513033564.0,
    "date_created": "2017-12-11",
    "time_created": "10:06:04",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr2wfg1",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "[The Time Cube](https://en.m.wikipedia.org/wiki/Time_Cube). That is quite the journey into madness.\n\nThe website is no longer up after his death, but [here is an archive of it](https://web.archive.org/web/20160112000701/http://timecube.com/)",
    "controversiality": 0,
    "ups": 967,
    "downs": 0,
    "score": 967,
    "created": 1513017276.0,
    "date_created": "2017-12-11",
    "time_created": "05:34:36",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr33wgm",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Dark Souls lore",
    "controversiality": 0,
    "ups": 247,
    "downs": 0,
    "score": 247,
    "created": 1513031626.0,
    "date_created": "2017-12-11",
    "time_created": "09:33:46",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3636o",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "for me, it's any wikipedia page about marvel/dc superheroes.  because the page inevitably contains a link (or 10) to another superhero/villain i've never heard of.  and that page contains a link to a character i've never heard of.  and so on.",
    "controversiality": 0,
    "ups": 123,
    "downs": 0,
    "score": 123,
    "created": 1513034333.0,
    "date_created": "2017-12-11",
    "time_created": "10:18:53",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr39jwj",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Rotten.com\n\n\nAm I showing my age?",
    "controversiality": 0,
    "ups": 122,
    "downs": 0,
    "score": 122,
    "created": 1513038251.0,
    "date_created": "2017-12-11",
    "time_created": "11:24:11",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr37fzr",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "www.natethesnake.com.\n\nIt's worth the full read. It's basically one long joke.",
    "controversiality": 0,
    "ups": 38,
    "downs": 0,
    "score": 38,
    "created": 1513035914.0,
    "date_created": "2017-12-11",
    "time_created": "10:45:14",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr33hbm",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "My most recent obsession has been [ElsaGate](https://www.reddit.com/r/ElsaGate/?utm_term=3a2b1ee4-127c-48e4-bfa4-34fb57683420&utm_medium=search&utm_source=reddit&utm_name=AskReddit&utm_content=1)   \n\nTL;DR: There are a lot of very, very, VERY strange and wholly innapropriate videos on youtube marketed to kids that many believe are secret communications between criminals, or trying to groom a new generation of kids to accept inappropriate behavior as OK.",
    "controversiality": 0,
    "ups": 174,
    "downs": 0,
    "score": 174,
    "created": 1513031069.0,
    "date_created": "2017-12-11",
    "time_created": "09:24:29",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr34bdf",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "[5 Second Films.](http://5secondfilms.com/) They make films that are literally only 5 seconds long. I've spent an embarrassing amount of hours watching them.",
    "controversiality": 0,
    "ups": 146,
    "downs": 0,
    "score": 146,
    "created": 1513032153.0,
    "date_created": "2017-12-11",
    "time_created": "09:42:33",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr368s6",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Pick a religious cult and research that. It just keeps getting deeper (Scientology specifically is absolutely nuts.)",
    "controversiality": 0,
    "ups": 79,
    "downs": 0,
    "score": 79,
    "created": 1513034520.0,
    "date_created": "2017-12-11",
    "time_created": "10:22:00",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr330zr",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "The mightly [superpower wiki](http://powerlisting.wikia.com/wiki/Superpower_Wiki). The random button is pretty fun, and can actually be good ofr setting up one-off RPG sessions.",
    "controversiality": 0,
    "ups": 102,
    "downs": 0,
    "score": 102,
    "created": 1513030452.0,
    "date_created": "2017-12-11",
    "time_created": "09:14:12",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr33cde",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "/r/neckbeardnests\n\nI don’t remember how I ended up here, but I found myself at the subs top all time where I learned of some heroes like Fridgebro.\n\nI’ve never physically gagged at a photo before seeing some of the extra photos in that thread, so I’d say it was an interesting rabbit hole I don’t see myself venturing down again anytime soon.",
    "controversiality": 0,
    "ups": 187,
    "downs": 0,
    "score": 187,
    "created": 1513030886.0,
    "date_created": "2017-12-11",
    "time_created": "09:21:26",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr341mn",
    "parent_id": "t3_7j1ady",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "englishrussia back in the day. Haven’t been to that site in years but it was fascinating to see how everyone lives behind the iron curtain. ",
    "controversiality": 0,
    "ups": 37,
    "downs": 0,
    "score": 37,
    "created": 1513031809.0,
    "date_created": "2017-12-11",
    "time_created": "09:36:49",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3v1k3",
    "parent_id": "t1_dr367ae",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I am mostly surprised that the game supports this kind of gameplay at all. It's bizarre in a kind of good way.",
    "controversiality": 0,
    "ups": 512,
    "downs": 0,
    "score": 512,
    "created": 1513060308.0,
    "date_created": "2017-12-11",
    "time_created": "17:31:48",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3cv10",
    "parent_id": "t1_dr367ae",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I just read the whole thing, and it was so good. Wow, superb writing. Alice and Kev felt so real, and I know people are living very similar lives in our world as we speak.",
    "controversiality": 0,
    "ups": 494,
    "downs": 0,
    "score": 494,
    "created": 1513041704.0,
    "date_created": "2017-12-11",
    "time_created": "12:21:44",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3wu43",
    "parent_id": "t1_dr367ae",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Thanks for posting that! It was a surprisingly good read and I was more invested in it than I thought I’d be.",
    "controversiality": 0,
    "ups": 57,
    "downs": 0,
    "score": 57,
    "created": 1513062253.0,
    "date_created": "2017-12-11",
    "time_created": "18:04:13",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3fkb8",
    "parent_id": "t1_dr367ae",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "This is content I come here for, thank you. ",
    "controversiality": 0,
    "ups": 51,
    "downs": 0,
    "score": 51,
    "created": 1513044430.0,
    "date_created": "2017-12-11",
    "time_created": "13:07:10",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3976a",
    "parent_id": "t1_dr367ae",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Omg the ending...",
    "controversiality": 0,
    "ups": 88,
    "downs": 0,
    "score": 88,
    "created": 1513037865.0,
    "date_created": "2017-12-11",
    "time_created": "11:17:45",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3t1x0",
    "parent_id": "t1_dr3830u",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Damn..makes me feel really computer illiterate reading this.",
    "controversiality": 0,
    "ups": 5953,
    "downs": 0,
    "score": 5953,
    "created": 1513058193.0,
    "date_created": "2017-12-11",
    "time_created": "16:56:33",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr41mp6",
    "parent_id": "t1_dr3830u",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "It is ridiculous these days, bots are constantly scanning IP ranges for open SSH ports. Almost the instant you have a server with an open root password or an insecure password it us taken over and added to the botnet.\n\nI set up Fail2Ban to ban IPs that attempt more than 5 logins and it sends me an email when it happens, I get multiple emails a day, every day it is insane.",
    "controversiality": 0,
    "ups": 73,
    "downs": 0,
    "score": 73,
    "created": 1513067822.0,
    "date_created": "2017-12-11",
    "time_created": "19:37:02",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr38phl",
    "parent_id": "t1_dr3639p",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "What happened?  Did you report her?  Confront her (I hope not but college kids can be dumb sometimes)? I need a resolution to this story. ",
    "controversiality": 0,
    "ups": 2031,
    "downs": 0,
    "score": 2031,
    "created": 1513037327.0,
    "date_created": "2017-12-11",
    "time_created": "11:08:47",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3cf8c",
    "parent_id": "t1_dr3639p",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I came across some gay guy that had blog with a post about me, and what he wanted to do to me, sexually. I only came across it because I'm a bit paranoid, and I reverse lookup my photos all the time. (I've caught a couple of fake profiles in weird mexican social networks as well).\n\nAnyhow apparently we were introduced, but for the life of me, I can't recall him, but then again, I'm terrible with faces. The description was truly kinky. I think I'd disappoint him. If I recall correctly he was heavily into SM, and I'm more of a peace and love guy.\n\nI wonder if it's still up.\n\nEDIT: The blog is still up, but the post has been deleted =c",
    "controversiality": 0,
    "ups": 171,
    "downs": 0,
    "score": 171,
    "created": 1513041257.0,
    "date_created": "2017-12-11",
    "time_created": "12:14:17",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3b5nk",
    "parent_id": "t1_dr34w4g",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "What does unlisted mean exactly? I’m unfamiliar",
    "controversiality": 0,
    "ups": 118,
    "downs": 0,
    "score": 118,
    "created": 1513039953.0,
    "date_created": "2017-12-11",
    "time_created": "11:52:33",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3e7nk",
    "parent_id": "t1_dr34ml8",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I don’t think it’s the same one, but www.wwwdotcom.com used to say something like ‘Congratulations, you have reached the last page of the internet. Now turn off your computer and go outside.’",
    "controversiality": 0,
    "ups": 1095,
    "downs": 0,
    "score": 1095,
    "created": 1513043054.0,
    "date_created": "2017-12-11",
    "time_created": "12:44:14",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3c556",
    "parent_id": "t1_dr34ml8",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Opaldata.com/the_end/index.html\n\nLooks like it isn’t up anymore though",
    "controversiality": 0,
    "ups": 139,
    "downs": 0,
    "score": 139,
    "created": 1513040973.0,
    "date_created": "2017-12-11",
    "time_created": "12:09:33",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3gtwx",
    "parent_id": "t1_dr36mxq",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Didn't Chuck E. Cheese and Showbiz join? I remember there being a Showbiz near where I lived as a kid, and suddenly it was a Chuck E. Cheese.",
    "controversiality": 0,
    "ups": 517,
    "downs": 0,
    "score": 517,
    "created": 1513045711.0,
    "date_created": "2017-12-11",
    "time_created": "13:28:31",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3ogtk",
    "parent_id": "t1_dr36mxq",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "The history of Chuck E. Cheese/Showbiz Pizza and the whole creation of those types of restaurants is also a pretty fun rabbit hole.",
    "controversiality": 0,
    "ups": 69,
    "downs": 0,
    "score": 69,
    "created": 1513053546.0,
    "date_created": "2017-12-11",
    "time_created": "15:39:06",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3fcuz",
    "parent_id": "t1_dr36mxq",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Definitely picking up a Five Nights At Freddy's vibe from all this...",
    "controversiality": 0,
    "ups": 466,
    "downs": 0,
    "score": 466,
    "created": 1513044216.0,
    "date_created": "2017-12-11",
    "time_created": "13:03:36",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3okd5",
    "parent_id": "t1_dr36mxq",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I love the Rock-a-Fire covers. Here is my favorite: [Pop Lock and Drop It](https://www.youtube.com/watch?v=Fd5c3Qtcr_w)",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1513053643.0,
    "date_created": "2017-12-11",
    "time_created": "15:40:43",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr372fp",
    "parent_id": "t1_dr365ma",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I might be..lol Thank you!",
    "controversiality": 0,
    "ups": 15500,
    "downs": 0,
    "score": 15500,
    "created": 1513035483.0,
    "date_created": "2017-12-11",
    "time_created": "10:38:03",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3nxdh",
    "parent_id": "t1_dr365ma",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Wtf people regularly put mannequins on train tracks as a prank?! That's so messed up. ",
    "controversiality": 0,
    "ups": 204,
    "downs": 0,
    "score": 204,
    "created": 1513052999.0,
    "date_created": "2017-12-11",
    "time_created": "15:29:59",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3rkg3",
    "parent_id": "t1_dr365ma",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "So, if I read correctly this Daniel person possibly placed you across the tracks??",
    "controversiality": 0,
    "ups": 110,
    "downs": 0,
    "score": 110,
    "created": 1513056669.0,
    "date_created": "2017-12-11",
    "time_created": "16:31:09",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3mrba",
    "parent_id": "t1_dr365ma",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I saw the picture of the mountains, and realized she was in my town. Saw the campus, and realized she goes to the school I'm starting in spring. I hope I can meet her and have an awkward conversation about her year-old imgur post.",
    "controversiality": 0,
    "ups": 120,
    "downs": 0,
    "score": 120,
    "created": 1513051802.0,
    "date_created": "2017-12-11",
    "time_created": "15:10:02",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3mwxt",
    "parent_id": "t1_dr365ma",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "In case you like stories like that, I can tell you one.\n\nI worked the night shift at a home for disabled people one summer. I'd never done any work like that before, but there were only three residents there and all I really had to do was wipe one of their asses if he got up during the night. Besides having to call an ambulance on my first unsupervised watch (that was not fun), the summer was largely uneventful. There were three male residents. They were all mentally impaired and I got to know all of them both through interactions and through stories from the caretakers. Two of them were in modest health, but the third was wheelchair bound, in his sixties, with some respiratory problems and was pretty much starting on his way out. It was he that really freaked me out. You see, while the other two were mentally handicapped from birth, he'd been in an accident. He'd been driving outside of town when he got into an accident. For the life of me I can't remember whether he forewent his seatbelt or was driving too fast, but I no longer do both after hearing his story. He's in a nasty crash and suffers extensive damage. They manage to save his life, but it takes quite some time for him to gain his motor functions (which he'd lost again by the time I met him), but his mind was pretty much gone. He could talk and interact with you, but only to a certain degree. His memory since the accident was non-existent. He never remembered me. He never remembered his caretaker of (then) twelve years. He never even recognized his daughter which sometimes came to visit him. But he seemed to remember most of his life before the crash. He could tell you all about his car (if you had the patience to listen) and was a hell of an olsen olsen player, but it was as if he'd died in that accident and all that remained was a recording.\n\nNow for the truly horrifying part. When I met him he was in his sixties. He was 22 when the accident happened. His daughter was around 1-2 years old. She never knew her father as anything other than a husk and he has spent longer trapped in that body than he had lived before the accident. His caretaker even confided in me that she thought his health problems were him finally giving up and hoped to God that he would die soon. She loved that man and felt nothing but sadness for the life he'd been forced to live.",
    "controversiality": 0,
    "ups": 141,
    "downs": 0,
    "score": 141,
    "created": 1513051965.0,
    "date_created": "2017-12-11",
    "time_created": "15:12:45",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr357m7",
    "parent_id": "t1_dr31bpb",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "This was an amazing read. Got completely hooked on the story the last time this was posted. The guy explained the searches so well it almost felt like you were there. Would make an awesome novel turned into a mediocre movie.",
    "controversiality": 0,
    "ups": 5791,
    "downs": 0,
    "score": 5791,
    "created": 1513033264.0,
    "date_created": "2017-12-11",
    "time_created": "10:01:04",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3cxov",
    "parent_id": "t1_dr31bpb",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I read that story several months ago, and what stuck with me is that they died because they failed to realize that they were in a life-or-death situation until very late. Even once their van got stuck, if they had realized that they and their children were horribly screwed and in severe danger, the logical thing to do would have been to walk several miles back the same way they had come and break into the closed-up cabin that they had briefly stopped at, because it probably had access to water, maybe even a telephone line, and it was on a road, albeit a rarely-traveled one. \n\nInstead, the adults apparently just decided to go looking for help in calling someone to get their van unstuck, which by the author's guess is what led them to walk further into the wilderness towards that abandoned army testing ground in the desert. ",
    "controversiality": 0,
    "ups": 315,
    "downs": 0,
    "score": 315,
    "created": 1513041778.0,
    "date_created": "2017-12-11",
    "time_created": "12:22:58",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr39154",
    "parent_id": "t1_dr31bpb",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "This was a very cool read and I'm glad to see it here - I read it a year or so ago when Jeff Atwood retweeted it.\n\nI had the opportunity to visit Death Valley this past summer and loved every second of it - I think the temps spiked around 125F while we were there. The heat was oppressive but seemed oddly tolerable.  Of course, we made sure we were pounding water and had several gallons to spare in the trunk, and we made sure to follow the recommended safety precautions and didn't spend crazy amounts of time outside, only did some very short hikes (borax mine), and generally appreciated the park from inside of or very close to our rental car.\n\nWhat I did notice though - besides just the fact that 75% of the tourists were European - was that a lot of the foreign tourists didn't seem to take the heat very seriously.  At Badwater Basin - the lowest point in North America - we saw several young children who seemed dazed and their parents only had one small water bottle for the entire group (we each had several bottles in our backpacks).  \n\nWhat stood out the most to me, though, was a foreign family who decided to walk way out into the salt flat from the parking lot.  The mother and young daughter stopped halfway down the flat, but the father and young son kept walking and walking and walking all the way beyond the end of this particular salt flat - and they only had one water bottle.  It was insane.  It was like a five minute walk out there and then they were just standing and milling around for several minutes.  It really made me worried for them.",
    "controversiality": 0,
    "ups": 371,
    "downs": 0,
    "score": 371,
    "created": 1513037684.0,
    "date_created": "2017-12-11",
    "time_created": "11:14:44",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36d25",
    "parent_id": "t1_dr31bpb",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Aaaaaaand the site is down",
    "controversiality": 0,
    "ups": 2922,
    "downs": 0,
    "score": 2922,
    "created": 1513034661.0,
    "date_created": "2017-12-11",
    "time_created": "10:24:21",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36av5",
    "parent_id": "t1_dr31bpb",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Go give the \"What if?\"-Podcast episode 47 a listen, they cover the story and the effort the guy puts into his research.",
    "controversiality": 0,
    "ups": 98,
    "downs": 0,
    "score": 98,
    "created": 1513034587.0,
    "date_created": "2017-12-11",
    "time_created": "10:23:07",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr398td",
    "parent_id": "t1_dr31bpb",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "This was super interesting when I read it. More of a journal type POV from the searcher, and he's a good writer rather than just listing facts which I didn't know I wanted to read. I like how he describes how he tries to get into the heads of the missing people to guide his search when it's a vast wilderness, rather than just searching aimlessly around their vehicle.",
    "controversiality": 0,
    "ups": 45,
    "downs": 0,
    "score": 45,
    "created": 1513037915.0,
    "date_created": "2017-12-11",
    "time_created": "11:18:35",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3j50s",
    "parent_id": "t1_dr37eap",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Pictures without context can be pretty unsettling. My dad is convinced there’s ghosts in my house, so he’ll occasionally just walk around and snap pictures looking for orbs and whatnot. If some strange event occurs in which someone happens across these pictures without talking to any of us about it, it would just appear to be a long series of pictures of my house, random corners, dark hallways, no people in any of them. ",
    "controversiality": 0,
    "ups": 684,
    "downs": 0,
    "score": 684,
    "created": 1513048069.0,
    "date_created": "2017-12-11",
    "time_created": "14:07:49",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3btly",
    "parent_id": "t1_dr34arh",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "guy convinces scammer to get a tattoo\n\nhttp://www.419eater.com/html/okorie.htm ",
    "controversiality": 0,
    "ups": 5105,
    "downs": 0,
    "score": 5105,
    "created": 1513040641.0,
    "date_created": "2017-12-11",
    "time_created": "12:04:01",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3a4fx",
    "parent_id": "t1_dr34arh",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "If you're into this you've probably heard of James Veitch, but if not check him out. He baits all kinds of scam emails for comedy. ",
    "controversiality": 0,
    "ups": 2100,
    "downs": 0,
    "score": 2100,
    "created": 1513038866.0,
    "date_created": "2017-12-11",
    "time_created": "11:34:26",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3c20v",
    "parent_id": "t1_dr34arh",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "This is actually fantastic. I think people who do this might not realize how much good they're actually doing. 419 scams don't tend to work on most people, they specifically work on the disabled and lonely. People looking for any chance at a bit of money. Then these bastards give them false hope and take what little money they have.",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1513040882.0,
    "date_created": "2017-12-11",
    "time_created": "12:08:02",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3bmzf",
    "parent_id": "t1_dr36orq",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "For similar reasons, I find the [Kerguelen Islands](https://en.m.wikipedia.org/wiki/Kerguelen_Islands) fascinating.  The few available pictures are hauntingly beautiful, and it is one of the most remote places on Earth. ",
    "controversiality": 0,
    "ups": 581,
    "downs": 0,
    "score": 581,
    "created": 1513040446.0,
    "date_created": "2017-12-11",
    "time_created": "12:00:46",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3f9h5",
    "parent_id": "t1_dr36orq",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Isn't Point Nemo frighteningly close to the theorized location of R'lyeh?\n\nWikipedia: \n\n> Lovecraft claims R'lyeh is located at 47°9′S 126°43′W in the southern Pacific Ocean.[1] Writer August Derleth, a contemporary correspondent of Lovecraft, placed R'lyeh at 49°51′S 128°34′W.[2] The latter coordinates place the city approximately 5,100 nautical miles (9,400 km) from the actual island of Pohnpei (Ponape), the location of the fictional \"Ponape Scripture\". Both locations are close to the Pacific pole of inaccessibility (48°52.6′S 123°23.6′W), a point in the ocean farthest from any land mass.",
    "controversiality": 0,
    "ups": 1968,
    "downs": 0,
    "score": 1968,
    "created": 1513044118.0,
    "date_created": "2017-12-11",
    "time_created": "13:01:58",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3lsy2",
    "parent_id": "t1_dr31nwg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "My dad worked in the CIA in the 1960s and 70s,  and I've known that since I was a kid, but he always told me it was just embassy and communications stuff,  no assassinations or shootouts or anything that young me would have found very interesting.\n\nAbout 2 years ago I asked him some specifics about it, and he said \"Oh,  I was operating a numbers station in brazil.\"   I almost choked on my beer.  I'd read up on numbers stations in the past and was fascinated.  I asked him to explain it,  but it was damn complicated.   Here's the best I can explain it.  \n\nSo agents in the field were told to listen to a radio station at specific times.  If a specific song was played on that radio station it indicated that the agent should tune to the numbers station and the numbers being broadcast would be an authentic message that needed to be decoded,  if a second, different song was being played it signaled that there was no message and any numbers being broadcast were meaningless.  This was so agents in the field wouldn't have to set up their shortwave radio receivers,  and potentially expose themselves to being found with said radios, unless there was an actual message forthcoming.\n\nThe actual numbers themselves were the complicated part... something about five-letter encrypts and \"one-time-use pads\" where the numbers represented groups of five letters,  with some caveats like two \"A\"s meaning \"B\" and some other letters being transposed on the fly (he said a large part of training was committing these to memory). \n\nIt was complex stuff.  I told him that one of these days he should do an AMA on it,  but he isn't sure doing an AMA on cold war espionage would be a great idea in such a public setting.\n\nEDIT: sorry,  he was stationed in brazil at one point,  but when he was doing the numbers stations he was in Florida and Virginia.",
    "controversiality": 0,
    "ups": 765,
    "downs": 0,
    "score": 765,
    "created": 1513050801.0,
    "date_created": "2017-12-11",
    "time_created": "14:53:21",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr35m1k",
    "parent_id": "t1_dr31nwg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "and then for the guy recieving the message its just another boring day at work",
    "controversiality": 0,
    "ups": 2673,
    "downs": 0,
    "score": 2673,
    "created": 1513033758.0,
    "date_created": "2017-12-11",
    "time_created": "10:09:18",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36ljj",
    "parent_id": "t1_dr31nwg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I suggest checking out [The Conet Project](http://www.youtube.com/playlist?list=PLSoYU4Rz9Q6xFJ6nPc2zGUPwS_LBzOmUn) if you’re not already familiar with it. It’s a series of numbers station recording first released on CD back in the 90s, but now available for free online. The link is to a YouTube playlist of the recordings.",
    "controversiality": 0,
    "ups": 399,
    "downs": 0,
    "score": 399,
    "created": 1513034934.0,
    "date_created": "2017-12-11",
    "time_created": "10:28:54",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3e0ml",
    "parent_id": "t1_dr31nwg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Having worked in the aerospace industry, we ran our own “number station”, quite often reading a series of numbers or phrases repeatedly.\n\nWhy?\n\nTo check our recordings of what is transmitted be each radio and person. To check our recordings of what was received. What was heard by different people with their radio panels set up different ways. Squelch, voice activated mics, background noise. To check the directionality and efficiency of antennas. To judge the accuracy of direction finding equipment. To validate interference models between the various antennas and radios. It goes on and on.\n\nThere are doubtless recordings of me out there reading out the time for hours at a time. Bored, monotone, airsick...",
    "controversiality": 0,
    "ups": 473,
    "downs": 0,
    "score": 473,
    "created": 1513042856.0,
    "date_created": "2017-12-11",
    "time_created": "12:40:56",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr35yl3",
    "parent_id": "t1_dr31nwg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "The numbers, Mason..",
    "controversiality": 0,
    "ups": 1042,
    "downs": 0,
    "score": 1042,
    "created": 1513034178.0,
    "date_created": "2017-12-11",
    "time_created": "10:16:18",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3cdro",
    "parent_id": "t1_dr31nwg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "As a teenager, I used to stay up late listening to these, writing down each number and wracking my mind to figure out a pattern to them. \n\nPrevious code breaking experience: 0. \n\nNumber of top secret codes broken: 0. \n\nNumber of phone calls from 3 letter agencies looking to recruit my genius ass: 0. ",
    "controversiality": 0,
    "ups": 125,
    "downs": 0,
    "score": 125,
    "created": 1513041215.0,
    "date_created": "2017-12-11",
    "time_created": "12:13:35",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3ef6p",
    "parent_id": "t1_dr31nwg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": ">E25, E25a: Run by Egyptian intelligence. Mistakes on this station are very common, typical mistakes include Windows 7 login sounds, to the operator playing Solitaire in the background.\n\nAh yes, gotta get that solitaire game in while spying.",
    "controversiality": 0,
    "ups": 57,
    "downs": 0,
    "score": 57,
    "created": 1513043262.0,
    "date_created": "2017-12-11",
    "time_created": "12:47:42",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr381gw",
    "parent_id": "t1_dr31nwg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Thank God someone mentioned these! The fact that your imagination is really the limit is the scary part. Wiki the buzzer ... They reckon it might be a Deadman switch that, should it stop broadcasting that buzzing sound, might set of a nuclear strike... Or that it used AM in order to propagate long distances.. oh man, I gotta go back and read it before bed",
    "controversiality": 0,
    "ups": 148,
    "downs": 0,
    "score": 148,
    "created": 1513036582.0,
    "date_created": "2017-12-11",
    "time_created": "10:56:22",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36qm4",
    "parent_id": "t1_dr31nwg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Not much rattles me, but the sound these stations tend to make cause my skin to crawl.",
    "controversiality": 0,
    "ups": 178,
    "downs": 0,
    "score": 178,
    "created": 1513035098.0,
    "date_created": "2017-12-11",
    "time_created": "10:31:38",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr4mqqp",
    "parent_id": "t1_dr31nwg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "When I was in the USCG based in Miami Beach FL, I worked in their COMMCEN(communications center) or SECTOR.  I was one of their radio operators, and one night on watch, I had the HF radio set to scan thru freqs.  I can't remember what freq it was, but it was in the high 2000s and I started hearing numbers being read.  It changed over after about 2 seconds so I set the frequency back to the previous one.  For about 5 minutes it played the numbers and I got all the other watchstanders involved.  no one knew what it meant but me.  I had grown up reading LeCarre and Ludlum so I KNEW what they were, but I had never actually HEARD one.  \n\nSo my command duty officer includes it in his log, and he emailed that off to whomever.  Later that week, my commander pulls me into his office and tells me not to go doing any spy shit on him in a joking manner.  Apparently, he got a call from a 2-star admiral over at SOUTHCOM who somehow found his name CCd on the email... This guy was in control of ALL the special forces commands in the southeastern region of the US.  Apparently, there was a \"training exercise\" going on and it involved multiple \"agencies\" and SPECFOR groups.  \n\nWhat I had heard COINCIDENTALLY was their training exercise.\n\nThis was before COD black ops.  ",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1513097495.0,
    "date_created": "2017-12-12",
    "time_created": "03:51:35",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr38g6s",
    "parent_id": "t1_dr31nwg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "And there's that one station that had a little girl reading out the numbers just to make it more creepy.",
    "controversiality": 0,
    "ups": 84,
    "downs": 0,
    "score": 84,
    "created": 1513037038.0,
    "date_created": "2017-12-11",
    "time_created": "11:03:58",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3c02m",
    "parent_id": "t1_dr344yb",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I remember reading a write-up from the era about the controversy (like a proto-reddit post) arguing that they all knew that one of the accusers (identified as G I think) and were all always annoyed with him and he was a little shit so do they really need to be upset about it. G was 10.",
    "controversiality": 0,
    "ups": 75,
    "downs": 0,
    "score": 75,
    "created": 1513040827.0,
    "date_created": "2017-12-11",
    "time_created": "12:07:07",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr376xt",
    "parent_id": "t1_dr344yb",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "MZB is also one of the earliest members of the Society for Creative Anachronism, arguably the world's largest medieval recreation organization. It has had its share of modern scandals, but I almost shudder to think what might have happened in the 60s/70s of that organization that has never made it to light.",
    "controversiality": 0,
    "ups": 175,
    "downs": 0,
    "score": 175,
    "created": 1513035623.0,
    "date_created": "2017-12-11",
    "time_created": "10:40:23",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36kn8",
    "parent_id": "t1_dr344yb",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I did not know this. I’m crushed. ",
    "controversiality": 0,
    "ups": 115,
    "downs": 0,
    "score": 115,
    "created": 1513034905.0,
    "date_created": "2017-12-11",
    "time_created": "10:28:25",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr37h3v",
    "parent_id": "t1_dr344yb",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "You forgot to mention that Breen was a well known numismatist. In the 70s, when I first got into coin collecting, his name was everywhere.",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1513035950.0,
    "date_created": "2017-12-11",
    "time_created": "10:45:50",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3gza0",
    "parent_id": "t1_dr344yb",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "[Nooooooooooooo](http://nooooooooooooooo.com), today I am reminded that there are no 100% good people in this world.\n\nExcept for Mr. Rogers.",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1513045862.0,
    "date_created": "2017-12-11",
    "time_created": "13:31:02",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3fpjh",
    "parent_id": "t1_dr344yb",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Yeah, MZB's books seem so kind and universal. Finding out she was capable of doing something so horrible and selfish, and over such a prolonged period of time... \n\nIirc the docs linked talked about how parents would just lock their kids in their rooms when MZB and Breen were around instead of, you know. Doing something helpful.  \n\nAnother sad layer is that MZB's daughter is an anti-LGBT crusader because of her experience with her parents. It's not the soundest logic but I also can't really blame her. There's not a correct way to process something so cruel",
    "controversiality": 0,
    "ups": 84,
    "downs": 0,
    "score": 84,
    "created": 1513044581.0,
    "date_created": "2017-12-11",
    "time_created": "13:09:41",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3adi4",
    "parent_id": "t1_dr33uod",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Genuine question: how did you report him without getting yourself in trouble?",
    "controversiality": 0,
    "ups": 2306,
    "downs": 0,
    "score": 2306,
    "created": 1513039135.0,
    "date_created": "2017-12-11",
    "time_created": "11:38:55",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr39lvk",
    "parent_id": "t1_dr33uod",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "You did a good thing friend.",
    "controversiality": 0,
    "ups": 1401,
    "downs": 0,
    "score": 1401,
    "created": 1513038311.0,
    "date_created": "2017-12-11",
    "time_created": "11:25:11",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3hqed",
    "parent_id": "t1_dr33mvd",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "These 2 got me:\n\n>600 million\tThe Sun's increasing luminosity begins to disrupt the carbonate–silicate cycle; higher luminosity increases weathering of surface rocks, which traps carbon dioxide in the ground as carbonate. As water evaporates from the Earth's surface, rocks harden, causing plate tectonics to slow and eventually stop. Without volcanoes to recycle carbon into the Earth's atmosphere, carbon dioxide levels begin to fall.[54] By this time, carbon dioxide levels will fall to the point at which C3 photosynthesis is no longer possible. All plants that utilize C3 photosynthesis (~99 percent of present-day species) will die.\n\n\n\n> 800 million\tCarbon dioxide levels fall to the point at which C4 photosynthesis is no longer possible.[55] Free oxygen and ozone disappear from the atmosphere. Multicellular life dies out.\n\nNo matter what, life on earth is dead after 600-800 million years.  Weird to think, no matter what there'll only be a little over a billion years of life on the planet after the Cambrian explosion of life.",
    "controversiality": 0,
    "ups": 252,
    "downs": 0,
    "score": 252,
    "created": 1513046624.0,
    "date_created": "2017-12-11",
    "time_created": "13:43:44",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3gg0k",
    "parent_id": "t1_dr33mvd",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Man, for some reason this shit makes me suicidal and I can never quite figure out why. It's like my brain goes, \"Oh, we're completely insignificant? Well, might as well tap out early.\" It doesn't make sense. ",
    "controversiality": 0,
    "ups": 623,
    "downs": 0,
    "score": 623,
    "created": 1513045328.0,
    "date_created": "2017-12-11",
    "time_created": "13:22:08",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr38jb9",
    "parent_id": "t1_dr33mvd",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "That's got to be one of the best titles on Wikipedia.",
    "controversiality": 0,
    "ups": 116,
    "downs": 0,
    "score": 116,
    "created": 1513037134.0,
    "date_created": "2017-12-11",
    "time_created": "11:05:34",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3p4rk",
    "parent_id": "t1_dr33mvd",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "At 7.9b years,\n\n> Saturn's moon Titan could achieve surface temperatures necessary to support life.\n\nThen at 8b years, the Sun shrinks down to a white dwarf.  Titanians need to get their shit together quickly.",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1513054212.0,
    "date_created": "2017-12-11",
    "time_created": "15:50:12",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3ikw1",
    "parent_id": "t1_dr33mvd",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "It's amusing to me how incomprehensibly long it's all going to last until it's finally over. Everything is going to pass us by without regard for any of our lives (our achievements and mishaps) and ultimately it's all going to be over and dead. It's crazy how short and insignificant our period in time is, and I'm just sitting here worried about school, money, and food lol.",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1513047491.0,
    "date_created": "2017-12-11",
    "time_created": "13:58:11",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3dtc9",
    "parent_id": "t1_dr30rn2",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "The thing to remember about uncontacted tribes is that with the exception of the Sentinelese, who really are truly uncontacted, these tribes are not uncontacted peoples living in a primal undisturbed lifestyle since ancient times; these Amazonian tribes are actually tribes who deliberately fled deep, deep, into the jungle around 100 years ago to avoid a genocide of native Amazonian people that was occurring during the rubber boom in South America around the turn of the century. These tribes know about the outside world; they are essentially hiding from it because so many of their people have been slaughtered in recent history. The ancestors of some of these uncontacted Amazonian tribes were actually farmers prior to European contact, not hunter-gatherers like they are now. ",
    "controversiality": 0,
    "ups": 209,
    "downs": 0,
    "score": 209,
    "created": 1513042649.0,
    "date_created": "2017-12-11",
    "time_created": "12:37:29",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr35qwg",
    "parent_id": "t1_dr30rn2",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I like how the opening paragraph of this article is, in essence, saying that we shouldn't contact these people because of the Prime Directive.",
    "controversiality": 0,
    "ups": 3797,
    "downs": 0,
    "score": 3797,
    "created": 1513033923.0,
    "date_created": "2017-12-11",
    "time_created": "10:12:03",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr361vx",
    "parent_id": "t1_dr30rn2",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "My favorite is the Sentinelese;\n\nIt’s a tribe that lives on the North Sentinel Island, a largely unexplored island that is the territory of India. They can be considered a pinnacle of a tribe untouched by modern civilization:\n\n• Their language is largely undocumented, let alone deciphered: Their language also does not have similarities with any other obscure language of any island or mainland Indian tribe, let alone any other world language.\n\n• All purposed exploration expeditions, attempted contact or even just a casual trip there (fishermen) has ended in a disaster one way or another because they admantly reject all forms of contact; there was history of open attacks and even times when they killed a couple of local fishermen. They tend to attack any foreigner that travels too close to the village, but they mostly hide in the forest.\n\n• Even their exact population estimate is vague: ranging from 15 to 500.\n\n• Apparently, and IIRC, they have no concept of fire. **Fire.**\n\nEdit: Holy shit and Mother of God of all that is dear, did this unexpectedly blew up.\n\nEdit No. 2: They have a concept of fire, they just don’t know how to create it. My fault.",
    "controversiality": 0,
    "ups": 9073,
    "downs": 0,
    "score": 9073,
    "created": 1513034291.0,
    "date_created": "2017-12-11",
    "time_created": "10:18:11",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3bxdw",
    "parent_id": "t1_dr30rn2",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "It's realy depressing seeing how many Brazilian Tribes' notes end in \"recently massacred\".",
    "controversiality": 0,
    "ups": 71,
    "downs": 0,
    "score": 71,
    "created": 1513040750.0,
    "date_created": "2017-12-11",
    "time_created": "12:05:50",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr38m2h",
    "parent_id": "t1_dr30rn2",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I usually jump to the tables on those wiki articles\n\nFound a pretty interesting one in [The Man of the Hole](https://en.wikipedia.org/wiki/Man_of_the_Hole)\n\nIt's literally just one guy that exists on his own out in the Amazon and no one knows anything about him.\n\nApparently he got his nickname in the media because every time he abandons his 'homes' they find a 6-foot deep hole inside.",
    "controversiality": 0,
    "ups": 80,
    "downs": 0,
    "score": 80,
    "created": 1513037218.0,
    "date_created": "2017-12-11",
    "time_created": "11:06:58",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr389ik",
    "parent_id": "t1_dr37m8e",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": " The United States of America in one paragraph.\n\n",
    "controversiality": 0,
    "ups": 170,
    "downs": 0,
    "score": 170,
    "created": 1513036833.0,
    "date_created": "2017-12-11",
    "time_created": "11:00:33",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3bw6k",
    "parent_id": "t1_dr2zopi",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": " > HOW YOU CAN, AND DO, HAVE DEMONS - EVERYONE HAS DEMONS, NO EXCEPTIONS (so this includes all Christians).\n\n > Do you have a bad temper? That's a demon. Is there mental illness in your family background? That is a demon. Do you have trouble serving God? That's a demon. Do you have problems with bad thoughts? That is a demon(s) in your mind, will or emotions.\n\n > BOYCE and BOICE are two demons that interfere with any electronic equipment, i.e., phone, computer, printer, automobile, etc. If something malfunctions, command these two demons to leave your equipment, in the name of Jesus. We get many emails saying this worked. If it does not work, demons are not causing the problem.. \n\nI really don't know what else to say.  How can I even respond to this?  \n\n",
    "controversiality": 0,
    "ups": 96,
    "downs": 0,
    "score": 96,
    "created": 1513040714.0,
    "date_created": "2017-12-11",
    "time_created": "12:05:14",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr37tug",
    "parent_id": "t1_dr2zopi",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": ">  demonbusters.com.\n\nNo \"s\". [demonbuster.com](http://www.demonbuster.com/)\n\n[e]fair warning- don't wear headphones at  full volume when you open that site, unless you wan't your ears demonically raped by shitty audio of old-timey hymns turned up to eleven.",
    "controversiality": 0,
    "ups": 358,
    "downs": 0,
    "score": 358,
    "created": 1513036345.0,
    "date_created": "2017-12-11",
    "time_created": "10:52:25",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr35x91",
    "parent_id": "t1_dr31hko",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": ">Moon deniers\n\nDo you mean moon landing deniers, or are there seriously people who don't believe the fucking moon exists? If so, I need to fall down that rabbit hole.",
    "controversiality": 0,
    "ups": 1634,
    "downs": 0,
    "score": 1634,
    "created": 1513034133.0,
    "date_created": "2017-12-11",
    "time_created": "10:15:33",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36zwy",
    "parent_id": "t1_dr31hko",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "> disbelief in DNA\n\nNever heard that one before. But I’ve seen so much crazy shit that some people legitimately believe that I’m disappointingly unsurprised.",
    "controversiality": 0,
    "ups": 53,
    "downs": 0,
    "score": 53,
    "created": 1513035403.0,
    "date_created": "2017-12-11",
    "time_created": "10:36:43",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3cyoj",
    "parent_id": "t1_dr31hko",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "[Wikipedia:Unusual Articles](https://en.wikipedia.org/wiki/Wikipedia:Unusual_articles) and [Fundies Say The Darndest Things](http://www.fstdt.net) for the lazy\n\n",
    "controversiality": 0,
    "ups": 115,
    "downs": 0,
    "score": 115,
    "created": 1513041806.0,
    "date_created": "2017-12-11",
    "time_created": "12:23:26",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr38kzv",
    "parent_id": "t1_dr34gcc",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "You troll Waldorf homeschooling forums, obviously. ",
    "controversiality": 0,
    "ups": 239,
    "downs": 0,
    "score": 239,
    "created": 1513037185.0,
    "date_created": "2017-12-11",
    "time_created": "11:06:25",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3b7dr",
    "parent_id": "t1_dr34gcc",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "As a Norwegian, I can relate. \nWhat's  even more interesting is that his former wife  (the crown princess, which has renounced her royal title) runs a school teaching about angels and crystals and stuff. Weird shit.",
    "controversiality": 0,
    "ups": 51,
    "downs": 0,
    "score": 51,
    "created": 1513040003.0,
    "date_created": "2017-12-11",
    "time_created": "11:53:23",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36oll",
    "parent_id": "t1_dr3446l",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Reading through that feels like you're having a stroke... theyre words that you recognise, but they make zero sense in whatever order theyre in",
    "controversiality": 0,
    "ups": 1477,
    "downs": 0,
    "score": 1477,
    "created": 1513035030.0,
    "date_created": "2017-12-11",
    "time_created": "10:30:30",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr39akx",
    "parent_id": "t1_dr3446l",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "\"He stole a helicopter and landed on a purely vegan diet\"",
    "controversiality": 0,
    "ups": 59,
    "downs": 0,
    "score": 59,
    "created": 1513037970.0,
    "date_created": "2017-12-11",
    "time_created": "11:19:30",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36ynz",
    "parent_id": "t1_dr3446l",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "The best is when you sub to that subreddit and then see how often you get tricked when scrolling through your front page.",
    "controversiality": 0,
    "ups": 109,
    "downs": 0,
    "score": 109,
    "created": 1513035361.0,
    "date_created": "2017-12-11",
    "time_created": "10:36:01",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr358uz",
    "parent_id": "t1_dr31q10",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "[Here](https://m.youtube.com/channel/UCMV8B1Q5lEEb5yR8Hqkbdhg) is his channel. He actually is fixing to start uploading the Marblelympics 2018. His sand rally races are very easy to get hooked on",
    "controversiality": 0,
    "ups": 6273,
    "downs": 0,
    "score": 6273,
    "created": 1513033307.0,
    "date_created": "2017-12-11",
    "time_created": "10:01:47",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr356ot",
    "parent_id": "t1_dr31q10",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "OOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOrangers!",
    "controversiality": 0,
    "ups": 825,
    "downs": 0,
    "score": 825,
    "created": 1513033233.0,
    "date_created": "2017-12-11",
    "time_created": "10:00:33",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36d92",
    "parent_id": "t1_dr31q10",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I feel so wonderfully validated by seeing this comment. I once tried to use marble olympics videos to go to sleep to but they were too exciting. \n\n(Go wisps!)",
    "controversiality": 0,
    "ups": 64,
    "downs": 0,
    "score": 64,
    "created": 1513034667.0,
    "date_created": "2017-12-11",
    "time_created": "10:24:27",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr35r67",
    "parent_id": "t1_dr31q10",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "[I'm Oceanic, motherfucker](https://youtu.be/_qG4o9M1S2E)\n\n^^^I'm ^^^actually ^^^a ^^^Midnight ^^^Wisps ^^^fan ^^^but ^^^they ^^^don't ^^^have ^^^a ^^^video ^^^with ^^^The ^^^Rock ",
    "controversiality": 0,
    "ups": 54,
    "downs": 0,
    "score": 54,
    "created": 1513033931.0,
    "date_created": "2017-12-11",
    "time_created": "10:12:11",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3460f",
    "parent_id": "t1_dr31q10",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "If you don't find yourself wanting to stand and cheer for your marble on one of the downhill runs, you are simply not a fan of sport. ",
    "controversiality": 0,
    "ups": 981,
    "downs": 0,
    "score": 981,
    "created": 1513031964.0,
    "date_created": "2017-12-11",
    "time_created": "09:39:24",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr35io0",
    "parent_id": "t1_dr31q10",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Are my Oceanic boys in the house?",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1513033644.0,
    "date_created": "2017-12-11",
    "time_created": "10:07:24",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36wub",
    "parent_id": "t1_dr31q10",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Thats the brother of my uncle! We're from the Netherlands. He is autistic and does really enjoys the fact that people like his work! ",
    "controversiality": 0,
    "ups": 76,
    "downs": 0,
    "score": 76,
    "created": 1513035301.0,
    "date_created": "2017-12-11",
    "time_created": "10:35:01",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3dypy",
    "parent_id": "t1_dr35mik",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "The best part was the burglar seeing that dude just fuckin sitting there all spooky and noping the fuck out",
    "controversiality": 0,
    "ups": 366,
    "downs": 0,
    "score": 366,
    "created": 1513042801.0,
    "date_created": "2017-12-11",
    "time_created": "12:40:01",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr31o6v",
    "parent_id": "t1_dr2vsa8",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I first heard about this the other day through an article in a newspaper and a thread on /r/worldnews about it and I still cannot wrap my head around this. These videos are so weird, like some real-life creepypasta shit.",
    "controversiality": 0,
    "ups": 1750,
    "downs": 0,
    "score": 1750,
    "created": 1513028464.0,
    "date_created": "2017-12-11",
    "time_created": "08:41:04",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr2xn9r",
    "parent_id": "t1_dr2vsa8",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Ok I just spent an hour on that sub and I'll definitely be uninstalling YouTube kids on the iPad. \n\nThat shit makes me sick. ",
    "controversiality": 0,
    "ups": 3999,
    "downs": 0,
    "score": 3999,
    "created": 1513020463.0,
    "date_created": "2017-12-11",
    "time_created": "06:27:43",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr343gp",
    "parent_id": "t1_dr2vsa8",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Ever since I heard about that in another reddit thread I've been informing friends so they can be on the look out for their kids. I was with my nephew and he was watching this claymation Elsa thing, and immediately I got a little worried so I was watching with him. Then in the \"suggested videos\" on the right there was one of those \"Bad Baby\" videos and I immediately told my sister-in-law. Fortunately she usually just lets him watch specific channels that she's pre-screened.",
    "controversiality": 0,
    "ups": 688,
    "downs": 0,
    "score": 688,
    "created": 1513031873.0,
    "date_created": "2017-12-11",
    "time_created": "09:37:53",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3289w",
    "parent_id": "t1_dr2vsa8",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "ELI5? I get that people are posting non kid friendly stuff in kids tags, but having a bit of trouble getting what or why without hopping into the rabbit hole myself. ",
    "controversiality": 0,
    "ups": 830,
    "downs": 0,
    "score": 830,
    "created": 1513029303.0,
    "date_created": "2017-12-11",
    "time_created": "08:55:03",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr34q9s",
    "parent_id": "t1_dr2vsa8",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I'm really happy the word has started to get out about this. My daughter found some of these videos on YouTube and I only found out about because they started showing up in my suggested list. I sat with her one day and watched some of her videos with her and it inevitably led to these. I was shocked with what I saw and immediately started taking steps to limit her exposure to videos like this. I tried to tell my ex wife and anyone else my daughter stayed with but nobody seemed to take it seriously. I eventually had to dig one up and convince my ex wife to watch it herself. I don't even let my daughter watch YouTube at all anymore unless I'm right there with her picking the videos myself. ",
    "controversiality": 0,
    "ups": 66,
    "downs": 0,
    "score": 66,
    "created": 1513032673.0,
    "date_created": "2017-12-11",
    "time_created": "09:51:13",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr31n8x",
    "parent_id": "t1_dr2vsa8",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I saw iDubbbz's video on it when it came out. \n\nVery, very fucked up stuff. ",
    "controversiality": 0,
    "ups": 168,
    "downs": 0,
    "score": 168,
    "created": 1513028423.0,
    "date_created": "2017-12-11",
    "time_created": "08:40:23",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr31hlv",
    "parent_id": "t1_dr2xbo4",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I've read the [list of unusual deaths] (https://en.wikipedia.org/wiki/List_of_unusual_deaths) an embarrassing number of times. My favorite one is the guy that died laughing watching a donkey eat figs. ",
    "controversiality": 0,
    "ups": 6940,
    "downs": 0,
    "score": 6940,
    "created": 1513028182.0,
    "date_created": "2017-12-11",
    "time_created": "08:36:22",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr32a4m",
    "parent_id": "t1_dr2xbo4",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "\"Please don't try to expand this list by killing people.\"\nEdit: thanks for all the upvotes Reddit!",
    "controversiality": 0,
    "ups": 1409,
    "downs": 0,
    "score": 1409,
    "created": 1513029378.0,
    "date_created": "2017-12-11",
    "time_created": "08:56:18",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr2xmrf",
    "parent_id": "t1_dr2xbo4",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Oh this is definitely one of my favorites",
    "controversiality": 0,
    "ups": 470,
    "downs": 0,
    "score": 470,
    "created": 1513020428.0,
    "date_created": "2017-12-11",
    "time_created": "06:27:08",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr38923",
    "parent_id": "t1_dr30j09",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Thanks for the promotion!  Also, thanks for killing the site!\n\nI'm working to restore the site, I was completely not ready for a frontpage subreddit to have a top comment mentioning it.\n\nEDIT: Okay, I think it's up now?  Fingers crossed?",
    "controversiality": 0,
    "ups": 4358,
    "downs": 0,
    "score": 4358,
    "created": 1513036819.0,
    "date_created": "2017-12-11",
    "time_created": "11:00:19",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3428s",
    "parent_id": "t1_dr30j09",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Aaaand the site is down.",
    "controversiality": 0,
    "ups": 2746,
    "downs": 0,
    "score": 2746,
    "created": 1513031832.0,
    "date_created": "2017-12-11",
    "time_created": "09:37:12",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr344zl",
    "parent_id": "t1_dr30j09",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "182 upvotes and it's already hugged to death...We did it, Reddit!",
    "controversiality": 0,
    "ups": 764,
    "downs": 0,
    "score": 764,
    "created": 1513031928.0,
    "date_created": "2017-12-11",
    "time_created": "09:38:48",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3311x",
    "parent_id": "t1_dr31kbx",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": ">I somehow ended up on Reddit. Not sure how, or if our qualifies as scariest or most interesting.\n\nSometimes both, often neither. ",
    "controversiality": 0,
    "ups": 859,
    "downs": 0,
    "score": 859,
    "created": 1513030454.0,
    "date_created": "2017-12-11",
    "time_created": "09:14:14",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr2ymoe",
    "parent_id": "t1_dr2wind",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Yep, I've been stuck there for 5 years now. ",
    "controversiality": 0,
    "ups": 1757,
    "downs": 0,
    "score": 1757,
    "created": 1513022766.0,
    "date_created": "2017-12-11",
    "time_created": "07:06:06",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr2wpo3",
    "parent_id": "t1_dr2wind",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Favorite SCP? (Possibly SCPs) i need some to look up",
    "controversiality": 0,
    "ups": 570,
    "downs": 0,
    "score": 570,
    "created": 1513018052.0,
    "date_created": "2017-12-11",
    "time_created": "05:47:32",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr2zimf",
    "parent_id": "t1_dr2wind",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I couldn't understand what is this SCP thing. Could someone ELI5?",
    "controversiality": 0,
    "ups": 801,
    "downs": 0,
    "score": 801,
    "created": 1513024628.0,
    "date_created": "2017-12-11",
    "time_created": "07:37:08",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr34erl",
    "parent_id": "t1_dr2ymda",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "His \"most downvoted comment\" link needs an update after the EA fiasco.",
    "controversiality": 0,
    "ups": 1950,
    "downs": 0,
    "score": 1950,
    "created": 1513032272.0,
    "date_created": "2017-12-11",
    "time_created": "09:44:32",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr319n1",
    "parent_id": "t1_dr2ymda",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I don't know whether to be ashamed or proud that I only haven't heard of three of that list.",
    "controversiality": 0,
    "ups": 175,
    "downs": 0,
    "score": 175,
    "created": 1513027817.0,
    "date_created": "2017-12-11",
    "time_created": "08:30:17",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3h6ur",
    "parent_id": "t1_dr36jk1",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I should be studying, but this is my studying",
    "controversiality": 0,
    "ups": 99,
    "downs": 0,
    "score": 99,
    "created": 1513046073.0,
    "date_created": "2017-12-11",
    "time_created": "13:34:33",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr34089",
    "parent_id": "t1_dr2wsqg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "My favorite is when the customer is filming, thinks they are in the right, but are clearly the assholes in the situation.",
    "controversiality": 0,
    "ups": 654,
    "downs": 0,
    "score": 654,
    "created": 1513031759.0,
    "date_created": "2017-12-11",
    "time_created": "09:35:59",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr370lo",
    "parent_id": "t1_dr34pfj",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "This is the realest story here. Everything else is about memes and dreams, but this was a genuine rabbit hole that dismantled your life. I hope you're living well, pal.",
    "controversiality": 0,
    "ups": 7072,
    "downs": 0,
    "score": 7072,
    "created": 1513035425.0,
    "date_created": "2017-12-11",
    "time_created": "10:37:05",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36jdf",
    "parent_id": "t1_dr34pfj",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Hugs. Hope you're doing better now. I have a good ex-Mormon friend and he says it's more than just a religion, it's a culture, and that's something very hard to part ways with.",
    "controversiality": 0,
    "ups": 1273,
    "downs": 0,
    "score": 1273,
    "created": 1513034865.0,
    "date_created": "2017-12-11",
    "time_created": "10:27:45",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr35xeq",
    "parent_id": "t1_dr34pfj",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Is it this? https://cesletter.org/\n\nI keep coming across this but it is so wildly out of my frame of reference I can never really understand it.",
    "controversiality": 0,
    "ups": 861,
    "downs": 0,
    "score": 861,
    "created": 1513034138.0,
    "date_created": "2017-12-11",
    "time_created": "10:15:38",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr38ov2",
    "parent_id": "t1_dr34pfj",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Come over to r/exmormon if you aren't already there. We have many people who have gone through the exact same thing as you. ",
    "controversiality": 0,
    "ups": 140,
    "downs": 0,
    "score": 140,
    "created": 1513037306.0,
    "date_created": "2017-12-11",
    "time_created": "11:08:26",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36otr",
    "parent_id": "t1_dr34pfj",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I don't really know anything about LDS, can you explain what the Restoration is and why its so important, or so disturbing that it could be false as its taught. Sounds really interesting.",
    "controversiality": 0,
    "ups": 91,
    "downs": 0,
    "score": 91,
    "created": 1513035039.0,
    "date_created": "2017-12-11",
    "time_created": "10:30:39",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr37ogd",
    "parent_id": "t1_dr34pfj",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "That fact that you took a strong, honest approach is commendable. I do not envy the sense of loss I’m sure you feel. Just don’t let good works you’ve done be clouded by this discovery. \n\nYou obviously have great deductive reasoning abilities and a strong focus; use them to continue to contribute good and kindness to the world. ",
    "controversiality": 0,
    "ups": 47,
    "downs": 0,
    "score": 47,
    "created": 1513036178.0,
    "date_created": "2017-12-11",
    "time_created": "10:49:38",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3amnm",
    "parent_id": "t1_dr34pfj",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I was a semi-active Mormon (convert) and had a similar rabbit hole experience. We'd been to an old Masonic lodge that had been converted into an events center and the architecture was so cool I wanted to see what the lodge might have looked like when it was in working order. Started to find all sorts of Masonic stuff that had the same wording etc as some of the more \"sacred\" Mormon ceremonies and rites and found out Smith had been expelled from his Masonic lodge shortly after he \"received\" the Mormon temple rites...because they were lifted directly from Masonic rites. My father-in-law gave me a book filled with apologetics about the similarities...but it explained nothing. Realized the seeds of doubt I had were well-founded. I think church presidents had said basically, \"you believe it all or you don't\"...well, okay. I was out.",
    "controversiality": 0,
    "ups": 45,
    "downs": 0,
    "score": 45,
    "created": 1513039407.0,
    "date_created": "2017-12-11",
    "time_created": "11:43:27",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36c8p",
    "parent_id": "t1_dr34pfj",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "That sounds horrible, man. I can’t imagine that feeling of suddenly realizing everything you thought was true might not be.",
    "controversiality": 0,
    "ups": 76,
    "downs": 0,
    "score": 76,
    "created": 1513034634.0,
    "date_created": "2017-12-11",
    "time_created": "10:23:54",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr33bi8",
    "parent_id": "t1_dr2w8tz",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "There was a case in Canada in the 90's with Paul Bernardo and Karla Homolka.  They did a bunch of fucked up stuff, some of this fucked up stuff came with videotapes.\n\nNow I've read maybe 500 true crime books.  My dad was/is a huge fan and had boxes and boxes of books he read once, so I'd grab them and read them.\n\nMostly the books didn't bother me too much.  The writing of the actual crimes was kind of technical.  \"The stab wound was three inches deep near the throat.\", that kind of stuff.  The video evidence transcripts of the Bernardo/Homolka murders was used as part of the writing.  \n\nIt was **so** much worse when you were able to read the actual words that they said.  I took a break from the Big Box 'o Murder shortly after that.",
    "controversiality": 0,
    "ups": 143,
    "downs": 0,
    "score": 143,
    "created": 1513030851.0,
    "date_created": "2017-12-11",
    "time_created": "09:20:51",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr35l3o",
    "parent_id": "t1_dr2w8tz",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "You should read about him. It's way more disturbing than just his introduction audio tape. He recorded murders in his torture room, but they couldn't prosecute them because they couldn't prove that the deaths were real nor could they produce bodies. If I remember correctly, one investigator that had to catalog all of the videos (meaning watching them intently) subsequently went home and committed suicide. ",
    "controversiality": 0,
    "ups": 121,
    "downs": 0,
    "score": 121,
    "created": 1513033727.0,
    "date_created": "2017-12-11",
    "time_created": "10:08:47",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr2x33m",
    "parent_id": "t1_dr2w8tz",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Yes, I have read the transcript also, wish I never had.",
    "controversiality": 0,
    "ups": 265,
    "downs": 0,
    "score": 265,
    "created": 1513019046.0,
    "date_created": "2017-12-11",
    "time_created": "06:04:06",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr35z6u",
    "parent_id": "t1_dr338xy",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Oh this is a bad one. I hate those casual statements that open the rabbit hole- \"I'll just find a good quiet cpu fan\" - 6 hours later, \"okay I think this is the one...\"\n\n",
    "controversiality": 0,
    "ups": 191,
    "downs": 0,
    "score": 191,
    "created": 1513034198.0,
    "date_created": "2017-12-11",
    "time_created": "10:16:38",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr32kj9",
    "parent_id": "t1_dr2w36d",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "> Cracked.com is another inexplicable browser narcotic.  They could write a list of '17 worst haircuts in the Ottoman Empire' and I'd read through to the end, then click on all the links at the end.\n\nI miss when this used to be true. ",
    "controversiality": 0,
    "ups": 3481,
    "downs": 0,
    "score": 3481,
    "created": 1513029802.0,
    "date_created": "2017-12-11",
    "time_created": "09:03:22",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr33ees",
    "parent_id": "t1_dr31ovx",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Makashi sounds the coolest but always Soresu if you want to live.",
    "controversiality": 0,
    "ups": 300,
    "downs": 0,
    "score": 300,
    "created": 1513030961.0,
    "date_created": "2017-12-11",
    "time_created": "09:22:41",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36z6y",
    "parent_id": "t1_dr31ovx",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "*Wookieepedia",
    "controversiality": 0,
    "ups": 59,
    "downs": 0,
    "score": 59,
    "created": 1513035378.0,
    "date_created": "2017-12-11",
    "time_created": "10:36:18",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36xbc",
    "parent_id": "t1_dr31ovx",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Star Wars expanded universe in general. Oh my god when I watched videos that talked about different events from before and after the films, I was hooked. I don't know if I should spoil this per say, but stuff like: \n\nLuke becoming the strongest Jedi to ever live and fighting a godlike force monster alongside a Sith(?) warrior, Han and Leia's child becoming one of the greatest Jedi to ever live and then falling to the dark side, all of the Sith lords past present and future, it's just so interesting to me. I haven't explored the EU beyond the videos I've watched but it opened my eyes to all of this Star Wars that I just fell in love with. ",
    "controversiality": 0,
    "ups": 89,
    "downs": 0,
    "score": 89,
    "created": 1513035317.0,
    "date_created": "2017-12-11",
    "time_created": "10:35:17",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr30h2p",
    "parent_id": "t1_dr2vtyj",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I first head about this in a Leminno video and subscribed after watching. ",
    "controversiality": 0,
    "ups": 265,
    "downs": 0,
    "score": 265,
    "created": 1513026447.0,
    "date_created": "2017-12-11",
    "time_created": "08:07:27",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr32nt2",
    "parent_id": "t1_dr2vtyj",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "My city is listed on the Wikipedia as a place where a physical clue was found but whenever I try to Google anything about it all I get is an escape room in town. ",
    "controversiality": 0,
    "ups": 184,
    "downs": 0,
    "score": 184,
    "created": 1513029933.0,
    "date_created": "2017-12-11",
    "time_created": "09:05:33",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr339fw",
    "parent_id": "t1_dr31sbe",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Have you checked your bank account lately?",
    "controversiality": 0,
    "ups": 324,
    "downs": 0,
    "score": 324,
    "created": 1513030772.0,
    "date_created": "2017-12-11",
    "time_created": "09:19:32",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr38wxc",
    "parent_id": "t1_dr31sbe",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "*Exasperatedly releases vice like grip on penis*\n\nPenis: \"Oh sweet merciful jesus\"",
    "controversiality": 0,
    "ups": 89,
    "downs": 0,
    "score": 89,
    "created": 1513037558.0,
    "date_created": "2017-12-11",
    "time_created": "11:12:38",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3073a",
    "parent_id": "t1_dr2zbxx",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "IIRC it's an account Youtube uses to test things.",
    "controversiality": 0,
    "ups": 2358,
    "downs": 0,
    "score": 2358,
    "created": 1513025929.0,
    "date_created": "2017-12-11",
    "time_created": "07:58:49",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr30r6d",
    "parent_id": "t1_dr2zbxx",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Webdriver Torso is a channel by YouTube themselves to test the website's performance. Typing in that name even gets you a little easter egg on Google (Desktop only).",
    "controversiality": 0,
    "ups": 815,
    "downs": 0,
    "score": 815,
    "created": 1513026949.0,
    "date_created": "2017-12-11",
    "time_created": "08:15:49",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr325b0",
    "parent_id": "t1_dr2yyeg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Boots and pants and boots and pants!",
    "controversiality": 0,
    "ups": 1513,
    "downs": 0,
    "score": 1513,
    "created": 1513029181.0,
    "date_created": "2017-12-11",
    "time_created": "08:53:01",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr30cyc",
    "parent_id": "t1_dr2yyeg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "yee",
    "controversiality": 0,
    "ups": 10216,
    "downs": 0,
    "score": 10216,
    "created": 1513026239.0,
    "date_created": "2017-12-11",
    "time_created": "08:03:59",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr338yj",
    "parent_id": "t1_dr2yyeg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Really a lot of those meme playlists are a deep dive into how strange our culture has gotten",
    "controversiality": 0,
    "ups": 971,
    "downs": 0,
    "score": 971,
    "created": 1513030754.0,
    "date_created": "2017-12-11",
    "time_created": "09:19:14",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr34p73",
    "parent_id": "t1_dr2yyeg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "\"Go back to Toronto!\"\n\n....\n\n\"I'm from Winnipeg you idiot!\"",
    "controversiality": 0,
    "ups": 316,
    "downs": 0,
    "score": 316,
    "created": 1513032636.0,
    "date_created": "2017-12-11",
    "time_created": "09:50:36",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr30ofc",
    "parent_id": "t1_dr2yyeg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Wow, a yard ***SAIL!!***",
    "controversiality": 0,
    "ups": 1298,
    "downs": 0,
    "score": 1298,
    "created": 1513026818.0,
    "date_created": "2017-12-11",
    "time_created": "08:13:38",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr31zu9",
    "parent_id": "t1_dr2yyeg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "ayy you know this boy's got his free taco",
    "controversiality": 0,
    "ups": 864,
    "downs": 0,
    "score": 864,
    "created": 1513028954.0,
    "date_created": "2017-12-11",
    "time_created": "08:49:14",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr33fa9",
    "parent_id": "t1_dr2yyeg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Not a single comment actually has a link to the playlist.",
    "controversiality": 0,
    "ups": 1603,
    "downs": 0,
    "score": 1603,
    "created": 1513030995.0,
    "date_created": "2017-12-11",
    "time_created": "09:23:15",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr33s13",
    "parent_id": "t1_dr2yyeg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Robert, it goes down.",
    "controversiality": 0,
    "ups": 109,
    "downs": 0,
    "score": 109,
    "created": 1513031467.0,
    "date_created": "2017-12-11",
    "time_created": "09:31:07",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr34555",
    "parent_id": "t1_dr2yyeg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Name a yellow fruit.",
    "controversiality": 0,
    "ups": 291,
    "downs": 0,
    "score": 291,
    "created": 1513031933.0,
    "date_created": "2017-12-11",
    "time_created": "09:38:53",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr31v37",
    "parent_id": "t1_dr2yyeg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I just found 12 bricks",
    "controversiality": 0,
    "ups": 869,
    "downs": 0,
    "score": 869,
    "created": 1513028753.0,
    "date_created": "2017-12-11",
    "time_created": "08:45:53",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr360mc",
    "parent_id": "t1_dr2yyeg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "the best video hands down is the one with a turkish man SCREAMING MEOW at an egg",
    "controversiality": 0,
    "ups": 77,
    "downs": 0,
    "score": 77,
    "created": 1513034247.0,
    "date_created": "2017-12-11",
    "time_created": "10:17:27",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr30qxg",
    "parent_id": "t1_dr2yyeg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "r/yee",
    "controversiality": 0,
    "ups": 216,
    "downs": 0,
    "score": 216,
    "created": 1513026937.0,
    "date_created": "2017-12-11",
    "time_created": "08:15:37",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr33h0d",
    "parent_id": "t1_dr2yyeg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "*vapes*\n\n...\n\nwow",
    "controversiality": 0,
    "ups": 288,
    "downs": 0,
    "score": 288,
    "created": 1513031057.0,
    "date_created": "2017-12-11",
    "time_created": "09:24:17",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr34uao",
    "parent_id": "t1_dr2yyeg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Jesus is the Bread",
    "controversiality": 0,
    "ups": 64,
    "downs": 0,
    "score": 64,
    "created": 1513032811.0,
    "date_created": "2017-12-11",
    "time_created": "09:53:31",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr33gb5",
    "parent_id": "t1_dr2yyeg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I want you to meet my partner dr Hamilton. \nAND I WANT YOU TO GET THE FUCK OUTTA HERE",
    "controversiality": 0,
    "ups": 167,
    "downs": 0,
    "score": 167,
    "created": 1513031033.0,
    "date_created": "2017-12-11",
    "time_created": "09:23:53",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr32izs",
    "parent_id": "t1_dr2yyeg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Hey, I didn't dawg the shot",
    "controversiality": 0,
    "ups": 191,
    "downs": 0,
    "score": 191,
    "created": 1513029740.0,
    "date_created": "2017-12-11",
    "time_created": "09:02:20",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr33csc",
    "parent_id": "t1_dr2yyeg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "The six-minute New Year's celebration is an underrated Important Video.\n\nThe first hour of the playlist is all fun and games, the last two hours are a pure endurance test.",
    "controversiality": 0,
    "ups": 75,
    "downs": 0,
    "score": 75,
    "created": 1513030901.0,
    "date_created": "2017-12-11",
    "time_created": "09:21:41",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3fsah",
    "parent_id": "t1_dr306pa",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I just get fuckin bummed out when this guy comes up. He's not a good dude, he's unstable and violent, but it doesn't feel like he ever had a chance. His caregivers had obvious issues of their own. His antisocial behaviors weren't addressed and were often reinforced...then the internet methodically destroyed him over what must be decades at this point. It's a hopeless story and at every turn it shows off the ugliness in people.",
    "controversiality": 0,
    "ups": 107,
    "downs": 0,
    "score": 107,
    "created": 1513044661.0,
    "date_created": "2017-12-11",
    "time_created": "13:11:01",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr309vb",
    "parent_id": "t1_dr306pa",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Once you go into the Chris Chan Rabit hole you'll be in there for months.",
    "controversiality": 0,
    "ups": 437,
    "downs": 0,
    "score": 437,
    "created": 1513026076.0,
    "date_created": "2017-12-11",
    "time_created": "08:01:16",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr32xb7",
    "parent_id": "t1_dr312ra",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Yea when they first came out it was great ",
    "controversiality": 0,
    "ups": 117,
    "downs": 0,
    "score": 117,
    "created": 1513030310.0,
    "date_created": "2017-12-11",
    "time_created": "09:11:50",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3jsyw",
    "parent_id": "t1_dr33qst",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Steve: Name a body part involved with sex. \n\nContestant: Penis\n\nSteve: *Vietnam Flashbacks*",
    "controversiality": 0,
    "ups": 138,
    "downs": 0,
    "score": 138,
    "created": 1513048736.0,
    "date_created": "2017-12-11",
    "time_created": "14:18:56",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3dghm",
    "parent_id": "t1_dr32agn",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Sovereign citizen fail videos may be found in /r/amibeingdetained\n",
    "controversiality": 0,
    "ups": 82,
    "downs": 0,
    "score": 82,
    "created": 1513042294.0,
    "date_created": "2017-12-11",
    "time_created": "12:31:34",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr37bys",
    "parent_id": "t1_dr33ej4",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "where can I find it?",
    "controversiality": 0,
    "ups": 94,
    "downs": 0,
    "score": 94,
    "created": 1513035785.0,
    "date_created": "2017-12-11",
    "time_created": "10:43:05",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr31vrh",
    "parent_id": "t1_dr2w5sf",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "The ARG set around This House Has People In It is one of my all time favorite Resnik projects",
    "controversiality": 0,
    "ups": 189,
    "downs": 0,
    "score": 189,
    "created": 1513028783.0,
    "date_created": "2017-12-11",
    "time_created": "08:46:23",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr31577",
    "parent_id": "t1_dr2vqpn",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "This sub is like a palette cleanser after all the fucked up shit in the top posts.",
    "controversiality": 0,
    "ups": 168,
    "downs": 0,
    "score": 168,
    "created": 1513027612.0,
    "date_created": "2017-12-11",
    "time_created": "08:26:52",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr33xv9",
    "parent_id": "t1_dr2wfg1",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "My favourite thing I remember about Time Cube was an interview with Gene Ray where he talked about his theory of 4 simultaneous dawn/dusk/midday/midnight points per day (something like that) as being akin to the 4 sides of a cube. \n\nThe interviewer tried to explain that a cube has six sides he replied with an incredulous \"top and bottom ain't sides!\"\n\nEvery now and then I'll just say \"top and bottom ain't sides\" to my wife when the context demands it and it never fails to get a laugh",
    "controversiality": 0,
    "ups": 783,
    "downs": 0,
    "score": 783,
    "created": 1513031676.0,
    "date_created": "2017-12-11",
    "time_created": "09:34:36",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr35uzz",
    "parent_id": "t1_dr2wfg1",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "That story becomes really sad when you consider he had one guy who truly believed in his stuff and, after they met and had a disagreement, the dude killed himself.",
    "controversiality": 0,
    "ups": 55,
    "downs": 0,
    "score": 55,
    "created": 1513034060.0,
    "date_created": "2017-12-11",
    "time_created": "10:14:20",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr39xtv",
    "parent_id": "t1_dr33wgm",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "related (but not the same), /r/teslore \n\nelder scrolls lore is fascinating, by the way.",
    "controversiality": 0,
    "ups": 56,
    "downs": 0,
    "score": 56,
    "created": 1513038668.0,
    "date_created": "2017-12-11",
    "time_created": "11:31:08",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr39nyc",
    "parent_id": "t1_dr33wgm",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "WHAT IS THAT COUNFOUNDED CONTRAPTION ",
    "controversiality": 0,
    "ups": 45,
    "downs": 0,
    "score": 45,
    "created": 1513038373.0,
    "date_created": "2017-12-11",
    "time_created": "11:26:13",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr35965",
    "parent_id": "t1_dr33cde",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "some of those living situations are a genuinely unsettling nightmare. like looking through the eyes of someone with untreated depression. how did it get that bad?",
    "controversiality": 0,
    "ups": 102,
    "downs": 0,
    "score": 102,
    "created": 1513033318.0,
    "date_created": "2017-12-11",
    "time_created": "10:01:58",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3wdbi",
    "parent_id": "t1_dr3v1k3",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "If it allows sims to have a warehouse full of art slaves that you abuse, being homeless sounds pretty banal in comparison",
    "controversiality": 0,
    "ups": 481,
    "downs": 0,
    "score": 481,
    "created": 1513061740.0,
    "date_created": "2017-12-11",
    "time_created": "17:55:40",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3zaze",
    "parent_id": "t1_dr3t1x0",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Someone made his computer into a chat room for some really shady stuff.\n\nEDIT: My most upvoted post is now a hyper simplification of a tech story.",
    "controversiality": 0,
    "ups": 4793,
    "downs": 0,
    "score": 4793,
    "created": 1513065068.0,
    "date_created": "2017-12-11",
    "time_created": "18:51:08",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr42ano",
    "parent_id": "t1_dr3t1x0",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Dude same, I was reading along feeling all tense like \"omg what's going to happen next?!?!?!1111?!?!\" then I realised I didn't even know what was happening at all.",
    "controversiality": 0,
    "ups": 260,
    "downs": 0,
    "score": 260,
    "created": 1513068623.0,
    "date_created": "2017-12-11",
    "time_created": "19:50:23",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr39i5w",
    "parent_id": "t1_dr38phl",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Well this was like 07 and sophomore year was 03-04 so I had to dig through Facebook to find her and when i did she was a few states away and in a relationship so I never bothered her about it and I'm sure that it has been taken down now that Tripod has gone defunct ",
    "controversiality": 0,
    "ups": 2551,
    "downs": 0,
    "score": 2551,
    "created": 1513038198.0,
    "date_created": "2017-12-11",
    "time_created": "11:23:18",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3e4tk",
    "parent_id": "t1_dr3cf8c",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "> The blog is still up, but the post has been deleted =c\n\nHe knows you know. He read this comment.",
    "controversiality": 0,
    "ups": 125,
    "downs": 0,
    "score": 125,
    "created": 1513042975.0,
    "date_created": "2017-12-11",
    "time_created": "12:42:55",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3bce5",
    "parent_id": "t1_dr3b5nk",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "The youtube video can only be accessed through the link. You cannot search it on youtube.",
    "controversiality": 0,
    "ups": 180,
    "downs": 0,
    "score": 180,
    "created": 1513040143.0,
    "date_created": "2017-12-11",
    "time_created": "11:55:43",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr4clvr",
    "parent_id": "t1_dr3b5nk",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "YouTube has three privacy options:  \nPublic: The video can be found via a YouTube search, and anyone can watch it.  \nPrivate: Only those with the URL link and the password can watch it.  \nUnlisted: The video doesn't appear in YouTube's search results, but can be watched by anyone who has the link.",
    "controversiality": 0,
    "ups": 77,
    "downs": 0,
    "score": 77,
    "created": 1513080192.0,
    "date_created": "2017-12-11",
    "time_created": "23:03:12",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr471gf",
    "parent_id": "t1_dr3e7nk",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "[http://www.wwwdotcom.com/index.html](http://www.wwwdotcom.com/index.html) is still up and it says just that!",
    "controversiality": 0,
    "ups": 120,
    "downs": 0,
    "score": 120,
    "created": 1513074038.0,
    "date_created": "2017-12-11",
    "time_created": "21:20:38",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3kmw7",
    "parent_id": "t1_dr3gtwx",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Yeah, all of the Showbiz locations were converted to Chuck E. Cheese's.",
    "controversiality": 0,
    "ups": 313,
    "downs": 0,
    "score": 313,
    "created": 1513049591.0,
    "date_created": "2017-12-11",
    "time_created": "14:33:11",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3xi5w",
    "parent_id": "t1_dr3gtwx",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Fun fact: Chuck E Cheese was created by the founder of Atari.  The whole concept of the place was to create a kid-friendly arcade.  The reason they went with pizza was because it took longer to make and consume than other fast food choices, guaranteeing people would stay in the arcade longer.",
    "controversiality": 0,
    "ups": 298,
    "downs": 0,
    "score": 298,
    "created": 1513063006.0,
    "date_created": "2017-12-11",
    "time_created": "18:16:46",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3uek8",
    "parent_id": "t1_dr3ogtk",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I was checking out the top posts over on /r/obscuremedia and stumbled upon the fever dream that is [concept unification.](https://www.youtube.com/watch?v=GXCrVNEwGxM) It's some crazy Westworld kinda stuff.\n\nAfter that I spent like two hours watching Chuck E. Cheese employee training videos, from 1991 and 2007. It's honestly fascinating stuff and I'm not sure why.",
    "controversiality": 0,
    "ups": 69,
    "downs": 0,
    "score": 69,
    "created": 1513059628.0,
    "date_created": "2017-12-11",
    "time_created": "17:20:28",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3oh1u",
    "parent_id": "t1_dr3fcuz",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Never even played that game and it is the first thing I thought of when reading this. Wonder if it was an inspiration.",
    "controversiality": 0,
    "ups": 174,
    "downs": 0,
    "score": 174,
    "created": 1513053553.0,
    "date_created": "2017-12-11",
    "time_created": "15:39:13",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3a29x",
    "parent_id": "t1_dr372fp",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "oh snap!",
    "controversiality": 0,
    "ups": 1543,
    "downs": 0,
    "score": 1543,
    "created": 1513038800.0,
    "date_created": "2017-12-11",
    "time_created": "11:33:20",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3emzm",
    "parent_id": "t1_dr372fp",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I hate to ask, but the Imgur post only hinted at it. Dan was likely responsible for all this, right?",
    "controversiality": 0,
    "ups": 289,
    "downs": 0,
    "score": 289,
    "created": 1513043480.0,
    "date_created": "2017-12-11",
    "time_created": "12:51:20",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3tub1",
    "parent_id": "t1_dr3rkg3",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Yeah what the fuck. That's the most horrifying part. ",
    "controversiality": 0,
    "ups": 68,
    "downs": 0,
    "score": 68,
    "created": 1513059025.0,
    "date_created": "2017-12-11",
    "time_created": "17:10:25",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr38odb",
    "parent_id": "t1_dr357m7",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "So right! Came across this site and spent hours looking through the different articles.\n\nI went in looking for an article about a  guy in Nevada searching for evidence of a plane crash years before in the desert. Still haven't found it, but got some great stuff in the meantime. ",
    "controversiality": 0,
    "ups": 57,
    "downs": 0,
    "score": 57,
    "created": 1513037290.0,
    "date_created": "2017-12-11",
    "time_created": "11:08:10",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3jlny",
    "parent_id": "t1_dr39154",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I live near Joshua Tree. It's insane how many tourists during the summer months don't take proper precautions. I take my kids there pretty often as they like to climb around on the rocks. One day last summer my kids ended up playing around with a few other kids they found at the park while their parents sat in some shade. I went over to make the boys drink some water and I noticed that the kid was wobbly and pale. I gave him some water and started talking to him. He was speaking French and I don't speak French but he definitely sounded like he was drunk. \n\nI alerted the parents and they were not very concerned and essentially shrugged it off saying they had water in the car. \n\nThe worst part is there is very little cell reception in the park itself. Even in a relatively popular area it's possible to be a ways away from proper medical attention",
    "controversiality": 0,
    "ups": 146,
    "downs": 0,
    "score": 146,
    "created": 1513048531.0,
    "date_created": "2017-12-11",
    "time_created": "14:15:31",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr37m0c",
    "parent_id": "t1_dr36d25",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "archive: https://web.archive.org/web/20170920090047/http://www.otherhand.org/home-page/search-and-rescue/the-hunt-for-the-death-valley-germans/",
    "controversiality": 0,
    "ups": 3527,
    "downs": 0,
    "score": 3527,
    "created": 1513036102.0,
    "date_created": "2017-12-11",
    "time_created": "10:48:22",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr37wwi",
    "parent_id": "t1_dr36d25",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I really feel like this post is just, “Reddit, what site do you want to give the hug of death to today?”",
    "controversiality": 0,
    "ups": 2348,
    "downs": 0,
    "score": 2348,
    "created": 1513036441.0,
    "date_created": "2017-12-11",
    "time_created": "10:54:01",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3qmcp",
    "parent_id": "t1_dr3j50s",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "No people - that you can see.",
    "controversiality": 0,
    "ups": 75,
    "downs": 0,
    "score": 75,
    "created": 1513055709.0,
    "date_created": "2017-12-11",
    "time_created": "16:15:09",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3dpkj",
    "parent_id": "t1_dr3btly",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Exceptional",
    "controversiality": 0,
    "ups": 1344,
    "downs": 0,
    "score": 1344,
    "created": 1513042548.0,
    "date_created": "2017-12-11",
    "time_created": "12:35:48",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3g3jy",
    "parent_id": "t1_dr3btly",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "That dude might straight up be dead. They had him running around getting tattooed, making fake passports, and forging hospital documents, and he kept mentioning to the guy he thought was a fellow scammer that \"creditors\" were \"at his neck.\" Right about the time he starts mentioning creditors, communication from him goes dark. Not to give the impression that I feel especially sorry for him or anything...",
    "controversiality": 0,
    "ups": 340,
    "downs": 0,
    "score": 340,
    "created": 1513044980.0,
    "date_created": "2017-12-11",
    "time_created": "13:16:20",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3aa07",
    "parent_id": "t1_dr3a4fx",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I'm in tears everytime I see a video of him.",
    "controversiality": 0,
    "ups": 362,
    "downs": 0,
    "score": 362,
    "created": 1513039032.0,
    "date_created": "2017-12-11",
    "time_created": "11:37:12",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3kwyc",
    "parent_id": "t1_dr3bmzf",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Thats amazing! Along similar lines, I was just reading a few weeks ago about another island called Bouvet Island. The first explorers believed to have ever explored the island on foot found a frozen lake in the middle of the island, and in this lake they found a lifeboat stuck in the ice. To this day no one knows how it got there.\n https://www.reddit.com/r/thalassophobia/comments/7cvpuv/this_is_the_oceanic_pole_of_inaccessibility_aka/dpti8vn/",
    "controversiality": 0,
    "ups": 331,
    "downs": 0,
    "score": 331,
    "created": 1513049876.0,
    "date_created": "2017-12-11",
    "time_created": "14:37:56",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3i8j7",
    "parent_id": "t1_dr3f9h5",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Sounds like something we should explore. Screw Atlantis.",
    "controversiality": 0,
    "ups": 978,
    "downs": 0,
    "score": 978,
    "created": 1513047138.0,
    "date_created": "2017-12-11",
    "time_created": "13:52:18",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3jbhf",
    "parent_id": "t1_dr3f9h5",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "It is.  As the wiki page OP posted states, Lovecraft chose the location of R'lyeh because of this.\n\n>Known as \"Point Nemo\", Latin for \"no one\" and also a reference to Jules Verne's Captain Nemo, it lies more than 1,400 nautical miles from the nearest land.[15] This Oceanic Point of Inaccessibility was used by H. P. Lovecraft as R'lyeh, the earthly home of Cthulhu.\n",
    "controversiality": 0,
    "ups": 213,
    "downs": 0,
    "score": 213,
    "created": 1513048246.0,
    "date_created": "2017-12-11",
    "time_created": "14:10:46",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3us3q",
    "parent_id": "t1_dr3lsy2",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "One time pads (https://en.wikipedia.org/wiki/One-time_pad) are pretty simple, and a form of unbreakable encryption that can be done with pencil and paper (and more than a little patience).\n\nLet's say Alice is a secret agent, and Barbra is her handler. Barbra wants to send secure messages to Alice over shortwave radio once Alice is in some dangerous location.\n\nHere's how it works: First, we make two identical key pads. These pads are just lists of numbers generated by some purely random process, like rolling dice or shuffling cards. Alice takes one to DangerousPlace, while Barb holds on to the copy.\n\nNow, when Barb wants to send a message to Alice, she writes down the message as a series of numbers. The scheme used to turn letters/words into numbers is arbitrary. It could be a 2nd code book, or as simple as just A = 1, B = 2... and so on.\n\nNext, Barb encrypts the message by taking a page from the one time pad, and combining each number in the message with the number from the pad. The specific operation used to combine them needs to be invert-able. This could be modular arithmetic, or the exclusive or operation.\n\nNow Barb has the coded message, and can broadcast it on the numbers station at a pre-arranged time. To decode the message, Alice writes the numbers down, and chooses the same page from her copy of the one time pad. For each pair of numbers she applies the inverse operation, which reveal's Barb's message.\n\nSo long as you *never* reuse a page from the one time pads, this scheme is completely secure, in the information theoretic sense. Even an adversary with infinite computing power couldn't decode it, because they can't recreate the random information on the one time bad.\n\nThe downside of one time pad schemes, is you have to pre share the key data. So you can't use it to set up secure communications with someone new purely via an untrusted communication channel. That requires more tricky schemes.",
    "controversiality": 0,
    "ups": 206,
    "downs": 0,
    "score": 206,
    "created": 1513060027.0,
    "date_created": "2017-12-11",
    "time_created": "17:27:07",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3v7an",
    "parent_id": "t1_dr3lsy2",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Holy shit. Florida (specifically Jupiter Inlet) and Virginia (Warrenton training site) have been prime location suspects for the CIA-run stations since the 80s. Either you're familiar with the \"lore\" of the hobby and trolling us, or you're the first person I've ever known to have even a second-hand story from someone involved in the back-end of these stations.",
    "controversiality": 0,
    "ups": 39,
    "downs": 0,
    "score": 39,
    "created": 1513060474.0,
    "date_created": "2017-12-11",
    "time_created": "17:34:34",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr382u2",
    "parent_id": "t1_dr35m1k",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Да.",
    "controversiality": 0,
    "ups": 1318,
    "downs": 0,
    "score": 1318,
    "created": 1513036625.0,
    "date_created": "2017-12-11",
    "time_created": "10:57:05",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr39sxf",
    "parent_id": "t1_dr35m1k",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "\"Lunch today will be...\"\n\n",
    "controversiality": 0,
    "ups": 54,
    "downs": 0,
    "score": 54,
    "created": 1513038521.0,
    "date_created": "2017-12-11",
    "time_created": "11:28:41",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3a90m",
    "parent_id": "t1_dr35m1k",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "\"17, 23, 265, 1, 0, 7, 274, 3, 9.\"\n\n\"Yes, god damnit, I got the goddamn memo about the TPS report cover sheets!\"",
    "controversiality": 0,
    "ups": 112,
    "downs": 0,
    "score": 112,
    "created": 1513039003.0,
    "date_created": "2017-12-11",
    "time_created": "11:36:43",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3ctqq",
    "parent_id": "t1_dr36ljj",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Ahh nothimg says relaxing music like a German lady screaming numbers at me while music box plays in the background. That's some jigsaw shit right there...",
    "controversiality": 0,
    "ups": 264,
    "downs": 0,
    "score": 264,
    "created": 1513041668.0,
    "date_created": "2017-12-11",
    "time_created": "12:21:08",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3te11",
    "parent_id": "t1_dr3e0ml",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": ">There are doubtless recordings of me out there reading out the time for hours at a time. Bored, monotone, airsick...\n\nIf it makes you feel better if there's recordings of you out there reading the time for hours upon end in a bored monotone voice while sick.\n\nThere's also probably a bunch of people on a forum somewhere analysing those recordings trying to work out the hidden meaning, why is this guy just reading the time over and over, what could it mean!?",
    "controversiality": 0,
    "ups": 115,
    "downs": 0,
    "score": 115,
    "created": 1513058546.0,
    "date_created": "2017-12-11",
    "time_created": "17:02:26",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36uep",
    "parent_id": "t1_dr35yl3",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I have a friend named Mason. You can bet me and the lads have worn his soul to the stump with that joke.",
    "controversiality": 0,
    "ups": 612,
    "downs": 0,
    "score": 612,
    "created": 1513035222.0,
    "date_created": "2017-12-11",
    "time_created": "10:33:42",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3bdyt",
    "parent_id": "t1_dr3adi4",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Many things have an \"anonymous\" tipline. If your tip leads to the arrest of someone, they usually ignore how they got it or where it came from. Works for local pd too. The whole \"crime stoppers\" program in many states. ",
    "controversiality": 0,
    "ups": 3010,
    "downs": 0,
    "score": 3010,
    "created": 1513040187.0,
    "date_created": "2017-12-11",
    "time_created": "11:56:27",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3e2xq",
    "parent_id": "t1_dr3adi4",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "In the late 90's you had to do something really bad to get arrested for hacking. Even the FBI didn't quite understand it yet.",
    "controversiality": 0,
    "ups": 122,
    "downs": 0,
    "score": 122,
    "created": 1513042922.0,
    "date_created": "2017-12-11",
    "time_created": "12:42:02",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3eab7",
    "parent_id": "t1_dr3adi4",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Grey and white hat hacking back in the day was in some ways very different and in others very nuch the same. One important thing is \"responsible disclosure\" which usually refers to the idea that if you find an exploit in software or a website and you inform that website in a timely private manner that will go a long way to protect you if the entity tries to sue you for hacking them. The FBI probably functions under the same principal. As long as your catching child predators you can get a pass on some level.",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1513043127.0,
    "date_created": "2017-12-11",
    "time_created": "12:45:27",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3p8n3",
    "parent_id": "t1_dr3hqed",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Damn it, it's really a low number in geological terms. :/",
    "controversiality": 0,
    "ups": 45,
    "downs": 0,
    "score": 45,
    "created": 1513054321.0,
    "date_created": "2017-12-11",
    "time_created": "15:52:01",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3ku2z",
    "parent_id": "t1_dr3gg0k",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "You are significantly significant for me to take the time to remind you that ice cream tastes better when you are not dead.  Anyways, death is a hell of a commitment, it's like going to last forreevveeerrrr, an eternity, all the time everyday and that sounds boring as shit to me. D'ya think is there anything else we can do in the meantime, just to push it back in the diary for a couple more years.. anything but death for me today please and thanks.\n",
    "controversiality": 0,
    "ups": 284,
    "downs": 0,
    "score": 284,
    "created": 1513049795.0,
    "date_created": "2017-12-11",
    "time_created": "14:36:35",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36h6q",
    "parent_id": "t1_dr35qwg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Maybe humans are still making progress after all.\n\nAnd by progress obviously I mean inching closer making Star Trek real.",
    "controversiality": 0,
    "ups": 1947,
    "downs": 0,
    "score": 1947,
    "created": 1513034796.0,
    "date_created": "2017-12-11",
    "time_created": "10:26:36",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr377hg",
    "parent_id": "t1_dr361vx",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "It really tells you something when the most information anthropologists have about them is from how many meters away their javelins can reliably hit a human-sized target.",
    "controversiality": 0,
    "ups": 5508,
    "downs": 0,
    "score": 5508,
    "created": 1513035642.0,
    "date_created": "2017-12-11",
    "time_created": "10:40:42",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36wfi",
    "parent_id": "t1_dr361vx",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "They have been seen using fire that happens thru lightning strikes.  We don't think they know how to make fire yet.",
    "controversiality": 0,
    "ups": 2140,
    "downs": 0,
    "score": 2140,
    "created": 1513035288.0,
    "date_created": "2017-12-11",
    "time_created": "10:34:48",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr371s1",
    "parent_id": "t1_dr361vx",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I find the North Sentinelese people fascinating. I just wish there was more information to read up on them. As far as I know, there is just a Wikipedia page on them and a few YouTube videos (from my searching of the internet). It just blows my mind that there is still a group of humans who haven’t progressed in the tiniest bit with the rest of humanity.\n\nI would love for a contact with the outside world be peaceful so we can learn about their language, religion, society etc.\n\nAlso, IIRC, the Indian government thought everybody on the island died after the Boxing Day tsunami because of its location and how low the island sits. But nope, they were still there afterwards. I also think that the Indian government has made it illegal to make contact and even travel to the island, simply because it’s too risky. They fire arrows at anybody who gets too close. The literally try to kill anybody outside of their own little world.\n\nEdit: it would also be interesting to see that if they progress their society to a point where they explore outside of their own island, what they would think if they sailed to a modern city and how they would react to it.",
    "controversiality": 0,
    "ups": 1992,
    "downs": 0,
    "score": 1992,
    "created": 1513035463.0,
    "date_created": "2017-12-11",
    "time_created": "10:37:43",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr389d9",
    "parent_id": "t1_dr361vx",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "> Sentinelese\n\n*Quite a few discarded their weapons and gestured to us to throw the fish. The women came out of the shade to watch our antics. ... A few men came and picked up the fish. They appeared to be gratified, but there did not seem to be much softening to their hostile attitude. ... They all began shouting some incomprehensible words. We shouted back and gestured to indicate that we wanted to be friends. The tension did not ease. At this moment, a strange thing happened—a woman paired off with a warrior and sat on the sand in a passionate embrace. This act was being repeated by other women, each claiming a warrior for herself, a sort of community mating, as it were. Thus did the militant group diminish. This continued for quite some time and when the tempo of this frenzied dance of desire abated, the couples retired into the shade of the jungle. However, some warriors were still on guard. We got close to the shore and threw some more fish which were immediately retrieved by a few youngsters. It was well past noon and we headed back to the ship*\n\ntl;dr,  Indian anthropologists got close, the Sentinelese started banging on the beach until they finished and retreated to the shade..\n\nEdit typo",
    "controversiality": 0,
    "ups": 101,
    "downs": 0,
    "score": 101,
    "created": 1513036829.0,
    "date_created": "2017-12-11",
    "time_created": "11:00:29",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36vmc",
    "parent_id": "t1_dr361vx",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Aren't these the people who threw spears and shot arrows at a helicopter that flew overhead to survey the area?",
    "controversiality": 0,
    "ups": 94,
    "downs": 0,
    "score": 94,
    "created": 1513035261.0,
    "date_created": "2017-12-11",
    "time_created": "10:34:21",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3hyvq",
    "parent_id": "t1_dr3bw6k",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "\"If it does not work, demons are not causing the problem.\"\n\nNice caveat.",
    "controversiality": 0,
    "ups": 105,
    "downs": 0,
    "score": 105,
    "created": 1513046862.0,
    "date_created": "2017-12-11",
    "time_created": "13:47:42",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3blvx",
    "parent_id": "t1_dr37tug",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Bad news... You caught a demon :(",
    "controversiality": 0,
    "ups": 83,
    "downs": 0,
    "score": 83,
    "created": 1513040416.0,
    "date_created": "2017-12-11",
    "time_created": "12:00:16",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr375by",
    "parent_id": "t1_dr35x91",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "poeple... don't believe in primates??",
    "controversiality": 0,
    "ups": 1212,
    "downs": 0,
    "score": 1212,
    "created": 1513035574.0,
    "date_created": "2017-12-11",
    "time_created": "10:39:34",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr38aof",
    "parent_id": "t1_dr35x91",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "The latter. It's some bizarrely elaborate deception for profit I recall. I was not convinced by the reasoning.",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1513036868.0,
    "date_created": "2017-12-11",
    "time_created": "11:01:08",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr38bod",
    "parent_id": "t1_dr36zwy",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Think it was an \"I can't see it therefore it's not real\" type deal.",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1513036900.0,
    "date_created": "2017-12-11",
    "time_created": "11:01:40",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36yhp",
    "parent_id": "t1_dr36oll",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "But then sometimes it all crystallizes and you read a coherent thought. But it's not a thought, it's a bot guessing each word based on the previous one. It has an amazing amount of content and creativity and also none. Almost like a word version of seeing faces in buildings or aliens attempting to learn English. ",
    "controversiality": 0,
    "ups": 977,
    "downs": 0,
    "score": 977,
    "created": 1513035356.0,
    "date_created": "2017-12-11",
    "time_created": "10:35:56",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36cpb",
    "parent_id": "t1_dr358uz",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "> is fixing to \n\nHello fellow southerner",
    "controversiality": 0,
    "ups": 3978,
    "downs": 0,
    "score": 3978,
    "created": 1513034649.0,
    "date_created": "2017-12-11",
    "time_created": "10:24:09",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr39le1",
    "parent_id": "t1_dr358uz",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Me: This is surprisingly cute to watch. I'll watch a few minutes. \n\nMe: I absolutely can't watch more than 10 minutes. I need to go. \n\nAlso me: Fuck, I just watched 20 minutes of marbles and was sad when one of my favorites lost the lead. Wtf is wrong with me?",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1513038296.0,
    "date_created": "2017-12-11",
    "time_created": "11:24:56",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36fxt",
    "parent_id": "t1_dr358uz",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "He is an autistic Dutch guy, he gets narration help, but it's his passion to build marble tracks and marble competitons",
    "controversiality": 0,
    "ups": 134,
    "downs": 0,
    "score": 134,
    "created": 1513034755.0,
    "date_created": "2017-12-11",
    "time_created": "10:25:55",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr367fz",
    "parent_id": "t1_dr3460f",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Get a keg, colored shirts, and a handful of friends to liven up any boring Saturday!\n\n*friends optional",
    "controversiality": 0,
    "ups": 48,
    "downs": 0,
    "score": 48,
    "created": 1513034475.0,
    "date_created": "2017-12-11",
    "time_created": "10:21:15",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3fsqq",
    "parent_id": "t1_dr3dypy",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "At what minute is it?",
    "controversiality": 0,
    "ups": 51,
    "downs": 0,
    "score": 51,
    "created": 1513044674.0,
    "date_created": "2017-12-11",
    "time_created": "13:11:14",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36yjg",
    "parent_id": "t1_dr31o6v",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I think what makes it so disturbing is that nobody can discern a good reason for the videos to exist in the first place. The ad revenue thing makes sense, but you could achieve that with a wide range of content that doesn't involve such fucking weird themes. Kids aren't enticed by the inappropriate titles or scenes, they click because it's cartoon characters with bright colours. So why the fuck are all these videos full of scat, gore and weird fetish stuff?!",
    "controversiality": 0,
    "ups": 1429,
    "downs": 0,
    "score": 1429,
    "created": 1513035358.0,
    "date_created": "2017-12-11",
    "time_created": "10:35:58",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr2y56x",
    "parent_id": "t1_dr2xn9r",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I first heard of it from an H3H3 video months ago and I just recently dove head first into the craziness. It's honestly very disturbing ",
    "controversiality": 0,
    "ups": 2037,
    "downs": 0,
    "score": 2037,
    "created": 1513021651.0,
    "date_created": "2017-12-11",
    "time_created": "06:47:31",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr37ml6",
    "parent_id": "t1_dr343gp",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "What is \"bad baby\" videos and what do they contain. I already know about elsagate and switched to PBS Kids and Nick Jr. \n\nBut my I caught my daughter saying that. \"Bad Baby\"",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1513036119.0,
    "date_created": "2017-12-11",
    "time_created": "10:48:39",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr335wn",
    "parent_id": "t1_dr3289w",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "It's people posting disturbing stuff under the guise of being \"kid friendly.\" A lot of these videos end up in youtube kids, despite their creepy themes. And they tend to gain millions of views, either through bots, or through kids that watch the videos because they're filled with recognizable characters. It's just people scheming the YouTube algorithm, since none of these videos actually get checked manually.",
    "controversiality": 0,
    "ups": 1431,
    "downs": 0,
    "score": 1431,
    "created": 1513030641.0,
    "date_created": "2017-12-11",
    "time_created": "09:17:21",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr35jwc",
    "parent_id": "t1_dr31hlv",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "> 1871: Clement Vallandigham, a lawyer and Ohio politician defending a man accused of murder, accidentally shot himself while demonstrating how the victim might have accidentally shot himself. His client was cleared",
    "controversiality": 0,
    "ups": 1912,
    "downs": 0,
    "score": 1912,
    "created": 1513033686.0,
    "date_created": "2017-12-11",
    "time_created": "10:08:06",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr34chd",
    "parent_id": "t1_dr31hlv",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "258 AD: The deacon Saint Lawrence was roasted alive on a giant grill during the persecution of Valerian.[24][25] Prudentius tells that he joked with his tormentors, \"Turn me over—I'm done on this side\".[26] He is now the patron saint of cooks, chefs and comedians. ",
    "controversiality": 0,
    "ups": 5086,
    "downs": 0,
    "score": 5086,
    "created": 1513032192.0,
    "date_created": "2017-12-11",
    "time_created": "09:43:12",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr34jly",
    "parent_id": "t1_dr31hlv",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "> Garry Hoy, a lawyer in Toronto, Ontario, fell to his death from the 24th floor of the Toronto-Dominion Centre while demonstrating to a group of visitors that the building's windows were \"unbreakable\". Hoy threw himself against the glass, which indeed did not break; instead the window popped out of its frame\n\nThis one is my personal favorite. I confess I laughed much more than I should have.\n\nThe story of poor Mary the elephant on the other hand, not so much.",
    "controversiality": 0,
    "ups": 2203,
    "downs": 0,
    "score": 2203,
    "created": 1513032440.0,
    "date_created": "2017-12-11",
    "time_created": "09:47:20",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr33op7",
    "parent_id": "t1_dr31hlv",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": ">2013: Takuya Nagaya, 23, from Japan, started to slither on the floor and claim he had become a snake. His mother took this to mean that he had been possessed by a snake, and called for her husband, 53-year-old Katsumi Nagaya. Katsumi spent the next two days head-butting and biting his son \"to drive [out] the snake that had possessed him\" but instead causing his death.[152]\n\n\n\n\n.......What",
    "controversiality": 0,
    "ups": 2876,
    "downs": 0,
    "score": 2876,
    "created": 1513031342.0,
    "date_created": "2017-12-11",
    "time_created": "09:29:02",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr34i1k",
    "parent_id": "t1_dr31hlv",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "> 2008: A 43-year-old mother of four died of an allergic reaction after having sex with a German Shepherd dog.\n\nI don't know what I was expecting",
    "controversiality": 0,
    "ups": 1457,
    "downs": 0,
    "score": 1457,
    "created": 1513032384.0,
    "date_created": "2017-12-11",
    "time_created": "09:46:24",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr34h75",
    "parent_id": "t1_dr31hlv",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": ">\"1854: William Snyder, a 13 year old, died when a circus clown swung him around by his heels.[56][57]\"\n\nThe actual fuck\n\n",
    "controversiality": 0,
    "ups": 895,
    "downs": 0,
    "score": 895,
    "created": 1513032356.0,
    "date_created": "2017-12-11",
    "time_created": "09:45:56",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr37b1b",
    "parent_id": "t1_dr31hlv",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "> 1016: Edmund Ironside was stabbed whilst on a toilet, by an assassin hiding underneath.\n\nName does not check out.",
    "controversiality": 0,
    "ups": 106,
    "downs": 0,
    "score": 106,
    "created": 1513035755.0,
    "date_created": "2017-12-11",
    "time_created": "10:42:35",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr31tfc",
    "parent_id": "t1_dr31hlv",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Hahaha what the fuck",
    "controversiality": 0,
    "ups": 1236,
    "downs": 0,
    "score": 1236,
    "created": 1513028684.0,
    "date_created": "2017-12-11",
    "time_created": "08:44:44",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr38yif",
    "parent_id": "t1_dr31hlv",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": ">When Martin asked Borra where the jester had been, the jester replied with: \"Out of the next vineyard, where I saw a young deer hanging by his tail from a tree, as if someone had so punished him for stealing figs.\" This joke caused the king to die from laughter.\n\nI... guess you had to be there.",
    "controversiality": 0,
    "ups": 72,
    "downs": 0,
    "score": 72,
    "created": 1513037605.0,
    "date_created": "2017-12-11",
    "time_created": "11:13:25",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr35i5c",
    "parent_id": "t1_dr31hlv",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "\"2017: Charlie Holt, 5, died after his head was stuck between a wall and table in the Sun Dial Restaurant, Atlanta, Georgia, at the top of Westin Peachtree Plaza Hotel. The restaurant rotates 360 degrees, and he was fatally injured by being in the small space between the rotating and non-rotating sections.\"\n\nJesus.",
    "controversiality": 0,
    "ups": 135,
    "downs": 0,
    "score": 135,
    "created": 1513033626.0,
    "date_created": "2017-12-11",
    "time_created": "10:07:06",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3635j",
    "parent_id": "t1_dr31hlv",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "2013: Denver Lee St. Clair was asphyxiated by a wedgie administered by his stepson during a fight. After St. Clair had been knocked unconscious the elastic band from his torn underwear was pulled over his head and stretched around his neck, strangling him.",
    "controversiality": 0,
    "ups": 47,
    "downs": 0,
    "score": 47,
    "created": 1513034332.0,
    "date_created": "2017-12-11",
    "time_created": "10:18:52",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr38eju",
    "parent_id": "t1_dr31hlv",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "1979: Robert Williams, a worker at a Ford Motor Co. plant, became the first person known to be killed by a robot when the arm of a factory robot struck him in the head.\n\nNOT THE LAST EITHER MEATBAGS",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1513036988.0,
    "date_created": "2017-12-11",
    "time_created": "11:03:08",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr32lzl",
    "parent_id": "t1_dr31hlv",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 84,
    "downs": 0,
    "score": 84,
    "created": 1513029862.0,
    "date_created": "2017-12-11",
    "time_created": "09:04:22",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr37h74",
    "parent_id": "t1_dr31hlv",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": ">\"2008: David Phyall, 50, the last resident in a block of flats due to be demolished in Bishopstoke, near Southampton, Hampshire, England, **decapitated himself with a chainsaw** to highlight the injustice of being forced to move out.[132][133]\"\n\nHoly shit. ",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1513035953.0,
    "date_created": "2017-12-11",
    "time_created": "10:45:53",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr35uvu",
    "parent_id": "t1_dr32a4m",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I though wikipedia was supposed to stay neutral. ",
    "controversiality": 0,
    "ups": 123,
    "downs": 0,
    "score": 123,
    "created": 1513034056.0,
    "date_created": "2017-12-11",
    "time_created": "10:14:16",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3b1v5",
    "parent_id": "t1_dr32a4m",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "\"this list of serial killers is incomplete. you can help by expanding it\"",
    "controversiality": 0,
    "ups": 85,
    "downs": 0,
    "score": 85,
    "created": 1513039844.0,
    "date_created": "2017-12-11",
    "time_created": "11:50:44",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr30bvc",
    "parent_id": "t1_dr2xmrf",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I've been listening to so much last podcast on the left and generation why atm on serial killers and unsolved crime that I'm actually getting paranoid and need to stop. But the psychology is so interesting. ",
    "controversiality": 0,
    "ups": 491,
    "downs": 0,
    "score": 491,
    "created": 1513026182.0,
    "date_created": "2017-12-11",
    "time_created": "08:03:02",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr38n4p",
    "parent_id": "t1_dr38923",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Thanks for your website. So many laughs these years. \n\nSorry for the \"Reddit's accidental DDoS\". Keep up the good work.",
    "controversiality": 0,
    "ups": 874,
    "downs": 0,
    "score": 874,
    "created": 1513037252.0,
    "date_created": "2017-12-11",
    "time_created": "11:07:32",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr35di3",
    "parent_id": "t1_dr3428s",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "As is tradition",
    "controversiality": 0,
    "ups": 588,
    "downs": 0,
    "score": 588,
    "created": 1513033467.0,
    "date_created": "2017-12-11",
    "time_created": "10:04:27",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr350vq",
    "parent_id": "t1_dr3428s",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "REDDITEFUCKT\n",
    "controversiality": 0,
    "ups": 1434,
    "downs": 0,
    "score": 1434,
    "created": 1513033032.0,
    "date_created": "2017-12-11",
    "time_created": "09:57:12",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr34ou7",
    "parent_id": "t1_dr344zl",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I'm always curious what the owner of the site must be thinking with these sudden increases in traffic to their site.",
    "controversiality": 0,
    "ups": 508,
    "downs": 0,
    "score": 508,
    "created": 1513032624.0,
    "date_created": "2017-12-11",
    "time_created": "09:50:24",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr32zj3",
    "parent_id": "t1_dr2ymoe",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Damn, what did you do to get in that position? Must be horrible living in an SCP facility.",
    "controversiality": 0,
    "ups": 1256,
    "downs": 0,
    "score": 1256,
    "created": 1513030396.0,
    "date_created": "2017-12-11",
    "time_created": "09:13:16",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr324t2",
    "parent_id": "t1_dr2wpo3",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Can’t remember the number or his name, but there’s an SCP that is literally just some regular guy that inexplicably shows up at the most unlikely of places.  He’ll be put in absolute containment and surveillance, but then he’s just standing in a top secret room. He’s not dangerous and has no explanation for what’s going on; he’s just as lost as you.\n\n**edit:** Meet SCP-008-J, aka, [Geoff](http://www.scp-wiki.net/scp-008-j) (don't forget to read the incident transcripts)",
    "controversiality": 0,
    "ups": 1841,
    "downs": 0,
    "score": 1841,
    "created": 1513029161.0,
    "date_created": "2017-12-11",
    "time_created": "08:52:41",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr2wr3j",
    "parent_id": "t1_dr2wpo3",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "SCP-3000 is pretty creepy, largely because it's an unfathomably huge sea creature.",
    "controversiality": 0,
    "ups": 487,
    "downs": 0,
    "score": 487,
    "created": 1513018159.0,
    "date_created": "2017-12-11",
    "time_created": "05:49:19",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr30a0f",
    "parent_id": "t1_dr2wpo3",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "http://scp-wiki.wikidot.com/scp-261\n\nThe vending machine of your dreams/nightmares. A lot of good edits",
    "controversiality": 0,
    "ups": 487,
    "downs": 0,
    "score": 487,
    "created": 1513026083.0,
    "date_created": "2017-12-11",
    "time_created": "08:01:23",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr2y549",
    "parent_id": "t1_dr2wpo3",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": " SCP-173 was my first one that led me down the rabbit hole, but my favorite is 978.\n\nAlso [here](http://tvtropes.org/pmwiki/pmwiki.php/Tearjerker/SCPFoundation) is a TV trope for some good ones. ",
    "controversiality": 0,
    "ups": 192,
    "downs": 0,
    "score": 192,
    "created": 1513021647.0,
    "date_created": "2017-12-11",
    "time_created": "06:47:27",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3211e",
    "parent_id": "t1_dr2wpo3",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "[SCP-093](http://www.scp-wiki.net/scp-093) is one of my favorites.",
    "controversiality": 0,
    "ups": 91,
    "downs": 0,
    "score": 91,
    "created": 1513029004.0,
    "date_created": "2017-12-11",
    "time_created": "08:50:04",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr33zlc",
    "parent_id": "t1_dr2wpo3",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I forget which SCP it is, but my favorite one has got to be the SCP that's a pizza box, and it's \"thing\" is whenever someone opens it, it instantly materializes the person's favorite pizza, whatever it may be. \n\n\nJust a cool bro pizza box that gives you your fave pizza, that's a cool dude.",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1513031737.0,
    "date_created": "2017-12-11",
    "time_created": "09:35:37",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr2zm3o",
    "parent_id": "t1_dr2zimf",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "The SCP Foundation is a fictional organization that is the subject of a web-based collaborative writing project of the same name. The stories generated by the project describe the exploits of the Foundation, supposedly responsible for containing individuals, entities, locations, and objects that violate natural law (referred to as SCPs). The main written works on the SCP Foundation website are articles written in the style of structured internal documentation about the contained SCPs. The website also contains thousands of \"Foundation Tales\", short stories set within the universe of the SCP Foundation.\n\n\nIt's basically a group of people writing together about a fictional foundation and the creatures that they contain. ",
    "controversiality": 0,
    "ups": 2169,
    "downs": 0,
    "score": 2169,
    "created": 1513024825.0,
    "date_created": "2017-12-11",
    "time_created": "07:40:25",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr310ga",
    "parent_id": "t1_dr2zimf",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "The idea is that there are a huge amount of *things* - people, objects, buildings, entities, and so on - that are \"anomalous\" in nature. Some of them are relatively safe, others could destroy the world.\n\nThe SCP Foundation, true to their name, secures, contains, and protects these artifacts. They're basically an enormous organization of Men In Black who control the world from behind the scenes to keep these things secret and protect everyone else from their effects.",
    "controversiality": 0,
    "ups": 625,
    "downs": 0,
    "score": 625,
    "created": 1513027395.0,
    "date_created": "2017-12-11",
    "time_created": "08:23:15",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr351bn",
    "parent_id": "t1_dr34erl",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Downvoting that comment gave me such a great feeling of pride and accomplishment. ",
    "controversiality": 0,
    "ups": 2126,
    "downs": 0,
    "score": 2126,
    "created": 1513033048.0,
    "date_created": "2017-12-11",
    "time_created": "09:57:28",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr37dbt",
    "parent_id": "t1_dr34089",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I remember a video I saw of a guy who wanted to make Carmax look bad by getting his custom Supra MkIV appraised. At first it seemed normal, but throughout the video the only thing the dude keeps saying to the guy doing the appraisal is some variant of \"it's got 1000 horsepower\". At the end, he was only offered $15K. He didn't like that number on his precious project import.",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1513035829.0,
    "date_created": "2017-12-11",
    "time_created": "10:43:49",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr37fyi",
    "parent_id": "t1_dr370lo",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Thanks!  It took a while.  My marriage ended up falling apart in the process.\n\n",
    "controversiality": 0,
    "ups": 3132,
    "downs": 0,
    "score": 3132,
    "created": 1513035913.0,
    "date_created": "2017-12-11",
    "time_created": "10:45:13",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr383o1",
    "parent_id": "t1_dr36jdf",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Your friend is spot-on.  It's your entire identity. Nearly everything you do is with other members of the Church - mostly at Church sponsored activities. When I left it felt like a death in the family.  Except, this person keeps coming back and dying all over again. ",
    "controversiality": 0,
    "ups": 957,
    "downs": 0,
    "score": 957,
    "created": 1513036651.0,
    "date_created": "2017-12-11",
    "time_created": "10:57:31",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr389rc",
    "parent_id": "t1_dr35xeq",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "No.  The tone of that site is more aggressive against the Church.  As a  hardcore believing member of the Church I would have ran from the CES Letter.\n\nThe site that opened the trap-door beneath my feet was [MormonThink](http://www.mormonthink.com)",
    "controversiality": 0,
    "ups": 1728,
    "downs": 0,
    "score": 1728,
    "created": 1513036840.0,
    "date_created": "2017-12-11",
    "time_created": "11:00:40",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr37d1z",
    "parent_id": "t1_dr36otr",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Mormons believe that Jesus Christ's church found in the Bible was lost after the death of the 12 apostles, and that J.C. restored his church through a new york man in 1820 named Joseph Smith. Hence \"restoration\". The church teaches it's members a very whitewashed version of Joseph Smith's life that involves receiving revelations from god, receiving divine authority from god (priesthood), and the setting up of the church. Joseph Smith, to mormons, is the closet man to Jesus in terms of righteousness.\n\nSince all of this is so recent, Joseph Smith's life is very well documented, to the point that we almost know exactly where he was every day of his life. And when you look at the details of his life that's not taught at church you realise that there's some very disturbing details left out.\n\nJust a quick off-the-top-of-my-head list: J.S. was tried in court as a con man, rewrote scriptures (\"revelations\") to suit his purposes at any given time, lied to the public on a number of occasions, and coerced women to marry him (\"polygamy\") in god's name.\n\nThe list is very long and very detailed, but hopefully this gives you an idea. ",
    "controversiality": 0,
    "ups": 220,
    "downs": 0,
    "score": 220,
    "created": 1513035820.0,
    "date_created": "2017-12-11",
    "time_created": "10:43:40",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr38q8p",
    "parent_id": "t1_dr37ogd",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "> You obviously have great deductive reasoning abilities and a strong focus\n\nThanks, but it only took me 45 years   :)\n\nTruly, it was a complete accident that I found that website and article.  It was also fortunate  that it was not written in a manner that made it seem like an attack on the Church  - I would have fled if I suspected it was an \"anti\" website.",
    "controversiality": 0,
    "ups": 48,
    "downs": 0,
    "score": 48,
    "created": 1513037350.0,
    "date_created": "2017-12-11",
    "time_created": "11:09:10",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3dw54",
    "parent_id": "t1_dr33bi8",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "What's really horrid about those two isn't just that they killed her sister while raping her on Christmas, it's the fact that the next day, they recorded another sex video of Karla pretending to be her sister while wearing her sister's clothes. I repeat: they did this the day after they killed her. That's the part that makes me realize Karla was lying about being completely coerced into the things her and Paul did. ",
    "controversiality": 0,
    "ups": 57,
    "downs": 0,
    "score": 57,
    "created": 1513042728.0,
    "date_created": "2017-12-11",
    "time_created": "12:38:48",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3102v",
    "parent_id": "t1_dr2x33m",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I just read some of it... it just keeps going, and going, and going. I had to stop at the beastiality... What a fucked up person. I was going to listen to a podcast on the toy box killer today actually but I won't now and I'm glad I didn't.",
    "controversiality": 0,
    "ups": 181,
    "downs": 0,
    "score": 181,
    "created": 1513027378.0,
    "date_created": "2017-12-11",
    "time_created": "08:22:58",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr359mm",
    "parent_id": "t1_dr2x33m",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "On the off chance you stumble upon the Toolbox Killer transcript, avoid that. I had to stop reading. It's literally the transcript of a murder.",
    "controversiality": 0,
    "ups": 120,
    "downs": 0,
    "score": 120,
    "created": 1513033333.0,
    "date_created": "2017-12-11",
    "time_created": "10:02:13",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3aakl",
    "parent_id": "t1_dr35z6u",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "> \"okay I think this is the one...\"\n\n**THINK AGAIN, BITCH**\n\n\nSeriously, sometimes it takes me months to pull the trigger on a part. ",
    "controversiality": 0,
    "ups": 108,
    "downs": 0,
    "score": 108,
    "created": 1513039049.0,
    "date_created": "2017-12-11",
    "time_created": "11:37:29",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr337mw",
    "parent_id": "t1_dr32kj9",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I used to love that website. :(",
    "controversiality": 0,
    "ups": 1201,
    "downs": 0,
    "score": 1201,
    "created": 1513030703.0,
    "date_created": "2017-12-11",
    "time_created": "09:18:23",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr33g5t",
    "parent_id": "t1_dr32kj9",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I only quit cracked.com when they simultaneously started constantly advertising for the \"cracked store\", added a subscription plan (which was required to up or downvote article comments), and started asking for donations.\n\nSo they basically ruined the comments section while also doing a bunch of irritating shit.",
    "controversiality": 0,
    "ups": 612,
    "downs": 0,
    "score": 612,
    "created": 1513031028.0,
    "date_created": "2017-12-11",
    "time_created": "09:23:48",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr346zk",
    "parent_id": "t1_dr32kj9",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Did they lose/change writers at some point? I was all about Cracked in college.",
    "controversiality": 0,
    "ups": 166,
    "downs": 0,
    "score": 166,
    "created": 1513031998.0,
    "date_created": "2017-12-11",
    "time_created": "09:39:58",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr35a23",
    "parent_id": "t1_dr33ees",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Vapaad (or whatever the name for form VII is) if you're a bad motherfucker.",
    "controversiality": 0,
    "ups": 177,
    "downs": 0,
    "score": 177,
    "created": 1513033348.0,
    "date_created": "2017-12-11",
    "time_created": "10:02:28",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr37otb",
    "parent_id": "t1_dr36xbc",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I think you are fine. I’m pretty sure all of those old stories aren’t considered canon anymore.",
    "controversiality": 0,
    "ups": 45,
    "downs": 0,
    "score": 45,
    "created": 1513036189.0,
    "date_created": "2017-12-11",
    "time_created": "10:49:49",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr37njw",
    "parent_id": "t1_dr32nt2",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Just add **-escape** to your search to filter out anything related to the escape room. ",
    "controversiality": 0,
    "ups": 71,
    "downs": 0,
    "score": 71,
    "created": 1513036150.0,
    "date_created": "2017-12-11",
    "time_created": "10:49:10",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr30bbd",
    "parent_id": "t1_dr3073a",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Oh. Well that's much less exciting.",
    "controversiality": 0,
    "ups": 1398,
    "downs": 0,
    "score": 1398,
    "created": 1513026155.0,
    "date_created": "2017-12-11",
    "time_created": "08:02:35",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr34nro",
    "parent_id": "t1_dr325b0",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "BACKPACKS, BACKPACKS, COME GET YOUR BACKPACKS!",
    "controversiality": 0,
    "ups": 626,
    "downs": 0,
    "score": 626,
    "created": 1513032586.0,
    "date_created": "2017-12-11",
    "time_created": "09:49:46",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr33ixn",
    "parent_id": "t1_dr325b0",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "A haaaiircuuut",
    "controversiality": 0,
    "ups": 752,
    "downs": 0,
    "score": 752,
    "created": 1513031127.0,
    "date_created": "2017-12-11",
    "time_created": "09:25:27",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr32zxw",
    "parent_id": "t1_dr30cyc",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "it's the most wonderful time of the ",
    "controversiality": 0,
    "ups": 1664,
    "downs": 0,
    "score": 1664,
    "created": 1513030411.0,
    "date_created": "2017-12-11",
    "time_created": "09:13:31",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr34rzv",
    "parent_id": "t1_dr338yj",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Yee",
    "controversiality": 0,
    "ups": 271,
    "downs": 0,
    "score": 271,
    "created": 1513032734.0,
    "date_created": "2017-12-11",
    "time_created": "09:52:14",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr37pg0",
    "parent_id": "t1_dr338yj",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "My theory is that memes have gotten weirder to deter them from going mainstream. Old memes were pretty accessible: Advice Animals, rage comics, allsorts of image macros it was easy to make your own version of. As a result we got trollface merchandise, Keep Calm and Carry On and Grumpy Cat being spammed everywhere. So the humour drifted towards stuff you can't really repeat out of context without everyone not in on the joke thinking you're an utter weirdo.",
    "controversiality": 0,
    "ups": 139,
    "downs": 0,
    "score": 139,
    "created": 1513036208.0,
    "date_created": "2017-12-11",
    "time_created": "10:50:08",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr31in7",
    "parent_id": "t1_dr30ofc",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Alwayspayformusicneverillegallydownload",
    "controversiality": 0,
    "ups": 392,
    "downs": 0,
    "score": 392,
    "created": 1513028227.0,
    "date_created": "2017-12-11",
    "time_created": "08:37:07",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr34g38",
    "parent_id": "t1_dr33fa9",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Said playlist: ~~https://www.youtube.com/playlist?list=PL7XlqX4npddfrdpMCxBnNZXg2GFll7t5y~~\nnew mirror playlist link, thanks to /u/wumpified8 : https://www.youtube.com/playlist?list=PLXKAG8g1Ls_Ax-SU7rCgyiGWjylB5NHL-",
    "controversiality": 0,
    "ups": 2584,
    "downs": 0,
    "score": 2584,
    "created": 1513032318.0,
    "date_created": "2017-12-11",
    "time_created": "09:45:18",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr34x49",
    "parent_id": "t1_dr34555",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Orange",
    "controversiality": 0,
    "ups": 195,
    "downs": 0,
    "score": 195,
    "created": 1513032905.0,
    "date_created": "2017-12-11",
    "time_created": "09:55:05",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr374vu",
    "parent_id": "t1_dr31v37",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "12? ^^12? ^^^12? Woo^ooo^ooo",
    "controversiality": 0,
    "ups": 78,
    "downs": 0,
    "score": 78,
    "created": 1513035560.0,
    "date_created": "2017-12-11",
    "time_created": "10:39:20",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36jn8",
    "parent_id": "t1_dr33h0d",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I can hear his nasally voice just reading this",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1513034873.0,
    "date_created": "2017-12-11",
    "time_created": "10:27:53",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3afua",
    "parent_id": "t1_dr32xb7",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "They still are it's just that the concept can only really hold your attention so long. It's interesting but not thaaat interesting. ",
    "controversiality": 0,
    "ups": 128,
    "downs": 0,
    "score": 128,
    "created": 1513039205.0,
    "date_created": "2017-12-11",
    "time_created": "11:40:05",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3831d",
    "parent_id": "t1_dr37bys",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "www.hackerscanyon.com. If you have any questions about it feel free to ask, there's so much to talk about this website I don't even know where to begin. I don't know much about domains but the bit that really interests me is how they seem to own some pretty 'big' ones and have done for many, many years. For example, I'd imagine www.bloods.com and www.crips.com would be in quite high demand.. ",
    "controversiality": 0,
    "ups": 152,
    "downs": 0,
    "score": 152,
    "created": 1513036631.0,
    "date_created": "2017-12-11",
    "time_created": "10:57:11",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr35ejs",
    "parent_id": "t1_dr35965",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": ">untreated depression\n\nprobably",
    "controversiality": 0,
    "ups": 116,
    "downs": 0,
    "score": 116,
    "created": 1513033503.0,
    "date_created": "2017-12-11",
    "time_created": "10:05:03",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr4die5",
    "parent_id": "t1_dr3wdbi",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Excuse me? ",
    "controversiality": 0,
    "ups": 46,
    "downs": 0,
    "score": 46,
    "created": 1513081281.0,
    "date_created": "2017-12-11",
    "time_created": "23:21:21",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3zmaa",
    "parent_id": "t1_dr3zaze",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Thanks, that actually helped a lot.",
    "controversiality": 0,
    "ups": 1422,
    "downs": 0,
    "score": 1422,
    "created": 1513065429.0,
    "date_created": "2017-12-11",
    "time_created": "18:57:09",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr40b3b",
    "parent_id": "t1_dr3zaze",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Solid ELI5. Thank you!",
    "controversiality": 0,
    "ups": 481,
    "downs": 0,
    "score": 481,
    "created": 1513066241.0,
    "date_created": "2017-12-11",
    "time_created": "19:10:41",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3wf6k",
    "parent_id": "t1_dr3kmw7",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "The \"concept unification\" training video from the conversion is surreal.",
    "controversiality": 0,
    "ups": 69,
    "downs": 0,
    "score": 69,
    "created": 1513061796.0,
    "date_created": "2017-12-11",
    "time_created": "17:56:36",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr41rqw",
    "parent_id": "t1_dr3xi5w",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I have fond memories of that pizza.  It was probably made of ass crap but 10 year old me thought it was still the best tasting pizza in town.",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1513067990.0,
    "date_created": "2017-12-11",
    "time_created": "19:39:50",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3scfp",
    "parent_id": "t1_dr3oh1u",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I guarantee you it was. At least partially.",
    "controversiality": 0,
    "ups": 92,
    "downs": 0,
    "score": 92,
    "created": 1513057471.0,
    "date_created": "2017-12-11",
    "time_created": "16:44:31",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3bdff",
    "parent_id": "t1_dr3a29x",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I could just be a cyborg though...",
    "controversiality": 0,
    "ups": 3089,
    "downs": 0,
    "score": 3089,
    "created": 1513040172.0,
    "date_created": "2017-12-11",
    "time_created": "11:56:12",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3ohbc",
    "parent_id": "t1_dr3emzm",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "It seems there were other people there as well, seen fleeing by the conductor. Did no one in that group come forward to say what happened? I guess the answer is clearly no, but damn...",
    "controversiality": 0,
    "ups": 146,
    "downs": 0,
    "score": 146,
    "created": 1513053560.0,
    "date_created": "2017-12-11",
    "time_created": "15:39:20",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3jst5",
    "parent_id": "t1_dr3emzm",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "That or he felt guilty for allowing it to happen.",
    "controversiality": 0,
    "ups": 99,
    "downs": 0,
    "score": 99,
    "created": 1513048731.0,
    "date_created": "2017-12-11",
    "time_created": "14:18:51",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3r1x1",
    "parent_id": "t1_dr3emzm",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "There definitely seems to be some suspicion there... and the suicide implies massive amount of guilt. Add to the fact that she may have been roofied and that he was the first person on the scene, well, it could make a good TV show episode.",
    "controversiality": 0,
    "ups": 89,
    "downs": 0,
    "score": 89,
    "created": 1513056141.0,
    "date_created": "2017-12-11",
    "time_created": "16:22:21",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3osuk",
    "parent_id": "t1_dr3jlny",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I had a scary/stupid incident at Joshua Tree. The wife and I went there for a vacation. When we arrived at the airport and got a rental car, they ended up running out of rental cars and we ended up with a jeep. During one of our drives in the park we decided, hey, we've got a jeep, let's do one of these offroad trails. And we found a trail that looked like it ended at a road. \n\nSo we got on this trail and it was mostly sand. Then it got more and more rocky. The thinking was more along the lines of, \"wow, this jeep can handle some rough terrain, let's keep going.\". I don't know how long we went on for, but it seemed like hours. You don't realize that something doesn't look that far, but when going 5mph or less, it takes a long time. Then suddenly we're in a rocky canyon. There is a steep rock slope and I'm not sure if the jeep has the height to clear it. I have the wife watch from outside as I drove over and we made it. We keep going and then another rock slope, even steeper than the last one. And these are to the point where I know that even if I can get down it, I dunno if I could get back up and go back the way we came. And we don't have a winch or anything if we were to get stuck. \n\nWe decide to attempt to go down and keep going, we figured we couldn't be too far from the road and we made it down those rocks. But it just kept getting worse and worse. It was just increasing dread each time we encountered one of these because you know the further you go the harder it will be to get back. And you think the end is coming up around the bend but you have no idea where. You just have this map and guess where you are. What seemed like hours later, we finally made it to the road. \n\nWe had decent water and would have made it through the night if we got stuck or something. But who knows how long it would have been before someone came by or saw us. There was no way we were walking out of there. A fun trip quickly escalated into a scary scenario where we just wanted to get the heck out of there. Lesson learned.",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1513053878.0,
    "date_created": "2017-12-11",
    "time_created": "15:44:38",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3qwqd",
    "parent_id": "t1_dr37m0c",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I just went down that rabbit hole. Holy crap is that an awesome read but terribly anti-climactic ending.",
    "controversiality": 0,
    "ups": 41,
    "downs": 0,
    "score": 41,
    "created": 1513055997.0,
    "date_created": "2017-12-11",
    "time_created": "16:19:57",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr380x6",
    "parent_id": "t1_dr37wwi",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "We will slashdot the world.",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1513036566.0,
    "date_created": "2017-12-11",
    "time_created": "10:56:06",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3i4le",
    "parent_id": "t1_dr3dpkj",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Holy fuck he actually got the tattoo...that's the best reverse scam ever...",
    "controversiality": 0,
    "ups": 1306,
    "downs": 0,
    "score": 1306,
    "created": 1513047025.0,
    "date_created": "2017-12-11",
    "time_created": "13:50:25",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3gm3s",
    "parent_id": "t1_dr3aa07",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Have your ever thought about **that**, *Solomon?!*",
    "controversiality": 0,
    "ups": 87,
    "downs": 0,
    "score": 87,
    "created": 1513045496.0,
    "date_created": "2017-12-11",
    "time_created": "13:24:56",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3juzh",
    "parent_id": "t1_dr3i8j7",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "...On second thought, maybe it's best to let what lies down a dark abyss undisturbed.",
    "controversiality": 0,
    "ups": 909,
    "downs": 0,
    "score": 909,
    "created": 1513048791.0,
    "date_created": "2017-12-11",
    "time_created": "14:19:51",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3abeg",
    "parent_id": "t1_dr3a90m",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1513039074.0,
    "date_created": "2017-12-11",
    "time_created": "11:37:54",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr391md",
    "parent_id": "t1_dr36uep",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I'm a Mason, Black Ops came out when I was in middle School and pretty much everyone at my school played it. Still get that today",
    "controversiality": 0,
    "ups": 394,
    "downs": 0,
    "score": 394,
    "created": 1513037699.0,
    "date_created": "2017-12-11",
    "time_created": "11:14:59",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3pr8u",
    "parent_id": "t1_dr3bdyt",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I remember reading about a guy I think it was in Australia, broke into a house and stole a computer. He found kiddie porn and went to the police. He incriminated himself and got charged, so that he could help the police prosecute this guy. ",
    "controversiality": 0,
    "ups": 249,
    "downs": 0,
    "score": 249,
    "created": 1513054839.0,
    "date_created": "2017-12-11",
    "time_created": "16:00:39",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3d4t7",
    "parent_id": "t1_dr3bdyt",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "The anonymous tipline in my country isn't actually anonymous so YMMV. Research if it actually is first",
    "controversiality": 0,
    "ups": 259,
    "downs": 0,
    "score": 259,
    "created": 1513041970.0,
    "date_created": "2017-12-11",
    "time_created": "12:26:10",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3iwuf",
    "parent_id": "t1_dr3e2xq",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Had a cousin who did some time for cybercrime in the 90s. Now works in cyber security for the government.",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1513047837.0,
    "date_created": "2017-12-11",
    "time_created": "14:03:57",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr37sh5",
    "parent_id": "t1_dr36h6q",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Imagine their shock when a submarine or underwater vehicle surfaces, it'll be like the opening scene of Star Trek : Into Darkness",
    "controversiality": 0,
    "ups": 747,
    "downs": 0,
    "score": 747,
    "created": 1513036304.0,
    "date_created": "2017-12-11",
    "time_created": "10:51:44",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr38hlq",
    "parent_id": "t1_dr36h6q",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "this was my thought lol.  contacting them is giving me opening scene of 'star trek into darkness' vibes",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1513037081.0,
    "date_created": "2017-12-11",
    "time_created": "11:04:41",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr38epq",
    "parent_id": "t1_dr377hg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "And that they can throw a 90kg javelin 300m. ",
    "controversiality": 0,
    "ups": 1905,
    "downs": 0,
    "score": 1905,
    "created": 1513036993.0,
    "date_created": "2017-12-11",
    "time_created": "11:03:13",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr38i05",
    "parent_id": "t1_dr36wfi",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "The first and last true stormchasers.",
    "controversiality": 0,
    "ups": 927,
    "downs": 0,
    "score": 927,
    "created": 1513037094.0,
    "date_created": "2017-12-11",
    "time_created": "11:04:54",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr38prj",
    "parent_id": "t1_dr371s1",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I think the general consensus is that these tribes must remain uncontacted. What would their immune systems really be like? Check out Survival International.",
    "controversiality": 0,
    "ups": 1191,
    "downs": 0,
    "score": 1191,
    "created": 1513037335.0,
    "date_created": "2017-12-11",
    "time_created": "11:08:55",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3cbnz",
    "parent_id": "t1_dr389d9",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "\"Oh, you're gonna come and try to take our island?  Well we will just make more of us to fight you!\"",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1513041157.0,
    "date_created": "2017-12-11",
    "time_created": "12:12:37",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr37f7k",
    "parent_id": "t1_dr36vmc",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Yeah. Any tribe that is *still* \"uncontacted\" today is going to be hostile and aggressive by definition. If they weren't hostile and aggressive, they'd be hosting day-trips from tourists.\n\nThey've killed a few missionaries and others who tried to make contact, over the years.",
    "controversiality": 0,
    "ups": 130,
    "downs": 0,
    "score": 130,
    "created": 1513035888.0,
    "date_created": "2017-12-11",
    "time_created": "10:44:48",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr37ngx",
    "parent_id": "t1_dr375by",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Lol, yeah I got so distracted by the moon deniers I didn't even notice the primate thing. Definitely weirder.",
    "controversiality": 0,
    "ups": 694,
    "downs": 0,
    "score": 694,
    "created": 1513036147.0,
    "date_created": "2017-12-11",
    "time_created": "10:49:07",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36otk",
    "parent_id": "t1_dr36cpb",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Louisiana born and raised",
    "controversiality": 0,
    "ups": 1773,
    "downs": 0,
    "score": 1773,
    "created": 1513035039.0,
    "date_created": "2017-12-11",
    "time_created": "10:30:39",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3azbx",
    "parent_id": "t1_dr36yjg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "the best reason I can think of, is to make you pay for other services. Hulu and Netflix wouldn't let this on, but YouTube has the means to be exploited. ",
    "controversiality": 0,
    "ups": 68,
    "downs": 0,
    "score": 68,
    "created": 1513039773.0,
    "date_created": "2017-12-11",
    "time_created": "11:49:33",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr39pfd",
    "parent_id": "t1_dr36yjg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "> fetish stuff?!\n\nThey like to bind!",
    "controversiality": 0,
    "ups": 268,
    "downs": 0,
    "score": 268,
    "created": 1513038416.0,
    "date_created": "2017-12-11",
    "time_created": "11:26:56",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3clpx",
    "parent_id": "t1_dr36yjg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "That's what bothers me the most. I fell down that rabbit hole a month or two ago, but went too far and saw some shit I haven't been able to shake. There is some fucked up shit involving real children on there. All the videos have Russian titles. ",
    "controversiality": 0,
    "ups": 83,
    "downs": 0,
    "score": 83,
    "created": 1513041440.0,
    "date_created": "2017-12-11",
    "time_created": "12:17:20",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3a9w5",
    "parent_id": "t1_dr37ml6",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Prepare yourself for some unpleasant things.\n\nInfantilism is a type of fetish some consenting adults enjoy where one person, usually the submissive partner/participant is dressed as and treated like a baby, right down to footie pajamas, pigtails, pacifiers, and diapers for some. Usually it's just an incarnation of the Dominant/submissive dynamic, and is kept to consenting adults in safe situations, and a lot of it focuses on care giving and comfort.\n \nHowever, from what I've seen, these \"Bad Baby\" videos are a type of \"scene\" created by people and posted on YouTube. I'm not sure if they're actual consenting adults who enjoy infantilism or how willing all of the participants are. In BDSM circles, consent (even in \"nonconsent\" roleplay) is paramount - so posting these videos where non-consenting people (CHILDREN especially) could view them unwittingly goes against everything I've ever known about the community. I've heard of videos featuring people/children vomiting, urinating/defecating, being \"punished\" in various methods for being a \"bad baby,\" etc. \n\nOne of the more well-known contributors that sort of broke the elsagate thing (and got his channel banned because it went viral) was a father making videos with his two school-age daughters. His stuff often featured infantilism, or a scene where he comes into the bathroom while his daughters are taking a bath (in bathing suits) and scaring them with fake spiders/snakes and a live frog once (?) until they're screaming/crying. Another showed the youngest being force fed baby food until she threw up. One showed one of the daughters \"wetting\" herself, but no one knows if it was real or faked for the purposes of the video.",
    "controversiality": 0,
    "ups": 96,
    "downs": 0,
    "score": 96,
    "created": 1513039029.0,
    "date_created": "2017-12-11",
    "time_created": "11:37:09",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr33f3u",
    "parent_id": "t1_dr335wn",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "That's so damn weird. If it's people manipulating views for profit, why make the contents so disturbing? And if it's not about the profit, then what's the reason for trying to get this shit seen? Unsettling. ",
    "controversiality": 0,
    "ups": 512,
    "downs": 0,
    "score": 512,
    "created": 1513030987.0,
    "date_created": "2017-12-11",
    "time_created": "09:23:07",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr38ozx",
    "parent_id": "t1_dr35jwc",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "That shows real dedication to his work as a lawyer.",
    "controversiality": 0,
    "ups": 791,
    "downs": 0,
    "score": 791,
    "created": 1513037310.0,
    "date_created": "2017-12-11",
    "time_created": "11:08:30",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr380zz",
    "parent_id": "t1_dr35jwc",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I saw a skit of this one on a kids' show called Horrible Histories. I'm probably 15 years too old for that show, but Stupid Deaths was great.",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1513036569.0,
    "date_created": "2017-12-11",
    "time_created": "10:56:09",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr35l7m",
    "parent_id": "t1_dr34chd",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Absolute legend",
    "controversiality": 0,
    "ups": 1960,
    "downs": 0,
    "score": 1960,
    "created": 1513033731.0,
    "date_created": "2017-12-11",
    "time_created": "10:08:51",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr35g3e",
    "parent_id": "t1_dr34jly",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "At least he died knowing he was right.",
    "controversiality": 0,
    "ups": 591,
    "downs": 0,
    "score": 591,
    "created": 1513033555.0,
    "date_created": "2017-12-11",
    "time_created": "10:05:55",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3786f",
    "parent_id": "t1_dr34jly",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I'm actually having a smoke standing a few feet away from where he landed. Creepy. ",
    "controversiality": 0,
    "ups": 408,
    "downs": 0,
    "score": 408,
    "created": 1513035666.0,
    "date_created": "2017-12-11",
    "time_created": "10:41:06",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr34l5d",
    "parent_id": "t1_dr33op7",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "2013!? ",
    "controversiality": 0,
    "ups": 492,
    "downs": 0,
    "score": 492,
    "created": 1513032493.0,
    "date_created": "2017-12-11",
    "time_created": "09:48:13",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3efj1",
    "parent_id": "t1_dr33op7",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": ">Takuya Nagaya, 23, from Japan, started to slither on the floor and claim he had become a snake. His mother took this to mean that he had been possessed by a snake, and called for her husband, 53-year-old Katsumi Nagaya. Katsumi spent the next two days head-butting and biting his son \"to drive [out] the snake that had possessed him\" but instead causing his death.[152]\n\nWell that's weird, but before the modern era people used to have a lot of strange beliefs....\n\n>2013:\n\nWut. ",
    "controversiality": 0,
    "ups": 64,
    "downs": 0,
    "score": 64,
    "created": 1513043272.0,
    "date_created": "2017-12-11",
    "time_created": "12:47:52",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3d0k1",
    "parent_id": "t1_dr34i1k",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Her kids are smart and obedient but unfortunately have a genetic predisposition to hip dysplasia.",
    "controversiality": 0,
    "ups": 239,
    "downs": 0,
    "score": 239,
    "created": 1513041858.0,
    "date_created": "2017-12-11",
    "time_created": "12:24:18",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3b0wn",
    "parent_id": "t1_dr34i1k",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Oh shit! This reminds me of some crazy dog-fucker’s blog on “how to have a loving relationship with your best friend”. \n\nIt was written by some crazy chick that discussed her “long-term” relationships with her various dogs. She argued that dog sex was the best sex she’d ever had-fucking what. \n\nUnfortunately, I do not have the link to share. ",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1513039817.0,
    "date_created": "2017-12-11",
    "time_created": "11:50:17",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3egd1",
    "parent_id": "t1_dr34h75",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "so long gay bowser",
    "controversiality": 0,
    "ups": 145,
    "downs": 0,
    "score": 145,
    "created": 1513043295.0,
    "date_created": "2017-12-11",
    "time_created": "12:48:15",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3agc9",
    "parent_id": "t1_dr34h75",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "\"What are you gonna do, swing me around by my heels?\"\n-Swinging around by the heels victim ",
    "controversiality": 0,
    "ups": 120,
    "downs": 0,
    "score": 120,
    "created": 1513039222.0,
    "date_created": "2017-12-11",
    "time_created": "11:40:22",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr321yc",
    "parent_id": "t1_dr31tfc",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Watch out, you'll be next.",
    "controversiality": 0,
    "ups": 1373,
    "downs": 0,
    "score": 1373,
    "created": 1513029043.0,
    "date_created": "2017-12-11",
    "time_created": "08:50:43",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr32qkg",
    "parent_id": "t1_dr30bvc",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I got really into missing persons cases for a while which eventually devolved into unexplained disappearances and I started getting to the point where I believed so much, I should have been wearing a tinfoil hat. I cut it out all together when I started having recurring nightmares. Beyond interesting stuff though. ",
    "controversiality": 0,
    "ups": 193,
    "downs": 0,
    "score": 193,
    "created": 1513030045.0,
    "date_created": "2017-12-11",
    "time_created": "09:07:25",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3205r",
    "parent_id": "t1_dr30bvc",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I started listening to the last pod cast on the left about two weeks ago and I've gone through a lot of the back catalogue of episodes. My wife told me to stop because apparently I'm all paranoid now.",
    "controversiality": 0,
    "ups": 109,
    "downs": 0,
    "score": 109,
    "created": 1513028968.0,
    "date_created": "2017-12-11",
    "time_created": "08:49:28",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr35mj2",
    "parent_id": "t1_dr350vq",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "We hugged it too tight. ",
    "controversiality": 0,
    "ups": 851,
    "downs": 0,
    "score": 851,
    "created": 1513033775.0,
    "date_created": "2017-12-11",
    "time_created": "10:09:35",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr34t2g",
    "parent_id": "t1_dr34ou7",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "If they have google analytics, it's easy to see what's going on.",
    "controversiality": 0,
    "ups": 420,
    "downs": 0,
    "score": 420,
    "created": 1513032770.0,
    "date_created": "2017-12-11",
    "time_created": "09:52:50",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr33aht",
    "parent_id": "t1_dr32zj3",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "He's D class. Don't talk to him. ",
    "controversiality": 0,
    "ups": 1623,
    "downs": 0,
    "score": 1623,
    "created": 1513030812.0,
    "date_created": "2017-12-11",
    "time_created": "09:20:12",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr35th9",
    "parent_id": "t1_dr324t2",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "http://www.scp-wiki.net/scp-507 maybe?\n\nHes just a normal guy that can teleport/dimension hop around places with no control over it whatsoever. My favorite instance is when 2 other versions of scp 507 blinked into the same dimension and then had an argument with the site researcher on who was the real one",
    "controversiality": 0,
    "ups": 330,
    "downs": 0,
    "score": 330,
    "created": 1513034009.0,
    "date_created": "2017-12-11",
    "time_created": "10:13:29",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr35hs5",
    "parent_id": "t1_dr324t2",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Reminds me of another one. A chair that teleports around the world taking the place of a different chair. Like, if there's a regular cushioned chair in a theater then BAM weird old chair and the original is gone.",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1513033614.0,
    "date_created": "2017-12-11",
    "time_created": "10:06:54",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3hs4g",
    "parent_id": "t1_dr30a0f",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": ">Money entered: 1 counterfeit 500 yen coin (minted on site, otherwise identical to authentic article), accepted by SCP-261\n\n>SCP-261 Powered or Unpowered: Powered\n\n>Item description: After a delay of approximately 3 seconds, an unmarked, opaque white cellophane package was dispensed. Package contained candies similar to \"Gummi Bears,\" but shaped like human hands with extended middle fingers. Item was interpreted as a threat and not consumed. Testing revealed candy contained lethal amounts of potassium cyanide.\n\n****\n\n>Money entered: 0 yen (pushed \"coin return\" button)\n\n>SCP-261 Powered or Unpowered: Unpowered\n\n>Item description: Red aluminum can labelled simply \"Stop That\" in block letters, intermittent buzzing heard from within can as if coming from a large, angry insect. Subject declined to open container.\n\n****\n\n>Money entered: 100 yen, and an additional 100 yen after punching in the numbers '100' into the machine.\n\n>SCP-261 Powered or Unpowered: Powered\n\n\n>Item description: The machine made no noise for about 5 seconds, and then spat 200 yen out of the coin return. A sticky note also came out of the machine, attached to a small yet smooth rock weighing about 1.5 kg. The sticky note read \"Make up your mind!\", with an angry face drawn directly below this, all written with what seems to be permanent black marker.\n\n****\n\n>Money entered: One 500 yen coin with a hole drilled into it, with thick yarn tied through the hole; small amount of duct tape added over hole to ensure coin would not be lost. After inserting, string was pulled and coin was successfully retrieved.\n\n>SCP-261 Powered or Unpowered: Unpowered\n\n>Item description: The machine hesitated for for roughly 5 seconds, then dropped a live grenade. The grenade detonated approximately 2 seconds after hitting the ground. ██ killed, about ██ injured, an additional 4 receiving minor injuries. The grenade left a crater about two meters wide in diameter and about 18 cm deep. Interestingly, the machine itself was completely untouched. Repairs to lobby took █ days to complete.\n\n****\n\nDamn, the machine is sentient. Also it seems to hold a grudge against some of the scientists.",
    "controversiality": 0,
    "ups": 42,
    "downs": 0,
    "score": 42,
    "created": 1513046671.0,
    "date_created": "2017-12-11",
    "time_created": "13:44:31",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr32420",
    "parent_id": "t1_dr2zm3o",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": ">fictional",
    "controversiality": 0,
    "ups": 1257,
    "downs": 0,
    "score": 1257,
    "created": 1513029130.0,
    "date_created": "2017-12-11",
    "time_created": "08:52:10",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3559l",
    "parent_id": "t1_dr351bn",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I think the admins should keep it unlocked indefinitely. Downvoting EA would become a new rite of passage for new users.",
    "controversiality": 0,
    "ups": 1163,
    "downs": 0,
    "score": 1163,
    "created": 1513033185.0,
    "date_created": "2017-12-11",
    "time_created": "09:59:45",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3azyw",
    "parent_id": "t1_dr37fyi",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I am not religious at all, but I can imagine how devastating it must be for your entire identity to be shattered away like that. Sometimes reality is awful. Great to hear you are doing better now! :) ",
    "controversiality": 0,
    "ups": 1323,
    "downs": 0,
    "score": 1323,
    "created": 1513039790.0,
    "date_created": "2017-12-11",
    "time_created": "11:49:50",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr39fx5",
    "parent_id": "t1_dr37fyi",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Man, I relate to this so hard. ",
    "controversiality": 0,
    "ups": 191,
    "downs": 0,
    "score": 191,
    "created": 1513038129.0,
    "date_created": "2017-12-11",
    "time_created": "11:22:09",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr39a1h",
    "parent_id": "t1_dr383o1",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "So do you think it was for the best or would you go back and want to keep believing? And have you tried to show anyone else?",
    "controversiality": 0,
    "ups": 43,
    "downs": 0,
    "score": 43,
    "created": 1513037953.0,
    "date_created": "2017-12-11",
    "time_created": "11:19:13",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3b5kj",
    "parent_id": "t1_dr383o1",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Aaand this is why r/exmormon is friends with us over at r/exjw.",
    "controversiality": 0,
    "ups": 75,
    "downs": 0,
    "score": 75,
    "created": 1513039950.0,
    "date_created": "2017-12-11",
    "time_created": "11:52:30",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr399k7",
    "parent_id": "t1_dr389rc",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "What are your thoughts on it now? Do you regret reading it?",
    "controversiality": 0,
    "ups": 243,
    "downs": 0,
    "score": 243,
    "created": 1513037938.0,
    "date_created": "2017-12-11",
    "time_created": "11:18:58",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3c9ti",
    "parent_id": "t1_dr337mw",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "True... A couple of years ago I read about 2-4 articles daily. But then the quality plummeted and it wasn't that interesting anymore. Still, the older articles are interesting and the style they're written in is hilarious.Almost each of the article had some antic in them that would crack me up. ",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1513041105.0,
    "date_created": "2017-12-11",
    "time_created": "12:11:45",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr34ul4",
    "parent_id": "t1_dr346zk",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "The guy who started it all, Jack O’Brien, left about 6 months ago. I used to really enjoy their pod cast until he left. It definitely seemed like there were some creative differences going on.",
    "controversiality": 0,
    "ups": 131,
    "downs": 0,
    "score": 131,
    "created": 1513032820.0,
    "date_created": "2017-12-11",
    "time_created": "09:53:40",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr381cp",
    "parent_id": "t1_dr35a23",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 192,
    "downs": 0,
    "score": 192,
    "created": 1513036579.0,
    "date_created": "2017-12-11",
    "time_created": "10:56:19",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr33b6f",
    "parent_id": "t1_dr30bbd",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Yup, it's just to test the functionality of Youtube for things like upload speed, video compression, etc.",
    "controversiality": 0,
    "ups": 803,
    "downs": 0,
    "score": 803,
    "created": 1513030839.0,
    "date_created": "2017-12-11",
    "time_created": "09:20:39",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr33myg",
    "parent_id": "t1_dr33ixn",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "New shoes!",
    "controversiality": 0,
    "ups": 459,
    "downs": 0,
    "score": 459,
    "created": 1513031280.0,
    "date_created": "2017-12-11",
    "time_created": "09:28:00",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr341ci",
    "parent_id": "t1_dr32zxw",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "*yeee*",
    "controversiality": 0,
    "ups": 1683,
    "downs": 0,
    "score": 1683,
    "created": 1513031799.0,
    "date_created": "2017-12-11",
    "time_created": "09:36:39",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr353ay",
    "parent_id": "t1_dr34g38",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 615,
    "downs": 0,
    "score": 615,
    "created": 1513033119.0,
    "date_created": "2017-12-11",
    "time_created": "09:58:39",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3xvu3",
    "parent_id": "t1_dr34g38",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "And now it’s private. Thanks, Reddit. ",
    "controversiality": 0,
    "ups": 84,
    "downs": 0,
    "score": 84,
    "created": 1513063435.0,
    "date_created": "2017-12-11",
    "time_created": "18:23:55",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr39k0m",
    "parent_id": "t1_dr3831d",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Just spent a few minutes going through it. It's definitely strange. It appears like it's a guy trying to create a universe around a book that he's writing but then it goes off with those strange pictures and quotes. I'm on mobile, and at one point it asked if the web browser had permission to use my contacts. I noped out of there pretty quick. It's definitely peculiar, and like you said, it seems to be an older website, like early 2000s. Whoever it is must still be keeping that domain alive. Definitely going to go back later and check it out. \n",
    "controversiality": 0,
    "ups": 141,
    "downs": 0,
    "score": 141,
    "created": 1513038254.0,
    "date_created": "2017-12-11",
    "time_created": "11:24:14",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr4em9m",
    "parent_id": "t1_dr4die5",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Here is the specific [reference](http://www.reddit.com/r/AskReddit/comments/30r1l8/comment/cpv9f5z?st=JB354ML5&sh=2c0f0ba0), and I think there may be a Tumblr portrayal of it somewhere but I don't remember. That whole thread is amazing though",
    "controversiality": 0,
    "ups": 62,
    "downs": 0,
    "score": 62,
    "created": 1513082657.0,
    "date_created": "2017-12-11",
    "time_created": "23:44:17",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3x4po",
    "parent_id": "t1_dr3scfp",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "That game is so successful at it's genuine fright factor because there is such a huge uncanny valley going on with these types of animatronics and most of us grew up with them at birthday parties. They just have this unnatural movement to them and the 1000 yard stare that peers right into your soul. ",
    "controversiality": 0,
    "ups": 90,
    "downs": 0,
    "score": 90,
    "created": 1513062590.0,
    "date_created": "2017-12-11",
    "time_created": "18:09:50",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3fmg4",
    "parent_id": "t1_dr3bdff",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Good bot.",
    "controversiality": 0,
    "ups": 2387,
    "downs": 0,
    "score": 2387,
    "created": 1513044492.0,
    "date_created": "2017-12-11",
    "time_created": "13:08:12",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3kxgt",
    "parent_id": "t1_dr3jst5",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Either way the family photo with him smiling with them really creeped me out when I went back to it.",
    "controversiality": 0,
    "ups": 84,
    "downs": 0,
    "score": 84,
    "created": 1513049890.0,
    "date_created": "2017-12-11",
    "time_created": "14:38:10",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3m7k7",
    "parent_id": "t1_dr3i4le",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "keep reading. I don't think it ended well for the scammer though.",
    "controversiality": 0,
    "ups": 433,
    "downs": 0,
    "score": 433,
    "created": 1513051223.0,
    "date_created": "2017-12-11",
    "time_created": "15:00:23",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3jz5y",
    "parent_id": "t1_dr3juzh",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "But I wanna Ph'nglui mglw'nafh Cthulhu R'lyeh wgah'nagl fhtagn.",
    "controversiality": 0,
    "ups": 874,
    "downs": 0,
    "score": 874,
    "created": 1513048911.0,
    "date_created": "2017-12-11",
    "time_created": "14:21:51",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3bv29",
    "parent_id": "t1_dr391md",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "No your name is 4chan",
    "controversiality": 0,
    "ups": 138,
    "downs": 0,
    "score": 138,
    "created": 1513040682.0,
    "date_created": "2017-12-11",
    "time_created": "12:04:42",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3tzbr",
    "parent_id": "t1_dr3pr8u",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I read a news story where some kids broke into a shed and stole a stack of CDs. Some had CP on them. They ratted themselves out to turn the guy in. I think they ended up getting probation for their crime.",
    "controversiality": 0,
    "ups": 84,
    "downs": 0,
    "score": 84,
    "created": 1513059174.0,
    "date_created": "2017-12-11",
    "time_created": "17:12:54",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3dev1",
    "parent_id": "t1_dr3d4t7",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "What country?",
    "controversiality": 0,
    "ups": 89,
    "downs": 0,
    "score": 89,
    "created": 1513042249.0,
    "date_created": "2017-12-11",
    "time_created": "12:30:49",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr38kup",
    "parent_id": "t1_dr38epq",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "A LAND OF TREBUCHET-MEN!?!?!?!?\n\n\nWHY AM I NOT THERE ALREADY???",
    "controversiality": 0,
    "ups": 2153,
    "downs": 0,
    "score": 2153,
    "created": 1513037180.0,
    "date_created": "2017-12-11",
    "time_created": "11:06:20",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3alnr",
    "parent_id": "t1_dr38epq",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "If I’m the Cleveland Browns I’m kidnapping that tribe to use as my quarterback prospects",
    "controversiality": 0,
    "ups": 44,
    "downs": 0,
    "score": 44,
    "created": 1513039377.0,
    "date_created": "2017-12-11",
    "time_created": "11:42:57",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3ajvw",
    "parent_id": "t1_dr38prj",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "IIRC the British tried collecting a few people in the late 1800s, got two adults and two children.  The two adults died right away because the did not have an immunity to things we face everyday, the brought the kids back and never made another attempt to visit the island.",
    "controversiality": 0,
    "ups": 895,
    "downs": 0,
    "score": 895,
    "created": 1513039325.0,
    "date_created": "2017-12-11",
    "time_created": "11:42:05",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3a1x2",
    "parent_id": "t1_dr38prj",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Outside contact would destroy their virgin population. No way their immune system has caught up over the centuries",
    "controversiality": 0,
    "ups": 73,
    "downs": 0,
    "score": 73,
    "created": 1513038790.0,
    "date_created": "2017-12-11",
    "time_created": "11:33:10",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr37qxp",
    "parent_id": "t1_dr37ngx",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "what do they think they are in the zoo? animatronics???",
    "controversiality": 0,
    "ups": 435,
    "downs": 0,
    "score": 435,
    "created": 1513036253.0,
    "date_created": "2017-12-11",
    "time_created": "10:50:53",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr37dwg",
    "parent_id": "t1_dr36otk",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "On the Bayou is where you spent most of your days.",
    "controversiality": 0,
    "ups": 1501,
    "downs": 0,
    "score": 1501,
    "created": 1513035847.0,
    "date_created": "2017-12-11",
    "time_created": "10:44:07",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3gcyd",
    "parent_id": "t1_dr3azbx",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 61,
    "downs": 0,
    "score": 61,
    "created": 1513045243.0,
    "date_created": "2017-12-11",
    "time_created": "13:20:43",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3b2l8",
    "parent_id": "t1_dr39pfd",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "And they like to be bound!",
    "controversiality": 0,
    "ups": 123,
    "downs": 0,
    "score": 123,
    "created": 1513039863.0,
    "date_created": "2017-12-11",
    "time_created": "11:51:03",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3dsi9",
    "parent_id": "t1_dr3a9w5",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Oh god damn what the fuck.\n\nAnd anyone could accidentally find this shit with normal kid-style youtube searches?",
    "controversiality": 0,
    "ups": 68,
    "downs": 0,
    "score": 68,
    "created": 1513042627.0,
    "date_created": "2017-12-11",
    "time_created": "12:37:07",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr34awm",
    "parent_id": "t1_dr33f3u",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Some of them, from what I saw on the /r/elsagate sub, are very suggestive of child abuse. The weirdest and grossest are when you can tell the parents are coercing their children to participate in these videos without them understanding the situation. There's a lot of infantilism, fake violence, etc. Some of the theories are that it's a way for pedophiles to find videos they like, others think it goes farther and suggest that the pedophiles are creating content to desensitize children and maybe groom them. I'm not sure about all that, but some of these videos are extremely disturbing.",
    "controversiality": 0,
    "ups": 795,
    "downs": 0,
    "score": 795,
    "created": 1513032136.0,
    "date_created": "2017-12-11",
    "time_created": "09:42:16",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36t77",
    "parent_id": "t1_dr35l7m",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Seriously, imagine being able to deliver a smooth, badass, action movie line like that while you're being burned alive, instead of \"Aaaaaaaaahhhh fuuuuuck it's so hot!!!\".",
    "controversiality": 0,
    "ups": 1340,
    "downs": 0,
    "score": 1340,
    "created": 1513035183.0,
    "date_created": "2017-12-11",
    "time_created": "10:33:03",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr397y0",
    "parent_id": "t1_dr35g3e",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "1871: Clement Vallandigham, a lawyer and Ohio politician defending a man accused of murder, accidentally shot himself while demonstrating how the victim might have accidentally shot himself. His client was cleared.",
    "controversiality": 0,
    "ups": 100,
    "downs": 0,
    "score": 100,
    "created": 1513037889.0,
    "date_created": "2017-12-11",
    "time_created": "11:18:09",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr35l11",
    "parent_id": "t1_dr34l5d",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "..yeah, I was expecting like 1320.",
    "controversiality": 0,
    "ups": 372,
    "downs": 0,
    "score": 372,
    "created": 1513033724.0,
    "date_created": "2017-12-11",
    "time_created": "10:08:44",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36600",
    "parent_id": "t1_dr35mj2",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Can there be such a thing as too much love in the world?\nWhy yes. Yes there can.",
    "controversiality": 0,
    "ups": 268,
    "downs": 0,
    "score": 268,
    "created": 1513034426.0,
    "date_created": "2017-12-11",
    "time_created": "10:20:26",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr348sb",
    "parent_id": "t1_dr33aht",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "D class are terminated at the end of the month unless he is Brights vessel or the friend/caretaker of one of the child SCPs. Of which only Bright would have access to the external intranet so...\n\n\n\nGood morning, Dr. Bright \n\n\n\n\nEdit: from the scp personnel page, emphasis mine\n\n\nClass D\n\nClass D personnel are expendable personnel used to handle extremely hazardous anomalies and are not allowed to come into contact with Class A or Class B personnel. Class D personnel are typically drawn worldwide from the ranks of prison inmates convicted of violent crimes, especially those on death row. In times of duress, Protocol 12 may be enacted, which allows recruitment from other sources — such as political prisoners, refugee populations, and other civilian sources — that can be transferred into Foundation custody under plausibly deniable circumstances. **Class D personnel are to be given regular mandatory psychiatric evaluations and are to be administered an amnestic of at least Class B strength or terminated at the end of the month at the discretion of on-site security or medical staff**. In the event of a catastrophic site event, Class D personnel are to be terminated immediately except as deemed necessary by on-site security personnel.\n\n\n It depends on the scp but most that require d class mention termination not amnestics",
    "controversiality": 0,
    "ups": 836,
    "downs": 0,
    "score": 836,
    "created": 1513032059.0,
    "date_created": "2017-12-11",
    "time_created": "09:40:59",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3642t",
    "parent_id": "t1_dr35th9",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I searched around and thought for sure it was this one, but turns out it's just good old [Geoff](http://www.scp-wiki.net/scp-008-j).",
    "controversiality": 0,
    "ups": 173,
    "downs": 0,
    "score": 173,
    "created": 1513034362.0,
    "date_created": "2017-12-11",
    "time_created": "10:19:22",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr39t98",
    "parent_id": "t1_dr35th9",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "My favorite line thus far from that:\n\n>Upon reappearing, subject was reported to mutter “So many spiders.” Subject refused to elaborate.",
    "controversiality": 0,
    "ups": 51,
    "downs": 0,
    "score": 51,
    "created": 1513038530.0,
    "date_created": "2017-12-11",
    "time_created": "11:28:50",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3bc5a",
    "parent_id": "t1_dr35th9",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Request: A hug. Approved. \n\nFor such a bureaucratic organization, this little detail gets me. \n\n",
    "controversiality": 0,
    "ups": 50,
    "downs": 0,
    "score": 50,
    "created": 1513040135.0,
    "date_created": "2017-12-11",
    "time_created": "11:55:35",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr32900",
    "parent_id": "t1_dr32420",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "> short stories",
    "controversiality": 0,
    "ups": 971,
    "downs": 0,
    "score": 971,
    "created": 1513029333.0,
    "date_created": "2017-12-11",
    "time_created": "08:55:33",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr355c8",
    "parent_id": "t1_dr32420",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "You will refer to the SCP Foundation as fictional or you will receive Class-C amnestics.",
    "controversiality": 0,
    "ups": 313,
    "downs": 0,
    "score": 313,
    "created": 1513033188.0,
    "date_created": "2017-12-11",
    "time_created": "09:59:48",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36gc2",
    "parent_id": "t1_dr3559l",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "\"Here's your account and a link to EA's comment, you know what to do\"",
    "controversiality": 0,
    "ups": 764,
    "downs": 0,
    "score": 764,
    "created": 1513034767.0,
    "date_created": "2017-12-11",
    "time_created": "10:26:07",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3ccjv",
    "parent_id": "t1_dr3azyw",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Thanks!   I never would have guessed it would have been so difficult.  ",
    "controversiality": 0,
    "ups": 176,
    "downs": 0,
    "score": 176,
    "created": 1513041182.0,
    "date_created": "2017-12-11",
    "time_created": "12:13:02",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3ackz",
    "parent_id": "t1_dr39a1h",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I wonder about this often.  I think, if I could snap my fingers and go back to the blissful ignorance that I enjoyed.  I would do it.\n\nIt's impossible to undo the knowledge I have acquired.  I went to church for a few years after I fell down the hold and it was torturous.  The lesson manuals are filled with half-truths and at times outright lies.  I felt dizzy and sick.\n\n> And have to tried to show anyone else?\n\nYes.  It's impossible.  A believer has to be ready to hear or they just get angry and refused to even remotely think about what you presented.  I lost a brother, life-long friendships and even my parents barely speak with me.\n\nI innocently tripped, fell down the rabbit hole and in my honest ignorance - I climbed out a different man.\n",
    "controversiality": 0,
    "ups": 165,
    "downs": 0,
    "score": 165,
    "created": 1513039108.0,
    "date_created": "2017-12-11",
    "time_created": "11:38:28",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3akyg",
    "parent_id": "t1_dr399k7",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "> Do you regret reading it?\n\nThat's tricky.  I lost a lot by leaving, but I want to live an honest life.  I like learning about myself - which is not something you really do as a mormon.  ",
    "controversiality": 0,
    "ups": 716,
    "downs": 0,
    "score": 716,
    "created": 1513039356.0,
    "date_created": "2017-12-11",
    "time_created": "11:42:36",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3a1jo",
    "parent_id": "t1_dr399k7",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I'm not OP but had the exact same experience. I had years of fallout including divorce, losing contact with most of my family (things have since improved), losing contact with all but 2-3 of my life long friends. \n\nThat said, I don't regret it at all. Happier, healthier, and more fulfilled than I've ever been. Took a few years to rebuild a new life though. ",
    "controversiality": 0,
    "ups": 240,
    "downs": 0,
    "score": 240,
    "created": 1513038778.0,
    "date_created": "2017-12-11",
    "time_created": "11:32:58",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr36f1a",
    "parent_id": "t1_dr33b6f",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Also making sure French videos are ok. Apparently",
    "controversiality": 0,
    "ups": 76,
    "downs": 0,
    "score": 76,
    "created": 1513034725.0,
    "date_created": "2017-12-11",
    "time_created": "10:25:25",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr33wr5",
    "parent_id": "t1_dr33myg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Getcherself a outfiiit",
    "controversiality": 0,
    "ups": 301,
    "downs": 0,
    "score": 301,
    "created": 1513031636.0,
    "date_created": "2017-12-11",
    "time_created": "09:33:56",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr39wzk",
    "parent_id": "t1_dr39k0m",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "That was our initial thought, however the thing is 'Dirk Lemmons' doesn't appear to exist as an author, and neither do any of the books he's apparently written, no trace of them can be found anywhere. \n\nThere are various pages referring to the canyon as a place where people meet, and say if you message people you can 'set up camp'. We were in contact with one of the e-mail addresses on there 8 (EDIT: actually probably around 10/11) years ago, and they made us do some weird puzzles + riddles before finally giving us our own domain in Hacker's Canyon where we could essentially post what we want. It was around this point our investigation fizzled out, however 6 years later I e-mailed one of the addresses on the site again explaining who I was and that I was interested in picking up where I left off with the website, and they responded quickly, offering me the information needed to take control of the domain again. \n\nCombine this with the strange subject matter, the pages about drug smuggling, gangs, videos of snipers from the Iraq war, and it starts getting really fucking weird. ",
    "controversiality": 0,
    "ups": 121,
    "downs": 0,
    "score": 121,
    "created": 1513038642.0,
    "date_created": "2017-12-11",
    "time_created": "11:30:42",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr39unz",
    "parent_id": "t1_dr39k0m",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "That's what you want, a nice disconcerting website asking to access your contacts. Maybe they'll ask to track your key strokes if you're lucky next time! ",
    "controversiality": 0,
    "ups": 66,
    "downs": 0,
    "score": 66,
    "created": 1513038573.0,
    "date_created": "2017-12-11",
    "time_created": "11:29:33",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3qhkh",
    "parent_id": "t1_dr3fmg4",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "!isbot lifeproofbionicwoman",
    "controversiality": 0,
    "ups": 67,
    "downs": 0,
    "score": 67,
    "created": 1513055579.0,
    "date_created": "2017-12-11",
    "time_created": "16:12:59",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3ledo",
    "parent_id": "t1_dr3jz5y",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "O r’lyeh?",
    "controversiality": 0,
    "ups": 1235,
    "downs": 0,
    "score": 1235,
    "created": 1513050380.0,
    "date_created": "2017-12-11",
    "time_created": "14:46:20",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3dit7",
    "parent_id": "t1_dr3dev1",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "The Netherlands.\n\nPlenty of cases where \"anonymous\" tipping people still got their name etc attached to the case/thing they tipped",
    "controversiality": 0,
    "ups": 193,
    "downs": 0,
    "score": 193,
    "created": 1513042358.0,
    "date_created": "2017-12-11",
    "time_created": "12:32:38",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3cmo7",
    "parent_id": "t1_dr38kup",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "##Trebuchet Man \n*Medium humanoid (human), any non-lawful alignment*  \n___\n**Armor Class** 12  \n**Hit Points** 26 (4d8 + 8)  \n**Speed** 30 ft.\n___\nSTR | DEX | CON | INT | WIS | CHA\n:-:|:-:|:-:|:-:|:-:|:-:\n19 (+4)|14 (+2)|15 (+2)|7 (-2)|15 (+2)|8 (-1)\n___\n**Skills** Athletics +6, Perception +4  \n**Senses** passive Perception 14  \n**Languages** Trebuchetish  \n**Challenge** 1 (200 XP)\n___\n\n***Thrown Weapon Master.*** When using any thrown weapon, the trebuchet man's range when making a ranged weapon attack with that weapon becomes 300/900 ft. When making a ranged weapon attack with a thrown weapon that has the Versatile property, the trebuchet man may use the weapon's two-handed damage when making a ranged attack within its normal range.\n\n####Actions\n___\n\n***Spear.*** *Melee or Ranged Weapon Attack:* +6 to hit, reach 5 ft. or range 300/900 ft., one target. *Hit:* 7 (1d6 + 4) piercing damage, or 8 (1d8 + 4) piercing damage when wielded in melee with two hands, or when thrown 300 feet or fewer.",
    "controversiality": 0,
    "ups": 248,
    "downs": 0,
    "score": 248,
    "created": 1513041468.0,
    "date_created": "2017-12-11",
    "time_created": "12:17:48",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr38phj",
    "parent_id": "t1_dr38kup",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Because you’d have a spear through your neck if you got within 300 meters. ",
    "controversiality": 0,
    "ups": 1089,
    "downs": 0,
    "score": 1089,
    "created": 1513037326.0,
    "date_created": "2017-12-11",
    "time_created": "11:08:46",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3e8oz",
    "parent_id": "t1_dr3ajvw",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Oh, so that's why they hate us so much.",
    "controversiality": 0,
    "ups": 946,
    "downs": 0,
    "score": 946,
    "created": 1513043081.0,
    "date_created": "2017-12-11",
    "time_created": "12:44:41",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3fto0",
    "parent_id": "t1_dr3ajvw",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Here are your kids back, chock full of all the germs we have to offer. Enjoy!",
    "controversiality": 0,
    "ups": 60,
    "downs": 0,
    "score": 60,
    "created": 1513044700.0,
    "date_created": "2017-12-11",
    "time_created": "13:11:40",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3gkuq",
    "parent_id": "t1_dr3ajvw",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "“Here, now that your parents are dead you can go home. Probably with a bunch of new diseases to introduce to your tribe. Have fun, and thanks for letting us kidnap you!”",
    "controversiality": 0,
    "ups": 40,
    "downs": 0,
    "score": 40,
    "created": 1513045462.0,
    "date_created": "2017-12-11",
    "time_created": "13:24:22",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr38ymj",
    "parent_id": "t1_dr37dwg",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Chillin' out maxin' relaxin' all cool, And all shootin some gators that won't stay out of my pool.",
    "controversiality": 0,
    "ups": 1002,
    "downs": 0,
    "score": 1002,
    "created": 1513037609.0,
    "date_created": "2017-12-11",
    "time_created": "11:13:29",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3bant",
    "parent_id": "t1_dr3b2l8",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I need my tools, I gotta have MY TOOLS",
    "controversiality": 0,
    "ups": 86,
    "downs": 0,
    "score": 86,
    "created": 1513040093.0,
    "date_created": "2017-12-11",
    "time_created": "11:54:53",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3ebu9",
    "parent_id": "t1_dr3dsi9",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "YouTube kids even features them, they are not filtered into any way",
    "controversiality": 0,
    "ups": 54,
    "downs": 0,
    "score": 54,
    "created": 1513043168.0,
    "date_created": "2017-12-11",
    "time_created": "12:46:08",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr37713",
    "parent_id": "t1_dr34awm",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Yeah I have a kid and he watches YouTube. I always have to watch along cause one second it's fine, next second joker is feeding people shit or pissing in people's mouths.",
    "controversiality": 0,
    "ups": 261,
    "downs": 0,
    "score": 261,
    "created": 1513035627.0,
    "date_created": "2017-12-11",
    "time_created": "10:40:27",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr39ksf",
    "parent_id": "t1_dr36t77",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "He could have done it through clenched teeth, though.\n \nCould you imagine Clint Eastwood delivering that line:\n\nTurn me over.\n\n\\*grimace intensifies\\*\n\nI'm done on this side",
    "controversiality": 0,
    "ups": 137,
    "downs": 0,
    "score": 137,
    "created": 1513038278.0,
    "date_created": "2017-12-11",
    "time_created": "11:24:38",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3c5ht",
    "parent_id": "t1_dr36600",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "[deleted]",
    "controversiality": 0,
    "ups": 218,
    "downs": 0,
    "score": 218,
    "created": 1513040982.0,
    "date_created": "2017-12-11",
    "time_created": "12:09:42",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr34dx8",
    "parent_id": "t1_dr348sb",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "D class can be excused from termination if they're good at eating cake that will consume the world ",
    "controversiality": 0,
    "ups": 497,
    "downs": 0,
    "score": 497,
    "created": 1513032243.0,
    "date_created": "2017-12-11",
    "time_created": "09:44:03",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr38l1p",
    "parent_id": "t1_dr3642t",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "That's fucking hilarious. The guys obliviousness is what get's me.",
    "controversiality": 0,
    "ups": 59,
    "downs": 0,
    "score": 59,
    "created": 1513037186.0,
    "date_created": "2017-12-11",
    "time_created": "11:06:26",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3867e",
    "parent_id": "t1_dr36gc2",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "\"You may pay $2.99 to downvote EA.\"",
    "controversiality": 0,
    "ups": 168,
    "downs": 0,
    "score": 168,
    "created": 1513036731.0,
    "date_created": "2017-12-11",
    "time_created": "10:58:51",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3csrb",
    "parent_id": "t1_dr3ccjv",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Virtual hug buddy. I lived in Park City, UT for 4 years ski bumming, met some very nice Mormons but I couldn't imagine believing what they believed. I deeply respect your open-mindedness, but I'm really sorry it had such a negative impact on your life.",
    "controversiality": 0,
    "ups": 147,
    "downs": 0,
    "score": 147,
    "created": 1513041640.0,
    "date_created": "2017-12-11",
    "time_created": "12:20:40",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3c48p",
    "parent_id": "t1_dr3ackz",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "> I wonder about this often. I think, if I could snap my fingers and go back to the blissful ignorance that I enjoyed. I would do it.\n\nI think that's something people, especially believers, often misunderstand. It's not like we choose to stop believing. At a certain point we almost just can't help it. I grew up Christian and really tried to believe and stick with it, but at a certain point I just couldn't. I'm currently in some weird gray area where I crave spirituality, communion, and moral instruction, but not if it is tied irrational superstition. I was an outright atheist for years, but now I'm not even sure anymore. \n\n",
    "controversiality": 0,
    "ups": 100,
    "downs": 0,
    "score": 100,
    "created": 1513040946.0,
    "date_created": "2017-12-11",
    "time_created": "12:09:06",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr345df",
    "parent_id": "t1_dr33wr5",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Denim!",
    "controversiality": 0,
    "ups": 220,
    "downs": 0,
    "score": 220,
    "created": 1513031942.0,
    "date_created": "2017-12-11",
    "time_created": "09:39:02",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3mcew",
    "parent_id": "t1_dr3ledo",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Auto-parts!",
    "controversiality": 0,
    "ups": 643,
    "downs": 0,
    "score": 643,
    "created": 1513051366.0,
    "date_created": "2017-12-11",
    "time_created": "15:02:46",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3j1e9",
    "parent_id": "t1_dr3dit7",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I mean it was still child porn so anonymous or not you did the right thing.\n\nIt's like, there's no justifying that.",
    "controversiality": 0,
    "ups": 182,
    "downs": 0,
    "score": 182,
    "created": 1513047966.0,
    "date_created": "2017-12-11",
    "time_created": "14:06:06",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3eg58",
    "parent_id": "t1_dr3e8oz",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I would assume so!  I remember reading that it is how the British 'conquered' so easily at times.  They would abduct a few people, bring them to 'civilization' and lavish them with gifts, food, and other things to make it seem like it is a good idea to join with the British.  They would then bring them back to their island/area/whatever and allow them to spread the word about the greatness of the British empire.  The British would then return as heroes, before enslaving most of the people and taking over.  Kind of a smart way of doing it I guess!",
    "controversiality": 0,
    "ups": 264,
    "downs": 0,
    "score": 264,
    "created": 1513043290.0,
    "date_created": "2017-12-11",
    "time_created": "12:48:10",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr393yw",
    "parent_id": "t1_dr38ymj",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Then a couple of guys, who were up to no good, started playin' jazz in my neighborhood",
    "controversiality": 0,
    "ups": 758,
    "downs": 0,
    "score": 758,
    "created": 1513037768.0,
    "date_created": "2017-12-11",
    "time_created": "11:16:08",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr387az",
    "parent_id": "t1_dr37713",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "The fuck ",
    "controversiality": 0,
    "ups": 102,
    "downs": 0,
    "score": 102,
    "created": 1513036765.0,
    "date_created": "2017-12-11",
    "time_created": "10:59:25",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3b7fa",
    "parent_id": "t1_dr39ksf",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Yeah it was probably like \"more weight\". ",
    "controversiality": 0,
    "ups": 72,
    "downs": 0,
    "score": 72,
    "created": 1513040004.0,
    "date_created": "2017-12-11",
    "time_created": "11:53:24",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr34opc",
    "parent_id": "t1_dr34dx8",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Doesn't that require site director approval?",
    "controversiality": 0,
    "ups": 49,
    "downs": 0,
    "score": 49,
    "created": 1513032619.0,
    "date_created": "2017-12-11",
    "time_created": "09:50:19",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr38v2w",
    "parent_id": "t1_dr38l1p",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "SCP-008-J: Can you help me out? I’m a bit turned around. I’m trying to get to Grays Street.\n\nCommander Price: WE’RE 3,000 METERS UNDER THE FUCKING OCEAN!",
    "controversiality": 0,
    "ups": 107,
    "downs": 0,
    "score": 107,
    "created": 1513037500.0,
    "date_created": "2017-12-11",
    "time_created": "11:11:40",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3dzd3",
    "parent_id": "t1_dr3csrb",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Thanks - I am glad I'm out, but when things are quiet I do missing the fantasy of Mormonism. ",
    "controversiality": 0,
    "ups": 123,
    "downs": 0,
    "score": 123,
    "created": 1513042819.0,
    "date_created": "2017-12-11",
    "time_created": "12:40:19",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3efl1",
    "parent_id": "t1_dr3c48p",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "> I'm currently in some weird gray area where I crave spirituality, communion, and moral instruction, but not if it is tied irrational superstition.\n\nThis statement!  I relate to it so completely.  I want that communion and moral instruction, but not a part of magic, superstition or abusive leadership.\n\n",
    "controversiality": 0,
    "ups": 52,
    "downs": 0,
    "score": 52,
    "created": 1513043274.0,
    "date_created": "2017-12-11",
    "time_created": "12:47:54",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr34sta",
    "parent_id": "t1_dr345df",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Haaaaircut",
    "controversiality": 0,
    "ups": 162,
    "downs": 0,
    "score": 162,
    "created": 1513032761.0,
    "date_created": "2017-12-11",
    "time_created": "09:52:41",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3oa2q",
    "parent_id": "t1_dr3mcew",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "OW!",
    "controversiality": 0,
    "ups": 65,
    "downs": 0,
    "score": 65,
    "created": 1513053356.0,
    "date_created": "2017-12-11",
    "time_created": "15:35:56",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3gw5t",
    "parent_id": "t1_dr3eg58",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I feel like there are some parallels to be explored with UFO obductions there.",
    "controversiality": 0,
    "ups": 149,
    "downs": 0,
    "score": 149,
    "created": 1513045773.0,
    "date_created": "2017-12-11",
    "time_created": "13:29:33",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr39kaz",
    "parent_id": "t1_dr393yw",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I got one lil sax and my mom, she yelled! Laissez les bons temps rouler",
    "controversiality": 0,
    "ups": 746,
    "downs": 0,
    "score": 746,
    "created": 1513038264.0,
    "date_created": "2017-12-11",
    "time_created": "11:24:24",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3977n",
    "parent_id": "t1_dr387az",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "He is not joking. (pun not intended) My son can be watching a long chain of paw patrol and other such cartoon related videos then suddenly something WAY out of bounds pops up. He only has the children's YouTube app as well on the tablet he has access to during free play time with it, and it just can't be watched alone. Never know what could pop up. Think about what you could stumble across randomly on the internet. Now think if you'd want your child to see it at a super young age. ",
    "controversiality": 0,
    "ups": 153,
    "downs": 0,
    "score": 153,
    "created": 1513037867.0,
    "date_created": "2017-12-11",
    "time_created": "11:17:47",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3hjpm",
    "parent_id": "t1_dr3dzd3",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I hear that man, I was raised in a very fundamentalist Christian upbringing. Literally everyone I knew until I graduated were Christians. When I left the church I lost all of my friends and every bit of support I had once counted upon, not to mention all my childhood dreams of being a youth minister or teaching sunday school. I had been obsessive about learning all the stories, we went to church 3 times a week because I loved it, and then I was discovering that all my instincts for things I enjoy are actually empty promises or built upon a literal translation of an apocryphal tale.\n\nI still miss going to sing at church (acappella), even if I didn't believe the words in the final year. And I still miss my old church family and the warmth and fellowship they provided, but the couple times I attempted to visit I just felt like a heretic and the judgmental pity in the eyes of my former close friends and mentors was just too much. I know that was just my internal obsession over the scriptures and quotes from \"The Prodigal Son\" ringing through my mind. But the worst thing is not trusting my conscience anymore, since it still hates me for \"sinning\" or it guilts and shames me about the most trivial or random events, even when I tell it that I don't believe that type of thinking anymore, it still makes me feel rotten. It is not nearly as bad now, like with Love even the bad pain fades and it just gets more gray. I just wish I had more friends, I really miss being able to just show up somewhere and visit with lifelong friends and their families; I really feel like I got an amputation and I don't know how to use that part of my heart anymore. \n\nOverall being raised like that helped me to be more kind and selfless, but I'm unsure how much that also made me act small and meek, when it would have been better to be assertive.\n\nedit - I guess another benefit is that sometimes when I'm bored I've been known to say to a co-worker \"hey have you heard about the story of Samson and Delilah? and proceed to tell the entire story. Crazy how much stuff sticks with you over the years. Would be nice if I had a real use for all these gospel tunes and stories about badasses like Ehud the left-handed assassin (a judge).",
    "controversiality": 0,
    "ups": 81,
    "downs": 0,
    "score": 81,
    "created": 1513046435.0,
    "date_created": "2017-12-11",
    "time_created": "13:40:35",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr369cm",
    "parent_id": "t1_dr34sta",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "Backpacks backpacks come get your backpacks!",
    "controversiality": 0,
    "ups": 51,
    "downs": 0,
    "score": 51,
    "created": 1513034539.0,
    "date_created": "2017-12-11",
    "time_created": "10:22:19",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3k3xq",
    "parent_id": "t1_dr3gw5t",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "this is the main reason I carry a spear",
    "controversiality": 0,
    "ups": 103,
    "downs": 0,
    "score": 103,
    "created": 1513049052.0,
    "date_created": "2017-12-11",
    "time_created": "14:24:12",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3a1cl",
    "parent_id": "t1_dr39kaz",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "I whistled for the boat and when it came near the name was ma Cherie and there was shrimp in the air",
    "controversiality": 0,
    "ups": 573,
    "downs": 0,
    "score": 573,
    "created": 1513038772.0,
    "date_created": "2017-12-11",
    "time_created": "11:32:52",
    "submission_id": "askreddit-7j1ady"
  },
  {
    "id": "dr3av3a",
    "parent_id": "t1_dr3a1cl",
    "subreddit_name_prefixed": "r/AskReddit",
    "body": "It sure smelled like this bayou was dead, but I said fuck it and hollered \"Pinch the tail- suck the head!\"",
    "controversiality": 0,
    "ups": 418,
    "downs": 0,
    "score": 418,
    "created": 1513039650.0,
    "date_created": "2017-12-11",
    "time_created": "11:47:30",
    "submission_id": "askreddit-7j1ady"
  }
]